{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802",
  "title": "Child visa",
  "raw_text": "===== main placeholder ========================================== Subclass 802 Child visa This visa allows a child to stay in Australia permanently and live with their parents. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Stay Permanently Cost From AUD3,235.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa the child can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible. See all conditions Check your eligibility The child must be a dependent child of a parent who is an Australian citizen, eligible New Zealand citizen or holder of an Australian permanent visa be under 18 years, a full-time student aged over 18 and under 25, or over 18 and unable to work due to a disability be single and dependent on the parent be in Australia when the application is made and when we make our decision Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications With this visa the child can How long the child can stay Include other children Cost Apply from Processing times The child's obligations Visa label With this visa the child can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible. Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility: they will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when the child's travel facility ends, use VEVO How long the child can stay This is a permanent visa. It lets the child stay in Australia indefinitely. The child becomes a permanent resident the day we grant the visa. Include other children If the child has siblings who also want to apply, submit separate applications for each sibling. The child's dependent children can be included on their application when they apply or at any time before we decide the application. Dependent children of the child who apply for the visa must meet our health requirement Family members who are not coming to Australia might also have to meet our health requirement. Cost The visa costs AUD3,235.00 for the main applicant. There is also a charge for each dependent child who applies for the visa with you. There might be other costs for health exams police certificates and biometrics To work out what your visa will cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. Apply from The child must be in Australia, but not in immigration clearance , when the application is submitted and when we make a decision. The child can't apply for this visa if they are in Australia on another visa with a no further stay condition. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. The application might take longer to process if: it is not filled in correctly it does not include all required documents or we need more information it takes us time to verify your information you do not make full payment at the time of initial lodgement. We cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application. You should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement. We will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application. The child's obligations The child and any dependants must obey all Australian laws. Visa label We will digitally link the visa to the child's passport. They will not get a label in their passport. Eligibility From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Be dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder Details The child must be dependent on a parent who is an: Australian citizen Eligible New Zealand citizen Australian permanent visa holder They can be their parent's: biological child adopted child stepchild (only from a former parent) A child does not meet the dependency requirement, if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent. Adopted children To be eligible for this visa, the adoption must have been finalised before the child turned 18. The adoption can have happened either before or after the parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen. If the child was adopted after their parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen, they must have been adopted: through an intercountry adoption with the involvement of an Australian state or territory central authority , or through an intercountry adoption by arrangement between two countries (other than Australia) that are parties to the Hague Convention on the Protection of Children and Cooperation in Respect of Intercountry Adoption (the Hague Adoption Convention), or if no Australian state or territory central authority was involved, through an expatriate adoption by an Australian citizen, an eligible New Zealand citizen or the holder of an Australian permanent visa who has been living outside Australia for more than 12 months before the adoption was finalised Learn more about adopting a child overseas from Intercountry Adoptions Australia .​​ It is recommended that you obtain independent legal advice both in Australia and in the child’s country of usual residence before proceeding with an expatriate adoption as there are risks for both the child and the adoptive parents in this process. Stepchildren To be eligible for this visa, a stepchild must: be the child of their step-parent’s former partner be aged under 18. The step-parent must also have either: an Australian parenting order in force that says the child is to live with them and be looked after by them, or guardianship or custody of the child under an Australian law or the law of another country. Citizenship by Descent The child may apply for Australian citizenship by descent instead of a visa to travel to Australia, if: the child was born outside Australia one of their parents was an Australian citizen at the time of their child’s birth. Have a sponsor Details The child must be sponsored by an eligible parent or their parent's spouse or de facto partner. We must approve the sponsorship before the visa can be granted. If the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application. If the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances. Learn more about measures for the protection of children Be this age Details The child must be either: under 18 years old, or over 18 and under 25 years and studying full time, or over 18 years with a disability If the child is over 18 and under 25 years and studying full time Details If the child is over 18 and under 25 years old they: must be a full-time student when they apply and when the visa application is decided can't work full time must be financially dependent on their parent more than any other person The child is a full-time student if they are: enrolled in a full-time course that leads to a professional, trade or vocational qualification attending classes The child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained. If the child is over 18 years with a disability Details If the child is 18 years or older with a disability, they: must have totally or partially lost their bodily or mental functions can't work full time must be financially dependent on their parent Have no partner Details The child: can't be married or in a de facto relationship can't be engaged to be married If the child is over 18, they must never have been married or had a de facto partner. Meet the health requirement Details The child and any of their dependent children who apply for the visa with them must meet our health requirement Dependent children who are not applying for the visa might also need to meet our health requirement. Meet the character requirement Details If the child is aged 16 years and over they must meet our character requirement We might also ask that their dependent children who apply for the visa with them meet the requirement. Have paid back debt to the Australian Government Details If the child or any member of their family owes the Australian Government money, it must be paid back or there must be a formal arrangement to pay it back. Sign the Australian values statement Details Children aged 18 or older must: have read, or had explained to them, the Life in Australia booklet sign the Australian Values Statement confirming they will obey Australian laws and respect the Australian way of life Not have had a visa cancelled or a previous application refused Details We will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused. In some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If immigration assistance is needed, see Who can help with your visa application Have consent to migrate to Australia Details We will only grant this visa to a child younger than 18 years if either: the child has the written consent of everyone who can legally decide where they live, or the laws of the child’s home country allow them to leave their home country, or it is consistent with any Australian child order about the child Best interests of the child We might not grant this visa if it is not in the best interests of an applicant under 18. Details Meet all these criteria? Check how to apply in our step by step guide. Meet all these criteria? Check how to apply in our step by step guide. Step by step From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Step 1 Before you apply Check the child's passport is valid. Tell us if someone is acting on the child's behalf. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide documents in support of the visa application. Show steps Provide accurate documents Provide accurate information. See what happens if the child's identity can't be established or false information is provided Identity documents Provide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if they have one proof of change of name Documents that prove a change of name include: change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names the child has been known by If the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate. See how Travel documents Provide a certified copy of the passport or travel document the child used to enter Australia and any passports the child has held since then. See how Photographs Provide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application. Photographs must be: passport-size (45mm x 35mm) less than 6 months old good quality colour. We don't accept laser copies a full-face view of your head and shoulders taken against a plain light-coloured background The child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face. See how Child's relationship to the parent Provide evidence the child is related to their parent, such as: a birth certificate a marriage certificate a family status certificate or family book, if officially issued and maintained If the child was adopted, provide the child's adoption papers or adoption compliance certificate. Where an adoption involved an Australian state or territory central adoption authority, including a letter supporting the adoption. If the child was adopted through an expatriate adoption process, provide evidence that: at least one of the adoptive parents lived outside Australia for more than 12 months before the adoption was finalised the adoptive parent did not arrange to live overseas so they could avoid Australia’s intercountry adoption laws the adoptive parent has full and permanent parental rights, with no remaining legal ties between the child and the birth parents the child was adopted in line with the adoption laws of their home country See how Financial documents If the child is over 18 when the application is made, provide evidence the child is dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include: bank statements money transfers rent receipts See how Applicant circumstances documents Depending on the child's situation, we might require other documents. See how Applicants aged 18 to 25 years studying full time Provide evidence the child is enrolled and actively participating as a full-time student in a post-secondary course of study. Provide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies. Applicants aged 18 or older with disability Provide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working. Dependants under 18 documents For every dependant under 18 years old who is applying with the child, provide: identity documents travel documents proof of the child's relationship with the dependant, like a birth or marriage certificate character documents, if applicable See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives. They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to stay Australia on this visa Include an identity document with the signature and photo of the person who completed the form or declaration, such as a: passport driver’s licence Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of the child's home country allow them to leave their home country See how Character documents We might ask you to provide an Australian state or territory police certificate if you have lived in an Australian state or territory for at least 12 months. If you have lived for at least 12 months in an overseas country, we might ask you to provide a police certificate from that country. If anyone included in the application has served in the armed forces of any country, they must provide their military service record or discharge papers. Children over 16 years of age must complete and provide Form 80 Personal particulars for assessment including character assessment (596KB PDF) See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify Do not certify police certificates. You need to send us the originals. Have all other documents certified . This includes: non-English documents English translations Photographs of the applicant and any of their dependent children included in the application must also be certified. See how Keep Keep a copy of your completed application. Send Send us: original police certificates certified copies of all other documents as much information as possible to help us decide your application each document only once, even if it is evidence of more than one thing all documents with your application, if you can See how Step 3 Apply for the visa You must apply for this visa on paper. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply on paper Complete the following 2 forms and send them together: Form 47CH Application for migration to Australia by a child (2MB PDF) Form 40CH Sponsorship for a child to migrate to Australia (2MB PDF) The forms must be completed in English. Pay for the application before it is submitted using the online portal payment function in ImmiAccount . Include evidence the application is paid for with your application. For other payment options see how to pay Applications for this visa can't be submitted in person. Send the application by post or courier to the Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application. If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After applying We will let the applicant know when we have received the application and documents. There might be other things to do or be aware of after applying. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa made in Australia. See how Status updates We can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further. See how Travel Tell us if the child needs to travel outside Australia while we process their application. We need to know because the child must be in Australia when we make our decision. If you leave Australia, make sure the child has a valid visa to return. Learn about visa expiry See how Health exams We will let you know when to arrange the child’s health examinations See how Biometrics We might ask for biometrics . We will let you know if the child needs to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount If you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre online form See how Stay lawful Make sure the child stays lawful by holding a valid visa while we process their application. When the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application. Learn more about visa expiry See how Add family members You can add the child's dependent children to their visa application any time before we make a decision. See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Let us know as soon as you can. Complete Form 1023 Notification of incorrect answers (168KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre online form See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) For more information see Who can help you with your application If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre online form See how Tell us if things change Things you need to let us know about include: changes to the child's phone number, address or passport changes to the child's relationship status the child is over 18 and stops studying full-time or starts working full-time the birth of a child you want to withdraw the application. See how to tell us if your situation changes See how Step 5 Visa outcome The child must be in Australia when we make our decision. We will let you know our decision in writing. If we grant the visa, we will advise: the visa grant number the date your visa starts any visa conditions Keep a copy of the grant letter with you when in Australia. If we refuse the child's visa, we will advise: why we refused the visa any rights of review We will not refund the application charge if we refuse the application. When you have this visa From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications In Australia Leaving Australia In Australia The child's obligations The child and family members must obey all Australian laws. Tell us if things change Things we need to know about include: changes to the child's passport the birth of a child changes of name See how to let us know if there is a change in the child's situation See how long the child can stay This is a permanent visa. It lets the child stay in Australia indefinitely. The child becomes a permanent resident the day we grant the visa. Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility: they will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when the child's travel facility ends, use VEVO Working The child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law. See their workplace rights and entitlements Bringing a family member You can't add a family member after we have decided the application. If we have made a decision on your visa and you want to bring a family member to Australia, you will need to submit a new visa application for them. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, the child might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, the child's permanent residence starts the day we grant the visa. Leaving Australia Before the child leaves The child must have a valid passport or other travel document to leave Australia. Check if the child needs a Resident Return visa to return to Australia as a permanent resident in VEVO At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After the child leaves Prove the child has been to Australia Request the child's international movement records to get proof of their travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 802\n\n# Child visa\n\nChild visa\n\nThis visa allows a child to stay in Australia permanently and live with their parents.\n\nThis visa allows a child to stay in Australia permanently and live with their parents.\n\nThis visa allows a child to stay in Australia permanently and live with their parents.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD3,235.00\n\nFromAUD3,235.00\n\nFrom\nAUD3,235.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible.\napply for\nAustralian citizenship\n, if eligible.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### The child must\n\nThe child must\n- be adependent childof a parent who is an Australian citizen,eligible New Zealand citizenor holder of an Australian permanent visa\nbe a\ndependent child\nof a parent who is an Australian citizen,\neligible New Zealand citizen\nor holder of an Australian permanent visa\n- be under 18 years, a full-time student aged over 18 and under 25, or over 18 and unable to work due to a disability\nbe under 18 years, a full-time student aged over 18 and under 25, or over 18 and unable to work due to a disability\n- be single and dependent on the parent\nbe single and dependent on the parent\n- be in Australia when the application is made and when we make our decision\nbe in Australia when the application is made and when we make our decision\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nWith this visa the child can\nHow long the child can stay\nInclude other children\nCost\nApply from\nProcessing times\nThe child's obligations\nVisa label\n\n## With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible.\napply for\nAustralian citizenship\n, if eligible.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility:\n\nIf the child wants to travel after the initial 5-year travel facility:\n- they will need to apply for and be granted aResident Return (RRV)visa so they can re-enter Australia as a permanent resident\nthey will need to apply for and be granted a\nResident Return (RRV)\nvisa so they can re-enter Australia as a permanent resident\n- they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n## How long the child can stay\n\nHow long the child can stay\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThe child becomes a permanent resident the day we grant the visa.\n\nThe child becomes a permanent resident the day we grant the visa.\n\n## Include other children\n\nInclude other children\n\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\n\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nDependent children of the child who apply for the visa must meet ourhealth requirement.\n\nDependent children of the child who apply for the visa must meet our\nhealth requirement\n.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\n## Cost\n\nCost\n\nThe visa costsAUD3,235.00for the main applicant.\n\nThe visa costs\nAUD3,235.00\nfor the main applicant.\n\nThere is also a charge for each dependent child who applies for the visa with you.\n\nThere is also a charge for each dependent child who applies for the visa with you.\n\nThere might be other costs forhealth exams,police certificatesandbiometrics.\n\nThere might be other costs for\nhealth exams\n,\npolice certificates\nand\nbiometrics\n.\n\nTo work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nThe child must be in Australia, but not inimmigration clearance, when the application is submitted and when we make a decision.\n\nThe child must be in Australia, but not in\nimmigration clearance\n, when the application is submitted and when we make a decision.\n\nThe child can't apply for this visa if they are in Australia on another visa with a no further stay condition.\n\nThe child can't apply for this visa if they are in Australia on another visa with a no further stay condition.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nThe application might take longer to process if:\n\nThe application might take longer to process if:\n- it is not filled in correctly\nit is not filled in correctly\n- it does not include all required documents or we need more information\nit does not include all required documents or we need more information\n- it takes us time to verify your information\nit takes us time to verify your information\n- you do not make full payment at the time of initial lodgement.\nyou do not make full payment at the time of initial lodgement.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nYou should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement.\n\nYou should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\n## The child's obligations\n\nThe child's obligations\n\nThe child and any dependants must obey all Australian laws.\n\nThe child and any dependants must obey all Australian laws.\n\n## Visa label\n\nVisa label\n\nWe will digitally link the visa to the child's passport. They will not get a label in their passport.\n\nWe will digitally link the visa to the child's passport. They will not get a label in their passport.\nEligibility\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n## Be dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder\n\nBe dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder\nDetails\n\nThechildmust be dependent on a parent who is an:\n\nThe\nchild\nmust be dependent on a parent who is an:\n- Australian citizen\nAustralian citizen\n- Eligible New Zealand citizen\nEligible New Zealand citizen\n- Australian permanent visa holder\nAustralian permanent visa holder\n\nThey can be their parent's:\n\nThey can be their parent's:\n- biological child\nbiological child\n- adopted child\nadopted child\n- stepchild (only from a former parent)\nstepchild (only from a former parent)\n\nA child does not meet the dependency requirement, if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent.\n\nA child does not meet the dependency requirement, if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent.\n\n### Adopted children\n\nAdopted children\n\nTo be eligible for this visa, the adoption must have been finalised before the child turned 18.The adoption can have happened either before or after the parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen.\n\nTo be eligible for this visa, the adoption must have been finalised before the child turned 18.\nThe adoption can have happened either before or after the parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen.\n\nIf the child was adopted after their parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen, they must have been adopted:\n\nIf the child was adopted after their parent became an Australian citizen, Australian permanent visa holder or eligible New Zealand citizen, they must have been adopted:\n- through an intercountry adoption with the involvement of anAustralian state or territory central authority, or\nthrough an intercountry adoption with the involvement of an\nAustralian state or territory central authority\n, or\n- through an intercountry adoption by arrangement between two countries (other than Australia) that are parties to the Hague Convention on the Protection of Children and Cooperation in Respect of Intercountry Adoption (the Hague Adoption Convention), or\nthrough an intercountry adoption by arrangement between two countries (other than Australia) that are parties to the Hague Convention on the Protection of Children and Cooperation in Respect of Intercountry Adoption (the Hague Adoption Convention), or\n- if no Australian state or territory central authority was involved, through an expatriate adoption by an Australian citizen, an eligible New Zealand citizen or the holder of an Australian permanent visa who has been living outside Australia for more than 12 months before the adoption was finalised\nif no Australian state or territory central authority was involved, through an expatriate adoption by an Australian citizen, an eligible New Zealand citizen or the holder of an Australian permanent visa who has been living outside Australia for more than 12 months before the adoption was finalised\n\nLearn more about adopting a child overseas fromIntercountry Adoptions Australia.​​\n\nLearn more about adopting a child overseas from\nIntercountry Adoptions Australia\n.​​\n\nIt is recommended that you obtain independent legal advice both in Australia and in the child’s country of usual residence before proceeding with an expatriate adoption as there are risks for both the child and the adoptive parents in this process.\n\nIt is recommended that you obtain independent legal advice both in Australia and in the child’s country of usual residence before proceeding with an expatriate adoption as there are risks for both the child and the adoptive parents in this process.\n\n### Stepchildren\n\nStepchildren\n\nTo be eligible for this visa, a stepchild must:\n\nTo be eligible for this visa, a stepchild must:\n- be the child of their step-parent’s former partner\nbe the child of their step-parent’s former partner\n- be aged under 18.\nbe aged under 18.\n\nThe step-parent must also have either:\n\nThe step-parent must also have either:\n- an Australian parenting order in force that says the child is to live with them and be looked after by them, or\nan Australian parenting order in force that says the child is to live with them and be looked after by them, or\n- guardianship or custody of the child under an Australian law or the law of another country.\nguardianship or custody of the child under an Australian law or the law of another country.\n\n### Citizenship by Descent\n\nCitizenship by Descent\n\nThe child may apply forAustralian citizenship by descentinstead of a visa to travel to Australia, if:\n\nThe child may apply for\nAustralian citizenship by descent\ninstead of a visa to travel to Australia, if:\n- the child was born outside Australia\nthe child was born outside Australia\n- one of their parents was an Australian citizen at the time of their child’s birth.\none of their parents was an Australian citizen at the time of their child’s birth.\n\n## Have a sponsor\n\nHave a sponsor\nDetails\n\nThe child must be sponsored by an eligible parent or their parent's spouse or de facto partner.\n\nThe child must be sponsored by an eligible parent or their parent's spouse or de facto partner.\n\nWe must approve the sponsorship before the visa can be granted.\n\nWe must approve the sponsorship before the visa can be granted.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nLearn more aboutmeasures for the protection of children.\n\nLearn more about\nmeasures for the protection of children\n.\n\n## Be this age\n\nBe this age\nDetails\n\nThe child must be either:\n\nThe child must be either:\n- under 18 years old, or\nunder 18 years old, or\n- over 18 and under 25 years and studying full time, or\nover 18 and under 25 years and studying full time, or\n- over 18 years with a disability\nover 18 years with a disability\n\n### If the child is over 18 and under 25 years and studying full time\n\nIf the child is over 18 and under 25 years and studying full time\nDetails\n\nIf the child is over 18 and under 25 years old they:\n\nIf the child is over 18 and under 25 years old they:\n- must be a full-time student when they apply and when the visa application is decided\nmust be a full-time student when they apply and when the visa application is decided\n- can't work full time\ncan't work full time\n- must be financially dependent on their parent more than any other person\nmust be financially dependent on their parent more than any other person\n\nThe child is a full-time student if they are:\n\nThe child is a full-time student if they are:\n- enrolled in a full-time course that leads to a professional, trade or vocational qualification\nenrolled in a full-time course that leads to a professional, trade or vocational qualification\n- attending classes\nattending classes\n\nThe child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained.\n\nThe child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained.\n\n### If the child is over 18 years with a disability\n\nIf the child is over 18 years with a disability\nDetails\n\nIf the child is 18 years or older with a disability, they:\n\nIf the child is 18 years or older with a disability, they:\n- must have totally or partially lost their bodily or mental functions\nmust have totally or partially lost their bodily or mental functions\n- can't work full time\ncan't work full time\n- must be financially dependent on their parent\nmust be financially dependent on their parent\n\n## Have no partner\n\nHave no partner\nDetails\n\nThe child:\n\nThe child:\n- can't be married or in a de facto relationship\ncan't be married or in a de facto relationship\n- can't be engaged to be married\ncan't be engaged to be married\n\nIf the child is over 18, they must never have been married or had a de facto partner.\n\nIf the child is over 18, they must never have been married or had a de facto partner.\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nThe child and any of their dependent children who apply for the visa with them must meet ourhealth requirement.\n\nThe child and any of their dependent children who apply for the visa with them must meet our\nhealth requirement\n.\n\nDependent children who are not applying for the visa might also need to meet our health requirement.\n\nDependent children who are not applying for the visa might also need to meet our health requirement.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nIf the child is aged 16 years and over they must meet ourcharacter requirement.\n\nIf the child is aged 16 years and over they must meet our\ncharacter requirement\n.\n\nWe might also ask that their dependent children who apply for the visa with them meet the requirement.\n\nWe might also ask that their dependent children who apply for the visa with them meet the requirement.\n\n## Have paid back debt to the Australian Government\n\nHave paid back debt to the Australian Government\nDetails\n\nIf the child or any member of their family owes the Australian Government money, it must be paid back or there must be a formal arrangement to pay it back.\n\nIf the child or any member of their family owes the Australian Government money, it must be paid back or there must be a formal arrangement to pay it back.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nChildren aged 18 or older must:\n\nChildren aged 18 or older must:\n- have read, or had explained to them, theLife in Australiabooklet\nhave read, or had explained to them, the\nLife in Australia\nbooklet\n- sign theAustralian Values Statementconfirming they will obey Australian laws and respect the Australian way of life\nsign the\nAustralian Values Statement\nconfirming they will obey Australian laws and respect the Australian way of life\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused.\n\nWe will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused.\n\nIn some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf immigration assistance is needed, seeWho can help with your visa application.\n\nIf immigration assistance is needed, see\nWho can help with your visa application\n.\n\n## Have consent to migrate to Australia\n\nHave consent to migrate to Australia\nDetails\n\nWe will only grant this visa to a child younger than 18 years if either:\n\nWe will only grant this visa to a child younger than 18 years if either:\n- the child has the written consent of everyone who can legally decide where they live, or\nthe child has the written consent of everyone who can legally decide where they live, or\n- the laws of the child’s home country allow them to leave their home country, or\nthe laws of the child’s home country allow them to leave their home country, or\n- it is consistent with anyAustralian child orderabout the child\nit is consistent with any\nAustralian child order\nabout the child\n\n## Best interests of the child\n\nBest interests of the child\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nDetails\n\nMeet all these criteria? Check how to apply in ourstep by step guide.\n\nMeet all these criteria? Check how to apply in our\nstep by step guide.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide documents in support of the visa application.\n\nProvide documents in support of the visa application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if the child's identity can't be established orfalse information is provided.\n\nProvide accurate information. See what happens if the child's identity can't be established or\nfalse information is provided\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if they have one\na national identity card, if they have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names the child has been known by\ndocuments that show other names the child has been known by\n\nIf the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate.\n\nIf the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate.\nSee how\n\n#### Travel documents\n\nTravel documents\n\nProvide a certified copy of the passport or travel document the child used to enter Australia and any passports the child has held since then.\n\nProvide a certified copy of the passport or travel document the child used to enter Australia and any passports the child has held since then.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application.\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application.\n\nPhotographs must be:\n\nPhotographs must be:\n- passport-size (45mm x 35mm)\npassport-size (45mm x 35mm)\n- less than 6 months old\nless than 6 months old\n- good quality colour. We don't accept laser copies\ngood quality colour. We don't accept laser copies\n- a full-face view of your head and shoulders\na full-face view of your head and shoulders\n- taken against a plain light-coloured background\ntaken against a plain light-coloured background\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\nSee how\n\n#### Child's relationship to the parent\n\nChild's relationship to the parent\n\nProvide evidence the child is related to their parent, such as:\n\nProvide evidence the child is related to their parent, such as:\n- a birth certificate\na birth certificate\n- a marriage certificate\na marriage certificate\n- a family status certificate or family book, if officially issued and maintained\na family status certificate or family book, if officially issued and maintained\n\nIf the child was adopted, provide the child's adoption papers or adoption compliance certificate.\n\nIf the child was adopted, provide the child's adoption papers or adoption compliance certificate.\n\nWhere an adoption involved an Australian state or territory central adoption authority, including a letter supporting the adoption.\n\nWhere an adoption involved an Australian state or territory central adoption authority, including a letter supporting the adoption.\n\nIf the child was adopted through an expatriate adoption process, provide evidence that:\n\nIf the child was adopted through an expatriate adoption process, provide evidence that:\n- at least one of the adoptive parents lived outside Australia for more than 12 months before the adoption was finalised\nat least one of the adoptive parents lived outside Australia for more than 12 months before the adoption was finalised\n- the adoptive parent did not arrange to live overseas so they could avoid Australia’s intercountry adoption laws\nthe adoptive parent did not arrange to live overseas so they could avoid Australia’s intercountry adoption laws\n- the adoptive parent has full and permanent parental rights, with no remaining legal ties between the child and the birth parents\nthe adoptive parent has full and permanent parental rights, with no remaining legal ties between the child and the birth parents\n- the child was adopted in line with the adoption laws of their home country\nthe child was adopted in line with the adoption laws of their home country\nSee how\n\n#### Financial documents\n\nFinancial documents\n\nIf the child is over 18 when the application is made, provide evidence the child is dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\n\nIf the child is over 18 when the application is made, provide evidence the child is dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\n- bank statements\nbank statements\n- money transfers\nmoney transfers\n- rent receipts\nrent receipts\nSee how\n\n#### Applicant circumstances documents\n\nApplicant circumstances documents\n\nDepending on the child's situation, we might require other documents.\n\nDepending on the child's situation, we might require other documents.\nSee how\n\n#### Applicants aged 18 to 25 years studying full time\n\nApplicants aged 18 to 25 years studying full time\n\nProvide evidence the child is enrolled and actively participating as a full-time student in a post-secondary course of study.\n\nProvide evidence the child is enrolled and actively participating as a full-time student in a post-secondary course of study.\n\nProvide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies.\n\nProvide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies.\n\n#### Applicants aged 18 or older with disability\n\nApplicants aged 18 or older with disability\n\nProvide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working.\n\nProvide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working.\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with the child, provide:\n\nFor every dependant under 18 years old who is applying with the child, provide:\n- identity documents\nidentity documents\n- travel documents\ntravel documents\n- proof of the child's relationship with the dependant, like a birth or marriage certificate\nproof of the child's relationship with the dependant, like a birth or marriage certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to stay Australia on this visa\na statutory declaration giving their consent for the child to stay Australia on this visa\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\n- passport\npassport\n- driver’s licence\ndriver’s licence\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of the child's home country allow them to leave their home country\nthat the laws of the child's home country allow them to leave their home country\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe might ask you to provide an Australian state or territory police certificate if you have lived in an Australian state or territory for at least 12 months.\n\nWe might ask you to provide an Australian state or territory police certificate if you have lived in an Australian state or territory for at least 12 months.\n\nIf you have lived for at least 12 months in an overseas country, we might ask you to provide a police certificate from that country.\n\nIf you have lived for at least 12 months in an overseas country, we might ask you to provide a police certificate from that country.\n\nIf anyone included in the application has served in the armed forces of any country, they must provide their military service record or discharge papers.\n\nIf anyone included in the application has served in the armed forces of any country, they must provide their military service record or discharge papers.\n\nChildren over 16 years of age must complete and provideForm 80 Personal particulars for assessment including character assessment (596KB PDF).\n\nChildren over 16 years of age must complete and provide\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nDo not certify police certificates. You need to send us the originals.\n\nDo not certify police certificates. You need to send us the originals.\n\nHave all other documentscertified. This includes:\n\nHave all other documents\ncertified\n. This includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\n\nPhotographs of the applicant and any of their dependent children included in the application must also be certified.\n\nPhotographs of the applicant and any of their dependent children included in the application must also be certified.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much information as possible to help us decide your application\nas much information as possible to help us decide your application\n- each document only once, even if it is evidence of more than one thing\neach document only once, even if it is evidence of more than one thing\n- all documents with your application, if you can\nall documents with your application, if you can\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa on paper.\n\nYou must apply for this visa on paper.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Apply on paper\n\nApply on paper\n\nComplete the following 2 forms and send them together:\n\nComplete the following 2 forms and send them together:\n- Form 47CH Application for migration to Australia by a child (2MB PDF)\nForm 47CH Application for migration to Australia by a child (2MB PDF)\n- Form 40CH Sponsorship for a child to migrate to Australia (2MB PDF)\nForm 40CH Sponsorship for a child to migrate to Australia (2MB PDF)\n\nThe forms must be completed in English.\n\nThe forms must be completed in English.\n\nPay for the application before it is submitted using the online portal payment function inImmiAccount. Include evidence the application is paid for with your application. For other payment options seehow to pay.\n\nPay for the application before it is submitted using the online portal payment function in\nImmiAccount\n. Include evidence the application is paid for with your application. For other payment options see\nhow to pay\n.\n\nApplications for this visa can't be submitted in person. Send the application by post or courier to the Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\n\nApplications for this visa can't be submitted in person. Send the application by post or courier to the Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter applying\n\nWe will let the applicant know when we have received the application and documents. There might be other things to do or be aware of after applying.\n\nWe will let the applicant know when we have received the application and documents. There might be other things to do or be aware of after applying.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa made in Australia.\n\nYou can import any new and existing applications for this visa made in Australia.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further.\n\nWe can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further.\nSee how\n\n#### Travel\n\nTravel\n\nTell us if the child needs to travel outside Australia while we process their application. We need to know because the child must be in Australia when we make our decision.\n\nTell us if the child needs to travel outside Australia while we process their application. We need to know because the child must be in Australia when we make our decision.\n\nIf you leave Australia, make sure the child has a valid visa to return.\n\nIf you leave Australia, make sure the child has a valid visa to return.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know when to arrange the child’shealth examinations.\n\nWe will let you know when to arrange the child’s\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will let you know if the child needs to provide them.\n\nWe might ask for\nbiometrics\n. We will let you know if the child needs to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nMake sure the child stays lawful by holding a valid visa while we process their application.\n\nMake sure the child stays lawful by holding a valid visa while we process their application.\n\nWhen the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application.\n\nWhen the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can add the child's dependent children to their visa application any time before we make a decision.\n\nYou can add the child's dependent children to their visa application any time before we make a decision.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can.\n\nLet us know as soon as you can.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF).\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to the child's phone number, address or passport\nchanges to the child's phone number, address or passport\n- changes to the child's relationship status\nchanges to the child's relationship status\n- the child is over 18 and stops studying full-time or starts working full-time\nthe child is over 18 and stops studying full-time or starts working full-time\n- the birth of a child\nthe birth of a child\n- you want to withdraw the application.\nyou want to withdraw the application.\n\nSee how to tell us ifyour situation changes.\n\nSee how to tell us if\nyour situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nThe child must be in Australia when we make our decision.\n\nThe child must be in Australia when we make our decision.\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nIf we grant the visa, we will advise:\n\nIf we grant the visa, we will advise:\n- the visa grant number\nthe visa grant number\n- the date your visa starts\nthe date your visa starts\n- any visa conditions\nany visa conditions\n\nKeep a copy of the grant letter with you when in Australia.\n\nKeep a copy of the grant letter with you when in Australia.\n\nIf we refuse the child's visa, we will advise:\n\nIf we refuse the child's visa, we will advise:\n- why we refused the visa\nwhy we refused the visa\n- any rights of review\nany rights of review\n\nWe will not refund the application charge if we refuse the application.\n\nWe will not refund the application charge if we refuse the application.\nWhen you have this visa\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nIn Australia\nLeaving Australia\n\n## In Australia\n\nIn Australia\n\n### The child's obligations\n\nThe child's obligations\n\nThe child and family members must obey all Australian laws.\n\nThe child and family members must obey all Australian laws.\n\n### Tell us if things change\n\nTell us if things change\n\nThings we need to know about include:\n\nThings we need to know about include:\n- changes to the child's passport\nchanges to the child's passport\n- the birth of a child\nthe birth of a child\n- changes of name\nchanges of name\n\nSee how to let us know if there is achange in the child's situation.\n\nSee how to let us know if there is a\nchange in the child's situation\n.\n\n### See how long the child can stay\n\nSee how long the child can stay\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThe child becomes a permanent resident the day we grant the visa.\n\nThe child becomes a permanent resident the day we grant the visa.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility:\n\nIf the child wants to travel after the initial 5-year travel facility:\n- they will need to apply for and be granted aResident Return (RRV)visa so they can re-enter Australia as a permanent resident\nthey will need to apply for and be granted a\nResident Return (RRV)\nvisa so they can re-enter Australia as a permanent resident\n- they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n### Working\n\nWorking\n\nThe child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law.See their workplace rights and entitlements.\n\nThe child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law.\nSee their workplace rights and entitlements\n.\n\n### Bringing a family member\n\nBringing a family member\n\nYou can't add a family member after we have decided the application.\n\nYou can't add a family member after we have decided the application.\n\nIf we have made a decision on your visa and you want to bring a family member to Australia, you will need to submit a new visa application for them.\n\nIf we have made a decision on your visa and you want to bring a family member to Australia, you will need to submit a new visa application for them.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, the child's permanent residence starts the day we grant the visa.\n\nFor citizenship purposes, the child's permanent residence starts the day we grant the visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before the child leaves\n\nBefore the child leaves\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident inVEVO.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident in\nVEVO\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After the child leaves\n\nAfter the child leaves\n\n#### Prove the child has been to Australia\n\nProve the child has been to Australia\n\nRequest the child's international movement recordsto get proof of their travel in and out of Australia.\n\nRequest the child's international movement records\nto get proof of their travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101/measures-for-the-protection-of-children",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-802#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:06:40.657832",
  "metadata": {}
}