{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870",
  "title": "Sponsored Parent (Temporary) visa",
  "raw_text": "===== main placeholder ========================================== (Subclass 870) Sponsored Parent (Temporary) visa This temporary visa lets a parent of an Australian citizen, Australian permanent resident or eligible New Zealand citizen visit Australia for up to 3 or 5 years. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Applications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount. Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​ The Australian Government is streamlining requirements for temporary visa applicants in Australia. Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon. Check if you still need to undertake a medical examination and chest x-ray Stay Up to 3 or 5 years Cost Up to 3 years AUD6,070.00 Up to 5 years AUD12,140.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa you can visit Australia for up to 3 or 5 years per visa can apply for further visas to visit up to a maximum period in Australia of 10 years cannot work in Australia See all conditions Check your eligibility You must have an approved Parent Sponsor before you can lodge an application for this visa apply online for this visa lodge your visa application within 6 months of the sponsorship approval, or 60 days if we give you permission to apply in Australia Help with your visa If you are getting help with your visa, before you pay someone, read information on who can help with your visa application About this visa Applications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount. Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​ The Australian Government is streamlining requirements for temporary visa applicants in Australia. Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon. Check if you still need to undertake a medical examination and chest x-ray With this visa you can How long you can stay Stay longer Applying for another Sponsored Parent (Temporary) visa Include family Sponsorship Cost Apply from Processing times Travel Your obligations Visa label With this visa you can reunite with children visit Australia for up to 3 or 5 years per visa re-apply for further Sponsored Parent (Temporary) visas to visit up to a maximum period of 10 years in Australia You cannot work in Australia while you hold this visa. How long you can stay This is a temporary visa. This visa does not lead to permanent residence. You cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa. You can apply to stay in Australia for up to 3 or 5 years at a time, with a cumulative maximum stay of 10 years. If you held a Sponsored Parent (Temporary) visa and were outside Australia on 1 July 2021, your visa period was automatically extended by 18 months under the COVID-19 visa concessions . If your visa was extended under this concession, the additional 18 months will not count towards your cumulative 10 year maximum stay. You can stay for the period or date(s) specified on the visa grant letter. Your visa will end: on the date specified on the visa grant letter we cancel it if your sponsor withdraws their sponsorship and you do not find a new Parent Sponsor if we cancel the sponsorship. Stay longer You cannot stay in Australia longer by extending this visa. If you wish to remain in Australia, you must apply for and be granted another visa. Applying for another Sponsored Parent (Temporary) visa If you are applying for another Sponsored Parent (Temporary) visa, you must lodge your application from outside of Australia. This applies unless we have issued you with Permission to Apply in Australia (but not in immigration clearance). If you apply for another Sponsored Parent (Temporary) visa whilst outside of Australia, you will not be eligible for the grant of this visa unless you have been outside of Australia for at least 90 consecutive days since your relevant departure day. You can calculate your relevant departure day based on your location when your last Sponsored Parent (Temporary) visa ceased: If you were in Australia – your relevant departure day is the first day you left Australia after your visa ceased. If you were outside of Australia - your relevant departure day is the last day you left Australia while the visa was in effect. If you have held Sponsored Parent (Temporary) visas for the cumulative maximum 10 year period, you will not be eligible for a further Sponsored Parent (Temporary) visa. You must either depart Australia or apply for and be granted another kind of visa that will allow you to remain in Australia. Include family You cannot include family members in your visa application. Sponsorship You must have an approved Parent Sponsor to apply for this visa. Your sponsor’s household is limited to one sponsorship at a time. Your sponsor’s sponsorship can cover up to 2 parents per household at a time. Your sponsor cannot lodge a new sponsorship application until their current approved sponsorship ends. Cost This visa costs from: AUD6,070.00 for a visa of up to 3 years; or AUD12,140.00 for a visa of up to 5 years. You pay for this visa in 2 parts called instalments. Pay the first instalment when you apply. Pay the second instalment when we ask you to. You might also have to pay other costs for health checks police certificates biometrics . For more information see Fee and charges for other services To work out what this visa will cost, you can use the Visa Pricing Estimator . The estimator does not take into account the second instalment or other costs. Apply from You must be outside Australia when you apply for this visa, unless you have Permission to Apply in Australia (but not in immigration clearance ). Permission to Apply in Australia may be approved in exceptional circumstances. This may include where the parent cannot depart Australia, for example, because of: the parent having an accident or a serious illness (medical evidence must be provided) or a natural disaster preventing travel to the parent’s home country. You can be in or outside Australia, but not in immigration clearance , when we decide your application. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application might take longer to process if: you do not fill it in correctly you do not include all the documents we need or we need more information from you it takes us time to verify your information Travel You can travel to and from Australia as many times as you want while the visa is valid. Your obligations You must obey Australian laws and meet all visa conditions Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Applications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount. Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​ The Australian Government is streamlining requirements for temporary visa applicants in Australia. Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon. Check if you still need to undertake a medical examination and chest x-ray Be eligible to apply Details To be eligible to apply, you must: be the biological, legal (including adoptive) parent, step-parent or parent in-law of the Parent Sponsor be at least 18 years of age There is no balance of family test or Assurance of Support requirements for this visa. Have a sponsor You must have an approved Parent Sponsor to apply for this visa. Have met any previous visa obligations You must have met and complied with any previous visa obligations. Meet the health requirement You must meet our health requirement Meet the character requirement You must meet our character requirement Have enough money You must have, or have access to, enough money to support yourself while you are in Australia. Have a genuine intention to stay in Australia temporarily Details You must intend to: stay only temporarily in Australia do only the things the visa allows you to do. If you have already lodged a permanent parent visa application, you may visit Australia, but not remain in Australia permanently while the application is being decided. This is a temporary visa only. You will not have the right to permanent residence. You cannot apply for a permanent or temporary parent visa if you have applied for or hold this visa. Health insurance Details You must have and maintain adequate arrangements for health insurance from an Australian Health Insurance provider to cover any unforeseen medical treatment you might need while you are in Australia. See what we consider adequate health insurance Learn more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Have no debt to the Australian government If you owe the Australian Government money or you have a public health debt, you must have paid it back or have arrangements in place to pay it back. Meet all these criteria? Check how to apply in our step by step guide. Step by step Applications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount. Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​ The Australian Government is streamlining requirements for temporary visa applicants in Australia. Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon. Check if you still need to undertake a medical examination and chest x-ray Step 1 Before you apply Before you apply, check you are eligible. Check that you have an approved Parent Sponsor. You can't apply for or be granted this visa if you do not have an approved Parent Sponsor. Show steps Check your passport You must have a valid passport. We will only grant the visa if you have a valid passport. Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide evidence to support your application. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or don't provide accurate information Identity documents We need proof of your identity. If you cannot prove your identity: we will refuse your visa application we might not grant you another visa for 10 years Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by such as a birth certificate showing the names of both parents or custody documents issued by the relevant court of law. See how Permission to Apply in Australia We will tell your approved Parent Sponsor if you have Permission to Apply in Australia (but not in immigration clearance) if we approve their sponsorship. This advice will be provided in a Permission to Apply letter. You must attach a copy of this letter to your visa application. See how Genuine intention to stay in Australia temporarily Provide as much evidence as possible to show that you have a genuine intention to visit Australia temporarily. The evidence may include but not limited to: your reasons to visit Australia temporarily proof that you will return home proof that you own a house/other major assets and have strong ties to your home country. See how Character documents Provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. Also provide: an overseas police certificate from every country , including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 military service records or discharge papers if you served in the armed forces of any country Complete and provide the following forms: Form 80 Personal particulars for assessment including character assessment (596KB PDF) See how Health exams Check ImmiAccount if you need to do any health examinations . If health examinations are required, you may wish to do them before lodging your application so that we can process your application more quickly. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Attach Attach a document only once, even if you are using it to show more than one thing. Learn more about attaching documents See how Step 3 Apply for the visa NOTE: You cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa. You must apply: online from outside Australia within 6 months of Sponsorship approval If you have Permission to Apply in Australia in Australia, you must apply within 60 days of sponsorship approval. If you do not apply within 60 days, your approved Parent Sponsor may apply again for Permission to Apply in Australia, if the sponsorship is valid and there are exceptional circumstances for applying while in Australia. If we do not approve the Permission to Apply in Australia request, you will have to: apply for the visa from outside Australia within 6 months of sponsorship approval, or apply for and be granted a different kind of visa to remain in Australia. Show steps Apply online in ImmiAccount Login or create an ImmiAccount Complete Application for a Sponsored Parent (Temporary) visa Attach documents Pay the application fee . We will not process your application until you pay. Complete applications might be processed quicker. Incomplete ones might be delayed or refused if there is insufficient information to show you meet the requirements. Step 4 After you apply We will let you know when we have received your application and documents. Show steps Status updates We will not give you updates on your application’s progress within normal processing times. You can check your application progress in ImmiAccount. We will let you know if you need to provide anything further. You can check if we need more information in ImmiAccount Travel If you are outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. Attach more information Attach any documents you did not provide with your application into ImmiAccount. We might also ask you to provide more information. Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Attach a completed Form 1023 Notification of incorrect answers (168KB PDF) to your application in ImmiAccount. Tell us if things change Tell us if things change after you apply but before we've made a decision. Things you need to let us know about include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child if you are convicted of a crime See how to tell us if your situation changes See how Biometrics We might ask for biometrics. We will let you know if you need to provide them. Health exams We will let you know if you need to do any other health examinations Pay the second instalment You must pay a second instalment before we will grant the visa. We will send you an invoice when it is due. If you do not pay the invoice, we will refuse your application. Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Withdrawing your visa application You can withdraw your visa application at any time before we decide on the application. To withdraw your application, advise us in writing. Follow the instruction to withdraw your visa application You must attach the completed form to your application in ImmiAccount We will not refund the visa application fee if you withdraw your application. See how Step 5 Visa outcome You can be in or outside Australia, but not in immigration clearance, when we decide your application. We will let you know our decision in writing. If we grant you the visa, we will let you know: your visa grant number the date your visa starts your visa conditions Keep a copy of our decision. If we refuse your visa we will let you know in writing. We will tell you: why we refused the visa whether you have a right to a review of the decision We will not refund the application fee if we refuse your application. When you have this visa Applications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount. Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​ The Australian Government is streamlining requirements for temporary visa applicants in Australia. Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon. Check if you still need to undertake a medical examination and chest x-ray Coming to Australia In Australia Leaving Australia Coming to Australia Before you travel You must have: a valid visa to enter Australia a valid passport or other travel document At the border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card Using the SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you must do when you have this visa You must obey all Australian laws. Tell us if things change See what to do if your situation changes Change of Parent sponsor If your approved Parent Sponsor withdraws their sponsorship you will need to find a new sponsor or your visa will cease. The new sponsorship application must be lodged within 35 days of the original sponsorship withdrawal and the new sponsor must meet the sponsor eligibility requirements. Where a new sponsorship is approved, the previous Parent Sponsor will still need to pay any outstanding health debts incurred by the sponsored parent in Australia while they were the parent sponsor. If a new sponsorship is not approved, you will need to either apply for and be granted a different kind of visa to stay in Australia or make arrangements to leave Australia. Death of a sponsor If your approved Parent Sponsor dies, a new sponsorship application can be lodged to be your new Parent Sponsor. This must be done within 90 days of death of the approved Parent Sponsor. The new sponsor must meet the sponsor eligibility requirements. What you can do on your visa To see your visa expiry and conditions use VEVO Travelling on your visa You can travel to and from Australia as many times as you want while the visa is valid. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO No work condition You are not allowed to work in Australia while you hold this visa. You can undertake the following unpaid work: providing care for grandchildren or other minor relatives in a domestic environment undertaking volunteer work in a non-commercial capacity such as assisting a charitable organisation assisting at a local school where the sponsor’s children or other minor relatives attend However, you cannot undertake any unpaid work: in a commercial environment in a family business Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your visa is still valid Check your conditions and the expiry of your current visa in VEVO See what you can and must do if your visa has expired or is about to expire At the Border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Proving you have been to Australia Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\n(Subclass 870)\n\n# Sponsored Parent (Temporary) visa\n\nSponsored Parent (Temporary) visa\n\nThis temporary visa lets a parent of an Australian citizen, Australian permanent resident or eligible New Zealand citizen visit Australia for up to 3 or 5 years.\n\nThis temporary visa lets a parent of an Australian citizen, Australian permanent resident or eligible New Zealand citizen visit Australia for up to 3 or 5 years.\n\nThis temporary visa lets a parent of an Australian citizen, Australian permanent resident or eligible New Zealand citizen visit Australia for up to 3 or 5 years.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​The Australian Government is streamlining requirements for temporary visa applicants in Australia.Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.Check if you still need toundertake a medical examination and chest x-ray.​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.\nApplications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nCheck if you still need toundertake a medical examination and chest x-ray.\n\nCheck if you still need to\nundertake a medical examination and chest x-ray\n.\n​\n\n#### Stay\n\nStay\n\nUp to 3 or 5 years\n\nUp to 3 or 5 years\n\n#### Cost\n\nCost\n\nUp to 3 years AUD6,070.00Up to 5 years AUD12,140.00\n\nUp to 3 years AUD6,070.00\n\nUp to 3 years AUD6,070.00\n\nUp to 5 years AUD12,140.00\n\nUp to 5 years AUD12,140.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa you\n\nWith this visa you\n- can visit Australia for up to 3 or 5 years per visa\ncan visit Australia for up to 3 or 5 years per visa\n- can apply for further visas to visit up to a maximum period in Australia of 10 years\ncan apply for further visas to visit up to a maximum period in Australia of 10 years\n- cannotworkin Australia\ncannot\nwork\nin Australia\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- have an approved Parent Sponsor before you can lodge an application for this visa\nhave an approved Parent Sponsor before you can lodge an application for this visa\n- apply online for this visa\napply online for this visa\n- lodge your visa application within 6 months of the sponsorship approval, or 60 days if we give youpermission to apply in Australia.\nlodge your visa application within 6 months of the sponsorship approval, or 60 days if we give you\npermission to apply in Australia\n.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onwho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nwho can help with your visa application\n.\nAbout this visa\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​The Australian Government is streamlining requirements for temporary visa applicants in Australia.Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.Check if you still need toundertake a medical examination and chest x-ray.​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.\nApplications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nCheck if you still need toundertake a medical examination and chest x-ray.\n\nCheck if you still need to\nundertake a medical examination and chest x-ray\n.\n​\nWith this visa you can\nHow long you can stay\nStay longer\nApplying for another Sponsored Parent (Temporary) visa\nInclude family\nSponsorship\nCost\nApply from\nProcessing times\nTravel\nYour obligations\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- reunite with children\nreunite with children\n- visit Australia for up to 3 or 5 years per visa\nvisit Australia for up to 3 or 5 years per visa\n- re-apply for further Sponsored Parent (Temporary) visas to visit up to a maximum period of 10 years in Australia\nre-apply for further Sponsored Parent (Temporary) visas to visit up to a maximum period of 10 years in Australia\n\nYou cannotworkin Australia while you hold this visa.\n\nYou cannot\nwork\nin Australia while you hold this visa.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa. This visa does not lead to permanent residence. You cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa.\n\nThis is a temporary visa. This visa does not lead to permanent residence. You cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa.\n\nYou can apply to stay in Australia for up to 3 or 5 years at a time, with a cumulative maximum stay of 10 years.\n\nYou can apply to stay in Australia for up to 3 or 5 years at a time, with a cumulative maximum stay of 10 years.\n\nIf you held a Sponsored Parent (Temporary) visa and were outside Australia on 1 July 2021, your visa period was automatically extended by 18 months under theCOVID-19 visa concessions. If your visa was extended under this concession, the additional 18 months will not count towards your cumulative 10 year maximum stay.\n\nIf you held a Sponsored Parent (Temporary) visa and were outside Australia on 1 July 2021, your visa period was automatically extended by 18 months under the\nCOVID-19 visa concessions\n. If your visa was extended under this concession, the additional 18 months will not count towards your cumulative 10 year maximum stay.\n\nYou can stay for the period or date(s) specified on the visa grant letter.\n\nYou can stay for the period or date(s) specified on the visa grant letter.\n\nYour visa will end:\n\nYour visa will end:\n- on the date specified on the visa grant letter\non the date specified on the visa grant letter\n- we cancel it\nwe cancel it\n- if your sponsor withdraws their sponsorship and you do not find a new Parent Sponsor\nif your sponsor withdraws their sponsorship and you do not find a new Parent Sponsor\n- if we cancel the sponsorship.\nif we cancel the sponsorship.\n\n## Stay longer\n\nStay longer\n\nYou cannot stay in Australia longer by extending this visa. If you wish to remain in Australia, you must apply for and be granted another visa.\n\nYou cannot stay in Australia longer by extending this visa. If you wish to remain in Australia, you must apply for and be granted another visa.\n\n## Applying for another Sponsored Parent (Temporary) visa\n\nApplying for another Sponsored Parent (Temporary) visa\n\nIf you are applying for another Sponsored Parent (Temporary) visa, you must lodge your application from outside of Australia. This applies unless we have issued you with Permission to Apply in Australia (but not in immigration clearance).\n\nIf you are applying for another Sponsored Parent (Temporary) visa, you must lodge your application from outside of Australia. This applies unless we have issued you with Permission to Apply in Australia (but not in immigration clearance).\n\nIf you apply for another Sponsored Parent (Temporary) visa whilst outside of Australia, you will not be eligible for the grant of this visa unless you have been outside of Australia for at least 90 consecutive days since your relevant departure day.\n\nIf you apply for another Sponsored Parent (Temporary) visa whilst outside of Australia, you will not be eligible for the grant of this visa unless you have been outside of Australia for at least 90 consecutive days since your relevant departure day.\n\nYou can calculate your relevant departure day based on your location when your last Sponsored Parent (Temporary) visa ceased:\n\nYou can calculate your relevant departure day based on your location when your last Sponsored Parent (Temporary) visa ceased:\n- If you were in Australia – your relevant departure day is the first day you left Australia after your visa ceased.\nIf you were in Australia – your relevant departure day is the first day you left Australia after your visa ceased.\n- If you were outside of Australia - your relevant departure day is the last day you left Australia while the visa was in effect.\nIf you were outside of Australia - your relevant departure day is the last day you left Australia while the visa was in effect.\n\nIf you have held Sponsored Parent (Temporary) visas for the cumulative maximum 10 year period, you will not be eligible for a further Sponsored Parent (Temporary) visa. You must either depart Australia or apply for and be granted another kind of visa that will allow you to remain in Australia.\n\nIf you have held Sponsored Parent (Temporary) visas for the cumulative maximum 10 year period, you will not be eligible for a further Sponsored Parent (Temporary) visa. You must either depart Australia or apply for and be granted another kind of visa that will allow you to remain in Australia.\n\n## Include family\n\nInclude family\n\nYou cannot include family members in your visa application.\n\nYou cannot include family members in your visa application.\n\n## Sponsorship\n\nSponsorship\n\nYou must have an approved Parent Sponsor to apply for this visa.\n\nYou must have an approved Parent Sponsor to apply for this visa.\n\nYour sponsor’s household is limited to one sponsorship at a time.\n\nYour sponsor’s household is limited to one sponsorship at a time.\n\nYour sponsor’s sponsorship can cover up to 2 parents per household at a time.\n\nYour sponsor’s sponsorship can cover up to 2 parents per household at a time.\n\nYour sponsor cannot lodge a new sponsorship application until their current approved sponsorship ends.\n\nYour sponsor cannot lodge a new sponsorship application until their current approved sponsorship ends.\n\n## Cost\n\nCost\n\nThis visa costs from:\n\nThis visa costs from:\n- AUD6,070.00 for a visa of up to 3 years; or\nAUD6,070.00 for a visa of up to 3 years; or\n- AUD12,140.00 for a visa of up to 5 years.\nAUD12,140.00 for a visa of up to 5 years.\n\nYou pay for this visa in 2 parts called instalments.\n\nYou pay for this visa in 2 parts called instalments.\n\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\n\nPay the first instalment when you apply. Pay the second instalment when we ask you to.\n\nYou might also have to pay other costs forhealth checks,police certificatesbiometrics. For more information seeFee and charges for other services.\n\nYou might also have to pay other costs for\nhealth checks\n,\npolice certificates\nbiometrics\n. For more information see\nFee and charges for other services\n.\n\nTo work out what this visa will cost, you can use theVisa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\n\nTo work out what this visa will cost, you can use the\nVisa Pricing Estimator\n. The estimator does not take into account the second instalment or other costs.\n\n## Apply from\n\nApply from\n\nYou must be outside Australia when you apply for this visa, unless you have Permission to Apply in Australia (but not inimmigration clearance).\n\nYou must be outside Australia when you apply for this visa, unless you have Permission to Apply in Australia (but not in\nimmigration clearance\n).\n\nPermission to Apply in Australiamay be approved in exceptional circumstances. This may include where the parent cannot depart Australia, for example, because of:\n\nPermission to Apply in Australia\nmay be approved in exceptional circumstances. This may include where the parent cannot depart Australia, for example, because of:\n- the parent having an accident or a serious illness (medical evidence must be provided) or\nthe parent having an accident or a serious illness (medical evidence must be provided) or\n- a natural disaster preventing travel to the parent’s home country.\na natural disaster preventing travel to the parent’s home country.\n\nYou can be in or outside Australia, but not inimmigration clearance, when we decide your application.\n\nYou can be in or outside Australia, but not in\nimmigration clearance\n, when we decide your application.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application might take longer to process if:\n\nYour application might take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need or we need more information from you\nyou do not include all the documents we need or we need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n\n## Travel\n\nTravel\n\nYou can travel to and from Australia as many times as you want while the visa is valid.\n\nYou can travel to and from Australia as many times as you want while the visa is valid.\n\n## Your obligations\n\nYour obligations\n\nYou must obey Australian laws and meet allvisa conditions.\n\nYou must obey Australian laws and meet all\nvisa conditions\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​The Australian Government is streamlining requirements for temporary visa applicants in Australia.Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.Check if you still need toundertake a medical examination and chest x-ray.​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.\nApplications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nCheck if you still need toundertake a medical examination and chest x-ray.\n\nCheck if you still need to\nundertake a medical examination and chest x-ray\n.\n​\n\n## Be eligible to apply\n\nBe eligible to apply\nDetails\n\nTo be eligible to apply, you must:\n\nTo be eligible to apply, you must:\n- be the biological, legal (including adoptive) parent, step-parent or parent in-law of the Parent Sponsor\nbe the biological, legal (including adoptive) parent, step-parent or parent in-law of the Parent Sponsor\n- be at least 18 years of age\nbe at least 18 years of age\n\nThere is no balance of family test or Assurance of Support requirements for this visa.\n\nThere is no balance of family test or Assurance of Support requirements for this visa.\n\n## Have a sponsor\n\nHave a sponsor\n\nYou must have an approved Parent Sponsor to apply for this visa.\n\nYou must have an approved Parent Sponsor to apply for this visa.\n\n## Have met any previous visa obligations\n\nHave met any previous visa obligations\n\nYou must have met and complied with any previous visa obligations.\n\nYou must have met and complied with any previous visa obligations.\n\n## Meet the health requirement\n\nMeet the health requirement\n\nYou must meet ourhealth requirement.\n\nYou must meet our\nhealth requirement\n.\n\n## Meet the character requirement\n\nMeet the character requirement\n\nYou must meet ourcharacter requirement.\n\nYou must meet our\ncharacter requirement\n.\n\n## Have enough money\n\nHave enough money\n\nYou must have, or have access to, enough money to support yourself while you are in Australia.\n\nYou must have, or have access to, enough money to support yourself while you are in Australia.\n\n## Have a genuine intention to stay in Australia temporarily\n\nHave a genuine intention to stay in Australia temporarily\nDetails\n\nYou must intend to:\n\nYou must intend to:\n- stay only temporarily in Australia\nstay only temporarily in Australia\n- do only the things the visa allows you to do.\ndo only the things the visa allows you to do.\n\nIf you have already lodged a permanent parent visa application, you may visit Australia, but not remain in Australia permanently while the application is being decided. This is a temporary visa only. You will not have the right to permanent residence. You cannot apply for a permanent or temporary parent visa if you have applied for or hold this visa.\n\nIf you have already lodged a permanent parent visa application, you may visit Australia, but not remain in Australia permanently while the application is being decided. This is a temporary visa only. You will not have the right to permanent residence. You cannot apply for a permanent or temporary parent visa if you have applied for or hold this visa.\n\n## Health insurance\n\nHealth insurance\nDetails\n\nYou must have and maintain adequate arrangements for health insurance from an Australian Health Insurance provider to cover any unforeseen medical treatment you might need while you are in Australia.\n\nYou must have and maintain adequate arrangements for health insurance from an Australian Health Insurance provider to cover any unforeseen medical treatment you might need while you are in Australia.\n\nSee what we consideradequate health insurance.\n\nSee what we consider\nadequate health insurance\n.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors\n.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Have no debt to the Australian government\n\nHave no debt to the Australian government\n\nIf you owe the Australian Government money or you have a public health debt, you must have paid it back or have arrangements in place to pay it back.\n\nIf you owe the Australian Government money or you have a public health debt, you must have paid it back or have arrangements in place to pay it back.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​The Australian Government is streamlining requirements for temporary visa applicants in Australia.Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.Check if you still need toundertake a medical examination and chest x-ray.​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.\nApplications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nCheck if you still need toundertake a medical examination and chest x-ray.\n\nCheck if you still need to\nundertake a medical examination and chest x-ray\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nBefore you apply, check you are eligible. Check that you have an approved Parent Sponsor. You can't apply for or be granted this visa if you do not have an approved Parent Sponsor.\n\nBefore you apply, check you are eligible. Check that you have an approved Parent Sponsor. You can't apply for or be granted this visa if you do not have an approved Parent Sponsor.\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nYou must have a valid passport. We will only grant the visa if you have a valid passport.\n\nYou must have a valid passport. We will only grant the visa if you have a valid passport.\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide evidence to support your application.\n\nProvide evidence to support your application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens ifyou can't prove your identity or don't provide accurate information.\n\nProvide accurate information. See what happens if\nyou can't prove your identity or don't provide accurate information\n.\n\n#### Identity documents\n\nIdentity documents\n\nWe need proof of your identity. If you cannot prove your identity:\n\nWe need proof of your identity. If you cannot prove your identity:\n- we will refuse your visa application\nwe will refuse your visa application\n- we might not grant you another visa for 10 years\nwe might not grant you another visa for 10 years\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by such as a birth certificate showing the names of both parents or custody documents issued by the relevant court of law.\ndocuments that show other names you have been known by such as a birth certificate showing the names of both parents or custody documents issued by the relevant court of law.\nSee how\n\n#### Permission to Apply in Australia\n\nPermission to Apply in Australia\n\nWe will tell your approved Parent Sponsor if you have Permission to Apply in Australia (but not in immigration clearance) if we approve their sponsorship.\n\nWe will tell your approved Parent Sponsor if you have Permission to Apply in Australia (but not in immigration clearance) if we approve their sponsorship.\n\nThis advice will be provided in a Permission to Apply letter.\n\nThis advice will be provided in a Permission to Apply letter.\n\nYou must attach a copy of this letter to your visa application.\n\nYou must attach a copy of this letter to your visa application.\nSee how\n\n#### Genuine intention to stay in Australia temporarily\n\nGenuine intention to stay in Australia temporarily\n\nProvide as much evidence as possible to show that you have a genuine intention to visit Australia temporarily. The evidence may include but not limited to:\n\nProvide as much evidence as possible to show that you have a genuine intention to visit Australia temporarily. The evidence may include but not limited to:\n- your reasons to visit Australia temporarily\nyour reasons to visit Australia temporarily\n- proof that you will return home\nproof that you will return home\n- proof that you own a house/other major assets and have strong ties to your home country.\nproof that you own a house/other major assets and have strong ties to your home country.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nWe only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nWe only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nAlso provide:\n\nAlso provide:\n- an overseas police certificate fromevery country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\nan overseas police certificate from\nevery country\n, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\n- military service records or discharge papers if you served in the armed forces of any country\nmilitary service records or discharge papers if you served in the armed forces of any country\n\nComplete and provide the following forms:\n\nComplete and provide the following forms:\n- Form 80 Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\nSee how\n\n#### Health exams\n\nHealth exams\n\nCheckImmiAccountif you need to do anyhealth examinations. If health examinations are required, you may wish to do them before lodging your application so that we can process your application more quickly.\n\nCheck\nImmiAccount\nif you need to do any\nhealth examinations\n. If health examinations are required, you may wish to do them before lodging your application so that we can process your application more quickly.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\n#### Attach\n\nAttach\n\nAttach a document only once, even if you are using it to show more than one thing.\n\nAttach a document only once, even if you are using it to show more than one thing.\n\nLearn more aboutattaching documents.\n\nLearn more about\nattaching documents\n.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nNOTE:You cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa.\n\nNOTE:\nYou cannot apply for a permanent or temporary parent visa when you have applied for or hold this visa.\n\nYou must apply:\n\nYou must apply:\n- online\nonline\n- from outside Australia within 6 months of Sponsorship approval\nfrom outside Australia within 6 months of Sponsorship approval\n\nIf you havePermission to Apply in Australiain Australia, you must apply within 60 days of sponsorship approval. If you do not apply within 60 days, your approved Parent Sponsor may apply again for Permission to Apply in Australia, if the sponsorship is valid and there are exceptional circumstances for applying while in Australia.\n\nIf you have\nPermission to Apply in Australia\nin Australia, you must apply within 60 days of sponsorship approval. If you do not apply within 60 days, your approved Parent Sponsor may apply again for Permission to Apply in Australia, if the sponsorship is valid and there are exceptional circumstances for applying while in Australia.\n\nIf we do not approve the Permission to Apply in Australia request, you will have to:\n\nIf we do not approve the Permission to Apply in Australia request, you will have to:\n- apply for the visa from outside Australia within 6 months of sponsorship approval, or\napply for the visa from outside Australia within 6 months of sponsorship approval, or\n- apply for and be granted a different kind of visa to remain in Australia.\napply for and be granted a different kind of visa to remain in Australia.\nShow\n                    steps\n\n#### Apply online in ImmiAccount\n\nApply online in ImmiAccount\n1. Login or create anImmiAccount.\nLogin or create an\nImmiAccount\n.\n2. Complete Application for a Sponsored Parent (Temporary) visa\nComplete Application for a Sponsored Parent (Temporary) visa\n3. Attach documents.\nAttach documents\n.\n4. Pay the application fee. We will not process your application until you pay.\nPay the application fee\n. We will not process your application until you pay.\n\nComplete applications might be processed quicker. Incomplete ones might be delayed or refused if there is insufficient information to show you meet the requirements.\n\nComplete applications might be processed quicker. Incomplete ones might be delayed or refused if there is insufficient information to show you meet the requirements.\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents.\n\nWe will let you know when we have received your application and documents.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe will not give you updates on your application’s progress within normal processing times. You can check your application progress in ImmiAccount. We will let you know if you need to provide anything further.\n\nWe will not give you updates on your application’s progress within normal processing times. You can check your application progress in ImmiAccount. We will let you know if you need to provide anything further.\n\nYou can check if we need more information inImmiAccount.\n\nYou can check if we need more information in\nImmiAccount\n.\n\n#### Travel\n\nTravel\n\nIf you are outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\n\nIf you are outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\n\n#### Attach more information\n\nAttach more information\n\nAttach any documents you did not provide with your application intoImmiAccount.\n\nAttach any documents you did not provide with your application into\nImmiAccount.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nAttach a completedForm 1023 Notification of incorrect answers (168KB PDF)to your application in ImmiAccount.\n\nAttach a completed\nForm 1023 Notification of incorrect answers (168KB PDF)\nto your application in ImmiAccount.\n\n#### Tell us if things change\n\nTell us if things change\n\nTell us if things change after you apply but before we've made a decision.\n\nTell us if things change after you apply but before we've made a decision.\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- if you are convicted of a crime\nif you are convicted of a crime\n\nSee how to tell us if yoursituation changes.\n\nSee how to tell us if your\nsituation changes\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask for biometrics. We will let you know if you need to provide them.\n\nWe might ask for biometrics. We will let you know if you need to provide them.\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you need to do any otherhealth examinations.\n\nWe will let you know if you need to do any other\nhealth examinations\n.\n\n#### Pay the second instalment\n\nPay the second instalment\n\nYou must pay a second instalment before we will grant the visa. We will send you an invoice when it is due. If you do not pay the invoice, we will refuse your application.\n\nYou must pay a second instalment before we will grant the visa. We will send you an invoice when it is due. If you do not pay the invoice, we will refuse your application.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Withdrawing your visa application\n\nWithdrawing your visa application\n\nYou can withdraw your visa application at any time before we decide on the application.\n\nYou can withdraw your visa application at any time before we decide on the application.\n\nTo withdraw your application, advise us in writing. Follow the instruction towithdraw your visa application.\n\nTo withdraw your application, advise us in writing. Follow the instruction to\nwithdraw your visa application\n.\n\nYou must attach the completed form to your application inImmiAccount.\n\nYou must attach the completed form to your application in\nImmiAccount\n.\n\nWe will not refund the visa application fee if you withdraw your application.\n\nWe will not refund the visa application fee if you withdraw your application.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia, but not in immigration clearance, when we decide your application.\n\nYou can be in or outside Australia, but not in immigration clearance, when we decide your application.\n\nWe will let you know our decision in writing. If we grant you the visa, we will let you know:\n\nWe will let you know our decision in writing. If we grant you the visa, we will let you know:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of our decision.\n\nKeep a copy of our decision.\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision\nwhether you have a right to a review of the decision\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\nWhen you have this visa\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​The Australian Government is streamlining requirements for temporary visa applicants in Australia.Our systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.Check if you still need toundertake a medical examination and chest x-ray.​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.Applications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nApplications to be an approved Parent Sponsor opened on 17 April 2019 and can be applied for in ImmiAccount.\nApplications for the Sponsored Parent (Temporary) visa (subclass 870) opened on 1 July 2019.​​\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nThe Australian Government is streamlining requirements for temporary visa applicants in Australia.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nOur systems are being updated to reflect the new policy and your ImmiAccount should be updated soon.\n\nCheck if you still need toundertake a medical examination and chest x-ray.\n\nCheck if you still need to\nundertake a medical examination and chest x-ray\n.\n​\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you travel\n\nBefore you travel\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the border\n\nAt the border\n\nCompleting an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n.\n\n### Using the SmartGate\n\nUsing the SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n\n## In Australia\n\nIn Australia\n\n### What you must do when you have this visa\n\nWhat you must do when you have this visa\n\nYou must obey all Australian laws.\n\nYou must obey all Australian laws.\n\n### Tell us if things change\n\nTell us if things change\n\nSee what to do if yoursituation changes.\n\nSee what to do if your\nsituation changes\n.\n\n### Change of Parent sponsor\n\nChange of Parent sponsor\n\nIf your approved Parent Sponsor withdraws their sponsorship you will need to find a new sponsor or your visa will cease.\n\nIf your approved Parent Sponsor withdraws their sponsorship you will need to find a new sponsor or your visa will cease.\n\nThe new sponsorship application must be lodged within 35 days of the original sponsorship withdrawal and the new sponsor must meet the sponsor eligibility requirements.\n\nThe new sponsorship application must be lodged within 35 days of the original sponsorship withdrawal and the new sponsor must meet the sponsor eligibility requirements.\n\nWhere a new sponsorship is approved, the previous Parent Sponsor will still need to pay any outstanding health debts incurred by the sponsored parent in Australia while they were the parent sponsor.\n\nWhere a new sponsorship is approved, the previous Parent Sponsor will still need to pay any outstanding health debts incurred by the sponsored parent in Australia while they were the parent sponsor.\n\nIf a new sponsorship is not approved, you will need to either apply for and be granted a different kind of visa to stay in Australia or make arrangements to leave Australia.\n\nIf a new sponsorship is not approved, you will need to either apply for and be granted a different kind of visa to stay in Australia or make arrangements to leave Australia.\n\n### Death of a sponsor\n\nDeath of a sponsor\n\nIf your approved Parent Sponsor dies, a new sponsorship application can be lodged to be your new Parent Sponsor. This must be done within 90 days of death of the approved Parent Sponsor.\n\nIf your approved Parent Sponsor dies, a new sponsorship application can be lodged to be your new Parent Sponsor. This must be done within 90 days of death of the approved Parent Sponsor.\n\nThe new sponsor must meet the sponsor eligibility requirements.\n\nThe new sponsor must meet the sponsor eligibility requirements.\n\n### What you can do on your visa\n\nWhat you can do on your visa\n\nTo see your visa expiry and conditions useVEVO.\n\nTo see your visa expiry and conditions use\nVEVO\n.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel to and from Australia as many times as you want while the visa is valid.\n\nYou can travel to and from Australia as many times as you want while the visa is valid.\n\n### Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### No work condition\n\nNo work condition\n\nYou are not allowed to work in Australia while you hold this visa.\n\nYou are not allowed to work in Australia while you hold this visa.\n\nYou can undertake the following unpaid work:\n\nYou can undertake the following unpaid work:\n- providing care for grandchildren or other minor relatives in a domestic environment\nproviding care for grandchildren or other minor relatives in a domestic environment\n- undertaking volunteer work in a non-commercial capacity such as assisting a charitable organisation\nundertaking volunteer work in a non-commercial capacity such as assisting a charitable organisation\n- assisting at a local school where the sponsor’s children or other minor relatives attend\nassisting at a local school where the sponsor’s children or other minor relatives attend\n\nHowever, you cannot undertake any unpaid work:\n\nHowever, you cannot undertake any unpaid work:\n- in a commercial environment\nin a commercial environment\n- in a family business\nin a family business\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your visa is still valid\n\nEnsure your visa is still valid\n\nCheck your conditions and the expiry of your current visa inVEVO\n\nCheck your conditions and the expiry of your current visa in\nVEVO\n\nSee what youcan and must do if your visa has expired or is about to expire.\n\nSee what you\ncan and must do if your visa has expired or is about to expire\n.\n\n### At the Border\n\nAt the Border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n\n### After you leave\n\nAfter you leave\n\n#### Proving you have been to Australia\n\nProving you have been to Australia\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870?tg=2&bk=aboutVisa-index-7#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#aboutVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:11:16.842990",
  "metadata": {}
}