{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/state-territory-sponsored-regional-established-business-in-australia-visa-subclass-846",
  "title": "State/Territory Sponsored Regional Established Business in Australia visa (subclass 846)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. State/Territory Sponsored Regional Established Business in Australia visa (subclass 846) Page Content ​​​ The State/Territory Sponsored Regional Established Business in Australia visa (subclass 846) closed to new applications on 1 July 2012. Information on other business visas is available through the SkillSelect website. If you have applied for this visa but no visa decision has yet been made, you can add your spouse, de facto partner or dependent children to your application until the visa is decided. You must be in Australia when the visa is decided. Visa applicants Details This information is for people who have already applied for an State/Territory Sponsored Regional Established Business in Australia visa (subclass 846), but are waiting for a decision. Adding members of your family unit to a visa application Details You can add members of the family unit to your visa application at any time until your visa is decided. For detailed information regarding who you can include in your application see including family members in your application To add dependent children, complete: Form 47BT Application for a Business Skills (provisional) visa (579KB PDF) Your family members can be added to your application by completing: Form 47BT Application for a Business Skills (provisional) visa (579KB PDF) .. These family members must meet the requirements for including family members in your application . The application must include documentary evidence of their relationship to you.​​ Your family members must be able to show that they meet health and character requirements.​ They might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English. Health requirements Details You must meet certain health requirements . However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to. Character requirements Details You must meet certain character requirements . You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age. Debts to the Australian Government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Where to lodge your application Details Lodge the completed forms and documents in person or by registered post, courier or fax to the Adelaide office in South Australia - attention Client Services, Adelaide Business Skills Processing Centre. Include the documents listed in the Document checklist with the application and pay the visa application charge by credit card, money order or bank cheque. After you have applied Details After you have lodged your application and documents, we will acknowledge that we have received your information. Wait for a decision Details If you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A , you can apply for Bridging visa B to travel outside Australia while you wait for a decision. Provide more information Details You can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 - Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to tell us if your situation changes You must contact your case officer to report any changes in circumstances that could affect the processing of your application. When you write to the department, you must include: your business name your ABN (for businesses in Australia) or other identifier (for businesses outside Australia) the number the department gives you when you lodge your application online. This is usually a Transaction Reference Number (TRN). Providing all this information helps the department quickly locate your application. Withdrawing your application Details You can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number. ​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​ Visa decision Details If the visa is granted, we will let you know: when you can use the visa the visa grant number any conditions attached to the visa.​ If the visa is not granted, we will let you know: why the visa was refused your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed the time limit for lodging an appeal. Document checklist Details You need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application. Provide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations. Use this checklist to make sure your application is complete. Forms Details Form 47BU Application for a Business Skills (permanent) visa (707KB PDF) For any member of your family unit included in the application who is 18 years of age or older and is not your partner: Form 47a Details of child or other dependent family member aged 18 years or over (307KB PDF) For each member of your family unit (child) included in the application who is 16 years of age or older: Form 80 - Personal particulars for assessment including character assessment (596KB PDF) Identity Details Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates). Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application. These photographs should be of the head and shoulders only against a plain background. Print the name of the person on the back of each photograph. If your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change. Family Details Certified copies of birth certificates or the family book showing the names of both parents of all your dependent children. If any dependent child included in the application is adopted: certified copies of the adoption papers. If you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as: If you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature. certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order Statutory Declaration giving their permission Form 1229 — Consent to grant an Australian visa to a child under the age of 18 years (276KB PDF) Evidence of financial dependency for all your members of the family unit aged 18 or older: a certified copy of their birth certificate and proof of their relationship to you proof that they live in your household proof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application. Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia. If you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets). If you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, or Statutory Declaration separation documents. Character requirements Details Police checks for everyone included in the visa application who is 16 years of age or older: an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age police certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age. Provide the original certificates and keep a copy for yourself. If anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers. Health requirements Details Documents to show you meet Australia’s health requirements: evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations. English language proficiency Details For each of your dependants aged 18 years or older at the time of invitation, provide one of the following: if they have functional English: the results of an IELTS test that they each took less than 12 months before you lodge your application if they have less-than-functional English a statement indicating your intention to pay the second visa application charge. Visa holders Details This information is for people who have already been granted a State/Territory Sponsored Regional Established Business in Australia visa (subclass 846). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This visa lets you work in your established business in Australia. This is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa: stay in Australia indefinitely work and study in Australia enrol in Medicare Australia's scheme for health-related care and expenses apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia). Your obligations Details You and your family must comply with all visa conditions and Australian laws. You must: intend to maintain an ownership interest in an eligible business in Australia keep the department informed of your current address for three years participate in monitoring surveys conducted by the department. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# State/Territory Sponsored Regional Established Business in Australia visa (subclass 846)\n\nState/Territory Sponsored Regional Established Business in Australia visa (subclass 846)\nPage Content\n\n​​​\n\n​​​\n\nThe State/Territory Sponsored Regional Established Business in Australia visa (subclass 846) closed to new applications on 1 July 2012. Information on other business visas is available through theSkillSelectwebsite.\n\nThe State/Territory Sponsored Regional Established Business in Australia visa (subclass 846) closed to new applications on 1 July 2012. Information on other business visas is available through the\nSkillSelect\nwebsite.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add your spouse, de facto partner or dependent children to your application until the visa is decided.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add your spouse, de facto partner or dependent children to your application until the visa is decided.\n\nYou must be in Australia when the visa is decided.\n\nYou must be in Australia when the visa is decided.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\nThis information is for people who have already applied for an State/Territory Sponsored Regional Established Business in Australia visa (subclass 846), but are waiting for a decision.\n\nThis information is for people who have already applied for an State/Territory Sponsored Regional Established Business in Australia visa (subclass 846), but are waiting for a decision.\n\n### Adding members of your family unit to a visa application\n\nAdding members of your family unit to a visa application\nDetails\n\nYou can add members of the family unit to your visa application at any time until your visa is decided.\n\nYou can add members of the family unit to your visa application at any time until your visa is decided.\n\nFor detailed information regarding who you can include in your application seeincluding family members in your application.\n\nFor detailed information regarding who you can include in your application see\nincluding family members in your application\n.\n\nTo add dependent children, complete:\n\nTo add dependent children, complete:\n- Form 47BT Application for a Business Skills (provisional) visa (579KB PDF).\nForm 47BT Application for a Business Skills (provisional) visa (579KB PDF)\n.\n\nYour family members can be added to your application by completing:\n\nYour family members can be added to your application by completing:\n- Form 47BT Application for a Business Skills (provisional) visa (579KB PDF)..\nForm 47BT Application for a Business Skills (provisional) visa (579KB PDF)\n..\n\nThese family members must meet the requirements forincluding family members in your application. The application must include documentary evidence of their relationship to you.​​\n\nThese family members must meet the requirements for\nincluding family members in your application\n. The application must include documentary evidence of their relationship to you.​​\n\nYour family members must be able to show that they meethealthandcharacterrequirements.​\n\nYour family members must be able to show that they meet\nhealth\nand\ncharacter\nrequirements.​\n\nThey might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English.\n\nThey might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English.\n\n#### Health requirements\n\nHealth requirements\nDetails\n\nYou must meet certainhealth requirements. However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to.\n\nYou must meet certain\nhealth requirements\n. However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to.\n\n#### Character requirements\n\nCharacter requirements\nDetails\n\nYou must meet certaincharacter requirements. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age.\n\nYou must meet certain\ncharacter requirements\n. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age.\n\n#### Debts to the Australian Government\n\nDebts to the Australian Government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n### Where to lodge your application\n\nWhere to lodge your application\nDetails\n\nLodge the completed forms and documents in person or by registered post, courier or fax to theAdelaide officein South Australia - attention Client Services, Adelaide Business Skills Processing Centre.\n\nLodge the completed forms and documents in person or by registered post, courier or fax to the\nAdelaide office\nin South Australia - attention Client Services, Adelaide Business Skills Processing Centre.\n\nInclude the documents listed in the Document checklist with the application and pay the visa application charge by credit card, money order or bank cheque.\n\nInclude the documents listed in the Document checklist with the application and pay the visa application charge by credit card, money order or bank cheque.\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\n#### Wait for a decision\n\nWait for a decision\nDetails\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given aBridging visa A, you can apply forBridging visa Bto travel outside Australia while you wait for a decision.\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a\nBridging visa A\n, you can apply for\nBridging visa B\nto travel outside Australia while you wait for a decision.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 - Notification of incorrect answer(s) (168KB PDF)\nForm 1023 - Notification of incorrect answer(s) (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\n\nYou must contact your case officer to report any changes in circumstances that could affect the processing of your application.\n\nYou must contact your case officer to report any changes in circumstances that could affect the processing of your application.\n\nWhen you write to the department, you must include:\n\nWhen you write to the department, you must include:\n- your business name\nyour business name\n- your ABN (for businesses in Australia) or other identifier (for businesses outside Australia)\nyour ABN (for businesses in Australia) or other identifier (for businesses outside Australia)\n- the number the department gives you when you lodge your application online. This is usually a Transaction Reference Number (TRN).\nthe number the department gives you when you lodge your application online. This is usually a Transaction Reference Number (TRN).\n\nProviding all this information helps the department quickly locate your application.\n\nProviding all this information helps the department quickly locate your application.\n\n#### Withdrawing your application\n\nWithdrawing your application\nDetails\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will let you know:\n\nIf the visa is granted, we will let you know:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.​\nany conditions attached to the visa.​\n\nIf the visa is not granted, we will let you know:\n\nIf the visa is not granted, we will let you know:\n- why the visa was refused\nwhy the visa was refused\n- your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\nyour review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\n- the time limit for lodging an appeal.\nthe time limit for lodging an appeal.\n\n### Document checklist\n\nDocument checklist\nDetails\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nUse this checklist to make sure your application is complete.\n\nUse this checklist to make sure your application is complete.\n\n#### Forms\n\nForms\nDetails\n- Form 47BU Application for a Business Skills (permanent) visa (707KB PDF).\nForm 47BU Application for a Business Skills (permanent) visa (707KB PDF)\n.\n- For any member of your family unit included in the application who is 18 years of age or older and is not your partner:Form 47a Details of child or other dependent family member aged 18 years or over (307KB PDF).\nFor any member of your family unit included in the application who is 18 years of age or older and is not your partner:\n- Form 47a Details of child or other dependent family member aged 18 years or over (307KB PDF).\nForm 47a Details of child or other dependent family member aged 18 years or over (307KB PDF)\n.\n- For each member of your family unit (child) included in the application who is 16 years of age or older:Form 80 - Personal particulars for assessment including character assessment (596KB PDF).\nFor each member of your family unit (child) included in the application who is 16 years of age or older:\n- Form 80 - Personal particulars for assessment including character assessment (596KB PDF).\nForm 80 - Personal particulars for assessment including character assessment (596KB PDF)\n.\n\n#### Identity\n\nIdentity\nDetails\n- Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\nCertified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\n- Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.These photographs should be of the head and shoulders only against a plain background.Print the name of the person on the back of each photograph.\nTwo recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.\n- These photographs should be of the head and shoulders only against a plain background.\nThese photographs should be of the head and shoulders only against a plain background.\n- Print the name of the person on the back of each photograph.\nPrint the name of the person on the back of each photograph.\n- If your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change.\nIf your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change.\n\n#### Family\n\nFamily\nDetails\n- Certified copies of birth certificates or the family book showing the names of both parents of all your dependent children.\nCertified copies of birth certificates or the family book showing the names of both parents of all your dependent children.\n- If any dependent child included in the application is adopted: certified copies of the adoption papers.\nIf any dependent child included in the application is adopted: certified copies of the adoption papers.\n- If you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as:If you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship orderStatutory Declarationgiving their permissionForm 1229 — Consent to grant an Australian visa to a child under the age of 18 years (276KB PDF).\nIf you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as:\n\nIf you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.\n\nIf you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.\n- certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order\ncertified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order\n- Statutory Declarationgiving their permission\nStatutory Declaration\ngiving their permission\n- Form 1229 — Consent to grant an Australian visa to a child under the age of 18 years (276KB PDF).\nForm 1229 — Consent to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n.\n- Evidence of financial dependency for all your members of the family unit aged 18 or older:a certified copy of their birth certificate and proof of their relationship to youproof that they live in your householdproof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\nEvidence of financial dependency for all your members of the family unit aged 18 or older:\n- a certified copy of their birth certificate and proof of their relationship to you\na certified copy of their birth certificate and proof of their relationship to you\n- proof that they live in your household\nproof that they live in your household\n- proof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\nproof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\n- Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nCertified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\n- If you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets).\nIf you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets).\n- If you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, orStatutory Declarationseparation documents.\nIf you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, or\nStatutory Declaration\nseparation documents.\n\n#### Character requirements\n\nCharacter requirements\nDetails\n- Police checks for everyone included in the visa application who is 16 years of age or older:an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of agepolice certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\nPolice checks for everyone included in the visa application who is 16 years of age or older:\n- an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age\nan Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age\n- police certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\npolice certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\n\nProvide the original certificates and keep a copy for yourself.\n\nProvide the original certificates and keep a copy for yourself.\n- If anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers.\nIf anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers.\n\n#### Health requirements\n\nHealth requirements\nDetails\n- Documents to show you meet Australia’s health requirements:evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\nDocuments to show you meet Australia’s health requirements:\n- evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\nevidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\n\n#### English language proficiency\n\nEnglish language proficiency\nDetails\n- For each of your dependants aged 18 years or older at the time of invitation, provide one of the following:if they have functional English: the results of an IELTS test that they each took less than 12 months before you lodge your applicationif they have less-than-functional English a statement indicating your intention to pay the second visa application charge.\nFor each of your dependants aged 18 years or older at the time of invitation, provide one of the following:\n- if they have functional English: the results of an IELTS test that they each took less than 12 months before you lodge your application\nif they have functional English: the results of an IELTS test that they each took less than 12 months before you lodge your application\n- if they have less-than-functional English a statement indicating your intention to pay the second visa application charge.\nif they have less-than-functional English a statement indicating your intention to pay the second visa application charge.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a State/Territory Sponsored Regional Established Business in Australia visa (subclass 846). It explains your rights and obligations.\n\nThis information is for people who have already been granted a State/Territory Sponsored Regional Established Business in Australia visa (subclass 846). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa lets you work in your established business in Australia.\n\nThis visa lets you work in your established business in Australia.\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicareAustralia's scheme for health-related care and expenses\nenrol in\nMedicare\nAustralia's scheme for health-related care and expenses\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\ntravel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou must:\n\nYou must:\n- intend to maintain an ownership interest in an eligible business in Australia\nintend to maintain an ownership interest in an eligible business in Australia\n- keep the department informed of your current address for three years\nkeep the department informed of your current address for three years\n- participate in monitoring surveys conducted by the department.\nparticipate in monitoring surveys conducted by the department.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/state-territory-sponsored-regional-established-business-in-australia-visa-subclass-846#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/state-territory-sponsored-regional-established-business-in-australia-visa-subclass-846#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:35:48.239071",
  "metadata": {}
}