{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151",
  "title": "Former Resident visa",
  "raw_text": "===== main placeholder ========================================== (Subclass 151) Former Resident visa This permanent visa allows former permanent residents and certain people who served in the Australian Defence Force to live in Australia. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay Permanently Cost From Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare See all conditions Check your eligibility You must meet our age and long residence requirement or defence service requirement apply on paper Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa With this visa you can How long you can stay Include family Cost Apply from Processing times Your obligations Travel Visa label With this visa you can stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for up to 5 years from date of grant as long as the travel facility remains valid apply for Australian citizenship , if eligible How long you can stay This permanent visa allows you to stay in Australia indefinitely. You become a permanent resident on the day you get the visa. For citizenship purposes, your permanent residency starts on the day: we grant the visa if you are in Australia you enter Australia on this visa if you are outside Australia when we granted it Include family You can include members of the family unit in your application when you apply. You can also add members of the family unit to your application at any time before we decide on your application. Family members who apply for the visa must meet our health and character requirements. If you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health and character requirements. Newborn child Find out what to do if your child is born after you apply Cost The visa costs for the main applicant. There is also a fee for each family member who applies for the visa with you. You might also have to pay other costs for health checks, police certificates and biometrics Use the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs Apply from You can be in or outside Australia when you apply for the visa but not in immigration clearance. If you apply in Australia, we can't grant you the visa if you are outside Australia when we make our decision. If you apply outside Australia, we can't grant you the visa if you are in Australia when we make our decision. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application might take longer to process if: you do not fill it in correctly you do not include all the documents we need, or we need more information from you it takes us time to verify your information We cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. Your obligations You and your family members must obey all Australian laws. Travel Travel to and from Australia for 5 years You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. If you want to travel after the initial 5-year travel validity expires: you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements for Australian citizenship Note: if you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia. the maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months. This period is set by law it can't be extended if you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel For more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use VEVO Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Be able to meet the long residence requirement, if applicable Details You must be able to show us that you meet all these criteria: if you are 18 years or older, spent at least 9 years in Australia as a Permanent resident before you turned 18 or if you are younger than 18, spent at least half of your life in Australia as a permanent resident younger than 45 years of age at the time you apply have never been an Australian citizen kept close business, cultural or personal ties with Australia (after you were no longer a permanent resident), including any regular contact with relatives or friends, frequent visits, owning property or having active business interests Be able to meet the defence services requirement, if applicable Details You must be able to show us that you meet one of these conditions: completed at least 3 months of continuous Australian defence service discharged from the Australian Defence Force before 3 months of service because you were medically unfit because of your Australian defence service Be this age Details To meet the long residence requirement, you must be younger than 45 at the time of application. There is no age requirement for the defence services requirement. Meet health requirement Details You and any family members who apply for the visa with you must meet our health requirement If you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirement. Meet character requirement Details You and any family members aged 16 years or over must meet our character requirement If you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our character requirement. Assurance of support Details You might be asked to provide an Assurance of support Have no debt to the Australian government Details If you or any family members owe the Australian Government money you must have paid it back or have a formal arrangement to pay it back Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia If applying for a visa from outside Australia, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply You might need to get health examinations. If you need help with your application, get someone to act on your behalf. Show steps Check your passport If you need a new passport, plan to get it before you apply for this visa. Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Gather documents to prove your identity and show you meet our requirements. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or don't provide true information Long residence documents Evidence of your ties with Australia and that you have kept these ties while you have been living overseas, such as: date of arrival in, and departure from, Australia (passport pages) school attendance (school reports or information from the Department of Education) business, cultural or personal ties (evidence of business or property ownership, social or professional memberships, personal correspondence) regular correspondence with relatives or friends in Australia frequent visits to Australia for business, cultural or personal reasons economic or business interests in Australia, with proof of an ongoing and active interest. See how Identity documents Provide the pages of your current passport showing your: photo personal details signature passport issue and expiry dates Also provide: a national identity card, if you have one proof of change of name, if applicable Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Character documents Do not arrange for police certificates until we ask you to. Learn more about police certificates If anyone included in the application has served in the armed forces of any country, provide certified copies of their military service record or discharge papers. See how Partner documents Provide: identity documents character documents documents about other relationships, if applicable Provide either: your current marriage certificate or enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply Documents that prove your de facto relationship include: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Dependants under 18 documents For every dependant under 18 years old who is applying with you, provide: identity documents proof of your relationship with them, like a birth or marriage certificate character documents, if applicable See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years a statutory declaration giving their consent for the child to visit Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include a document with the signature and photo of the person who completed the form or declaration, such as a: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable See how Dependants 18 or older documents For every dependant aged 18 years or older who is applying with you, provide: identity documents documents about their other relationships, if applicable character documents See how Proof of dependency You need to prove that this person is dependent on you. Provide: a completed Form Form 47a Details of a child or other dependent family member aged 18 years or over proof of your relationship with the dependent such as a birth certificate or adoption papers You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide: proof they live with you their tax records proof they are currently studying Usually, your child or stepchild must be under 23 years old to be included in your application. However, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation. Hide Defence service documents Evidence of service with the Australian Defence Forces before 1981 (if applicable). Identity documents Provide the pages of your current passport showing your: photo personal details signature passport issue and expiry dates Also provide: a national identity card, if you have one proof of change of name, if applicable Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person Send written notification or your forms with your paper application. See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify When you apply on paper you must provide certified copies of your documents. This includes: non-English documents English translations If you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan. See how Keep Keep a full copy of your completed application including all supporting documents. Keep a full copy of your completed application including all supporting documents. See how Send Send us: original police certificates certified copies of all other documents as much information as possible to help us decide on your application each document only once, even if you are using it to show more than one thing all documents with your application, if you can See how Step 3 Apply for the visa You must apply on paper. You can't lodge this application in person or online. You can be in or outside Australia when you apply. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply on paper You can be in or outside Australia when you apply for the visa, but not in immigration clearance. All applicants apply together on the one Form 47SV Application for special migration to Australia and lodge it with our Sydney office. Pay the application charge before you send your application. Pay online in ImmiAccount You can't lodge this application in person or online. We will not process your application until you pay the correct charge. We will let you know if you have paid an incorrect charge. Mail the form and supporting documents to: Subclass 151 Visa Application Department of Home Affairs GPO Box 9984 Sydney NSW 2001 AUSTRALIA If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After you apply We will let you know when we have received your application and documents. See what you can and must do after you apply. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa. See how Travel If you applied in Australia, tell us if you want to travel outside Australia while we process your application. We need to know because we can't grant you the visa if you are outside of Australia. If you leave Australia, make sure you have a valid visa to return. Learn about visa expiry If you applied outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. We can't grant you the visa if you are in Australia. See how Status updates If it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required. We do not acknowledge receipt of documents you send after you have submitted your application. See how Health Exams We will let you know when you need health examinations See how Biometrics We might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount. If you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter. We do not acknowledge receipt of documents you send after you have applied. See how Stay lawful If you are in Australia, make sure you stay lawful by holding a valid visa while we process your application. If you held a substantive visa when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. Do not cancel your current visa. If you do, you will: be in Australia unlawfully not be eligible for a Bridging visa A not be eligible for a Bridging visa B - which allows you to leave and re-enter Australian until this visa is finalised. Learn more about visa expiry See how Add family members You can add members of the family unit to your application before we decide on your visa. Complete Form 1436 Adding an additional applicant after lodgement , and send it to the email address we gave you when you sent your application include evidence of the child's relationship to you include other supporting documents for your child, such as identity documents pay the additional application charge. See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers. If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter. See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter. For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application. See how to tell us if your situation changes See how Step 5 Visa outcome If you apply in Australia, we can't grant the visa if you are outside Australia when we make our decision. If you apply outside Australia, we can't grant the visa if you are in Australia when we make our decision. We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of the decision with you when in Australia. If we refuse your visa, we will tell you: why we refused the visa if you have a right to a review of the decision We will not refund the application charge if we refuse your application. When you have this visa Coming to Australia In Australia Coming to Australia Before you leave Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the border Completing an Incoming Passenger Card All people arriving Australia must complete the Incoming Passenger Card Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you can do when you have this visa stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia while your visa is valid if eligible, become an Australian citizen To see your specific conditions and work entitlements use Visa Entitlement Verification Online (VEVO) What you must do on this visa (your obligations) You must obey all Australian laws. Travel to and from Australia for 5 years You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. If you want to travel after the initial 5-year travel validity expires: you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements for Australian citizenship Note: if you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia. the maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months. This period is set by law it can't be extended if you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel For more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use VEVO New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them: you have a Former Resident visa (subclass 151) you do not want a Special Category visa (subclass 444) If you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Resident Return visa and Australian citizenship. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Request your international movement records to get proof of your travel in and out of Australia. Working To see your conditions for work, use VEVO You have rights under Australian workplace law The Fair Work Ombudsman's Pay and Conditions Tool (PACT) has information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements. Bringing a family member As an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia. To find a visa for your family member, explore visa options. Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen. For citizenship purposes, your permanent residency starts on the day: we grant the visa, if you were in Australia, or you entered Australia on this visa, if you were outside Australia when we granted it. Tell us if things change Your visa is linked to your passport. You need to tell us if you get a new passport. See how to tell us if your situation changes.",
  "main_content": "===== main placeholder ==========================================\n(Subclass 151)\n\n# Former Resident visa\n\nFormer Resident visa\n\nThis permanent visa allows former permanent residents and certain people who served in the Australian Defence Force to live in Australia.\n\nThis permanent visa allows former permanent residents and certain people who served in the Australian Defence Force to live in Australia.\n\nThis permanent visa allows former permanent residents and certain people who served in the Australian Defence Force to live in Australia.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFrom\n\nFrom\n\nFrom\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- meet our age and long residence requirement or defence service requirement\nmeet our age and long residence requirement or defence service requirement\n- apply on paper\napply on paper\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\nWith this visa you can\nHow long you can stay\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nTravel\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for up to 5 years from date of grant as long as the travel facility remains valid\ntravel to and from Australia for up to 5 years from date of grant as long as the travel facility remains valid\n- apply forAustralian citizenship, if eligible\napply for\nAustralian citizenship\n, if eligible\n\n## How long you can stay\n\nHow long you can stay\n\nThis permanent visa allows you to stay in Australia indefinitely.\n\nThis permanent visa allows you to stay in Australia indefinitely.\n\nYou become a permanent resident on the day you get the visa.\n\nYou become a permanent resident on the day you get the visa.\n\nFor citizenship purposes, your permanent residency starts on the day:\n\nFor citizenship purposes, your permanent residency starts on the day:\n- we grant the visa if you are in Australia\nwe grant the visa if you are in Australia\n- you enter Australia on this visa if you are outside Australia when we granted it\nyou enter Australia on this visa if you are outside Australia when we granted it\n\n## Include family\n\nInclude family\n\nYou can includemembers of the family unitin your application when you apply. You can also addmembers of the family unitto your application at any time before we decide on your application.\n\nYou can include\nmembers of the family unit\nin your application when you apply. You can also add\nmembers of the family unit\nto your application at any time before we decide on your application.\n\nFamily members who apply for the visa must meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa must meet our\nhealth\nand\ncharacter\nrequirements.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health and character requirements.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health and character requirements.\n\n### Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n## Cost\n\nCost\n\nThe visa costsfor the main applicant.\n\nThe visa costs\nfor the main applicant.\n\nThere is also a fee for each family member who applies for the visa with you.\n\nThere is also a fee for each family member who applies for the visa with you.\n\nYou might also have to pay other costs for health checks, police certificates andbiometrics.\n\nYou might also have to pay other costs for health checks, police certificates and\nbiometrics\n.\n\nUse theVisa Pricing Estimatorto work out what your visa will cost. The estimator does not take into account the other costs\n\nUse the\nVisa Pricing Estimator\nto work out what your visa will cost. The estimator does not take into account the other costs\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\n\nIf you apply in Australia, we can't grant you the visa if you are outside Australia when we make our decision.\n\nIf you apply in Australia, we can't grant you the visa if you are outside Australia when we make our decision.\n\nIf you apply outside Australia, we can't grant you the visa if you are in Australia when we make our decision.\n\nIf you apply outside Australia, we can't grant you the visa if you are in Australia when we make our decision.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application might take longer to process if:\n\nYour application might take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need, or we need more information from you\nyou do not include all the documents we need, or we need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n## Travel\n\nTravel\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\n\nIf you want to travel after the initial 5-year travel validity expires:\n\nIf you want to travel after the initial 5-year travel validity expires:\n- you will need to apply for and be granted aResident Return (RRV)so that you can re-enter Australia as a permanent resident\nyou will need to apply for and be granted a\nResident Return (RRV)\nso that you can re-enter Australia as a permanent resident\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more abouteligibility requirements for Australian citizenship.\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about\neligibility requirements for Australian citizenship\n.\n\nNote:\n\nNote:\n- if you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia.\nif you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia.\n- the maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months.  This period is set by law it can't be extended\nthe maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months.  This period is set by law it can't be extended\n- if you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel\nif you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel\n\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, useVEVO.\n\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use\nVEVO\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Be able to meet the long residence requirement, if applicable\n\nBe able to meet the long residence requirement, if applicable\nDetails\n\nYou must be able to show us that you meet all these criteria:\n\nYou must be able to show us that you meet all these criteria:\n- if you are 18 years or older, spent at least 9 years in Australia as aPermanent residentbefore you turned 18 or if you are younger than 18, spent at least half of your life in Australia as a permanent resident\nif you are 18 years or older, spent at least 9 years in Australia as a\nPermanent resident\nbefore you turned 18 or if you are younger than 18, spent at least half of your life in Australia as a permanent resident\n- younger than 45 years of age at the time you apply\nyounger than 45 years of age at the time you apply\n- have never been an Australian citizen\nhave never been an Australian citizen\n- kept close business, cultural or personal ties with Australia (after you were no longer a permanent resident), including any regular contact with relatives or friends, frequent visits, owning property or having active business interests\nkept close business, cultural or personal ties with Australia (after you were no longer a permanent resident), including any regular contact with relatives or friends, frequent visits, owning property or having active business interests\n\n## Be able to meet the defence services requirement, if applicable\n\nBe able to meet the defence services requirement, if applicable\nDetails\n\nYou must be able to show us that you meet one of these conditions:\n\nYou must be able to show us that you meet one of these conditions:\n- completed at least 3 months of continuous Australian defence service\ncompleted at least 3 months of continuous Australian defence service\n- discharged from the Australian Defence Force before 3 months of service because you were medically unfit because of your Australian defence service\ndischarged from the Australian Defence Force before 3 months of service because you were medically unfit because of your Australian defence service\n\n## Be this age\n\nBe this age\nDetails\n\nTo meet the long residence requirement, you must be younger than 45 at the time of application.\n\nTo meet the long residence requirement, you must be younger than 45 at the time of application.\n\nThere is no age requirement for the defence services requirement.\n\nThere is no age requirement for the defence services requirement.\n\n## Meet health requirement\n\nMeet health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirement.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirement.\n\n## Meet character requirement\n\nMeet character requirement\nDetails\n\nYou and any family members aged 16 years or over must meet ourcharacter requirement.\n\nYou and any family members aged 16 years or over must meet our\ncharacter requirement\n.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our character requirement.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our character requirement.\n\n## Assurance of support\n\nAssurance of support\nDetails\n\nYou might be asked to provide anAssurance of support\n\nYou might be asked to provide an\nAssurance of support\n\n## Have no debt to the Australian government\n\nHave no debt to the Australian government\nDetails\n\nIf you or any family members owe the Australian Government money you must have paid it back or have a formal arrangement to pay it back\n\nIf you or any family members owe the Australian Government money you must have paid it back or have a formal arrangement to pay it back\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeLimitations on applications in Australia.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nLimitations on applications in Australia\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nYou might need to get health examinations. If you need help with your application, get someone to act on your behalf.\n\nYou might need to get health examinations. If you need help with your application, get someone to act on your behalf.\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nGather documents to prove your identity and show you meet our requirements.\n\nGather documents to prove your identity and show you meet our requirements.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if you can't prove your identity or don't providetrue information.\n\nProvide accurate information. See what happens if you can't prove your identity or don't provide\ntrue information\n.\n\n#### Long residence documents\n\nLong residence documents\n\nEvidence of your ties with Australia and that you have kept these ties while you have been living overseas, such as:\n\nEvidence of your ties with Australia and that you have kept these ties while you have been living overseas, such as:\n- date of arrival in, and departure from, Australia (passport pages)\ndate of arrival in, and departure from, Australia (passport pages)\n- school attendance (school reports or information from the Department of Education)\nschool attendance (school reports or information from the Department of Education)\n- business, cultural or personal ties (evidence of business or property ownership, social or professional memberships, personal correspondence)\nbusiness, cultural or personal ties (evidence of business or property ownership, social or professional memberships, personal correspondence)\n- regular correspondence with relatives or friends in Australia\nregular correspondence with relatives or friends in Australia\n- frequent visits to Australia for business, cultural or personal reasons\nfrequent visits to Australia for business, cultural or personal reasons\n- economic or business interests in Australia, with proof of an ongoing and active interest.\neconomic or business interests in Australia, with proof of an ongoing and active interest.\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your:\n\nProvide the pages of your current passport showing your:\n- photo\nphoto\n- personal details\npersonal details\n- signature\nsignature\n- passport issue and expiry dates\npassport issue and expiry dates\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if applicable\nproof of change of name, if applicable\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Character documents\n\nCharacter documents\n\nDo not arrange for police certificates until we ask you to. Learn more aboutpolice certificates.\n\nDo not arrange for police certificates until we ask you to. Learn more about\npolice certificates\n.\n\nIf anyone included in the application has served in the armed forces of any country, provide certified copies of their military service record or discharge papers.\n\nIf anyone included in the application has served in the armed forces of any country, provide certified copies of their military service record or discharge papers.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nProvide either:\n\nProvide either:\n- your current marriage certificate or\nyour current marriage certificate or\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nDocuments that prove your de facto relationship include:\n\nDocuments that prove your de facto relationship include:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with you, provide:\n\nFor every dependant under 18 years old who is applying with you, provide:\n- identity documents\nidentity documents\n- proof of your relationship with them, like a birth or marriage certificate\nproof of your relationship with them, like a birth or marriage certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years\n- a statutory declaration giving their consent for the child to visit Australia on this visa\na statutory declaration giving their consent for the child to visit Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\nSee how\n\n#### Dependants 18 or older documents\n\nDependants 18 or older documents\n\nFor every dependant aged 18 years or older who is applying with you, provide:\n\nFor every dependant aged 18 years or older who is applying with you, provide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\nSee how\n\n#### Proof of dependency\n\nProof of dependency\n\nYou need to prove that this person is dependent on you. Provide:\n\nYou need to prove that this person is dependent on you. Provide:\n- a completed FormForm 47a Details of a child or other dependent family member aged 18 years or over\na completed Form\nForm 47a Details of a child or other dependent family member aged 18 years or over\n- proof of your relationship with the dependent such as a birth certificate or adoption papers\nproof of your relationship with the dependent such as a birth certificate or adoption papers\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are currently studying\nproof they are currently studying\n\nUsually, your child or stepchild must be under 23 years old to be included in your application.However, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\n\nUsually, your child or stepchild must be under 23 years old to be included in your application.\nHowever, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\n\nHide\n\nHide\n\n#### Defence service documents\n\nDefence service documents\n\nEvidence of service with the Australian Defence Forces before 1981 (if applicable).\n\nEvidence of service with the Australian Defence Forces before 1981 (if applicable).\n\nIdentity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your:\n\nProvide the pages of your current passport showing your:\n- photo\nphoto\n- personal details\npersonal details\n- signature\nsignature\n- passport issue and expiry dates\npassport issue and expiry dates\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if applicable\nproof of change of name, if applicable\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nWhen you apply on paper you must providecertified copiesof your documents.\n\nWhen you apply on paper you must provide\ncertified copies\nof your documents.\n\nThis includes:\n\nThis includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\n\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\n\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a full copy of your completed application including all supporting documents. Keep a full copy of your completed application including all supporting documents.\n\nKeep a full copy of your completed application including all supporting documents. Keep a full copy of your completed application including all supporting documents.\nSee how\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much information as possible to help us decide on your application\nas much information as possible to help us decide on your application\n- each document only once, even if you are using it to show more than one thing\neach document only once, even if you are using it to show more than one thing\n- all documents with your application, if you can\nall documents with your application, if you can\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply on paper. You can't lodge this application in person or online. You can be in or outside Australia when you apply.\n\nYou must apply on paper. You can't lodge this application in person or online. You can be in or outside Australia when you apply.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens if you can't prove your identity ordon't provide true information.\n\nProvide accurate information. See what happens if you can't prove your identity or\ndon't provide true information\n.\n\n#### Apply on paper\n\nApply on paper\n\nYou can be in or outside Australia when you apply for the visa, but not in immigration clearance.\n\nYou can be in or outside Australia when you apply for the visa, but not in immigration clearance.\n\nAll applicants apply together on the oneForm 47SV Application for special migration to Australiaand lodge it with our Sydney office.\n\nAll applicants apply together on the one\nForm 47SV Application for special migration to Australia\nand lodge it with our Sydney office.\n\nPay the application charge before you send your application. Pay online inImmiAccount.\n\nPay the application charge before you send your application. Pay online in\nImmiAccount\n.\n\nYou can't lodge this application in person or online.\n\nYou can't lodge this application in person or online.\n\nWe will not process your application until you pay the correct charge. We will let you know if you have paid an incorrect charge.\n\nWe will not process your application until you pay the correct charge. We will let you know if you have paid an incorrect charge.\n\nMail the form and supporting documents to:\n\nMail the form and supporting documents to:\n\nSubclass 151 Visa ApplicationDepartment of Home AffairsGPO Box 9984Sydney NSW 2001AUSTRALIA\n\nSubclass 151 Visa Application\nDepartment of Home Affairs\nGPO Box 9984\nSydney NSW 2001\nAUSTRALIA\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents.\n\nWe will let you know when we have received your application and documents.\n\nSee what you can and must do after you apply.\n\nSee what you can and must do after you apply.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa.\n\nYou can import any new and existing applications for this visa.\nSee how\n\n#### Travel\n\nTravel\n\nIf you applied in Australia, tell us if you want to travel outside Australia while we process your application. We need to know because we can't grant you the visa if you are outside of Australia.\n\nIf you applied in Australia, tell us if you want to travel outside Australia while we process your application. We need to know because we can't grant you the visa if you are outside of Australia.\n\nIf you leave Australia, make sure you have a valid visa to return.\n\nIf you leave Australia, make sure you have a valid visa to return.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\n\nIf you applied outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. We can't grant you the visa if you are in Australia.\n\nIf you applied outside Australia, do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. We can't grant you the visa if you are in Australia.\nSee how\n\n#### Status updates\n\nStatus updates\n\nIf it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required.\n\nIf it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required.\n\nWe do not acknowledge receipt of documents you send after you have submitted your application.\n\nWe do not acknowledge receipt of documents you send after you have submitted your application.\nSee how\n\n#### Health Exams\n\nHealth Exams\n\nWe will let you know when you needhealth examinations.\n\nWe will let you know when you need\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics(fingerprints and photo). We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n(fingerprints and photo). We will let you know if you need to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount.\n\nIf you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter.\n\nWe do not acknowledge receipt of documents you send after you have applied.\n\nWe do not acknowledge receipt of documents you send after you have applied.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you held a substantive visa when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application.\n\nIf you held a substantive visa when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application.\n\nDo not cancel your current visa. If you do, you will:\n\nDo not cancel your current visa. If you do, you will:\n- be in Australia unlawfully\nbe in Australia unlawfully\n- not be eligible for a Bridging visa A\nnot be eligible for a Bridging visa A\n- not be eligible for a Bridging visa B - which allows you to leave and re-enter Australian until this visa is finalised.\nnot be eligible for a Bridging visa B - which allows you to leave and re-enter Australian until this visa is finalised.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can addmembers of the family unitto your application before we decide on your visa.\n\nYou can add\nmembers of the family unit\nto your application before we decide on your visa.\n\nCompleteForm 1436 Adding an additional applicant after lodgement, and\n\nComplete\nForm 1436 Adding an additional applicant after lodgement\n, and\n- send it to the email address we gave you when you sent your application\nsend it to the email address we gave you when you sent your application\n- include evidence of the child's relationship to you\ninclude evidence of the child's relationship to you\n- include other supporting documents for your child, such as identity documents\ninclude other supporting documents for your child, such as identity documents\n- pay the additional application charge.\npay the additional application charge.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to doif your child is born after you apply.\n\nFind out what to do\nif your child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers.\n\nComplete\nForm 1023 Notification of incorrect answers.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nSee how to tell usif your situation changes.\n\nSee how to tell us\nif your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nIf you apply in Australia, we can't grant the visa if you are outside Australia when we make our decision.\n\nIf you apply in Australia, we can't grant the visa if you are outside Australia when we make our decision.\n\nIf you apply outside Australia, we can't grant the visa if you are in Australia when we make our decision.\n\nIf you apply outside Australia, we can't grant the visa if you are in Australia when we make our decision.\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of the decision with you when in Australia.\n\nKeep a copy of the decision with you when in Australia.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- if you have a right to a review of the decision\nif you have a right to a review of the decision\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\nComing to Australia\nIn Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the border\n\nAt the border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving Australia must complete theIncoming Passenger Card.\n\nAll people arriving Australia must complete the\nIncoming Passenger Card\n.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia while your visa is valid\ntravel to and from Australia while your visa is valid\n- if eligible, become anAustralian citizen\nif eligible, become an\nAustralian citizen\n\nTo see your specific conditions and work entitlements useVisa Entitlement Verification Online (VEVO).\n\nTo see your specific conditions and work entitlements use\nVisa Entitlement Verification Online (VEVO)\n.\n\n### What you must do on this visa (your obligations)\n\nWhat you must do on this visa (your obligations)\n\nYou must obey all Australian laws.\n\nYou must obey all Australian laws.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa.\n\nIf you want to travel after the initial 5-year travel validity expires:\n\nIf you want to travel after the initial 5-year travel validity expires:\n- you will need to apply for and be granted aResident Return (RRV)so that you can re-enter Australia as a permanent resident\nyou will need to apply for and be granted a\nResident Return (RRV)\nso that you can re-enter Australia as a permanent resident\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more abouteligibility requirements for Australian citizenship.\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about\neligibility requirements for Australian citizenship\n.\n\nNote:\n\nNote:\n- if you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia.\nif you leave Australia after your travel validity expires or your travel validity expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. If you then wish to return to Australia as a permanent resident, you must apply for and be granted an RRV before your arrival in Australia.\n- the maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months.  This period is set by law it can't be extended\nthe maximum travel period that can be granted to someone who does not meet the RRV residence requirement is 12 months.  This period is set by law it can't be extended\n- if you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel\nif you are already in Australia as a permanent resident, you do not need to apply for an RRV if you do not wish to travel\n\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, useVEVO.\n\nFor more information on RRV, see: Resident Return visa (RRV). To see when your travel period ends, use\nVEVO\n.\n\n#### New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n- you have a Former Resident visa (subclass 151)\nyou have a Former Resident visa (subclass 151)\n- you do not want a Special Category visa (subclass 444)\nyou do not want a Special Category visa (subclass 444)\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Resident Return visa and Australian citizenship.\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Resident Return visa and Australian citizenship.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.\n\n### Working\n\nWorking\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\nYou have rights underAustralian workplace law.\n\nYou have rights under\nAustralian workplace law\n.\n\nTheFair Work Ombudsman's Pay and Conditions Tool(PACT) has information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\n\nThe\nFair Work Ombudsman's Pay and Conditions Tool\n(PACT) has information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\n\n### Bringing a family member\n\nBringing a family member\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen.\n\nFor citizenship purposes, your permanent residency starts on the day:\n\nFor citizenship purposes, your permanent residency starts on the day:\n- we grant the visa, if you were in Australia, or\nwe grant the visa, if you were in Australia, or\n- you entered Australia on this visa, if you were outside Australia when we granted it.\nyou entered Australia on this visa, if you were outside Australia when we granted it.\n\n### Tell us if things change\n\nTell us if things change\n\nYour visa is linked to your passport. You need to tell us if you get a new passport.\n\nYour visa is linked to your passport. You need to tell us if you get a new passport.\n\nSee how to tell usif your situation changes.\n\nSee how to tell us\nif your situation changes.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/former-resident-151#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:20:13.343519",
  "metadata": {}
}