{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/labour-agreement-visa-subclass-855",
  "title": "Labour Agreement visa (subclass 855)",
  "raw_text": "===== main placeholder ========================================== Labour Agreement visa (subclass 855) Page Content The Labour Agreement visa (subclass 855) closed to new applications on 1 July 2012. You cannot get this visa. You might be able to apply for the Employer Nomination Scheme (subclass 186) Visa holders Details This information is for people who have been granted a Labour Agreement visa (subclass 855). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa: stay in Australia indefinitely work and study in Australia enrol in Medicare Australia's scheme for health-related care and expenses apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia). Your obligations Details You do not have to work for the employer who nominated you, but you must comply with any obligations under your employment contracts or industrial laws that require you to give your employer an appropriate period of notice before you stop working for that employer. Your employer’s obligations Details Your employer must: provide a full-time position meet any additional requirements of the Labour Agreement comply with all relevant Australian standards and workplace legislation for wages and working conditions.",
  "main_content": "===== main placeholder ==========================================\n\n# Labour Agreement visa (subclass 855)\n\nLabour Agreement visa (subclass 855)\nPage Content\n\nThe Labour Agreement visa (subclass 855) closed to new applications on 1 July 2012. You cannot get this visa. You might be able to apply for theEmployer Nomination Scheme (subclass 186).\n\nThe Labour Agreement visa (subclass 855) closed to new applications on 1 July 2012. You cannot get this visa. You might be able to apply for the\nEmployer Nomination Scheme (subclass 186)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have been granted a Labour Agreement visa (subclass 855). It explains your rights and obligations.\n\nThis information is for people who have been granted a Labour Agreement visa (subclass 855). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicareAustralia's scheme for health-related care and expenses\nenrol in\nMedicare\nAustralia's scheme for health-related care and expenses\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\ntravel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou do not have to work for the employer who nominated you, but youmust comply with any obligations under your employment contracts or industrial laws that require you to give your employer an appropriate period of notice before you stop working for that employer.\n\nYou do not have to work for the employer who nominated you, but you\nmust comply with any obligations under your employment contracts or industrial laws that require you to give your employer an appropriate period of notice before you stop working for that employer.\n\n### Your employer’s obligations\n\nYour employer’s obligations\nDetails\n\nYour employer must:\n\nYour employer must:\n- provide a full-time position\nprovide a full-time position\n- meet any additional requirements of the Labour Agreement\nmeet any additional requirements of the Labour Agreement\n- comply with all relevant Australian standards and workplace legislation for wages and working conditions.\ncomply with all relevant Australian standards and workplace legislation for wages and working conditions.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/labour-agreement-visa-subclass-855#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/labour-agreement-visa-subclass-855#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:30:00.137322",
  "metadata": {}
}