{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-subclass-175",
  "title": "Skilled — Independent (subclass 175)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Skilled — Independent (subclass 175) Page Content ​​The Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the Cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made. About this visa Details Features This visa uses a points test and allows you to migrate to Australia if you have competent English language and other skills and attributes which will contribute the most to the Australian economy. The Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made. There is a visa finder function which outlines the requirements of all current skilled migration visas. This function will assist you to identify visa subclass(es) which suit your personal circumstances. Visa Holders Details This information is for people who have been granted a Skilled-Independent visa (subclass 175). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements What this visa lets you do Details This is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa: stay in Australia indefinitely work and study in Australia enrol in Medicare Australia's scheme for health-related care and expenses apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia). Your obligations You and your family must comply with all visa conditions and Australian laws. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Skilled — Independent (subclass 175)\n\nSkilled — Independent (subclass 175)\nPage Content\n\n​​The Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to theCap and ceasearrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\n\n​​The Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the\nCap and cease\narrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\n\n## About this visa\n\nAbout this visa\nDetails\n\n### Features\n\nFeatures\n\nThis visa uses a points test and allows you to migrate to Australia if you have competent English language and other skills and attributes which will contribute the most to the Australian economy.\n\nThis visa uses a points test and allows you to migrate to Australia if you have competent English language and other skills and attributes which will contribute the most to the Australian economy.\n\nThe Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\n\nThe Skilled-Independent visa (subclass 175) closed to new applications on 1 July 2012. This visa is subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made.\n\nThere is a visafinder functionwhich outlines the requirements of all current skilled migration visas. This function will assist you to identify visa subclass(es) which suit your personal circumstances.\n\nThere is a visa\nfinder function\nwhich outlines the requirements of all current skilled migration visas. This function will assist you to identify visa subclass(es) which suit your personal circumstances.\n\n## Visa Holders\n\nVisa Holders\nDetails\n\nThis information is for people who have been granted a Skilled-Independent visa (subclass 175). It explains your rights and obligations.\n\nThis information is for people who have been granted a Skilled-Independent visa (subclass 175). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicareAustralia's scheme for health-related care and expenses\nenrol in\nMedicare\nAustralia's scheme for health-related care and expenses\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\ntravel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\n\n### Your obligations\n\nYour obligations\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-subclass-175#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-subclass-175#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:33:01.425546",
  "metadata": {}
}