{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300",
  "title": "Prospective Marriage visa",
  "raw_text": "===== main placeholder ========================================== Subclass 300 Prospective Marriage visa This visa lets you come to Australia to marry your prospective spouse and then apply for a Partner visa. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay 9 to 15 months from date of grant of visa. Cost From AUD9,365.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. The Department continues to prioritise aged, and compassionate and compelling applications. This is reflected in current processing times. With this visa you can stay in Australia for 9 to 15 months from your visa grant date work and study in Australia. See all conditions Check your eligibility You must be 18 years old or older have a sponsor who is an Australian citizen, permanent resident or eligible New Zealand citizen intend to marry your prospective spouse before the visa period ends have met your prospective spouse face to face as adults since turning 18, and are known to each other personally at the time you apply for this visa be outside of Australia when you apply for this visa, along with any family that apply with you be in or outside Australia when we decide your temporary visa. Help with your visa If you are getting help with your visa, make sure you read information on Who can help with your visa application Apply About this visa With this visa you can Settle in Australia How long you can stay Include family members Cost Apply for this visa Your obligations Adequate health insurance Travel Visa label Frequently Asked Questions With this visa you can live, work and study in Australia for 9 to 15 months from the visa grant date travel to and from Australia as many times as you want while the visa is valid. Settle in Australia If you and your spouse want to settle in Australia, apply for a Partner visa (subclass 820 and 801) after you are married before your Prospective Marriage visa ends. How long you can stay This is a temporary visa. You can stay in Australia for the period specified on the visa grant letter. This is 9 to 15 months from the visa grant date. Include family members You can include members of the family unit in your application. when you lodge your visa application, or add a dependent child after you lodge your application but before we decide on your temporary visa. Family members who apply with you must: be members of the family unit meet our health requirement meet our character requirement be outside Australia. Family members who are not coming to Australia might also have to meet our health and character requirement. Newborn children For information on what to do if your child is born after you apply, see You had a baby Cost The visa costs AUD9,365.00 for the main applicant. There is also a fee for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You might also have to pay other costs for health checks, police certificates and biometrics To work out how much your visa will cost, including adding additional family members, use the Visa pricing estimator . The estimator does not take into account the costs for health checks, police certificates or biometrics. You will also have to pay a fee for your Partner visa (subclasses 820 and 801) . You pay less for this visa if you marry your prospective spouse and apply for the Partner visa before your Prospective Marriage visa ends. Apply for this visa You must be outside of Australia when you apply for this visa. Family who apply with you must also be outside Australia. Your obligations You and your family members must meet all visa conditions and obey Australian laws. See what conditions might be attached to this visa on our visa conditions page Your marriage You must enter Australia on the Prospective Marriage visa before the date specified on your grant letter. You must have married your prospective spouse before your Prospective Marriage visa expires. You can get married in any country but your marriage must be valid under Australian law. Forced marriage Forced marriage is when a person (or both people) gets married without freely and fully consenting. They may be tricked, threatened or pressured into getting married, or they are incapable of understanding the nature and effect of a marriage ceremony, for reasons including age or mental capacity. Forced marriage is a crime in Australia. If you or someone you know is in, or at risk of, a forced marriage you can seek help. For more information, see Forced marriage | Attorney-General's Department Adequate health insurance We recommend you take out health insurance to cover any unforeseen medical treatment you might need while in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. See what we consider adequate health insurance Learn more about health insurance for overseas visitors. Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal health care agreements. Travel You can travel to and from Australia as many times as you want while you hold this visa. First entry arrival date If you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Frequently Asked Questions You can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs) Eligibility Not had a visa cancelled or an application refused We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Be outside Australia when you apply You must be outside Australia when you apply for this visa. Family who apply with you must also be outside Australia. Have a sponsor You and anyone who applies for the visa with you must have a sponsor when you lodge your application and while you are on this visa. Your sponsor is your prospective spouse. You and your prospective spouse must have met in person as adults since turning 18, and are known to each other personally at the time you apply for this visa. We must approve your sponsor. Your sponsor should apply to sponsor you as soon as possible after you apply for this visa. Select the ‘For Sponsors’ switch at the top of this page for information about sponsorship. Be the right age You and your sponsor must be 18 years old or older when you apply for this visa. Meet relationship requirements In most cases, your prospective spouse must be an: Australian citizen Australian permanent resident eligible New Zealand citizen Your relationship can be with someone of the same or different sex. Meet our health requirement You and any family members who apply for the visa with you must meet our health requirement . We might ask for health information about family not coming to Australia with you. Meet our character requirement You and any family members aged 16 years and over who apply for the visa with you must meet our character requirements . We might ask for character information about family not coming to Australia with you. Have no debt to the Australian Government If you or any family members owe the Australian government money, it must have been paid back or arranged to be paid back. This may include family members who do not accompany you to Australia. Sign the Australian values statement You and any family members who apply with you who are 18 years of age or older must: have read, or had explained, the Life in Australia booklet sign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws. Best interests of the child We might not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply There are things you need to know and might need to do before you apply. Show steps Get help with your application You can appoint anyone to receive correspondence relating to your visa application. To appoint someone to receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) If you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can: discuss your application with us give us information send and receive correspondence about your application. We treat any correspondence they send as if it came from you. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner an exempt person To appoint someone to provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (225KB PDF) For more information, see who can help you with your application Step 2 Gather and prepare your documents You should provide all required information with your application, or as soon as possible after lodging your application. Applications with all required information reduce processing delays. You have the option to obtain your police certificates before you apply. However for immigration purposes, police certificates are valid for 12 months from the issue date. If more than 15 months has passed since your National Police certificate (NPC) was issued by the Australian Federal Police (AFP), new checks will be required to progress your application. Ensure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application. For more information, see Providing accurate information Your sponsor should apply to sponsor you as soon as possible after you apply for this visa. Select the 'For Sponsors' switch at the top of this page for information about sponsorship. Show steps Identity documents Provide a birth certificate showing the names of both parents. If you cannot provide this, provide one of the following: Identification pages of a family book showing the names of both parents. Identification pages of an identification document issued by the government. Identification pages of a court-issued document that proves your identity. Identification pages of a family census register. Also provide: the pages of your current passport showing your photo, personal details and issue and expiry dates a national identity card, if you have one proof of change of name, if applicable, such as: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. See how Evidence of relationships You need to attach to your application, evidence of: your relationship with your prospective spouse any former relationships any dependants you have. See how Your relationship with your prospective spouse You must provide statements from 2 witnesses who: are 18 years or older know you and your prospective spouse know about your relationship. Statements from witnesses can be done by completing Form 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (1027KB PDF) If the witness is an Australian citizen or permanent resident, provide evidence of this, such as a passport or birth certificate. Also provide other evidence of your relationship such as: evidence that you and your prospective spouse have met face-to-face as adults since turning 18 and know each other personally evidence (such as a letter from the person who will officiate at the wedding) that you will marry your prospective spouse within 9 months of being granted the visa evidence that you and your prospective spouse genuinely intend to live as spouses written statements showing the history of your relationship, such as: how, when and where you first met how your relationship developed when you got engaged what you do together significant events in the relationship your future plans as spouses. See how Former relationships If you have previously been married, widowed, divorced or permanently separated, provide divorce documents, death certificates, separation documents or statutory declarations. See how Dependants under 18 For each of the members of the family unit under 18 years old applying with you, provide: identity documents evidence of your relationship with your dependant, like a birth or marriage certificate health examinations character documents , if the dependant is 16 or 17 years of age adoption papers or parental court orders, if applicable evidence of enrolment at school, college or university, if applicable evidence of sole custody, if applicable. Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child. They must complete Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) Include: an identity document that shows the signature and photo of the person who completed the form, such as a passport or driver’s licence adoption papers or other court documents, if applicable. Alternatively, you can show us one of the following: An Australian court order that allows your child to migrate to Australia That the laws of the child's home country allow them to leave their home country permanently. See how Dependants over 18 To include members of the family unit who are over 18 in your visa application, they must be: between the ages of 18 and 23, and dependent on you or your partner over 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner. Provide: identity documents documents about their other relationships, if applicable health examinations character documents You must also provide evidence the child is dependent on you. This includes the following: Evidence of your relationship with the dependent such as a birth certificate or adoption papers. Evidence of financial dependence such as bank statements, money transfers and rent receipts. A completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) If the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner. This report should state that they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions. See how Prepare your documents Translate Have all documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating. These details must be in English. Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear enough to read. If a document is more than one page, save it all as one file. You do not need to have any documents certified. See how Step 3 Apply for the visa You must apply: online, and while outside Australia. Using our website and protections to your privacy We take our obligation to protect your privacy seriously. We provide a secure online environment, but you can do more to ensure your personal safety online: Make sure you give us your contact details when you apply for your visa and tell us if they have changed . We may need to contact you directly even if you have: nominated your sponsor’s email address for all electronic correspondence appointed your sponsor or someone else to receive your correspondence as your authorised recipient appointed someone to give you immigration assistance. Protect your ImmiAccount , email account and passwords. Don’t share them with anyone. For more information see Using our website Show steps How to apply Login to ImmiAccount . If you do not have an ImmiAccount login, you will be asked to create a new account. Select ‘New application’. Select ‘Family’. Select ‘Stage 1 – Partner or Prospective Marriage Visa’. Complete your application. Pay the visa application charge. Submit your application. Give your transaction reference number (TRN) to your sponsor. Your sponsor will need the TRN to apply for sponsorship. Attach supporting documents to your completed application. We cannot process your application if you do not pay the correct visa application charge. To find information for how to apply as a sponsor, click on the “Personalise this page..” toggle above to view this information. The partner visa application form will ask you for your own phone number and email address. It is important to provide your own contact details in case we need to contact you directly about your application. Clearly label your documents and only attach a document once, even if you are using it to show more than one thing. Keep a copy of your completed application. You can attach up to 100 documents for each person on your application. The attachment limit cannot be increased. If you reach the attachment limit for an applicant, you can attach more documents to other clients on the application. For more information, see Applying online in ImmiAccount You can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs) Step 4 After you apply We will let you know when we have received your application. Show steps Be sponsored You and anyone who applies for the visa with you must have a sponsor when you lodge your application and when you are on this visa. After you apply for this visa, give your sponsor your Transaction Reference Number (TRN) or application ID. Your sponsor can then apply to sponsor you. Select the ‘For Sponsors’ switch at the top of this page for information about sponsorship. See how Organise health examinations You need to have health examinations. To organise your health examinations, see What health examinations you need The results of your health assessment are valid for 12 months from the time you completed your examinations. If we ask you to sign a health undertaking, this will be valid for 6 months. For more information on health requirements and examinations, see Health See how Character documents To show that you meet our character requirements you need to provide: a police certificate from every country where you spent a total of 12 months or more during the last 10 years since you turned 16 military service records or discharge papers if you served in the armed forces of any country. For immigration purposes, police certificates are valid for 12 months from the issue date. To get a police certificate, see Offices outside Australia Complete and attach to your application Form 80 Personal particulars for assessment including character assessment (596KB PDF) Australian police certificate Provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. To get an Australian police certificate see National Police Checks. See how Status updates To help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on ImmiAccount will help make sure you include all required documents in your application. If your application is within standard processing times, do not contact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information in ImmiAccount To see standard processing times for this visa see Global processing times You can find the answers to common questions about this visa at Partner Program Frequently Asked Questions (FAQs) See how Travel Do not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 300 visa. See how Biometrics We will tell you if you need to provide biometrics See how Attach more information If you did not attach all documents when you applied, attach them in ImmiAccount as soon as you can. We might ask you to provide more information. For more information on attaching documents in ImmiAccount see Applying online or paper If you are unable to upload the relevant documents to you application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form See how Add family members You can add a dependent child to your application before we decide on your visa. Your child must be outside Australia. Complete and attach to your application in ImmiAccount Form 1436 - Adding an additional applicant after lodgement (481KB PDF) After you have attached the form, let us know by using the Partner Processing Enquiry Form We can grant your child the subclass 300 visa if they are members of the family unit , and meet all other criteria for grant. See how Newborn children If you have a baby, you will need to let us know. For more information, see You had a baby After you have updated ImmiAccount, let us know by using the Partner Processing Enquiry Form See how Tell us if your details have changed See here for changes to your contact details, address or passport See how Tell us if things change Tell us if things change after you apply but before we have made a decision. Things you need to let us know about include: the birth of a child any other changes relevant to your application a request to withdraw your application. For more information, see Change in your situation. If you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form See how If your relationship ends Complete the Notification of Relationship Cessation form in the ‘Update Details’ tab in ImmiAccount Your online safety To ensure your personal safety online we recommend that you: change your ImmiAccount password as soon as possible do not use saved passwords to access your ImmiAccount change your email password or consider setting up a new email account. To see how you can increase your personal safety you can use the eSafety Commissioner’s online safety checklist If you are having trouble completing the ImmiAccount form, complete the Partner Processing Enquiry Form See how If you marry If you get married before we decide on your visa application, you are no longer eligible for this visa. To tell us about this change: Sign into ImmiAccount Go to the 'Update details' tab Click on the 'Change in situation' option. You will also need to attach the following to your application: evidence that your marriage is valid (registered marriage certificate issued by the relevant legal authority) a request to be considered for a Partner (Provisional) visa (subclass 309) and Partner (Migrant) visa (subclass 100) a statement telling us you want to withdraw your Prospective Marriage visa application. After you have updated ImmiAccount, let us know by using the Partner Processing Enquiry Form If you do not withdraw your application, it will be refused as you no longer meet the eligibility requirements for the visa. See how Stay lawful If you travel to Australia on a visa while your Prospective Marriage visa is in progress, you are responsible for ensuring that you continue to hold a valid visa for the duration of your stay. See how No longer need help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) After you have attached the form to ImmiAccount, let us know by using the Partner Processing Enquiry Form For more information see Who can help you with your application See how Mistakes on your application Let us know as soon as you can if you have made a mistake on your application. For more information, see After you apply If you are unable to update your application in ImmiAccount, you need to contact us using the Partner Processing Enquiry Form See how Step 5 Visa outcome You can be in or outside Australia when we decide your visa application. We will tell you our decision in writing. Keep a copy of the decision. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions. If we refuse your visa, we will tell you: why we refused the visa if you have a right to a review of the decision. We will not refund the application fee if we refuse your application. When you have this visa What you can do on this visa How long you can stay What you must do on this visa Travel on your visa New Zealand passport holders Do not get another visa Prove you have a visa Working Studying Bring a family member If your relationship ends Tell us if your details have changed Tell us if things change What you can do on this visa This visa lets you: live, work and study in Australia for 9 to 15 months from date of visa grant travel to and from Australia as many times as you want while your visa is valid. How long you can stay You can stay in Australia for 9 to 15 months from date of visa grant. To see when your visa expires, refer to your grant letter or use VEVO What you must do on this visa You and your family members must meet all visa conditions and obey Australian laws. Check your visa details and conditions using VEVO If you and your spouse want to settle in Australia, you should apply for a Partner visa (subclass 820 and 801) after your marriage and before your Prospective Marriage visa expires. You will pay less for the Partner visa if you apply for it before your Prospective Marriage visa ends. Travel on your visa You can travel to and from Australia as many times as you want whilst your visa is valid. First entry arrival date If you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter. You can travel to Australia with an expired first entry arrival date if your visa is still valid. Your visa may still be subject to cancellation before arrival or at the border. To see if your visa is still valid, use VEVO New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them: you have a Prospective Marriage visa you do not want a Special Category visa (subclass 444). If you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your Prospective Marriage visa. Do not get another visa As a subclass 300 visa holder, you are eligible to pay a lower visa application charge for the Partner visa (subclasses 820 and 801) application. If you are granted any other visa, the new visa will replace your subclass 300 visa. This means you may need to pay a higher visa application charge when you apply for the Partner visa (subclasses 820 and 801) Prove you have a visa To prove you have a visa and show your conditions to someone, use VEVO Australian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport. Your visa number is contained in your visa grant letter. Use this number to access your digital visa record in VEVO Your digital visa record is also used by: airlines to check your visa before you board your flight Australian government agencies to check your identity and visa conditions employers, banks or other registered organisations to check your visa conditions. Working With this visa you will have full work rights and are protected by Australian workplace law. See your workplace rights and entitlements Studying With this visa you will be able to study in Australia. However you will not receive any government support and any study costs will be at your own expense. Bring a family member You cannot add family members to your visa application after we grant your Prospective Marriage visa subclass 300. To find a visa for a family member, explore visa options Newborn children If you have a baby after you have been granted this visa, you need to let us know. For more information, see You had a baby If your relationship ends Depending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, check Your relationship has changed Your online safety To ensure your personal safety online we recommend that you: change your ImmiAccount password as soon as possible do not use saved passwords to access your ImmiAccount change your email password or consider setting up a new email account. To see how you can increase your personal safety you can use the eSafety Commissioner’s online safety checklist If you do not have access to ImmiAccount, you can notify us using the Partner Processing Enquiry Form You may still be eligible for the Partner visa (subclasses 820 and 801) if your relationship ends or your partner dies. All information you provide is confidential. You must be in Australia to apply for the Partner visa (subclasses 820 and 801) If you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your temporary and permanent visa. For more information, see Domestic and family violence and your visa Tell us if your details have changed See here for changes to your contact details, address or passport Tell us if things change You must tell us about: the birth of a child any other changes relevant to your application. See what to do if there is a change in your situation If you do not have access to ImmiAcount you can let us know by completing the Partner Processing Enquiry Form",
  "main_content": "===== main placeholder ==========================================\nSubclass 300\n\n# Prospective Marriage visa\n\nProspective Marriage visa\n\nThis visa lets you come to Australia to marry your prospective spouse and then apply for a Partner visa.\n\nThis visa lets you come to Australia to marry your prospective spouse and then apply for a Partner visa.\n\nThis visa lets you come to Australia to marry your prospective spouse and then apply for a Partner visa.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\n9 to 15 months from date of grant of visa.\n\n9 to 15 months from date of grant of visa.\n\n#### Cost\n\nCost\n\nFromAUD9,365.00\n\nFromAUD9,365.00\n\nFrom\nAUD9,365.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nThe Department continues to prioritise aged, and compassionate and compelling applications. This is reflected in current processing times.\n\nThe Department continues to prioritise aged, and compassionate and compelling applications. This is reflected in current processing times.\n\n#### With this visa you can\n\nWith this visa you can\n- stay in Australia for 9 to 15 months from your visa grant date\nstay in Australia for 9 to 15 months from your visa grant date\n- work and study in Australia.\nwork and study in Australia.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be 18 years old or older\nbe 18 years old or older\n- have a sponsor who is an Australian citizen,permanent residentoreligible New Zealand citizen\nhave a sponsor who is an Australian citizen,\npermanent resident\nor\neligible New Zealand citizen\n- intend to marry your prospective spouse before the visa period ends\nintend to marry your prospective spouse before the visa period ends\n- have met your prospective spouse face to face as adults since turning 18, and are known to each other personally at the time you apply for this visa\nhave met your prospective spouse face to face as adults since turning 18, and are known to each other personally at the time you apply for this visa\n- be outside of Australia when you apply for this visa, along with any family that apply with you\nbe outside of Australia when you apply for this visa, along with any family that apply with you\n- be in or outside Australia when we decide your temporary visa.\nbe in or outside Australia when we decide your temporary visa.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, make sure you read information onWho can help with your visa application.\n\nIf you are getting help with your visa, make sure you read information on\nWho can help with your visa application\n.\n\nApply\n\nApply\nAbout this visa\nWith this visa you can\nSettle in Australia\nHow long you can stay\nInclude family members\nCost\nApply for this visa\nYour obligations\nAdequate health insurance\nTravel\nVisa label\nFrequently Asked Questions\n\n## With this visa you can\n\nWith this visa you can\n- live, work and study in Australia for 9 to 15 months from the visa grant date\nlive, work and study in Australia for 9 to 15 months from the visa grant date\n- travel to and from Australia as many times as you want while the visa is valid.\ntravel to and from Australia as many times as you want while the visa is valid.\n\n## Settle in Australia\n\nSettle in Australia\n\nIf you and your spouse want to settle in Australia, apply for aPartner visa (subclass 820 and 801):\n\nIf you and your spouse want to settle in Australia, apply for a\nPartner visa (subclass 820 and 801)\n:\n- after you are married\nafter you are married\n- before your Prospective Marriage visa ends.\nbefore your Prospective Marriage visa ends.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa. You can stay in Australia for the period specified on the visa grant letter. This is 9 to 15 months from the visa grant date.\n\nThis is a temporary visa. You can stay in Australia for the period specified on the visa grant letter. This is 9 to 15 months from the visa grant date.\n\n## Include family members\n\nInclude family members\n\nYou can includemembers of the family unitin your application.\n\nYou can include\nmembers of the family unit\nin your application.\n- when you lodge your visa application, or\nwhen you lodge your visa application, or\n- add adependent childafter you lodge your application but before we decide on your temporary visa.\nadd a\ndependent child\nafter you lodge your application but before we decide on your temporary visa.\n\nFamily members who apply with you must:\n\nFamily members who apply with you must:\n- bemembers of the family unit\nbe\nmembers of the family unit\n- meet ourhealth requirement\nmeet our\nhealth requirement\n- meet ourcharacter requirement\nmeet our\ncharacter requirement\n- be outside Australia.\nbe outside Australia.\n\nFamily members who are not coming to Australia might also have to meet our health and character requirement.\n\nFamily members who are not coming to Australia might also have to meet our health and character requirement.\n\n#### Newborn children\n\nNewborn children\n\nFor information on what to do if your child is born after you apply, seeYou had a baby.\n\nFor information on what to do if your child is born after you apply, see\nYou had a baby\n.\n\n## Cost\n\nCost\n\nThe visa costsAUD9,365.00for the main applicant.\n\nThe visa costs\nAUD9,365.00\nfor the main applicant.\n\nThere is also a fee for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You might also have to pay other costs for health checks, police certificates andbiometrics.\n\nThere is also a fee for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You might also have to pay other costs for health checks, police certificates and\nbiometrics\n.\n\nTo work out how much your visa will cost, including adding additional family members, use theVisa pricing estimator. The estimator does not take into account the costs for health checks, police certificates or biometrics.\n\nTo work out how much your visa will cost, including adding additional family members, use the\nVisa pricing estimator\n. The estimator does not take into account the costs for health checks, police certificates or biometrics.\n\nYou will also have to pay a fee for yourPartner visa (subclasses 820 and 801). You pay less for this visa if you marry your prospective spouse and apply for the Partner visa before your Prospective Marriage visa ends.\n\nYou will also have to pay a fee for your\nPartner visa (subclasses 820 and 801)\n. You pay less for this visa if you marry your prospective spouse and apply for the Partner visa before your Prospective Marriage visa ends.\n\n## Apply for this visa\n\nApply for this visa\n\nYou must be outside of Australia when you apply for this visa. Family who apply with you must also be outside Australia.\n\nYou must be outside of Australia when you apply for this visa. Family who apply with you must also be outside Australia.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nSee what conditions might be attached to this visa on ourvisa conditions page.\n\nSee what conditions might be attached to this visa on our\nvisa conditions page\n.\n\n#### Your marriage\n\nYour marriage\n\nYou must enter Australia on the Prospective Marriage visa before the date specified on your grant letter.\n\nYou must enter Australia on the Prospective Marriage visa before the date specified on your grant letter.\n\nYou must have married your prospective spouse before your Prospective Marriage visa expires.\n\nYou must have married your prospective spouse before your Prospective Marriage visa expires.\n\nYou can get married in any country but your marriage must be valid under Australian law.\n\nYou can get married in any country but your marriage must be valid under Australian law.\n\n#### Forced marriage\n\nForced marriage\n\nForced marriage is when a person (or both people) gets married without freely and fully consenting. They may be tricked, threatened or pressured into getting married, or they are incapable of understanding the nature and effect of a marriage ceremony, for reasons including age or mental capacity.\n\nForced marriage is when a person (or both people) gets married without freely and fully consenting. They may be tricked, threatened or pressured into getting married, or they are incapable of understanding the nature and effect of a marriage ceremony, for reasons including age or mental capacity.\n\nForced marriage is a crime in Australia.\n\nForced marriage is a crime in Australia.\n\nIf you or someone you know is in, or at risk of, a forced marriage you can seek help. For more information, seeForced marriage | Attorney-General's Department.\n\nIf you or someone you know is in, or at risk of, a forced marriage you can seek help. For more information, see\nForced marriage | Attorney-General's Department\n.\n\n## Adequate health insurance\n\nAdequate health insurance\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need while in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need while in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nSee what we consideradequate health insurance.\n\nSee what we consider\nadequate health insurance\n.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors.\n\n#### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal health care agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal health care agreements.\n\n## Travel\n\nTravel\n\nYou can travel to and from Australia as many times as you want while you hold this visa.\n\nYou can travel to and from Australia as many times as you want while you hold this visa.\n\n### First entry arrival date\n\nFirst entry arrival date\n\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter.\n\nIf you are outside Australia at the time of visa grant you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n## Frequently Asked Questions\n\nFrequently Asked Questions\n\nYou can find the answers to common questions about this visa atPartner Program Frequently Asked Questions (FAQs).\n\nYou can find the answers to common questions about this visa at\nPartner Program Frequently Asked Questions (FAQs)\n.\nEligibility\n\n## Not had a visa cancelled or an application refused\n\nNot had a visa cancelled or an application refused\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeCan I go to Australia.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Be outside Australia when you apply\n\nBe outside Australia when you apply\n\nYou must be outside Australia when you apply for this visa. Family who apply with you must also be outside Australia.\n\nYou must be outside Australia when you apply for this visa. Family who apply with you must also be outside Australia.\n\n## Have a sponsor\n\nHave a sponsor\n\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and while you are on this visa.\n\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and while you are on this visa.\n\nYour sponsor is your prospective spouse.\n\nYour sponsor is your prospective spouse.\n\nYou and your prospective spouse must have met in person as adults since turning 18, and are known to each other personally at the time you apply for this visa.\n\nYou and your prospective spouse must have met in person as adults since turning 18, and are known to each other personally at the time you apply for this visa.\n\nWe must approve your sponsor.\n\nWe must approve your sponsor.\n\nYour sponsor should apply to sponsor you as soon as possible after you apply for this visa.\n\nYour sponsor should apply to sponsor you as soon as possible after you apply for this visa.\n\nSelect the ‘For Sponsors’ switch at the top of this page for information about sponsorship.\n\nSelect the ‘For Sponsors’ switch at the top of this page for information about sponsorship.\n\n## Be the right age\n\nBe the right age\n\nYou and your sponsor must be 18 years old or older when you apply for this visa.\n\nYou and your sponsor must be 18 years old or older when you apply for this visa.\n\n## Meet relationship requirements\n\nMeet relationship requirements\n\nIn most cases, your prospective spouse must be an:\n\nIn most cases, your prospective spouse must be an:\n- Australian citizen\nAustralian citizen\n- Australianpermanent resident\nAustralian\npermanent resident\n- eligible New Zealand citizen.\neligible New Zealand citizen\n.\n\nYour relationship can be with someone of the same or different sex.\n\nYour relationship can be with someone of the same or different sex.\n\n## Meet our health requirement\n\nMeet our health requirement\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement. We might ask for health information about family not coming to Australia with you.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n. We might ask for health information about family not coming to Australia with you.\n\n## Meet our character requirement\n\nMeet our character requirement\n\nYou and any family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirements. We might ask for character information about family not coming to Australia with you.\n\nYou and any family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirements\n. We might ask for character information about family not coming to Australia with you.\n\n## Have no debt to the Australian Government\n\nHave no debt to the Australian Government\n\nIf you or any family members owe the Australian government money, it must have been paid back or arranged to be paid back. This may include family members who do not accompany you to Australia.\n\nIf you or any family members owe the Australian government money, it must have been paid back or arranged to be paid back. This may include family members who do not accompany you to Australia.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\n\nYou and any family members who apply with you who are 18 years of age or older must:\n\nYou and any family members who apply with you who are 18 years of age or older must:\n- have read, or had explained, theLife in Australia booklet\nhave read, or had explained, the\nLife in Australia booklet\n- sign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws.\nsign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws.\n\n## Best interests of the child\n\nBest interests of the child\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nThere are things you need to know and might need to do before you apply.\n\nThere are things you need to know and might need to do before you apply.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nYou can appoint anyone to receive correspondence relating to your visa application.\n\nYou can appoint anyone to receive correspondence relating to your visa application.\n\nTo appoint someone to receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF).\n\nTo appoint someone to receive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n.\n\nIf you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can:\n\nIf you need help with your application, you can appoint someone to give you immigration assistance. A person who gives you immigration assistance can:\n- discuss your application with us\ndiscuss your application with us\n- give us information\ngive us information\n- send and receive correspondence about your application.\nsend and receive correspondence about your application.\n\nWe treat any correspondence they send as if it came from you.\n\nWe treat any correspondence they send as if it came from you.\n\nIf you appoint someone to give you immigration assistance they must be:\n\nIf you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner\na\nlegal practitioner\n- anexempt person.\nan\nexempt person\n.\n\nTo appoint someone to provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (225KB PDF).\n\nTo appoint someone to provide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (225KB PDF)\n.\n\nFor more information, seewho can help you with your application.\n\nFor more information, see\nwho can help you with your application\n.\n\nStep 2\n\nStep 2\nGather and prepare your documents\n\nYou should provide all required information with your application, or as soon as possible after lodging your application. Applications with all required information reduce processing delays.\n\nYou should provide all required information with your application, or as soon as possible after lodging your application. Applications with all required information reduce processing delays.\n\nYou have the option to obtain your police certificates before you apply. However for immigration purposes, police certificates are valid for 12 months from the issue date.\n\nYou have the option to obtain your police certificates before you apply. However for immigration purposes, police certificates are valid for 12 months from the issue date.\n\nIf more than 15 months has passed since your National Police certificate (NPC) was issued by the Australian Federal Police (AFP), new checks will be required to progress your application.\n\nIf more than 15 months has passed since your National Police certificate (NPC) was issued by the Australian Federal Police (AFP), new checks will be required to progress your application.\n\nEnsure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application. For more information, seeProviding accurate information.\n\nEnsure that all information you provide is accurate. As a visa applicant, you must prove your identity and provide true information with your application. For more information, see\nProviding accurate information\n.\n\nYour sponsor should apply to sponsor you as soon as possible after you apply for this visa.\n\nYour sponsor should apply to sponsor you as soon as possible after you apply for this visa.\n\nSelect the 'For Sponsors' switch at the top of this page for information about sponsorship.\n\nSelect the 'For Sponsors' switch at the top of this page for information about sponsorship.\nShow\n                    steps\n\n#### Identity documents\n\nIdentity documents\n\nProvide a birth certificate showing the names of both parents.\n\nProvide a birth certificate showing the names of both parents.\n\nIf you cannot provide this, provide one of the following:\n\nIf you cannot provide this, provide one of the following:\n- Identification pages of a family book showing the names of both parents.\nIdentification pages of a family book showing the names of both parents.\n- Identification pages of an identification document issued by the government.\nIdentification pages of an identification document issued by the government.\n- Identification pages of a court-issued document that proves your identity.\nIdentification pages of a court-issued document that proves your identity.\n- Identification pages of a family census register.\nIdentification pages of a family census register.\n\nAlso provide:\n\nAlso provide:\n- the pages of your current passport showing your photo, personal details and issue and expiry dates\nthe pages of your current passport showing your photo, personal details and issue and expiry dates\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if applicable, such as:a marriage or divorce certificatechange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authoritydocuments that show other names you have been known by.\nproof of change of name, if applicable, such as:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\nSee how\n\n#### Evidence of relationships\n\nEvidence of relationships\n\nYou need to attach to your application, evidence of:\n\nYou need to attach to your application, evidence of:\n- your relationship with your prospective spouse\nyour relationship with your prospective spouse\n- any former relationships\nany former relationships\n- any dependants you have.\nany dependants you have.\nSee how\n\n#### Your relationship with your prospective spouse\n\nYour relationship with your prospective spouse\n\nYou must provide statements from 2 witnesses who:\n\nYou must provide statements from 2 witnesses who:\n- are 18 years or older\nare 18 years or older\n- know you and your prospective spouse\nknow you and your prospective spouse\n- know about your relationship.\nknow about your relationship.\n\nStatements from witnesses can be done by completingForm 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (1027KB PDF).\n\nStatements from witnesses can be done by completing\nForm 888 – Supporting statement in relation to a Partner or Prospective Marriage visa application (1027KB PDF)\n.\n\nIf the witness is an Australian citizen or permanent resident, provide evidence of this, such as a passport or birth certificate.\n\nIf the witness is an Australian citizen or permanent resident, provide evidence of this, such as a passport or birth certificate.\n\nAlso provide other evidence of your relationship such as:\n\nAlso provide other evidence of your relationship such as:\n- evidence that you and your prospective spouse have met face-to-face as adults since turning 18 and know each other personally\nevidence that you and your prospective spouse have met face-to-face as adults since turning 18 and know each other personally\n- evidence (such as a letter from the person who will officiate at the wedding) that you will marry your prospective spouse within 9 months of being granted the visa\nevidence (such as a letter from the person who will officiate at the wedding) that you will marry your prospective spouse within 9 months of being granted the visa\n- evidence that you and your prospective spouse genuinely intend to live as spouses\nevidence that you and your prospective spouse genuinely intend to live as spouses\n- written statements showing the history of your relationship, such as:how, when and where you first methow your relationship developedwhen you got engagedwhat you do togethersignificant events in the relationshipyour future plans as spouses.\nwritten statements showing the history of your relationship, such as:\n- how, when and where you first met\nhow, when and where you first met\n- how your relationship developed\nhow your relationship developed\n- when you got engaged\nwhen you got engaged\n- what you do together\nwhat you do together\n- significant events in the relationship\nsignificant events in the relationship\n- your future plans as spouses.\nyour future plans as spouses.\nSee how\n\n#### Former relationships\n\nFormer relationships\n\nIf you have previously been married, widowed, divorced or permanently separated, provide divorce documents, death certificates, separation documents or statutory declarations.\n\nIf you have previously been married, widowed, divorced or permanently separated, provide divorce documents, death certificates, separation documents or statutory declarations.\nSee how\n\n#### Dependants under 18\n\nDependants under 18\n\nFor each of themembers of the family unitunder 18 years old applying with you, provide:\n\nFor each of the\nmembers of the family unit\nunder 18 years old applying with you, provide:\n- identity documents\nidentity documents\n- evidence of your relationship with your dependant, like a birth or marriage certificate\nevidence of your relationship with your dependant, like a birth or marriage certificate\n- health examinations\nhealth examinations\n- character documents, if the dependant is 16 or 17 years of age\ncharacter documents\n, if the dependant is 16 or 17 years of age\n- adoption papers or parental court orders, if applicable\nadoption papers or parental court orders, if applicable\n- evidence of enrolment at school, college or university, if applicable\nevidence of enrolment at school, college or university, if applicable\n- evidence of sole custody, if applicable.\nevidence of sole custody, if applicable.\n\nParental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child.\nis not coming to Australia with the child.\n\nThey must completeForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF).\n\nThey must complete\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n.\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form, such as a passport or driver’s licence\n- adoption papers or other court documents, if applicable.\nadoption papers or other court documents, if applicable.\n\nAlternatively, you can show us one of the following:\n\nAlternatively, you can show us one of the following:\n- An Australian court order that allows your child to migrate to Australia\nAn Australian court order that allows your child to migrate to Australia\n- That the laws of the child's home country allow them to leave their home country permanently.\nThat the laws of the child's home country allow them to leave their home country permanently.\nSee how\n\n#### Dependants over 18\n\nDependants over 18\n\nTo includemembers of the family unitwho are over 18 in your visa application, they must be:\n\nTo include\nmembers of the family unit\nwho are over 18 in your visa application, they must be:\n- between the ages of 18 and 23, and dependent on you or your partner\nbetween the ages of 18 and 23, and dependent on you or your partner\n- over 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner.\nover 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner.\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- health examinations\nhealth examinations\n- character documents.\ncharacter documents\n.\n\nYou must also provide evidence the child is dependent on you. This includes the following:\n\nYou must also provide evidence the child is dependent on you. This includes the following:\n- Evidence of your relationship with the dependent such as a birth certificate or adoption papers.\nEvidence of your relationship with the dependent such as a birth certificate or adoption papers.\n- Evidence of financial dependence such as bank statements, money transfers and rent receipts.\nEvidence of financial dependence such as bank statements, money transfers and rent receipts.\n- A completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF).\nA completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n.\n\nIf the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner. This report should state that they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions.\n\nIf the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner. This report should state that they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\n\nTranslate\n\nTranslate\n\nHave all documents translated into English.\n\nHave all documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating.\nqualifications and experience in the language they are translating.\n\nThese details must be in English.\n\nThese details must be in English.\n\nScan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear enough to read.\n\nThe scans and photos must be clear enough to read.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\n\nYoudo notneed to have any documents certified.\n\nYou\ndo not\nneed to have any documents certified.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply:\n\nYou must apply:\n- online, and\nonline, and\n- while outside Australia.\nwhile outside Australia.\n\n### Using our website and protections to your privacy\n\nUsing our website and protections to your privacy\n\nWe take our obligation to protect your privacy seriously. We provide a secure online environment, but you can do more to ensure your personal safety online:\n\nWe take our obligation to protect your privacy seriously. We provide a secure online environment, but you can do more to ensure your personal safety online:\n- Make sure you give us your contact details when you apply for your visa andtell us if they have changed. We may need to contact you directly even if you have:nominated your sponsor’s email address for all electronic correspondenceappointed your sponsor or someone else to receive your correspondence as your authorised recipientappointed someone to give you immigration assistance.\nMake sure you give us your contact details when you apply for your visa and\ntell us if they have changed\n. We may need to contact you directly even if you have:\n- nominated your sponsor’s email address for all electronic correspondence\nnominated your sponsor’s email address for all electronic correspondence\n- appointed your sponsor or someone else to receive your correspondence as your authorised recipient\nappointed your sponsor or someone else to receive your correspondence as your authorised recipient\n- appointed someone to give you immigration assistance.\nappointed someone to give you immigration assistance.\n- Protect yourImmiAccount, email account and passwords. Don’t share them with anyone.\nProtect your\nImmiAccount\n, email account and passwords. Don’t share them with anyone.\n\nFor more information seeUsing our website.\n\nFor more information see\nUsing our website\n.\nShow\n                    steps\n\n#### How to apply\n\nHow to apply\n1. Login toImmiAccount. If you do not have an ImmiAccount login, you will be asked to create a new account.\nLogin to\nImmiAccount\n. If you do not have an ImmiAccount login, you will be asked to create a new account.\n2. Select ‘New application’.\nSelect ‘New application’.\n3. Select ‘Family’.\nSelect ‘Family’.\n4. Select ‘Stage 1 – Partner or Prospective Marriage Visa’.\nSelect ‘Stage 1 – Partner or Prospective Marriage Visa’.\n5. Complete your application.\nComplete your application.\n6. Pay the visa application charge.\nPay the visa application charge.\n7. Submit your application.\nSubmit your application.\n8. Give your transaction reference number (TRN) to your sponsor. Your sponsor will need the TRN to apply for sponsorship.\nGive your transaction reference number (TRN) to your sponsor. Your sponsor will need the TRN to apply for sponsorship.\n9. Attach supporting documentsto your completed application.\nAttach supporting documents\nto your completed application.\n\nWe cannot process your application if you do not pay the correct visa application charge.\n\nWe cannot process your application if you do not pay the correct visa application charge.\n\nTo find information for how to apply as a sponsor, click on the “Personalise this page..” toggle above to view this information.\n\nTo find information for how to apply as a sponsor, click on the “Personalise this page..” toggle above to view this information.\n\nThe partner visa application form will ask you for your own phone number and email address. It is important to provide your own contact details in case we need to contact you directly about your application.\n\nThe partner visa application form will ask you for your own phone number and email address. It is important to provide your own contact details in case we need to contact you directly about your application.\n\nClearly label your documents and only attach a document once, even if you are using it to show more than one thing.\n\nClearly label your documents and only attach a document once, even if you are using it to show more than one thing.\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\nYou can attach up to 100 documents foreachperson on your application.\n\nYou can attach up to 100 documents for\neach\nperson on your application.\n\nThe attachment limit cannot be increased.\n\nThe attachment limit cannot be increased.\n\nIf you reach the attachment limit for an applicant, you can attach more documents to other clients on the application.\n\nIf you reach the attachment limit for an applicant, you can attach more documents to other clients on the application.\n\nFor more information, seeApplying online in ImmiAccount.\n\nFor more information, see\nApplying online in ImmiAccount\n.\n\nYou can find the answers to common questions about this visa atPartner Program Frequently Asked Questions (FAQs).\n\nYou can find the answers to common questions about this visa at\nPartner Program Frequently Asked Questions (FAQs)\n.\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application.\n\nWe will let you know when we have received your application.\nShow\n                    steps\n\n#### Be sponsored\n\nBe sponsored\n\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and when you are on this visa.\n\nYou and anyone who applies for the visa with you must have a sponsor when you lodge your application and when you are on this visa.\n\nAfter you apply for this visa, give your sponsor your Transaction Reference Number (TRN) or application ID. Your sponsor can then apply to sponsor you.\n\nAfter you apply for this visa, give your sponsor your Transaction Reference Number (TRN) or application ID. Your sponsor can then apply to sponsor you.\n\nSelect the ‘For Sponsors’ switch at the top of this page for information about sponsorship.\n\nSelect the ‘For Sponsors’ switch at the top of this page for information about sponsorship.\nSee how\n\n#### Organise health examinations\n\nOrganise health examinations\n\nYou need to have health examinations.\n\nYou need to have health examinations.\n\nTo organise your health examinations, seeWhat health examinations you need.\n\nTo organise your health examinations, see\nWhat health examinations you need\n.\n\nThe results of your health assessment are valid for 12 months from the time you completed your examinations. If we ask you to sign a health undertaking, this will be valid for 6 months.\n\nThe results of your health assessment are valid for 12 months from the time you completed your examinations. If we ask you to sign a health undertaking, this will be valid for 6 months.\n\nFor more information on health requirements and examinations, seeHealth\n\nFor more information on health requirements and examinations, see\nHealth\nSee how\n\n#### Character documents\n\nCharacter documents\n\nTo show that you meet our character requirements you need to provide:\n\nTo show that you meet our character requirements you need to provide:\n- a police certificate from every country where you spent a total of 12 months or more during the last 10 years since you turned 16\na police certificate from every country where you spent a total of 12 months or more during the last 10 years since you turned 16\n- military service records or discharge papers if you served in the armed forces of any country.\nmilitary service records or discharge papers if you served in the armed forces of any country.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nTo get a police certificate, seeOffices outside Australia.\n\nTo get a police certificate, see\nOffices outside Australia\n.\n\nComplete and attach to your applicationForm 80 Personal particulars for assessment including character assessment (596KB PDF).\n\nComplete and attach to your application\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n.\n\nAustralian police certificate\n\nAustralian police certificate\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nWe only accept complete disclosure National Police Certificates issued by the Australian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nTo get an Australian police certificate seeNational Police Checks.\n\nTo get an Australian police certificate see\nNational Police Checks.\nSee how\n\n#### Status updates\n\nStatus updates\n\nTo help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on ImmiAccount will help make sure you include all required documents in your application.\n\nTo help ensure your application is processed as quickly as possible, attach all necessary supporting documents to your application. The checklist provided on ImmiAccount will help make sure you include all required documents in your application.\n\nIf your application is within standard processing times,do notcontact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information inImmiAccount.\n\nIf your application is within standard processing times,\ndo not\ncontact us. We cannot provide any further updates on your application's progress. You can see if we have asked for more information in\nImmiAccount\n.\n\nTo see standard processing times for this visa seeGlobal processing times.\n\nTo see standard processing times for this visa see\nGlobal processing times\n.\n\nYou can find the answers to common questions about this visa atPartner Program Frequently Asked Questions (FAQs).\n\nYou can find the answers to common questions about this visa at\nPartner Program Frequently Asked Questions (FAQs)\n.\nSee how\n\n#### Travel\n\nTravel\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 300 visa.\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the subclass 300 visa.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe will tell you if you need to providebiometrics.\n\nWe will tell you if you need to provide\nbiometrics\n.\nSee how\n\n#### Attach more information\n\nAttach more information\n\nIf you did not attach all documents when you applied, attach them inImmiAccountas soon as you can.\n\nIf you did not attach all documents when you applied, attach them in\nImmiAccount\nas soon as you can.\n\nWe might ask you to provide more information.\n\nWe might ask you to provide more information.\n\nFor more information on attaching documents in ImmiAccount seeApplying online or paper.\n\nFor more information on attaching documents in ImmiAccount see\nApplying online or paper\n.\n\nIf you are unable to upload the relevant documents to you application in ImmiAccount, you need to contact us using thePartner Processing Enquiry Form.\n\nIf you are unable to upload the relevant documents to you application in ImmiAccount, you need to contact us using the\nPartner Processing Enquiry Form\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can add adependent childto your application before we decide on your visa. Your child must be outside Australia.\n\nYou can add a\ndependent child\nto your application before we decide on your visa. Your child must be outside Australia.\n\nComplete and attach to your application in ImmiAccountForm 1436 - Adding an additional applicant after lodgement (481KB PDF).\n\nComplete and attach to your application in ImmiAccount\nForm 1436 - Adding an additional applicant after lodgement (481KB PDF)\n.\n\nAfter you have attached the form, let us know by using thePartner Processing Enquiry Form.\n\nAfter you have attached the form, let us know by using the\nPartner Processing Enquiry Form\n.\n\nWe can grant your child the subclass 300 visa if they aremembers of the family unit, and meet all other criteria for grant.\n\nWe can grant your child the subclass 300 visa if they are\nmembers of the family unit\n, and meet all other criteria for grant.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nIf you have a baby, you will need to let us know. For more information, seeYou had a baby.\n\nIf you have a baby, you will need to let us know. For more information, see\nYou had a baby\n.\n\nAfter you have updated ImmiAccount, let us know by using thePartner Processing Enquiry Form.\n\nAfter you have updated ImmiAccount, let us know by using the\nPartner Processing Enquiry Form\n.\nSee how\n\n#### Tell us if your details have changed\n\nTell us if your details have changed\n\nSee here for changes to yourcontact details, addressorpassport\n\nSee here for changes to your\ncontact details, address\nor\npassport\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nTell us if things change after you apply but before we have made a decision.\n\nTell us if things change after you apply but before we have made a decision.\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- the birth of a child\nthe birth of a child\n- any other changes relevant to your application\nany other changes relevant to your application\n- a request to withdraw your application.\na request to withdraw your application.\n\nFor more information, seeChange in your situation.\n\nFor more information, see\nChange in your situation.\n\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using thePartner Processing Enquiry Form.\n\nIf you are unable to upload the relevant documents to your application in ImmiAccount, you need to contact us using the\nPartner Processing Enquiry Form\n.\nSee how\n\n#### If your relationship ends\n\nIf your relationship ends\n\nComplete the Notification of Relationship Cessation form in the ‘Update Details’ tab inImmiAccount.\n\nComplete the Notification of Relationship Cessation form in the ‘Update Details’ tab in\nImmiAccount\n.\n\n#### Your online safety\n\nYour online safety\n\nTo ensure your personal safety online we recommend that you:\n\nTo ensure your personal safety online we recommend that you:\n- change yourImmiAccountpassword as soon as possible\nchange your\nImmiAccount\npassword as soon as possible\n- do not use saved passwords to access your ImmiAccount\ndo not use saved passwords to access your ImmiAccount\n- change your email password or consider setting up a new email account.\nchange your email password or consider setting up a new email account.\n\nTo see how you can increase your personal safety you can use theeSafety Commissioner’s online safety checklist\n\nTo see how you can increase your personal safety you can use the\neSafety Commissioner’s online safety checklist\n\nIf you are having trouble completing the ImmiAccount form, complete thePartner Processing Enquiry Form.\n\nIf you are having trouble completing the ImmiAccount form, complete the\nPartner Processing Enquiry Form\n.\nSee how\n\n#### If you marry\n\nIf you marry\n\nIf you get married before we decide on your visa application, you are no longer eligible for this visa. To tell us about this change:\n\nIf you get married before we decide on your visa application, you are no longer eligible for this visa. To tell us about this change:\n1. Sign intoImmiAccount\nSign into\nImmiAccount\n2. Go to the 'Update details' tab\nGo to the 'Update details' tab\n3. Click on the 'Change in situation' option.\nClick on the 'Change in situation' option.\n\nYou will also need to attach the following to your application:\n\nYou will also need to attach the following to your application:\n- evidence that your marriage is valid (registered marriage certificate issued by the relevant legal authority)\nevidence that your marriage is valid (registered marriage certificate issued by the relevant legal authority)\n- a request to be considered for aPartner (Provisional) visa (subclass 309)andPartner (Migrant) visa (subclass 100)\na request to be considered for a\nPartner (Provisional) visa (subclass 309)\nand\nPartner (Migrant) visa (subclass 100)\n- a statement telling us you want to withdraw your Prospective Marriage visa application.\na statement telling us you want to withdraw your Prospective Marriage visa application.\n\nAfter you have updated ImmiAccount, let us know by using thePartner Processing Enquiry Form.\n\nAfter you have updated ImmiAccount, let us know by using the\nPartner Processing Enquiry Form\n.\n\nIf you do not withdraw your application, it will be refused as you no longer meet the eligibility requirements for the visa.\n\nIf you do not withdraw your application, it will be refused as you no longer meet the eligibility requirements for the visa.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you travel to Australia on a visa while your Prospective Marriage visa is in progress, you are responsible for ensuring that you continue to hold a valid visa for the duration of your stay.\n\nIf you travel to Australia on a visa while your Prospective Marriage visa is in progress, you are responsible for ensuring that you continue to hold a valid visa for the duration of your stay.\nSee how\n\n#### No longer need help with your application\n\nNo longer need help with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nAfter you have attached the form to ImmiAccount, let us know by using thePartner Processing Enquiry Form.\n\nAfter you have attached the form to ImmiAccount, let us know by using the\nPartner Processing Enquiry Form\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you have made a mistake on your application. For more information, seeAfter you apply.\n\nLet us know as soon as you can if you have made a mistake on your application. For more information, see\nAfter you apply\n.\n\nIf you are unable to update your application in ImmiAccount, you need to contact us using thePartner Processing Enquiry Form.\n\nIf you are unable to update your application in ImmiAccount, you need to contact us using the\nPartner Processing Enquiry Form\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia when we decide your visa application.\n\nYou can be in or outside Australia when we decide your visa application.\n\nWe will tell you our decision in writing. Keep a copy of the decision.\n\nWe will tell you our decision in writing. Keep a copy of the decision.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions.\nyour visa conditions.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- if you have a right to a review of the decision.\nif you have a right to a review of the decision.\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\nWhen you have this visa\nWhat you can do on this visa\nHow long you can stay\nWhat you must do on this visa\nTravel on your visa\nNew Zealand passport holders\nDo not get another visa\nProve you have a visa\nWorking\nStudying\nBring a family member\nIf your relationship ends\nTell us if your details have changed\nTell us if things change\n\n## What you can do on this visa\n\nWhat you can do on this visa\n\nThis visa lets you:\n\nThis visa lets you:\n- live, work and study in Australia for 9 to 15 months from date of visa grant\nlive, work and study in Australia for 9 to 15 months from date of visa grant\n- travel to and from Australia as many times as you want while your visa is valid.\ntravel to and from Australia as many times as you want while your visa is valid.\n\n## How long you can stay\n\nHow long you can stay\n\nYou can stay in Australia for 9 to 15 months from date of visa grant. To see when your visa expires, refer to your grant letter or useVEVO.\n\nYou can stay in Australia for 9 to 15 months from date of visa grant. To see when your visa expires, refer to your grant letter or use\nVEVO\n.\n\n## What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nCheck your visa details and conditions usingVEVO.\n\nCheck your visa details and conditions using\nVEVO\n.\n\nIf you and your spouse want to settle in Australia, you should apply for aPartner visa (subclass 820 and 801)after your marriage and before your Prospective Marriage visa expires. You will pay less for the Partner visa if you apply for it before your Prospective Marriage visa ends.\n\nIf you and your spouse want to settle in Australia, you should apply for a\nPartner visa (subclass 820 and 801)\nafter your marriage and before your Prospective Marriage visa expires. You will pay less for the Partner visa if you apply for it before your Prospective Marriage visa ends.\n\n## Travel on your visa\n\nTravel on your visa\n\nYou can travel to and from Australia as many times as you want whilst your visa is valid.\n\nYou can travel to and from Australia as many times as you want whilst your visa is valid.\n\n### First entry arrival date\n\nFirst entry arrival date\n\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter.\n\nIf you are outside Australia at the time of visa grant, you must enter Australia before the first entry arrival date (first entry, arrive by) specified in your grant letter.\n\nYou can travel to Australia with an expired first entry arrival date if your visa is still valid. Your visa may still be subject to cancellation before arrival or at the border.\n\nYou can travel to Australia with an expired first entry arrival date if your visa is still valid. Your visa may still be subject to cancellation before arrival or at the border.\n\nTo see if your visa is still valid, useVEVO.\n\nTo see if your visa is still valid, use\nVEVO\n.\n\n## New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n- you have a Prospective Marriage visa\nyou have a Prospective Marriage visa\n- you do not want a Special Category visa (subclass 444).\nyou do not want a Special Category visa (subclass 444).\n\nIf you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your Prospective Marriage visa.\n\nIf you do not tell them, you might be granted a 444 visa. Grant of a subclass 444 visa will override your Prospective Marriage visa.\n\n## Do not get another visa\n\nDo not get another visa\n\nAs a subclass 300 visa holder, you are eligible to pay a lower visa application charge for thePartner visa (subclasses 820 and 801)application.\n\nAs a subclass 300 visa holder, you are eligible to pay a lower visa application charge for the\nPartner visa (subclasses 820 and 801)\napplication.\n\nIf you are granted any other visa, the new visa will replace your subclass 300 visa. This means you may need to pay a higher visa application charge when you apply for thePartner visa (subclasses 820 and 801).\n\nIf you are granted any other visa, the new visa will replace your subclass 300 visa. This means you may need to pay a higher visa application charge when you apply for the\nPartner visa (subclasses 820 and 801)\n.\n\n## Prove you have a visa\n\nProve you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\nAustralian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n\nAustralian visas are digital. We do not put a visa label in your passport. Instead, we link your digital visa record to your passport.\n\nYour visa number is contained in your visa grant letter. Use this number to access your digital visa record inVEVO.\n\nYour visa number is contained in your visa grant letter. Use this number to access your digital visa record in\nVEVO\n.\n\nYour digital visa record is also used by:\n\nYour digital visa record is also used by:\n- airlines to check your visa before you board your flight\nairlines to check your visa before you board your flight\n- Australian government agencies to check your identity and visa conditions\nAustralian government agencies to check your identity and visa conditions\n- employers, banks or other registered organisations to check your visa conditions.\nemployers, banks or other registered organisations to check your visa conditions.\n\n## Working\n\nWorking\n\nWith this visa you will have full work rights and are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nWith this visa you will have full work rights and are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\n## Studying\n\nStudying\n\nWith this visa you will be able to study in Australia. However you will not receive any government support and any study costs will be at your own expense.\n\nWith this visa you will be able to study in Australia. However you will not receive any government support and any study costs will be at your own expense.\n\n## Bring a family member\n\nBring a family member\n\nYou cannot add family members to your visa application after we grant your Prospective Marriage visa subclass 300.\n\nYou cannot add family members to your visa application after we grant your Prospective Marriage visa subclass 300.\n\nTo find a visa for a family member,explore visa options.\n\nTo find a visa for a family member,\nexplore visa options\n.\n\n### Newborn children\n\nNewborn children\n\nIf you have a baby after you have been granted this visa, you need to let us know. For more information, seeYou had a baby.\n\nIf you have a baby after you have been granted this visa, you need to let us know. For more information, see\nYou had a baby\n.\n\n## If your relationship ends\n\nIf your relationship ends\n\nDepending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, checkYour relationship has changed.\n\nDepending on your situation you may need to complete the Notification of Relationship Cessation form in ImmiAccount. To confirm, check\nYour relationship has changed\n.\n\n### Your online safety\n\nYour online safety\n\nTo ensure your personal safety online we recommend that you:\n\nTo ensure your personal safety online we recommend that you:\n- change yourImmiAccountpassword as soon as possible\nchange your\nImmiAccount\npassword as soon as possible\n- do not use saved passwords to access your ImmiAccount\ndo not use saved passwords to access your ImmiAccount\n- change your email password or consider setting up a new email account.\nchange your email password or consider setting up a new email account.\n\nTo see how you can increase your personal safety you can use theeSafety Commissioner’s online safety checklist\n\nTo see how you can increase your personal safety you can use the\neSafety Commissioner’s online safety checklist\n\nIf you do not have access to ImmiAccount, you can notify us using thePartner Processing Enquiry Form.\n\nIf you do not have access to ImmiAccount, you can notify us using the\nPartner Processing Enquiry Form\n.\n\nYou may still be eligible for thePartner visa (subclasses 820 and 801)if your relationship ends or your partner dies. All information you provide is confidential.\n\nYou may still be eligible for the\nPartner visa (subclasses 820 and 801)\nif your relationship ends or your partner dies. All information you provide is confidential.\n\nYou must be in Australia to apply for thePartner visa (subclasses 820 and 801).\n\nYou must be in Australia to apply for the\nPartner visa (subclasses 820 and 801)\n.\n\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your temporary and permanent visa. For more information, seeDomestic and family violence and your visa.\n\nIf you are experiencing domestic and family violence, we may be able to help you. You may still be eligible for the grant of your temporary and permanent visa. For more information, see\nDomestic and family violence and your visa\n.\n\n## Tell us if your details have changed\n\nTell us if your details have changed\n\nSee here for changes to yourcontact details, addressorpassport\n\nSee here for changes to your\ncontact details, address\nor\npassport\n\n## Tell us if things change\n\nTell us if things change\n\nYou must tell us about:\n\nYou must tell us about:\n- the birth of a child\nthe birth of a child\n- any other changes relevant to your application.\nany other changes relevant to your application.\n\nSee what to do if there is achange in your situation.\n\nSee what to do if there is a\nchange in your situation\n.\n\nIf you do not have access to ImmiAcount you can let us know by completing thePartner Processing Enquiry Form.\n\nIf you do not have access to ImmiAcount you can let us know by completing the\nPartner Processing Enquiry Form\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-onshore",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-offshore/provisional-309",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-offshore/migrant-100",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#haveThisVisa-index-12",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-onshore/permanent-801",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/partner-onshore/temporary-820",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/prospective-marriage-300#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:10:24.751856",
  "metadata": {}
}