{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-skills-provisional-visas-subclasses-160-165",
  "title": "Business Skills (provisional) visas (subclasses 160-165)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Business Skills (provisional) visas (subclasses 160-165) Page Content ​​The following visas are closed to most new applications: the Business Owner (Provisional) visa (subclass 160) the Senior Executive (Provisional) visa (subclass 161) the Investor (Provisional) visa (subclass 162) the State/Territory Sponsored Business Owner (Provisional) visa (subclass 163) the State/Territory Sponsored Senior Executive (Provisional) visa (subclass (164) the State/Territory Sponsored Investor (Provisional) visa (subclass 165). Family members of people who already hold these visas might be able to get the same visa. If you have already applied for one of these visas and it has not yet been decided, you can also add your dependent children or your partner’s dependent children to your visa application until the application is decided. Your eligible family members can apply for this visa when they are in or outside Australia. Someone who applies for this visa must be outside Australia when it is granted unless they held a student visa when they applied. In this case, they can be in or outside Australia when the visa is granted. Visa Applicants This visa is closed to new applicants. Dependent children can be added to the visa application at any time until the application is decided. Details Adding dependent children to a visa application Details Dependent children can be added to the visa application at any time until the application is decided. Dependent children are your or your partner's children who: have not turned 18 years of age, or have turned 18 but cannot work due to incapacity are not married or engaged to be married or have a de facto partner. To add dependent children, complete: Form 47BT — Application for a Business Skills (provisional) visa (579KB PDF) Application for a Business Skills (provisional) visa The documents listed in the document checklist must be provided with this application form. Applying as a family member Details Family members of someone who already has one of these visas, or who has lodged an application that has not yet been decided, might be able to get the same visa. The family members must be their: partner (married or de facto) dependent children or their partner’s dependent children other dependent relatives. These family members must meet the requirements for including family members in your application . The application must include documentary evidence of their relationship to you.​​ Your family members must be able to show that they meet health and character requirements.​ The family members might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English. Complete the following form to apply for one of the visas: Form 47BT — Application for a Business Skills (provisional) visa (579KB PDF) Submit the documents listed in the document checklist with the application and pay the visa application charge by credit card, money order or bank cheque. Health requirements Details You must meet certain health requirements . However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to. Character requirements Details You must meet certain character requirements . You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age. Debts to the Australian Government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Cost Details Business Owner (Subclass 160): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 Senior Executive (Subclass 161): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 Investor (Subclass 162): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 State/Territory Sponsored Business Owner (Subclass 163): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 State/Territory Sponsored Senior Executive (Subclass 164): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 Business Skills (Provisional) (Class UR) (Subclass 165): Additional applicant charge 18 and over — AUD2,340 Additional applicant charge under 18 — AUD1,170 Where to lodge your application Details If you live in the People's Republic of China (PRC), Hong Kong (SAR), Macau (SAR) or Taiwan: send the documents to the Australian Consulate-General Hong Kong If you live elsewhere: send your documents by registered post to our Adelaide office in South Australia - attention Client Services, Adelaide Business Skills Processing Centre. After you have applied Details After you have lodged your application and documents, we will acknowledge that we have received your information Wait for a decision Details Your application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete. If you applied for this visa outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Provide more information Details You can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 — Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane. Withdrawing your application See: Withdrawing your application Visa decision Details If the visa is granted, we will let you know: when you can use the visa the visa grant number any conditions attached to the visa.​ If the visa is not granted, we will let you know: why the visa was refused your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed the time limit for lodging an appeal. Document checklist Details You need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application. Provide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations. Use this checklist to make sure your application is complete. Forms Details Form 80 - Personal particulars for assessment including character assessment (596KB PDF) For any member of your family unit included in the application who is 18 years of age or older and is not your partner: Form 47a — Details of child or other dependent family member aged 18 years or over (307KB PDF) Details of child or other dependent family member aged 18 years or over (238 kB PDF). For each member of your family unit (child) included in the application who is 16 years of age or older: Form 80 - Personal particulars for assessment including character assessment (596KB PDF) Identity Details Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates). Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application. These photographs should be of the head and shoulders only against a plain background. Print the name of the person on the back of each photograph. Certified copies of birth certificates or the family book showing the names of both parents of all your dependent children. If your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change. Family Details If any dependent child included in the application is adopted: certified copies of the adoption papers. If you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as: If you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature. certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order statutory declaration giving their permission Form 1229 — Consent to grant an Australian visa to a child under the age of 18 years (276KB PDF) Evidence of financial dependency for all your members of the family unit aged 18 or older: a certified copy of their birth certificate and proof of their relationship to you proof that they live in your household proof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application. Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia. If you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets). If you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, or statutory declaration separation documents. Character requirements Details Police checks for everyone included in the visa application who is 16 years of age or older: an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age police certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age. Provide the original certificates and keep a copy for yourself. If anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers. Health requirements Details Documents to show you meet Australia’s health requirements: Applying outside Australia: medical and x-ray examinations by a panel doctor for you and any family member planning to stay with you in Australia Applying in Australia: evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations. English language ability Details You should have at least functional English. Applicants and dependants (18 years and older) who cannot provide evidence of having at least functional English must pay a second instalment of the visa application charge. If they have less than functional English provide a statement indicating your intention to pay the second visa application charge. To prove you have fu​​nction​al English you must provide evidence of one of the following: You are the holder of a valid passport issued by the United Kingdom, the United States of America, Canada, New Zealand, or the Republic of Ireland and you are a citizen of that country. An International English Language Testing System (IELTS) test result of an average band score of at least 4.5 based on the four test components of speaking, reading, listening and writing. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing. A Test of English as a Foreign Language internet-based Test (TOEFL iBT) test result of a total band score of at least 32 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing. A Pearson Test of English (PTE) Academic test result of an overall band score of at least 30 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing. A Cambridge English: Advanced (CAE) test result of an overall band score of at least 147 based on the four test components of speaking, reading, writing and listening and the test must have been taken on or after 1 January 2015. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing. A positive assessment by an Adult Migrant English Program service provider in Australia that you have functional English. Completed all years of primary education and at least three years of secondary education in an educational institution in or outside Australia and all instructions were in English. Completed at least five years of secondary education in an institution in or outside Australia and all instructions were in English. Successfully completed at least one year of full-time study or equivalent part-time study towards a degree, higher degree, diploma, or associate diploma in an institution in Australia and all instructions were in English. Completed a degree, a higher degree, a diploma or a trade certificate that required at least two years of full-time study or training in an institution in or outside Australia and all instructions were in English. The functional level of the Australian Assessment of Communicative English Skills (ACCESS) test certified by the relevant testing body. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing. Visa holders Details This information is for people who have already been granted one of the following visas: the Business Owner (Provisional) visa (subclass 160) the Senior Executive (Provisional) visa (subclass 161) the Investor (Provisional) visa (subclass 162) the State/Territory Sponsored Business Owner (Provisional) visa (subclass 163) the State/Territory Sponsored Senior Executive (Provisional) visa (subclass 164) the State/Territory Sponsored Investor (Provisional) visa (subclass 165). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details If you are outside Australia when the visa is granted, you will need to enter Australia by a specified date. The visa is usually valid for four years from the date specified for your first entry to Australia. What your visa lets you do Details This visa allows you and any family members who have been granted this visa to: live, work and study in Australia apply for permanent residence (if you are eligible) travel in and out of Australia any number of times as long as the visa is valid. You cannot access Medicare, family assistance or social security benefits. Your obligations Details You and your family must comply with all visa conditions and Australian laws. You might also need to comply with the following conditions: If condition 8515 is attached to your visa you must not marry or enter into a de facto relationship before you enter Australia If condition 8502 is attached to your visa you must not enter Australia before the person specified has entered Australia. Business Owner, State/Territory Sponsored Business Owner, Senior Executive and State/Territory Sponsored Senior Executive provisional visa holders Details You need to provide valuable input into the Australian economy. You must: obtain and maintain substantial ownership interest in a business in Australia participate, at a senior level, in the day-to-day management and decision-making of that business. In the business, it is expected that you will do at least one of the following: develop business links with international markets create or maintain employment in Australia export Australian goods produce goods or services that would otherwise be imported introduce new or improved technology add to commercial activity and competitiveness within the Australian economy. A failure to meet these obligations while holding a Business Skills (Provisional) visa may impact adversely upon any late application for a Business Skills (Residence) visa. Holders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category. Investor and State/Territory Investor visa holders Details Applicants for Investor visas must maintain their Designated Investment for a four year term. Failure to do so may result in visa cancellation. Holders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Business Skills (provisional) visas (subclasses 160-165)\n\nBusiness Skills (provisional) visas (subclasses 160-165)\nPage Content\n\n​​The following visas are closed to most new applications:\n\n​​The following visas are closed to most new applications:\n- the Business Owner (Provisional) visa (subclass 160)\nthe Business Owner (Provisional) visa (subclass 160)\n- the Senior Executive (Provisional) visa (subclass 161)\nthe Senior Executive (Provisional) visa (subclass 161)\n- the Investor (Provisional) visa (subclass 162)\nthe Investor (Provisional) visa (subclass 162)\n- the State/Territory Sponsored Business Owner (Provisional) visa (subclass 163)\nthe State/Territory Sponsored Business Owner (Provisional) visa (subclass 163)\n- the State/Territory Sponsored Senior Executive (Provisional) visa (subclass (164)\nthe State/Territory Sponsored Senior Executive (Provisional) visa (subclass (164)\n- the State/Territory Sponsored Investor (Provisional) visa (subclass 165).\nthe State/Territory Sponsored Investor (Provisional) visa (subclass 165).\n\nFamily members of people who already hold these visas might be able to get the same visa.\n\nFamily members of people who already hold these visas might be able to get the same visa.\n\nIf you have already applied for one of these visas and it has not yet been decided, you can also add your dependent children or your partner’s dependent children to your visa application until the application is decided.\n\nIf you have already applied for one of these visas and it has not yet been decided, you can also add your dependent children or your partner’s dependent children to your visa application until the application is decided.\n\nYour eligible family members can apply for this visa when they are in or outside Australia.\n\nYour eligible family members can apply for this visa when they are in or outside Australia.\n\nSomeone who applies for this visa must be outside Australia when it is granted unless they held a student visa when they applied. In this case, they can be in or outside Australia when the visa is granted.\n\nSomeone who applies for this visa must be outside Australia when it is granted unless they held a student visa when they applied. In this case, they can be in or outside Australia when the visa is granted.\n\n## Visa Applicants\n\nVisa Applicants\n\nThis visa is closed to new applicants. Dependent children can be added to the visa application at any time until the application is decided.\n\nThis visa is closed to new applicants. Dependent children can be added to the visa application at any time until the application is decided.\nDetails\n\n### Adding dependent children to a visa application\n\nAdding dependent children to a visa application\nDetails\n\nDependent children can be added to the visa application at any time until the application is decided. Dependent children are your or your partner's children who:\n\nDependent children can be added to the visa application at any time until the application is decided. Dependent children are your or your partner's children who:\n- have not turned 18 years of age, or have turned 18 but cannot work due to incapacity\nhave not turned 18 years of age, or have turned 18 but cannot work due to incapacity\n- are not married or engaged to be married or have  a de facto partner.\nare not married or engaged to be married or have  a de facto partner.\n\nTo add dependent children, complete:\n\nTo add dependent children, complete:\n- Form 47BT — Application for a Business Skills (provisional) visa (579KB PDF)Application for a Business Skills (provisional) visa\nForm 47BT — Application for a Business Skills (provisional) visa (579KB PDF)\nApplication for a Business Skills (provisional) visa\n\nThe documents listed in the document checklist must be provided with this application form.\n\nThe documents listed in the document checklist must be provided with this application form.\n\n### Applying as a family member\n\nApplying as a family member\nDetails\n\nFamily members of someone who already has one of these visas, or who has lodged an application that has not yet been decided, might be able to get the same visa. The family members must be their:\n\nFamily members of someone who already has one of these visas, or who has lodged an application that has not yet been decided, might be able to get the same visa. The family members must be their:\n- partner (married or de facto)\npartner (married or de facto)\n- dependent children or their partner’s dependent children\ndependent children or their partner’s dependent children\n- other dependent relatives.\nother dependent relatives.\n\nThese family members must meet the requirements forincluding family members in your application. The application must include documentary evidence of their relationship to you.​​\n\nThese family members must meet the requirements for\nincluding family members in your application\n. The application must include documentary evidence of their relationship to you.​​\n\nYour family members must be able to show that they meethealthandcharacterrequirements.​\n\nYour family members must be able to show that they meet\nhealth\nand\ncharacter\nrequirements.​\n\nThe family members might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English.\n\nThe family members might also need to take the International English Language Testing System (IELTS) test to show how well they speak, ready and write English.\n\nComplete the following form to apply for one of the visas:\n\nComplete the following form to apply for one of the visas:\n- Form 47BT — Application for a Business Skills (provisional) visa (579KB PDF)\nForm 47BT — Application for a Business Skills (provisional) visa (579KB PDF)\n\nSubmit the documents listed in the document checklist with the application and pay the visa application charge by credit card, money order or bank cheque.\n\nSubmit the documents listed in the document checklist with the application and pay the visa application charge by credit card, money order or bank cheque.\n\n#### Health requirements\n\nHealth requirements\nDetails\n\nYou must meet certainhealth requirements. However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to.\n\nYou must meet certain\nhealth requirements\n. However, most applicants for this visa will not be required to complete additional health examinations. Do not arrange a health examination until we ask you to.\n\n#### Character requirements\n\nCharacter requirements\nDetails\n\nYou must meet certaincharacter requirements. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age.\n\nYou must meet certain\ncharacter requirements\n. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age.\n\n#### Debts to the Australian Government\n\nDebts to the Australian Government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n### Cost\n\nCost\nDetails\n\nBusiness Owner (Subclass 160):\n\nBusiness Owner (Subclass 160):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\nSenior Executive (Subclass 161):\n\nSenior Executive (Subclass 161):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\nInvestor (Subclass 162):\n\nInvestor (Subclass 162):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\nState/Territory Sponsored Business Owner (Subclass 163):\n\nState/Territory Sponsored Business Owner (Subclass 163):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\nState/Territory Sponsored Senior Executive (Subclass 164):\n\nState/Territory Sponsored Senior Executive (Subclass 164):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\nBusiness Skills (Provisional) (Class UR) (Subclass 165):\n\nBusiness Skills (Provisional) (Class UR) (Subclass 165):\n- Additional applicant charge 18 and over — AUD2,340\nAdditional applicant charge 18 and over — AUD2,340\n- Additional applicant charge under 18 — AUD1,170\nAdditional applicant charge under 18 — AUD1,170\n\n### Where to lodge your application\n\nWhere to lodge your application\nDetails\n- If you live in the People's Republic of China (PRC), Hong Kong (SAR), Macau (SAR) or Taiwan: send the documents to theAustralian Consulate-General Hong Kong\nIf you live in the People's Republic of China (PRC), Hong Kong (SAR), Macau (SAR) or Taiwan: send the documents to the\nAustralian Consulate-General Hong Kong\n- If you live elsewhere: send your documents by registered post to ourAdelaide officein South Australia - attention Client Services, Adelaide Business Skills Processing Centre.\nIf you live elsewhere: send your documents by registered post to our\nAdelaide office\nin South Australia - attention Client Services, Adelaide Business Skills Processing Centre.\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information\n\n#### Wait for a decision\n\nWait for a decision\nDetails\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nIf you applied for this visa outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\n\nIf you applied for this visa outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 — Notification of incorrect answer(s)  (168KB PDF)\nForm 1023 — Notification of incorrect answer(s)  (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\n#### Withdrawing your application\n\nWithdrawing your application\n\nSee:Withdrawing your application\n\nSee:\nWithdrawing your application\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will let you know:\n\nIf the visa is granted, we will let you know:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.​\nany conditions attached to the visa.​\n\nIf the visa is not granted, we will let you know:\n\nIf the visa is not granted, we will let you know:\n- why the visa was refused\nwhy the visa was refused\n- your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\nyour review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\n- the time limit for lodging an appeal.\nthe time limit for lodging an appeal.\n\n### Document checklist\n\nDocument checklist\nDetails\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nUse this checklist to make sure your application is complete.\n\nUse this checklist to make sure your application is complete.\n\n#### Forms\n\nForms\nDetails\n- Form 80 - Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 - Personal particulars for assessment including character assessment (596KB PDF)\n- For any member of your family unit included in the application who is 18 years of age or older and is not your partner:Form 47a — Details of child or other dependent family member aged 18 years or over (307KB PDF)Details of child or other dependent family member aged 18 years or over(238 kB PDF).\nFor any member of your family unit included in the application who is 18 years of age or older and is not your partner:\n- Form 47a — Details of child or other dependent family member aged 18 years or over (307KB PDF)Details of child or other dependent family member aged 18 years or over(238 kB PDF).\nForm 47a — Details of child or other dependent family member aged 18 years or over (307KB PDF)\nDetails of child or other dependent family member aged 18 years or over\n(238 kB PDF).\n- For each member of your family unit (child) included in the application who is 16 years of age or older:Form 80 - Personal particulars for assessment including character assessment (596KB PDF).\nFor each member of your family unit (child) included in the application who is 16 years of age or older:\n- Form 80 - Personal particulars for assessment including character assessment (596KB PDF).\nForm 80 - Personal particulars for assessment including character assessment (596KB PDF)\n.\n\n#### Identity\n\nIdentity\nDetails\n- Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\nCertified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\n- Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.These photographs should be of the head and shoulders only against a plain background.Print the name of the person on the back of each photograph.\nTwo recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.\n- These photographs should be of the head and shoulders only against a plain background.\nThese photographs should be of the head and shoulders only against a plain background.\n- Print the name of the person on the back of each photograph.\nPrint the name of the person on the back of each photograph.\n- Certified copies of birth certificates or the family book showing the names of both parents of all your dependent children.\nCertified copies of birth certificates or the family book showing the names of both parents of all your dependent children.\n- If your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change.\nIf your name has changed or the name of anyone included in your application has changed: a certified copy of evidence of the name change.\n\n#### Family\n\nFamily\nDetails\n- If any dependent child included in the application is adopted: certified copies of the adoption papers.\nIf any dependent child included in the application is adopted: certified copies of the adoption papers.\n- If you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as:If you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship orderstatutory declarationgiving their permissionForm 1229 — Consent to grant an Australian visa to a child under the age of 18 years  (276KB PDF).\nIf you want to bring a child younger than 18 years of age with you to Australia, and that child’s other parent is not included in the application: documentary evidence that you have the legal right to bring that child to Australia, such as:\n\nIf you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.\n\nIf you use Form 1229 or a statutory declaration, you will have to attach a certified copy of the other parent’s government-issued identification document (such as a passport or driver's licence) with their photograph and signature.\n- certified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order\ncertified copies of official legal documents, such as a court-issued parental responsibility (custody), access or guardianship order\n- statutory declarationgiving their permission\n\nstatutory declarationgiving their permission\n\nstatutory declaration\ngiving their permission\n- Form 1229 — Consent to grant an Australian visa to a child under the age of 18 years  (276KB PDF).\nForm 1229 — Consent to grant an Australian visa to a child under the age of 18 years  (276KB PDF)\n.\n- Evidence of financial dependency for all your members of the family unit aged 18 or older:a certified copy of their birth certificate and proof of their relationship to youproof that they live in your householdproof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\nEvidence of financial dependency for all your members of the family unit aged 18 or older:\n- a certified copy of their birth certificate and proof of their relationship to you\na certified copy of their birth certificate and proof of their relationship to you\n- proof that they live in your household\nproof that they live in your household\n- proof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\nproof that they have been financially dependent on you for at least the 12 months immediately before you lodge your application.\n- Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nCertified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\n- If you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets).\nIf you are living in a de facto relationship: independent evidence that your relationship is genuine and continuing (for example, joint bank account statements, billing accounts in joint names or joint ownership of major assets).\n- If you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, orstatutory declarationseparation documents.\nIf you or anyone included in the application has been widowed, divorced or permanently separated: a certified copy of the death certificate, divorce documents, or\nstatutory declaration\nseparation documents.\n\n#### Character requirements\n\nCharacter requirements\nDetails\n- Police checks for everyone included in the visa application who is 16 years of age or older:an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of agepolice certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\nPolice checks for everyone included in the visa application who is 16 years of age or older:\n- an Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age\nan Australian National Police Check for anyone who has spent a cumulative total of 12 months or more in Australia since turning 16 years of age\n- police certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\npolice certificates from each country in which anyone in your application has spent a cumulative total of 12 months or more in the past 10 years since turning 16 years of age.\n\nProvide the original certificates and keep a copy for yourself.\n\nProvide the original certificates and keep a copy for yourself.\n- If anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers.\nIf anyone included in the application has served in the armed forces of any country: certified copies of their military service record or discharge papers.\n\n#### Health requirements\n\nHealth requirements\nDetails\n- Documents to show you meet Australia’s health requirements:Applying outside Australia:medical and x-ray examinations by a panel doctor for you and any family member planning to stay with you in AustraliaApplying in Australia:evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\nDocuments to show you meet Australia’s health requirements:\n- Applying outside Australia:medical and x-ray examinations by a panel doctor for you and any family member planning to stay with you in Australia\nApplying outside Australia:\nmedical and x-ray examinations by a panel doctor for you and any family member planning to stay with you in Australia\n- Applying in Australia:evidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\nApplying in Australia:\nevidence of a booking or receipt from Bupa Medical Visa Services for your medical and x-ray examinations.\n\n#### English language ability\n\nEnglish language ability\nDetails\n\nYou should have at least functional English.\n\nYou should have at least functional English.\n\nApplicants and dependants (18 years and older) who cannot provide evidence of having at least functional English must pay a second instalment of the visa application charge.\n\nApplicants and dependants (18 years and older) who cannot provide evidence of having at least functional English must pay a second instalment of the visa application charge.\n\nIf they have less than functional English provide a statement indicating your intention to pay the second visa application charge.\n\nIf they have less than functional English provide a statement indicating your intention to pay the second visa application charge.\n\nTo prove you have fu​​nction​al English you must provide evidence of one of the following:\n\nTo prove you have fu​​nction​al English you must provide evidence of one of the following:\n- You are the holder of a valid passport issued by the United Kingdom, the United States of America, Canada, New Zealand, or the Republic of Ireland and you are a citizen of that country.\nYou are the holder of a valid passport issued by the United Kingdom, the United States of America, Canada, New Zealand, or the Republic of Ireland and you are a citizen of that country.\n- An International English Language Testing System (IELTS) test result of an average band score of at least 4.5 based on the four test components of speaking, reading, listening and writing. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\nAn International English Language Testing System (IELTS) test result of an average band score of at least 4.5 based on the four test components of speaking, reading, listening and writing. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\n- A Test of English as a Foreign Language internet-based Test (TOEFL iBT) test result of a total band score of at least 32 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\nA Test of English as a Foreign Language internet-based Test (TOEFL iBT) test result of a total band score of at least 32 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\n- A Pearson Test of English (PTE) Academic test result of an overall band score of at least 30 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\nA Pearson Test of English (PTE) Academic test result of an overall band score of at least 30 based on the four test components of speaking, reading, writing and listening. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\n- A Cambridge English: Advanced (CAE) test result of an overall band score of at least 147 based on the four test components of speaking, reading, writing and listening and the test must have been taken on or after 1 January 2015. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\nA Cambridge English: Advanced (CAE) test result of an overall band score of at least 147 based on the four test components of speaking, reading, writing and listening and the test must have been taken on or after 1 January 2015. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\n- A positive assessment by an Adult Migrant English Program service provider in Australia that you have functional English.\nA positive assessment by an Adult Migrant English Program service provider in Australia that you have functional English.\n- Completed all years of primary education and at least three years of secondary education in an educational institution in or outside Australia and all instructions were in English.\nCompleted all years of primary education and at least three years of secondary education in an educational institution in or outside Australia and all instructions were in English.\n- Completed at least five years of secondary education in an institution in or outside Australia and all instructions were in English.\nCompleted at least five years of secondary education in an institution in or outside Australia and all instructions were in English.\n- Successfully completed at least one year of full-time study or equivalent part-time study towards a degree, higher degree, diploma, or associate diploma in an institution in Australia and all instructions were in English.\nSuccessfully completed at least one year of full-time study or equivalent part-time study towards a degree, higher degree, diploma, or associate diploma in an institution in Australia and all instructions were in English.\n- Completed a degree, a higher degree, a diploma or a trade certificate that required at least two years of full-time study or training in an institution in or outside Australia and all instructions were in English.\nCompleted a degree, a higher degree, a diploma or a trade certificate that required at least two years of full-time study or training in an institution in or outside Australia and all instructions were in English.\n- The functional level of the Australian Assessment of Communicative English Skills (ACCESS) test certified by the relevant testing body. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\nThe functional level of the Australian Assessment of Communicative English Skills (ACCESS) test certified by the relevant testing body. Your test must have been completed within 12 months of visa application lodgement or can be completed during visa application processing.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted one of the following visas:\n\nThis information is for people who have already been granted one of the following visas:\n- the Business Owner (Provisional) visa (subclass 160)\nthe Business Owner (Provisional) visa (subclass 160)\n- the Senior Executive (Provisional) visa (subclass 161)\nthe Senior Executive (Provisional) visa (subclass 161)\n- the Investor (Provisional) visa (subclass 162)\nthe Investor (Provisional) visa (subclass 162)\n- the State/Territory Sponsored Business Owner (Provisional) visa (subclass 163)\nthe State/Territory Sponsored Business Owner (Provisional) visa (subclass 163)\n- the State/Territory Sponsored Senior Executive (Provisional) visa (subclass 164)\nthe State/Territory Sponsored Senior Executive (Provisional) visa (subclass 164)\n- the State/Territory Sponsored Investor (Provisional) visa (subclass 165).\nthe State/Territory Sponsored Investor (Provisional) visa (subclass 165).\n\nIt explains your rights and obligations.\n\nIt explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you are outside Australia when the visa is granted, you will need to enter Australia by a specified date. The visa is usually valid for four years from the date specified for your first entry to Australia.\n\nIf you are outside Australia when the visa is granted, you will need to enter Australia by a specified date. The visa is usually valid for four years from the date specified for your first entry to Australia.\n\n### What your visa lets you do\n\nWhat your visa lets you do\nDetails\n\nThis visa allows you and any family members who have been granted this visa to:\n\nThis visa allows you and any family members who have been granted this visa to:\n- live, work and study in Australia\nlive, work and study in Australia\n- apply for permanent residence (if you are eligible)\napply for permanent residence (if you are eligible)\n- travel in and out of Australia any number of times as long as the visa is valid.\ntravel in and out of Australia any number of times as long as the visa is valid.\n\nYou cannot access Medicare, family assistance or social security benefits.\n\nYou cannot access Medicare, family assistance or social security benefits.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou might also need to comply with the following conditions:\n\nYou might also need to comply with the following conditions:\n- If condition 8515 is attached to your visa you must not marry or enter into a de facto relationship before you enter Australia\nIf condition 8515 is attached to your visa you must not marry or enter into a de facto relationship before you enter Australia\n- If condition 8502 is attached to your visa you must not enter Australia before the person specified has entered Australia.\nIf condition 8502 is attached to your visa you must not enter Australia before the person specified has entered Australia.\n\n#### Business Owner, State/Territory Sponsored Business Owner, Senior Executive and State/Territory Sponsored Senior Executive provisional visa holders\n\nBusiness Owner, State/Territory Sponsored Business Owner, Senior Executive and State/Territory Sponsored Senior Executive provisional visa holders\nDetails\n\nYou need to provide valuable input into the Australian economy. You must:\n\nYou need to provide valuable input into the Australian economy. You must:\n- obtain and maintain substantial ownership interest in a business in Australia\nobtain and maintain substantial ownership interest in a business in Australia\n- participate, at a senior level, in the day-to-day management and decision-making of that business.\nparticipate, at a senior level, in the day-to-day management and decision-making of that business.\n\nIn the business, it is expected that you will do at least one of the following:\n\nIn the business, it is expected that you will do at least one of the following:\n- develop business links with international markets\ndevelop business links with international markets\n- create or maintain employment in Australia\ncreate or maintain employment in Australia\n- export Australian goods\nexport Australian goods\n- produce goods or services that would otherwise be imported\nproduce goods or services that would otherwise be imported\n- introduce new or improved technology\nintroduce new or improved technology\n- add to commercial activity and competitiveness within the Australian economy.\nadd to commercial activity and competitiveness within the Australian economy.\n\nA failure to meet these obligations while holding a Business Skills (Provisional) visa may impact adversely upon any late application for a Business Skills (Residence) visa.\n\nA failure to meet these obligations while holding a Business Skills (Provisional) visa may impact adversely upon any late application for a Business Skills (Residence) visa.\n\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.\n\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.\n\n#### Investor and State/Territory Investor visa holders\n\nInvestor and State/Territory Investor visa holders\nDetails\n\nApplicants for Investor visas must maintain their Designated Investment for a four year term. Failure to do so may result in visa cancellation.\n\nApplicants for Investor visas must maintain their Designated Investment for a four year term. Failure to do so may result in visa cancellation.\n\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.\n\nHolders of these visas may be asked to complete a monitoring survey to provide us with information about any business activities undertaken in Australia. This assists in reporting on outcomes of the Business Skills category.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-skills-provisional-visas-subclasses-160-165#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-skills-provisional-visas-subclasses-160-165#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:26:11.265661",
  "metadata": {}
}