{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/training-and-research-visa-subclass-402",
  "title": "Training and Research visa (subclass 402)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Training and Research visa (subclass 402) Page Content ​​The Training and Research visa (subclass 402) is closed to new applications from 19 November 2016. You might be eligible to apply for Training visa (subclass 407) or Temporary Activity visa (subclass 408) You might want to consider the Training visa (subclass 407) if you intend to: undertake occupational training participate in classroom based professional development programme. You might want to consider the Temporary Activity visa (subclass 408) if you are: an academic who is invited to collaborate in a research project by an Australian tertiary or research institution or a student or recent graduate who wants to undertake a research activity at an Australian tertiary or research institution related to your field of study an elite sportsperson participating in high level sports training. Visa holders This information is for people who have already been granted a Training and Research visa (subclass 402). It explains your rights and ob​ligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. Details How long your​ visa​​ ​lasts Details This visa is valid for the period of the position, usually up to a maximum of: Occupational Trainee stream: two years Professional Development stream: 18 months Research stream: 12 months. Renewing your visa Occupational Trainee and Research streams: If you want to stay longer when you are in Australia, you must lodge a new application for this visa, including all relevant documents. You will also have to pay the visa application charge. If your visa was granted in the Occupational Trainee stream, you might have to provide an explanation of why you were unable to complete the training within the initial training period. Professional Development stream: You cannot apply or reapply for this visa while you are in Australia. What this visa lets you do Details This visa allows you to: enter Australia at any time after your visa is granted, if you are outside Australia at the time of visa grant stay in Australia for the nominated duration of the training, research position or program do the training or activity specified in your visa application travel to and from Australia as many times as you want until you have finished participating in the program or your visa expires, whichever occurs first. If you hold this visa under the Occupational Trainee or Research streams, you could also bring your family with you. Your family: might not be able to be in Australia without you: they might need to enter Australia with you or after you they might need to leave Australia with you or before you must intend to remain members of your family unit. Family members in the Occupational Trainee stream can only work for up to 40 hours a fortnight. Family members in the Research stream might have unrestricted work rights. Your obligations Details You and your family must comply with all visa conditions and Australian laws. During your stay in Australia, you must: maintain adequate health insurance for the duration of your stay in Australia continue to meet the requirements of the visa stream in which you were granted the visa leave Australia before your visa ends. Occupational Trainee stream Details You must: participate fully in the occupational training (you cannot stop participating) not do any work other than the approved occupational training program specified in your visa application not become unemployed, leave your workplace-based training to work for someone else, or work for someone else in a second job not do any other activities that could affect your participation in the occupational training tell your sponsor if your personal circumstances change, such as if you cannot continue the training tell your sponsor if you have any concerns about the training program. If you decide to train with another organisation while in Australia, you will need to be sponsored by that organisation, which must lodge a nomination. When the new nomination is approved you will be able to do workplace-based occupational training for that organisation for the period left on your visa without having to apply for a new visa. If your sponsor ceases your employment training you must notify the department and find another employer who is willing to sponsor you. Your family members cannot work for more than 40 hours a fortnight. Research stream Details You must: continue in the position for which your visa was granted not do any work other than the research for the position in relation to which your visa was granted engage only in activities that are consistent with the activities specified in your visa application do research for the employer who sponsored you for the visa not become unemployed, leave your job to work for someone else, or work for someone else in a second job not receive a salary. If your sponsor ceases your employment or training, you must notify the department and find another employer who is willing to sponsor you. Professional Development stream Details You must: participate fully in the professional development program (you cannot stop participating or change the programs) not pay any of the participant costs for which your sponsor is liable under the professional development agreement. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation Sponsors This information is for approved sponsors of people on a Training and Research visa (subclass 402). Details You can use Visa Entitlement Verification Online (VEVO for Organisations) to check the visa status and entitlements of people you have sponsored. You cannot apply to sponsor applicants for this visa because it is no longer open to new applications. As an approved sponsor, you can no longer nominate someone for this visa. If you were approved as a training and research sponsor before 19 November 2016 you can use this approval to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your sponsorship approval ceases (whatever is earlier). From 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant after this date. If you applied for approval as a training and research or professional development sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Training visa (subclass 407) or Temporary Activity visa (subclass 408) applications until 18 May 2017. Sponsor obligations Details You must comply with the following sponsorship obligations: cooperate with inspectors tell us when certain events occur keep records provide records and information to the Minister not recover from, transfer or charge certain costs to another person pay costs to locate and remove an unlawful non-citizen ensure the visa holder participates in the nominated occupation, program or activity. Depending on the stream in which you made a nomination, you could also be required to comply with the following sponsorship obligations: secure an offer of a reasonable standard of accommodation pay travel costs to enable sponsored people to leave Australia You are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent. Cooperate with inspectors Details You must cooperate with inspectors appointed under the Migration Act 1958 (the Act) who are investigating whether: a sponsorship obligation is being, or has been, complied with you have hired an illegal worker there are other circumstances in which we could take administrative action. This obligation: starts on the day the sponsorship is approved ends five years after the day the approved sponsorship ceases Cooperating with inspectors can include (but is not limited to): providing access to premises producing and providing documents within the requested timeframe not preventing or attempting to prevent access to a person who has custody of, or access to, a record or documents providing officers with access to interview any person on their premises. Keep records Details You must keep records to show how you have complied with your obligation to tell the department when certain events occur. All records must be reproducible and some must be capable of verification by an independent person. You must keep a record of: a notification that you were required to make to the department the date on which you notified the department, and how and where you made the notification. This obligation: starts on the day the sponsorship is approved ends two years after: you cease to be an approved sponsor, and you are no longer sponsoring anyone. You do not need to keep any records for more than five years. Provide records and information to the Minister Details You must provide records or information, if they are requested by a departmental officer that goes to determining whether: a sponsorship obligation is being or has been complied with, and determining whether other circumstances, in which the Minister could take administrative action, exist or have existed, in the manner and timeframe requested by the department. We could ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that: you are required to keep under Commonwealth, state or territory law you have an obligation to keep as a sponsor. This obligation starts to apply on the day the sponsorship is approved. This obligation ends two years after: your sponsorship ceases, and you no longer have a sponsored visa holder. Tell us when certain events occur Details You must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring. Events where a sponsor must provide information to us include: a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details; the primary sponsored person fails to participate in the nominated occupation, program or activity the primary sponsored person ceases to participate in the nominated occupation, program or activity a change to the formal agreement between the primary sponsored person and the person the person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80. This obligation starts to apply on the day the sponsorship is approved. This obligation ends two years after: your sponsorship ceases, and you are no longer sponsoring anyone. Research stream If you are sponsoring someone under the Research stream, you must also notify the department: when the person you have sponsored stops doing research for you as soon as you know the date on which they will stop doing research for you about any change in the final date on which they will stop doing research for you. Professional Development stream If you are sponsoring someone under the Professional Development stream, you must also notify the department if: your capacity or a subcontractor's capacity to deliver the approved professional development program has changed you cease to exist as a legal entity or your legal structure changes (for example, if a new director is appointed, a new partner joins a partnership, or a new member is appointed to the managing committee of the organisation) you become insolvent, as defined in the Bankruptcy Act 1966 and the Corporations Act 2001 the person you have sponsored does not attend the professional development program and you did not authorise their absence if you are a company, a partner of a partnership, or a member of a managing committee of an unincorporated association, any of the following occur: an administrator is appointed for the sponsoring organisation the organisation resolves by special resolution to be wound up voluntarily a court has ordered that the organisation be wound up in insolvency a court has appointed an official liquidator to be the provisional liquidator of the organisation a court has approved a compromise or arrangement proposed by the organisation the property of the organisation becomes subject to a receiver or other controller procedures are initiated for the deregistration of the organisation. Where to send a notice of an event or change You must send details of these events by email or to one of our state or territory offices listed below. By email (preferred): sponsor.notifications@homeaffairs.gov.au By registered post: Australian Capital Territory Sponsor Monitoring GPO Box 717 Canberra ACT 2601 New South Wales Sponsor Monitoring GPO Box 9984 Sydney NSW 2001 Queensland Sponsor Monitoring GPO Box 9984 Brisbane Qld 4001 Northern Territory Sponsor Monitoring GPO Box 864 Darwin NT 0801 South Australia Sponsor Monitoring GPO Box 2399 Adelaide SA 5001 Tasmania Sponsor Monitoring GPO Box 794 Hobart Tas. 7001 Victoria Sponsor Monitoring GPO Box 241 Melbourne Vic. 3001 Western Australia Sponsor Monitoring Locked Bag 7 Northbridge WA 6865 Not recover, transfer or charge certain costs to another person Details You must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members. This includes costs that relate to: the recruitment of the person you sponsored becoming or being a sponsor or former approved sponsor. This obligation: starts on the day the sponsorship is approved ends on the following two events: you cease to be an approved sponsor you no longer have a sponsored visa holder. Sponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include: cost of sponsorship and nomination charges migration agent costs associated with the lodgement of sponsorship and nomination applications administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including: recruitment agent fees migration agent fees the cost of job advertising screening of candidates, short listing, interviews and reference checks salaries of recruitment or human resource staff the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position training of new staff responding to queries for prospective candidates, and advising unsuccessful applicants travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia. Pay costs to locate and remove an unlawful non-citizen Details In the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you could be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia. You could be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which could have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above). This obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia. Secure an offer of a reasonable standard of accommodation (Professional Development stream and volunteers under the Occupational Trainee stream only) Details You must meet this obligation only if you sponsor someone: under the Professional Development stream as a volunteer without a salary or wages under the Occupational Trainee stream. If you sponsor someone under these streams, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them. If the accommodation becomes unavailable, you must find alternative accommodation for them. A ‘reasonable standard of accommodation’ means you must: meet all relevant state or territory and local government regulations regarding fire, health and safety offer 24-hour access provide meals or a self-catering kitchen be clean and well-maintained have a lounge area have adequate laundry facilities or a laundry service provide power for lighting, cooking and refrigeration have an adequate ratio of guests to bathroom facilities have uncrowded sleeping areas provide appropriate gender segregated areas and bathroom facilities allow adequate privacy and secure storage for personal items. This obligation starts on the day: your nomination is approved, or the day the visa is granted (if the person you have sponsored does not already hold this visa). This obligation ends on the day (whichever is earliest): another sponsor has their nomination application for the same person approved the person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Ensure sponsored applicant participates in the nominated occupation, program or activity (Occupational Trainee stream only) Details This obligation applies to you only if you have sponsored someone under the Occupational Trainee stream. You must ensure that the person you have sponsored for this visa participates only in the position or activity for which you nominated them. If you want them to do workplace-based training in a different position, you must nominate them for that position and lodge a new nomination application. This obligation starts on the day the person you have sponsored for the position is granted a visa. If they already hold a visa, your obligation starts on the day the nomination is approved. This obligation ends on the day (whichever is earliest): on which another sponsor has their nomination for the same person approved on which person you have sponsored is granted a further substantive visa of a different subclass from the one they last held, and their new visa does not require them to work for you the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Pay travel costs to enable sponsored people to leave Australia (Professional Development stream only) Details This obligation applies to you only if you have sponsored someone under the Professional Development stream. You must pay reasonable and necessary travel costs to enable the person you have sponsored to leave Australia. The person must ask in writing. The department can also ask on their behalf. The costs will be considered reasonable and necessary if they include all of the following: travel from the sponsored persons’ usual place of residence in Australia to the place of departure from Australia travel from Australia to the country (for which the person holds a passport) specified in the request economy class air travel or, where unavailable, a reasonable equivalent. Travel costs must be paid within 30 days of receiving the request. This obligation starts: on the day the visa is granted (if the person does not already hold a visa in this subclass). This obligation ends on the day (whichever is the earliest): the person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you the person you have sponsored has left Australia and the relevant visa is no longer valid.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Training and Research visa (subclass 402)\n\nTraining and Research visa (subclass 402)\nPage Content\n\n​​The Training and Research visa (subclass 402) is closed to new applications from 19 November 2016.\n\n​​The Training and Research visa (subclass 402) is closed to new applications from 19 November 2016.\n\nYou might be eligible to apply forTraining visa (subclass 407)orTemporary Activity visa (subclass 408).\n\nYou might be eligible to apply for\nTraining visa (subclass 407)\nor\nTemporary Activity visa (subclass 408)\n.\n\nYou might want to consider the Training visa (subclass 407) if you intend to:\n\nYou might want to consider the Training visa (subclass 407) if you intend to:\n- undertake occupational training\nundertake occupational training\n- participate in classroom based professional development programme.\nparticipate in classroom based professional development programme.\n\nYou might want to consider the Temporary Activity visa (subclass 408) if you are:\n\nYou might want to consider the Temporary Activity visa (subclass 408) if you are:\n- an academic who is invited to collaborate in a research project by an Australian tertiary or research institution or\nan academic who is invited to collaborate in a research project by an Australian tertiary or research institution or\n- a student or recent graduate who wants to undertake a research activity at an Australian tertiary or research institution related to your field of study\na student or recent graduate who wants to undertake a research activity at an Australian tertiary or research institution related to your field of study\n- an elite sportsperson participating in high level sports training.\nan elite sportsperson participating in high level sports training.\n\n## Visa holders\n\nVisa holders\n\nThis information is for people who have already been granted a Training and Research visa (subclass 402). It explains your rights and ob​ligations.\n\nThis information is for people who have already been granted a Training and Research visa (subclass 402). It explains your rights and ob​ligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\nDetails\n\n### How long your​ visa​​ ​lasts\n\nHow long your​ visa​​ ​lasts\nDetails\n\nThis visa is valid for the period of the position, usually up to a maximum of:\n\nThis visa is valid for the period of the position, usually up to a maximum of:\n- Occupational Traineestream: two years\nOccupational Trainee\nstream: two years\n- Professional Developmentstream: 18 months\nProfessional Development\nstream: 18 months\n- Researchstream: 12 months.\nResearch\nstream: 12 months.\n\n#### Renewing your visa\n\nRenewing your visa\n\nOccupational Trainee and Research streams:\n\nOccupational Trainee and Research streams:\n\nIf you want to stay longer when you are in Australia, you must lodge a new application for this visa, including all relevant documents. You will also have to pay the visa application charge.\n\nIf you want to stay longer when you are in Australia, you must lodge a new application for this visa, including all relevant documents. You will also have to pay the visa application charge.\n\nIf your visa was granted in the Occupational Trainee stream, you might have to provide an explanation of why you were unable to complete the training within the initial training period.\n\nIf your visa was granted in the Occupational Trainee stream, you might have to provide an explanation of why you were unable to complete the training within the initial training period.\n\nProfessional Development stream:\n\nProfessional Development stream:\n\nYou cannot apply or reapply for this visa while you are in Australia.\n\nYou cannot apply or reapply for this visa while you are in Australia.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to:\n\nThis visa allows you to:\n- enter Australia at any time after your visa is granted, if you are outside Australia at the time of visa grant\nenter Australia at any time after your visa is granted, if you are outside Australia at the time of visa grant\n- stay in Australia for the nominated duration of the training, research position or program\nstay in Australia for the nominated duration of the training, research position or program\n- do the training or activity specified in your visa application\ndo the training or activity specified in your visa application\n- travel to and from Australia as many times as you want until you have finished participating in the program or your visa expires, whichever occurs first.\ntravel to and from Australia as many times as you want until you have finished participating in the program or your visa expires, whichever occurs first.\n\nIf you hold this visa under theOccupational TraineeorResearchstreams, you could also bring your family with you. Your family:\n\nIf you hold this visa under the\nOccupational Trainee\nor\nResearch\nstreams, you could also bring your family with you. Your family:\n- might not be able to be in Australia without you:they might need to enter Australia with you or after youthey might need to leave Australia with you or before you\nmight not be able to be in Australia without you:\n- they might need to enter Australia with you or after you\nthey might need to enter Australia with you or after you\n- they might need to leave Australia with you or before you\nthey might need to leave Australia with you or before you\n- must intend to remain members of your family unit.\nmust intend to remain members of your family unit.\n\nFamily members in the Occupational Trainee stream can only work for up to 40 hours a fortnight.\n\nFamily members in the Occupational Trainee stream can only work for up to 40 hours a fortnight.\n\nFamily members in the Research stream might have unrestricted work rights.\n\nFamily members in the Research stream might have unrestricted work rights.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia, you must:\n\nDuring your stay in Australia, you must:\n- maintainadequate health insurancefor the duration of your stay in Australia\nmaintain\nadequate health insurance\nfor the duration of your stay in Australia\n- continue to meet the requirements of the visa stream in which you were granted the visa\ncontinue to meet the requirements of the visa stream in which you were granted the visa\n- leave Australia before your visa ends.\nleave Australia before your visa ends.\n\n#### Occupational Trainee stream\n\nOccupational Trainee stream\nDetails\n\nYou must:\n\nYou must:\n- participate fully in the occupational training (you cannot stop participating)\nparticipate fully in the occupational training (you cannot stop participating)\n- not do any work other than the approved occupational training program specified in your visa application\nnot do any work other than the approved occupational training program specified in your visa application\n- not become unemployed, leave your workplace-based training to work for someone else, or work for someone else in a second job\nnot become unemployed, leave your workplace-based training to work for someone else, or work for someone else in a second job\n- not do any other activities that could affect your participation in the occupational training\nnot do any other activities that could affect your participation in the occupational training\n- tell your sponsor if your personal circumstances change, such as if you cannot continue the training\ntell your sponsor if your personal circumstances change, such as if you cannot continue the training\n- tell your sponsor if you have any concerns about the training program.\ntell your sponsor if you have any concerns about the training program.\n\nIf you decide to train with another organisation while in Australia, you will need to be sponsored by that organisation, which must lodge a nomination. When the new nomination is approved you will be able to do workplace-based occupational training for that organisation for the period left on your visa without having to apply for a new visa.\n\nIf you decide to train with another organisation while in Australia, you will need to be sponsored by that organisation, which must lodge a nomination. When the new nomination is approved you will be able to do workplace-based occupational training for that organisation for the period left on your visa without having to apply for a new visa.\n\nIf your sponsor ceases your employment training you must notify the department and find another employer who is willing to sponsor you.\n\nIf your sponsor ceases your employment training you must notify the department and find another employer who is willing to sponsor you.\n\nYour family members cannot work for more than 40 hours a fortnight.\n\nYour family members cannot work for more than 40 hours a fortnight.\n\n#### Research stream\n\nResearch stream\nDetails\n\nYou must:\n\nYou must:\n- continue in the position for which your visa was granted\ncontinue in the position for which your visa was granted\n- not do any work other than the research for the position in relation to which your visa was granted\nnot do any work other than the research for the position in relation to which your visa was granted\n- engage only in activities that are consistent with the activities specified in your visa application\nengage only in activities that are consistent with the activities specified in your visa application\n- do research for the employer who sponsored you for the visa\ndo research for the employer who sponsored you for the visa\n- not become unemployed, leave your job to work for someone else, or work for someone else in a second job\nnot become unemployed, leave your job to work for someone else, or work for someone else in a second job\n- not receive a salary.\nnot receive a salary.\n\nIf your sponsor ceases your employment or training, you must notify the department and find another employer who is willing to sponsor you.\n\nIf your sponsor ceases your employment or training, you must notify the department and find another employer who is willing to sponsor you.\n\n#### Professional Development stream\n\nProfessional Development stream\nDetails\n\nYou must:\n\nYou must:\n- participate fully in the professional development program (you cannot stop participating or change the programs)\nparticipate fully in the professional development program (you cannot stop participating or change the programs)\n- not pay any of the participant costs for which your sponsor is liable under the professional development agreement.\nnot pay any of the participant costs for which your sponsor is liable under the professional development agreement.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n## Sponsors\n\nSponsors\n\nThis information is for approved sponsors of people on a Training and Research visa (subclass 402).\n\nThis information is for approved sponsors of people on a Training and Research visa (subclass 402).\nDetails\n\nYou can useVisa Entitlement Verification Online (VEVO for Organisations)to check the visa status and entitlements of people you have sponsored.\n\nYou can use\nVisa Entitlement Verification Online (VEVO for Organisations)\nto check the visa status and entitlements of people you have sponsored.\n\nYou cannot apply to sponsor applicants for this visa because it is no longer open to new applications. As an approved sponsor, you can no longer nominate someone for this visa.\n\nYou cannot apply to sponsor applicants for this visa because it is no longer open to new applications. As an approved sponsor, you can no longer nominate someone for this visa.\n\nIf you were approved as a training and research sponsor before 19 November 2016 you can use this approval to sponsor aTraining visa (subclass 407)orTemporary Activity visa (subclass 408)applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your sponsorship approval ceases (whatever is earlier).\n\nIf you were approved as a training and research sponsor before 19 November 2016 you can use this approval to sponsor a\nTraining visa (subclass 407)\nor\nTemporary Activity visa (subclass 408)\napplicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your sponsorship approval ceases (whatever is earlier).\n\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant after this date.\n\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Training visa (subclass 407) or Temporary Activity visa (subclass 408) applicant after this date.\n\nIf you applied for approval as a training and research or professional development sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Training visa (subclass 407) or Temporary Activity visa (subclass 408) applications until 18 May 2017.\n\nIf you applied for approval as a training and research or professional development sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Training visa (subclass 407) or Temporary Activity visa (subclass 408) applications until 18 May 2017.\n\n### Sponsor obligations\n\nSponsor obligations\nDetails\n\nYou must comply with the following sponsorship obligations:\n\nYou must comply with the following sponsorship obligations:\n- cooperate with inspectors\ncooperate with inspectors\n- tell us when certain events occur\ntell us when certain events occur\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- pay costs  to locate and remove an unlawful non-citizen\npay costs  to locate and remove an unlawful non-citizen\n- ensure the visa holder participates in the nominated occupation, program or activity.\nensure the visa holder participates in the nominated occupation, program or activity.\n\nDepending on the stream in which you made a nomination, you could also be required to comply with the following sponsorship obligations:\n\nDepending on the stream in which you made a nomination, you could also be required to comply with the following sponsorship obligations:\n- secure an offer of a reasonable standard of accommodation\nsecure an offer of a reasonable standard of accommodation\n- pay travel costs to enable sponsored people  to leave Australia\npay travel costs to enable sponsored people  to leave Australia\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\n#### Cooperate with inspectors\n\nCooperate with inspectors\nDetails\n\nYou must cooperate with inspectors appointed under theMigration Act 1958(the Act) who are investigating whether:\n\nYou must cooperate with inspectors appointed under the\nMigration Act 1958\n(the Act) who are investigating whether:\n- a sponsorship obligation is being, or has been, complied with\na sponsorship obligation is being, or has been, complied with\n- you have hired an illegal worker\nyou have hired an illegal worker\n- there are other circumstances in which we could take administrative action.\nthere are other circumstances in which we could take administrative action.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved\nstarts on the day the sponsorship is approved\n- ends five years after the day the approved sponsorship ceases\nends five years after the day the approved sponsorship ceases\n\nCooperating with inspectors can include (but is not limited to):\n\nCooperating with inspectors can include (but is not limited to):\n- providing access to premises\nproviding access to premises\n- producing and providing documents within the requested timeframe\nproducing and providing documents within the requested timeframe\n- not preventing or attempting to prevent access to a person who has custody of, or access to, a record or documents\nnot preventing or attempting to prevent access to a person who has custody of, or access to, a record or documents\n- providing officers with access to interview any person on their premises.\nproviding officers with access to interview any person on their premises.\n\n#### Keep records\n\nKeep records\nDetails\n\nYou must keep records to show how you have complied with your obligation to tell the department when certain events occur. All records must be reproducible and some must be capable of verification by an independent person.\n\nYou must keep records to show how you have complied with your obligation to tell the department when certain events occur. All records must be reproducible and some must be capable of verification by an independent person.\n\nYou must keep a record of:\n\nYou must keep a record of:\n- a notification that you were required to make to the department\na notification that you were required to make to the department\n- the date on which you notified the department, and how and where you made the notification.\nthe date on which you notified the department, and how and where you made the notification.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved\nstarts on the day the sponsorship is approved\n- ends two years after:you cease to be an approved sponsor, andyou are no longer sponsoring anyone.\nends two years after:\n- you cease to be an approved sponsor, and\nyou cease to be an approved sponsor, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nYou do not need to keep any records for more than five years.\n\nYou do not need to keep any records for more than five years.\n\n#### Provide records and information to the Minister\n\nProvide records and information to the Minister\nDetails\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n- a sponsorship obligation is being or has been complied with, and\na sponsorship obligation is being or has been complied with, and\n- determining whether other circumstances, in which the Minister could take administrative action, exist or have existed, in the manner and timeframe requested by the department.\ndetermining whether other circumstances, in which the Minister could take administrative action, exist or have existed, in the manner and timeframe requested by the department.\n\nWe could ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n\nWe could ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n- you are required to keep under Commonwealth, state or territory law\nyou are required to keep under Commonwealth, state or territory law\n- you have an obligation to keep as a sponsor.\nyou have an obligation to keep as a sponsor.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship ceases, and\nyour sponsorship ceases, and\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\n#### Tell us when certain events occur\n\nTell us when certain events occur\nDetails\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nEvents where a sponsor must provide information to us include:\n\nEvents where a sponsor must provide information to us include:\n- a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details;\na change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details;\n- the primary sponsored person fails to participate in the nominated occupation, program or activity\nthe primary sponsored person fails to participate in the nominated occupation, program or activity\n- the primary sponsored person ceases to participate in the nominated occupation, program or activity\nthe primary sponsored person ceases to participate in the nominated occupation, program or activity\n- a change to the formal agreement between the primary sponsored person and the person\na change to the formal agreement between the primary sponsored person and the person\n- the person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80.\nthe person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship ceases, and\nyour sponsorship ceases, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nResearch stream\n\nResearch stream\n\nIf you are sponsoring someone under theResearchstream, you must also notify the department:\n\nIf you are sponsoring someone under the\nResearch\nstream, you must also notify the department:\n- when the person you have sponsored stops doing research for you\nwhen the person you have sponsored stops doing research for you\n- as soon as you know the date on which they will stop doing research for you\nas soon as you know the date on which they will stop doing research for you\n- about any change in the final date on which they will stop doing research for you.\nabout any change in the final date on which they will stop doing research for you.\n\nProfessional Development stream\n\nProfessional Development stream\n\nIf you are sponsoring someone under theProfessional Developmentstream, you must also notify the department if:\n\nIf you are sponsoring someone under the\nProfessional Development\nstream, you must also notify the department if:\n- your capacity or a subcontractor's capacity to deliver the approved professional development program has changed\nyour capacity or a subcontractor's capacity to deliver the approved professional development program has changed\n- you cease to exist as a legal entity or your legal structure changes (for example, if a new director is appointed, a new partner joins a partnership, or a new member is appointed to the managing committee of the organisation)\nyou cease to exist as a legal entity or your legal structure changes (for example, if a new director is appointed, a new partner joins a partnership, or a new member is appointed to the managing committee of the organisation)\n- you become insolvent, as defined in theBankruptcy Act 1966and theCorporations Act 2001\nyou become insolvent, as defined in the\nBankruptcy Act 1966\nand the\nCorporations Act 2001\n- the person you have sponsored does not attend the professional development program and you did not authorise their absence\nthe person you have sponsored does not attend the professional development program and you did not authorise their absence\n- if you are a company, a partner of a partnership, or a member of a managing committee of an unincorporated association, any of the following occur:an administrator is appointed for the sponsoring organisationthe organisation resolves by special resolution to be wound up voluntarilya court has ordered that the organisation be wound up in insolvencya court has appointed an official liquidator to be the provisional liquidator of the organisationa court has approved a compromise or arrangement proposed by the organisationthe property of the organisation becomes subject to a receiver or other controllerprocedures are initiated for the deregistration of the organisation.\nif you are a company, a partner of a partnership, or a member of a managing committee of an unincorporated association, any of the following occur:\n- an administrator is appointed for the sponsoring organisation\nan administrator is appointed for the sponsoring organisation\n- the organisation resolves by special resolution to be wound up voluntarily\nthe organisation resolves by special resolution to be wound up voluntarily\n- a court has ordered that the organisation be wound up in insolvency\na court has ordered that the organisation be wound up in insolvency\n- a court has appointed an official liquidator to be the provisional liquidator of the organisation\na court has appointed an official liquidator to be the provisional liquidator of the organisation\n- a court has approved a compromise or arrangement proposed by the organisation\na court has approved a compromise or arrangement proposed by the organisation\n- the property of the organisation becomes subject to a receiver or other controller\nthe property of the organisation becomes subject to a receiver or other controller\n- procedures are initiated for the deregistration of the organisation.\nprocedures are initiated for the deregistration of the organisation.\n\nWhere to send a notice of an event or change\n\nWhere to send a notice of an event or change\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nBy email(preferred):sponsor.notifications@homeaffairs.gov.au\n\nBy email\n(preferred):\nsponsor.notifications@homeaffairs.gov.au\n\nBy registered post:\n\nBy registered post:\n- Australian Capital TerritorySponsor MonitoringGPO Box 717Canberra ACT 2601\nAustralian Capital Territory\nSponsor Monitoring\nGPO Box 717\nCanberra ACT 2601\n- New South WalesSponsor MonitoringGPO Box 9984Sydney NSW 2001\nNew South Wales\nSponsor Monitoring\nGPO Box 9984\nSydney NSW 2001\n- QueenslandSponsor MonitoringGPO Box 9984Brisbane Qld 4001\nQueensland\nSponsor Monitoring\nGPO Box 9984\nBrisbane Qld 4001\n- Northern TerritorySponsor MonitoringGPO Box 864Darwin NT 0801\nNorthern Territory\nSponsor Monitoring\nGPO Box 864\nDarwin NT 0801\n- South AustraliaSponsor MonitoringGPO Box 2399Adelaide SA 5001\nSouth Australia\nSponsor Monitoring\nGPO Box 2399\nAdelaide SA 5001\n- TasmaniaSponsor MonitoringGPO Box 794Hobart Tas. 7001\nTasmania\nSponsor Monitoring\nGPO Box 794\nHobart Tas. 7001\n- VictoriaSponsor MonitoringGPO Box 241Melbourne Vic. 3001\nVictoria\nSponsor Monitoring\nGPO Box 241\nMelbourne Vic. 3001\n- Western AustraliaSponsor MonitoringLocked Bag 7Northbridge WA 6865\nWestern Australia\nSponsor Monitoring\nLocked Bag 7\nNorthbridge WA 6865\n\n#### Not recover, transfer or charge certain costs to another person\n\nNot recover, transfer or charge certain costs to another person\nDetails\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members. This includes costs that relate to:\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members. This includes costs that relate to:\n- the recruitment of the person you sponsored\nthe recruitment of the person you sponsored\n- becoming or being a sponsor or former approved sponsor.\nbecoming or being a sponsor or former approved sponsor.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved\nstarts on the day the sponsorship is approved\n- ends on the following two events:you cease to be an  approved sponsoryou  no longer have a sponsored visa holder.\nends on the following two events:\n- you cease to be an  approved sponsor\nyou cease to be an  approved sponsor\n- you  no longer have a sponsored visa holder.\nyou  no longer have a sponsored visa holder.\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n- cost of sponsorship and nomination charges\ncost of sponsorship and nomination charges\n- migration agent costs associated with the lodgement of sponsorship and nomination applications\nmigration agent costs associated with the lodgement of sponsorship and nomination applications\n- administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:recruitment agent feesmigration agent feesthe cost of job advertisingscreening of candidates, short listing, interviews and reference checkssalaries of recruitment or human resource staffthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the positiontraining of new staffresponding to queries for prospective candidates, and advising unsuccessful applicantstravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\nadministrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:\n- recruitment agent fees\nrecruitment agent fees\n- migration agent fees\nmigration agent fees\n- the cost of job advertising\nthe cost of job advertising\n- screening of candidates, short listing, interviews and reference checks\nscreening of candidates, short listing, interviews and reference checks\n- salaries of recruitment or human resource staff\nsalaries of recruitment or human resource staff\n- the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\nthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\n- training of new staff\ntraining of new staff\n- responding to queries for prospective candidates, and advising unsuccessful applicants\nresponding to queries for prospective candidates, and advising unsuccessful applicants\n- travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\ntravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\n\n#### Pay costs to locate and remove an unlawful non-citizen\n\nPay costs to locate and remove an unlawful non-citizen\nDetails\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you could be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you could be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nYou could be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which could have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nYou could be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which could have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\n#### Secure an offer of a reasonable standard of accommodation (Professional Development stream and volunteers under the Occupational Trainee stream only)\n\nSecure an offer of a reasonable standard of accommodation (Professional Development stream and volunteers under the Occupational Trainee stream only)\nDetails\n\nYou must meet this obligation only if you sponsor someone:\n\nYou must meet this obligation only if you sponsor someone:\n- under the Professional Development stream\nunder the Professional Development stream\n- as a volunteer without a salary or wages under the Occupational Trainee stream.\nas a volunteer without a salary or wages under the Occupational Trainee stream.\n\nIf you sponsor someone under these streams, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf you sponsor someone under these streams, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nA ‘reasonable standard of accommodation’ means you must:\n\nA ‘reasonable standard of accommodation’ means you must:\n- meet all relevant state or territory and local government regulations regarding fire, health and safety\nmeet all relevant state or territory and local government regulations regarding fire, health and safety\n- offer 24-hour access\noffer 24-hour access\n- provide meals or a self-catering kitchen\nprovide meals or a self-catering kitchen\n- be clean and well-maintained\nbe clean and well-maintained\n- have a lounge area\nhave a lounge area\n- have adequate laundry facilities or a laundry service\nhave adequate laundry facilities or a laundry service\n- provide power for lighting, cooking and refrigeration\nprovide power for lighting, cooking and refrigeration\n- have an adequate ratio of guests to bathroom facilities\nhave an adequate ratio of guests to bathroom facilities\n- have uncrowded sleeping areas\nhave uncrowded sleeping areas\n- provide appropriate gender segregated areas and bathroom facilities\nprovide appropriate gender segregated areas and bathroom facilities\n- allow adequate privacy and secure storage for personal items.\nallow adequate privacy and secure storage for personal items.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- your nomination is approved, or\nyour nomination is approved, or\n- the day the visa is granted (if the person you have sponsored does not already hold this visa).\nthe day the visa is granted (if the person you have sponsored does not already hold this visa).\n\nThis obligation ends on the day (whichever is earliest):\n\nThis obligation ends on the day (whichever is earliest):\n- another sponsor has their nomination application for the same person approved\nanother sponsor has their nomination application for the same person approved\n- the  person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you\nthe  person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you\n- the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Ensure sponsored applicant participates in the nominated occupation, program or activity (Occupational Trainee stream only)\n\nEnsure sponsored applicant participates in the nominated occupation, program or activity (Occupational Trainee stream only)\nDetails\n\nThis obligation applies to you only if you have sponsored someone under the Occupational Trainee stream.\n\nThis obligation applies to you only if you have sponsored someone under the Occupational Trainee stream.\n\nYou must ensure that the person you have sponsored for this visa participates only in the position or activity for which you nominated them. If you want them to do workplace-based training in a different position, you must nominate them for that position and lodge a new nomination application.\n\nYou must ensure that the person you have sponsored for this visa participates only in the position or activity for which you nominated them. If you want them to do workplace-based training in a different position, you must nominate them for that position and lodge a new nomination application.\n\nThis obligation starts on the day the person you have sponsored for the position is granted a visa. If they already hold a visa, your obligation starts on the day the nomination is approved.\n\nThis obligation starts on the day the person you have sponsored for the position is granted a visa. If they already hold a visa, your obligation starts on the day the nomination is approved.\n\nThis obligation ends on the day (whichever is earliest):\n\nThis obligation ends on the day (whichever is earliest):\n- on which another sponsor has their nomination for the same person approved\non which another sponsor has their nomination for the same person approved\n- on which person you have sponsored is granted a further substantive visa of a different subclass from the one they last held, and their new visa does not require them to work for you\non which person you have sponsored is granted a further substantive visa of a different subclass from the one they last held, and their new visa does not require them to work for you\n- the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Pay travel costs to enable sponsored people to leave Australia (Professional Development stream only)\n\nPay travel costs to enable sponsored people to leave Australia (Professional Development stream only)\nDetails\n\nThis obligation applies to you only if you have sponsored someone under the Professional Development stream.\n\nThis obligation applies to you only if you have sponsored someone under the Professional Development stream.\n\nYou must pay reasonable and necessary travel costs to enable the person you have sponsored to leave Australia. The person must ask in writing. The department can also ask on their behalf.\n\nYou must pay reasonable and necessary travel costs to enable the person you have sponsored to leave Australia. The person must ask in writing. The department can also ask on their behalf.\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n- travel from the sponsored persons’ usual place of residence in Australia to the place of departure from Australia\ntravel from the sponsored persons’ usual place of residence in Australia to the place of departure from Australia\n- travel from Australia to the country (for which the person holds a passport) specified in the request\ntravel from Australia to the country (for which the person holds a passport) specified in the request\n- economy class air travel or, where unavailable, a reasonable equivalent.\neconomy class air travel or, where unavailable, a reasonable equivalent.\n\nTravel costs must be paid within 30 days of receiving the request.\n\nTravel costs must be paid within 30 days of receiving the request.\n\nThis obligation starts:\n\nThis obligation starts:\n- on the day the visa is granted (if the person does not already hold a visa in this subclass).\non the day the visa is granted (if the person does not already hold a visa in this subclass).\n\nThis obligation ends on the day (whichever is the earliest):\n\nThis obligation ends on the day (whichever is the earliest):\n- the person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you\nthe person you have sponsored is granted a further substantive visa of a different subclass to the one they last held, and their new visa does not require them to work for you\n- the person you have sponsored has left Australia and the relevant visa is no longer valid.\nthe person you have sponsored has left Australia and the relevant visa is no longer valid.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/training-and-research-visa-subclass-402#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/training-and-research-visa-subclass-402#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:37:19.508265",
  "metadata": {}
}