{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-skill-shortage-short-term-visa-subclass-482",
  "title": "Temporary Skill Shortage (Short-term) visa (subclass 482)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Temporary Skill Shortage (Short-term) visa (subclass 482) Page Content ​​On December 7 2024, the Skills in Demand (SID) visa replaced the Temporary Skills Shortage (TSS) visa. All TSS nominations and visa applications lodged prior to the implementation of the SID visa will be processed using the requirements in force at the time the application was lodged. If your employer has lodged a TSS nomination and you have not lodged your associated TSS visa application before 7 December 2024, if the nomination is approved it will be deemed a SID nomination and you can lodge an associated application for a SID visa. About this visa Details This visa enables employers to address labour shortages by bringing in skilled workers where employers can't source an appropriately skilled Australian worker. You can stay for up to 2 years or up to 4 years if an International Trade Obligation (ITO) applies. Hong Kong passport holders may stay up to 5 years. The occupation is on the short-term skilled occupations list Visa holders Details This information is for people who have already been granted a Temporary Skill Shortage (Short-term stream) visa (subclass 482), or for people who applied for the visa on or before 06 December 2024 and for which a decision has not yet been made. It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details If you already hold a Temporary Skill Shortage (Short-term stream) visa (subclass 482), it will be valid until the expiry date you were given when your visa was granted. What this visa lets you do Details With this visa, you can: live, study and work in Australia temporarily have eligible dependant family members apply to join you in Australia Your obligations Details You and your family must comply with all visa conditions and Australian laws. During your stay in Australia, you must: maintain adequate health insurance while you are in Australia continue to meet the requirements of the visa stream under which you were granted the visa leave Australia when your visa ends (unless you are granted another visa) Family members Details If your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as a subsequent entrant from in or outside Australia while your visa remains valid. When your visa ends, your family must leave Australia with you. Your family must: intend to remain members of your family unit. maintain adequate health insurance while they are in Australia. Your family can live, travel, work and study in Australia while their visa is valid We will tell you if there are any other conditions they must comply with when you are granted the visa. Report changes in circumstances Details Tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family. For further information, visit Changes in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Temporary Skill Shortage (Short-term) visa (subclass 482)\n\nTemporary Skill Shortage (Short-term) visa (subclass 482)\nPage Content\n\n​​On December 7 2024, the Skills in Demand (SID) visa replaced the Temporary Skills Shortage (TSS) visa.\n\n​​On December 7 2024, the Skills in Demand (SID) visa replaced the Temporary Skills Shortage (TSS) visa.\n\nAll TSS nominations and visa applications lodged prior to the implementation of the SID visa will be processed using the requirements in force at the time the application was lodged.\n\nAll TSS nominations and visa applications lodged prior to the implementation of the SID visa will be processed using the requirements in force at the time the application was lodged.\n\nIf your employer has lodged a TSS nomination and you have not lodged your associated TSS visa application before 7 December 2024, if the nomination is approved it will be deemed a SID nomination and you can lodge an associated application for a SID visa.\n\nIf your employer has lodged a TSS nomination and you have not lodged your associated TSS visa application before 7 December 2024, if the nomination is approved it will be deemed a SID nomination and you can lodge an associated application for a SID visa.\n​\n\n## About this visa\n\nAbout this visa\nDetails\n\nThis visa enables employers to address labour shortages by bringing in skilled workers where employers can't source an appropriately skilled Australian worker.\n\nThis visa enables employers to address labour shortages by bringing in skilled workers where employers can't source an appropriately skilled Australian worker.\n\nYou can stay for up to 2 years or up to 4 years if an International Trade Obligation (ITO) applies. Hong Kong passport holders may stay up to 5 years.\n\nYou can stay for up to 2 years or up to 4 years if an International Trade Obligation (ITO) applies. Hong Kong passport holders may stay up to 5 years.\n\nThe occupation is on the short-termskilled occupations list\n\nThe occupation is on the short-term\nskilled occupations list\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Temporary Skill Shortage (Short-term stream) visa (subclass 482), or for people who applied for the visa on or before 06 December 2024 and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Temporary Skill Shortage (Short-term stream) visa (subclass 482), or for people who applied for the visa on or before 06 December 2024 and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you already hold a Temporary Skill Shortage (Short-term stream) visa (subclass 482), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already hold a Temporary Skill Shortage (Short-term stream) visa (subclass 482), it will be valid until the expiry date you were given when your visa was granted.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nWith this visa, you can:\n\nWith this visa, you can:\n- live, study and work in Australia temporarily\nlive, study and work in Australia temporarily\n- have eligible dependant family members apply to join you in Australia\nhave eligible dependant family members apply to join you in Australia\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia, you must:\n\nDuring your stay in Australia, you must:\n- maintain adequate health insurance while you are in Australia\nmaintain adequate health insurance while you are in Australia\n- continue to meet the requirements of the visa stream under which you were granted the visa\ncontinue to meet the requirements of the visa stream under which you were granted the visa\n- leave Australia when your visa ends (unless you are granted another visa)\nleave Australia when your visa ends (unless you are granted another visa)\n\n### Family members\n\nFamily members\nDetails\n\nIf your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as asubsequent entrantfrom in or outside Australia while your visa remains valid.\n\nIf your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as a\nsubsequent entrant\nfrom in or outside Australia while your visa remains valid.\n\nWhen your visa ends, your family must leave Australia with you.\n\nWhen your visa ends, your family must leave Australia with you.\n\nYour family must:\n\nYour family must:\n- intend to remain members of your family unit.\nintend to remain members of your family unit.\n- maintainadequate health insurancewhile they are in Australia.\nmaintain\nadequate health insurance\nwhile they are in Australia.\n- Your family can live, travel, work and study in Australia while their visa is valid\nYour family can live, travel, work and study in Australia while their visa is valid\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\n### Report changes in circumstances\n\nReport changes in circumstances\nDetails\n\nTell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family.\n\nTell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family.\n\nFor further information, visitChanges in your situation.\n\nFor further information, visit\nChanges in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-skill-shortage-short-term-visa-subclass-482#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-skill-shortage-short-term-visa-subclass-482#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:24:25.586620",
  "metadata": {}
}