{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864",
  "title": "Contributory Aged Parent visa",
  "raw_text": "===== main placeholder ========================================== (Subclass 864) Contributory Aged Parent visa This permanent visa lets the aged parent of a settled Australian citizen, Australian permanent resident or eligible New Zealand citizen stay in Australia. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview From 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see Update to ImmiAccount — new online services for paper-based Parent visa applications Stay Permanently Cost From AUD48,640.00 over 2 instalments for a single applicant. For more information on additional fees that may apply, see the Costs section on the About this visa page for applicants. Processing times The demand for Parent visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy. For an indication of processing times for this visa, see Parent visa queue With this visa you can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor your family members to come to Australia travel to and from Australia for 5 years attend free English language classes provided by the Adult Migrant English Program , if eligible if eligible, apply for Australian citizenship See all conditions Check your eligibility You must have an eligible child who is a settled Australian citizen, Australian permanent resident or eligible New Zealand citizen be old enough to receive the age pension in Australia not have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa when applying for this visa. Help with your visa If you are getting help with your visa, before you pay someone, read information on who can help with your visa application Process About this visa From 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see Update to ImmiAccount — new online services for paper-based Parent visa applications With this visa you can How long you can stay Include family Cost Apply from Processing times Your obligations Visa label With this visa you can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor your family members to come to Australia travel to and from Australia for 5 years attend free English language classes provided by the Adult Migrant English Program , if eligible if eligible, apply for Australian citizenship You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. Travel to and from Australia for 5 years You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. If you want to travel after the initial 5-year travel facility: to re-enter Australia as a permanent resident you will need to apply for and be granted a Resident Return (RRV) you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for becoming a citizen To see when your travel facility ends, use VEVO If you hold a Contributory Aged Parent (Temporary) (subclass 884) visa You can apply for the subclass 864 visa as a 2-step process by first applying for a Contributory Aged Parent (Temporary) (subclass 884) visa. Applying for the subclass 884 visa and then the subclass 864 visa allows you to spread the cost of the visas over a number of years. You have already met the balance of family test. How long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. For citizenship purposes, your permanent residency starts on the day we grant the visa. Include family You can include members of the family unit in your application when you apply. You will be required to include details of all your family members, whether they are migrating or not, in the application form. Family members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements. Learn more about health requirements Learn more about character requirements Newborn child Find out what to do if your child is born after you apply Cost This visa costs from AUD48,640.00 for a single applicant. There are additional charges for each family member who applies with you. You pay for this visa in 2 parts called instalments. Pay the first instalment when you apply. Pay the second instalment when we ask you to. You might also have to pay other costs for each applicant for health checks, police certificates and biometrics. For more information see Fees and charges for other services To work out what your visa will cost see current visa pricing . See more about visa fees and charges Apply from You must be in Australia, but not in immigration clearance, when you apply for the visa. Any family members who apply for the visa with you must also be in Australia, but not in immigration clearance, when you apply. Processing times The demand for these visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy. Applications for this visa are subject to capping and queueing and are processed in the order we receive them. For an indication of processing times for this visa, see Parent visa queue release dates For more information on priorities, visit Family visa processing priorities Your application might take longer to process if: you don’t fill it in correctly you don’t include all of the documents we need or we need more information from you and/or your information takes a long time to verify. We can’t process your application if you don’t pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. For further information on Migration Program outcomes against planning for each migration program year, read the Reports on Migration Programs Assessment We assess applications for this visa in 2 stages: An initial assessment to check eligibility and either add the application to the queue or refuse it. As places become available, applications are released from the queue for final assessment. Don’t arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa. Consider another visa Other Parent visas available include the: Contributory Aged Parent (Temporary) visa (subclass 884) Followed by a permanent Contributory Aged Parent visa (subclass 864) . This 2-step visa process is faster but costs more than the Aged Parent visa (subclass 804). It also costs more than applying directly for the Contributory Aged Parent visa (subclass 864), but the cost is spread across the 2 visas over a longer period. Sponsored Parent (Temporary) visa (subclass 870) This is a temporary visa allowing parents to visit their children in Australia for up to 3 or 5 years at a time and a cumulative maximum 10 year period. You can view all visa options on our Visa list page Your obligations You and your family members must meet all visa conditions and obey Australian laws. See what conditions might be attached to this visa on our visa conditions page Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility From 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see Update to ImmiAccount — new online services for paper-based Parent visa applications Not have this visa You can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa. Have a sponsor Details You must be sponsored by an eligible sponsor. Usually you would be sponsored by an eligible child. If your child is under 18, you can be sponsored by an eligible relative or community organisation. We must approve the sponsorship. If your sponsor dies If you hold a Temporary Contributory Aged Parent (subclass 884) visa, you might still be eligible for this visa if your sponsor dies. See what to do if your situation changes Be this age You must be old enough to receive the age pension in Australia Meet the balance of family test Details You must meet the balance-of-family test. You do so if: at least half of your children and step-children are eligible children, or there are more eligible children living in Australia than in any other single country For more information and examples of how the test is applied, visit balance of family test If you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test. Have assurance of support Details You must be able to obtain an assurance of support. An assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa for the assurance of support period. The assurance is for you and any family members who come to Australia with you on this visa. We will let you know when you need to provide the assurance of support. Learn more about assurances of support Meet the health requirement Details You and any family members who apply for the visa with you must meet our health requirement We might also ask that other non-migrating family members meet the requirement. Meet the character requirement Details You and any family members who apply for the visa with you must meet our character requirement We might also ask that other non-migrating family members meet the requirement. Have paid back your debt to the Australian Government If you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back. Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Sign the Australian Values Statement Details ​If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia booklet sign an Australian Values Statement . This is to confirm you will respect the Australian way of life and obey Australian laws. Best interests of the child We will not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step From 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see Update to ImmiAccount — new online services for paper-based Parent visa applications Step 1 Before you apply Check your passport. If you need help with your application, get someone to act on your behalf. Show steps Check your passport You and anyone who applies for the visa with you must have valid passports before we grant the visa. We will only grant the visa if you have a valid passport. We will only grant the visa if you have a valid passport. See how Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. To learn more visit authorised recipients See how If you have an existing Parent visa application If you have applied for a different parent visa, but we have not made a decision about that visa, you must withdraw that application at the same time that you apply for this visa. Use Part B of Form 47PA Application for a parent to migrate to Australia (3MB PDF) See how Step 2 Gather your documents Gather all your documents, including for any partner or dependents who might be applying with you. You will also need your sponsor documents. Show steps Provide accurate information There are consequences to not providing accurate or complete information. To learn more, visit providing accurate information See how Contributory Aged Parent (Temporary) (subclass 884) visa holders You won't need to provide us with some of the documents we usually ask for if: you hold a subclass 884 visa, or your subclass 884 visa ended in the 28 days immediately before you apply for this visa You will still need to provide documents: to let us know you are getting help with your application if there has been a change in your situation since we granted you the 884 visa Changes in your situation we need evidence of include: your family member is no longer a dependent your partnership relationship has changed you have had a baby your contact details have changed you have a new passport you want to nominate a new sponsor your sponsor has died See how Identity documents We need proof of your identity. If you can't prove your identity: we will refuse your visa application we might not grant you another visa for 10 years we might not grant any family members you listed on your application a visa for 10 years. Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name. Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. See how Sponsor documents You must be sponsored by an eligible sponsor. Your sponsor must complete Form 40 Sponsorship for migration to Australia (469KB PDF) See how Balance of family documents You must show us that you meet the balance of family test . You can do so by giving us: evidence of how you are related to each child evidence of each child's Australian citizenship or country of permanent residence evidence that your child should not be included in the balance-of-family test (for example, their death certificate If you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test. See how Character documents We might ask for character documents, including police certificates. Don’t arrange a police check until we ask you to. Learn more about police certificates See how Assurance of support When we ask for it, provide us with an assurance of support See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Dependants under 18 documents For every dependant under 18 years old who is applying with you, provide: identity documents evidence of your relationship with them, like a birth or marriage certificate character documents, if applicable See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to stay in Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable Dependants over 18 documents To be included in your visa application as a dependent child, your child must be: under 18 years over 18 years of age but not yet turned 23, and dependent on you or your partner over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner. For every dependant 18 years old or older who is applying with you, provide: identity documents documents about their other relationships, if applicable character documents proof of dependency. For more information on visa processing times, see Parent visa queue release dates Provide: identity documents documents about their other relationships, if applicable character documents. See how Proof of dependency You need to prove that this person is dependent on you. Provide: a completed Form 47a - Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of your relationship with the dependent such as a birth certificate or adoption papers You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide: proof they live with you their tax records proof they are currently studying See how Partner documents Provide: identity documents character documents documents about other relationships, if applicable. Provide either: your current marriage certificate or enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply. Documents that prove your de facto relationship include: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show you have lived at the same address as your partner. See how Photographs Provide 4 recent photos (45mm x 35mm) of anyone included in the application. Photographs must be: 45mm x 35mm less than 6 months old good quality colour. We don't accept laser copies a full-face view of your head and shoulders taken against a plain light-coloured background. You can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face. See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia don't have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating. These details must be in English. See how Certify Don't certify police certificates. You need to send us the originals. Have all other documents certified . This includes: non-English documents English translations. See how Keep Keep a copy of your completed application. Send Send us: original police certificates certified copies of all other documents as much relevant information as possible to help us make a decision on your application each document only once, even if you are using to show more than one thing all documents with your application, if you can. See how Step 3 Apply for the visa You must apply for this visa on paper. You must be in Australia, but not in immigration clearance, when the application is submitted. You can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa. Show steps Apply on paper If your subclass 884 visa is current or has ended within the last 28 days, complete Form 47PT Application for migration to Australia by a Contributory Parent (Temporary) or Contributory Aged Parent (Temporary) (2MB PDF) visa holder. If you don’t hold, (or have never held) a subclass 884 visa, you must complete Form 47PA Application for a parent to migrate to Australia (3MB PDF) Your sponsor will need to complete Form 40 Sponsorship for migration to Australia (469KB PDF) Whether migrating or not, each member of the family unit aged 18 years or over must also complete Form 47A Details of child or other dependent family member aged 18 years or over. (307KB PDF) You must complete all forms in English. You must pay the first instalment when you apply. For payment options see how to pay You can't apply for this visa in person. Send the application by post or courier to the address on the form. Include all required documents, forms and evidence of visa application charge payment with your application. Don’t send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. If any of the above steps are incomplete, your application may be invalid. We don’t process invalid applications. We will notify you if this is the case, and if requested, return your application. See how Step 4 After you apply We will let you know when we have received your application and documents. There are other things you need to know and might have to do. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you receive your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages sent to you update your details view the status of your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (ImmiCard, passport or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import both new and on-hand applications. See how Status updates We can't provide updates on your application's progress within normal processing times. We will let you know if you need to provide anything further. Learn more about the processing times at Parent visa queue release dates Travel Tell us if you want to travel outside Australia while we process your application. We need to know because you must be in Australia when we make our decision. If you leave Australia, make sure you have a valid visa to return. Learn about visa expiry See how Health exams We will let you know if you need health examinations Provide character documents We will let you know when you need to provide character documents. Learn more about character requirements See how Biometrics We might ask for biometrics . These include fingerprints and photos. We will let you know if you need to provide them. See how Stay lawful If you are in Australia and your current temporary visa is about to expire, you should make sure you stay lawful by holding valid visa while we process your application. When you apply for this visa in Australia, you are likely to be granted a bridging visa. If your current visa expires before we make a decision on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application. Learn more about visa expiry See how Pay the second instalment You must pay the second instalment before we grant the visa. We will send you an invoice when it is due. If you don’t pay the invoice, we will refuse your application. See how Send more information If you have imported your application into ImmiAccount, you can use it to upload any additional documents that you did not provide with your application. Alternatively, you can send any documents to the Parent Visa Centre in Perth. We might also ask you to provide more information. See how Add family members You might be able to add family members to your application before we make a decision. Complete and send us Form 1436 Adding an additional applicant after lodgement (481KB PDF) You will also need to provide evidence of your relationship and the family member’s passport. If you have imported your application into ImmiAccount, you can use it to upload the completed form and any additional documents. Any family members you add to your application after you apply must be in Australia when you add them. See how Newborn child Find out what to do if your child is born after you apply See how Mistakes on your application Let us know as soon as you can if you make a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms to the office you submitted your application to. If you have imported your application into ImmiAccount, you can use it to upload the completed form. For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application. See what to do if your situation changes See how Step 5 Visa outcome You must be in Australia, but not in immigration clearance, when we make a decision on your application. We will let you know our decision in writing. If we grant you the visa, we will let you know: your visa grant number the date your visa starts your visa conditions. We recommend you keep a copy of our decision. If we refuse your visa we will let you know: why we refused the visa whether you have a right to a review of the decision. We will not refund the application fee if we refuse your application. When you have this visa From 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see Update to ImmiAccount — new online services for paper-based Parent visa applications In Australia Leaving Australia In Australia What you must do when you have this visa You and your dependants must meet all visa conditions and obey all Australian laws. Tell us if things change See what to do if your situation changes What can you do on your visa See your visa expiry, conditions and work and study entitlements in VEVO See how long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. Access Australian Government benefits As a newly arrived resident, you might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents waiting periods from Services Australia Travel to and from Australia for 5 years You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. If you want to travel after the initial 5-year travel facility: to re-enter Australia as a permanent resident you will need to apply for and be granted a Resident Return (RRV) you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when your travel facility ends, use VEVO Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO To get proof of your travel in and out of Australia, request your international movement records Working With this visa you become a permanent resident. This means you can work and study. You are protected by Australian workplace law. See your workplace rights and entitlements Bringing a family member As an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, your permanent residence starts on the day we grant the visa. Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your travel facility is still valid To see when your travel facility ends, use VEVO See what to do if your travel facility has expired or is about to expire At the border Departures SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Proving you have been to Australia To get proof of your travel in and out of Australia, request your international movement records",
  "main_content": "===== main placeholder ==========================================\n(Subclass 864)\n\n# Contributory Aged Parent visa\n\nContributory Aged Parent visa\n\nThis permanent visa lets the aged parent of a settled Australian citizen,  Australian permanent resident or eligible New Zealand citizen stay in Australia.\n\nThis permanent visa lets the aged parent of a settled Australian citizen,  Australian permanent resident or eligible New Zealand citizen stay in Australia.\n\nThis permanent visa lets the aged parent of a settled Australian citizen,  Australian permanent resident or eligible New Zealand citizen stay in Australia.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.​\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Parent visa applications\n.\n​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFrom AUD48,640.00 over 2 instalments for a single applicant.For more information on additional fees that may apply, see the Costs section on theAbout this visapage for applicants.\n\nFrom AUD48,640.00 over 2 instalments for a single applicant.\n\nFrom AUD48,640.00 over 2 instalments for a single applicant.\n\nFor more information on additional fees that may apply, see the Costs section on theAbout this visapage for applicants.\n\nFor more information on additional fees that may apply, see the Costs section on the\nAbout this visa\npage for applicants.\n\n#### Processing times\n\nProcessing times\n\nThe demand for Parent visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy.\n\nThe demand for Parent visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy.\n\nFor an indication of processing times for this visa, seeParent visa queue.\n\nFor an indication of processing times for this visa, see\nParent visa queue\n.\n\n#### With this visa you can\n\nWith this visa you can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor your family members to come to Australia\nsponsor your family members to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- have an eligible child who is a settled Australian citizen, Australianpermanent residentoreligible New Zealand citizen\nhave an eligible child who is a settled Australian citizen, Australian\npermanent resident\nor\neligible New Zealand citizen\n- be old enough to receive the age pension in Australia\nbe old enough to receive the age pension in Australia\n- not have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa when applying for this visa.\nnot have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa when applying for this visa.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onwho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nwho can help with your visa application\n.\n\n### Process\n\nProcess\nAbout this visa\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.​\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Parent visa applications\n.\n​\nWith this visa you can\nHow long you can stay\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor your family members to come to Australia\nsponsor your family members to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\nIf you want to travel after the initial 5-year travel facility:\n\nIf you want to travel after the initial 5-year travel facility:\n- to re-enter Australia as a permanent resident you will need to apply for and be granted aResident Return (RRV).\nto re-enter Australia as a permanent resident you will need to apply for and be granted a\nResident Return (RRV)\n.\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia.\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia.\n\nSee more about eligibility requirements and current processing times forbecoming a citizen.\n\nSee more about eligibility requirements and current processing times for\nbecoming a citizen\n.\n\nTo see when your travel facility ends, useVEVO.\n\nTo see when your travel facility ends, use\nVEVO\n.\n\n### If you hold a Contributory Aged Parent (Temporary) (subclass 884) visa\n\nIf you hold a Contributory Aged Parent (Temporary) (subclass 884) visa\n\nYou can apply for the subclass 864 visa as a 2-step process by first applying for a Contributory Aged Parent (Temporary) (subclass 884) visa. Applying for the subclass 884 visa and then the subclass 864 visa allows you to spread the cost of the visas over a number of years.\n\nYou can apply for the subclass 864 visa as a 2-step process by first applying for a Contributory Aged Parent (Temporary) (subclass 884) visa. Applying for the subclass 884 visa and then the subclass 864 visa allows you to spread the cost of the visas over a number of years.\n\nYou have already met the balance of family test.\n\nYou have already met the balance of family test.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nFor citizenship purposes, your permanent residency starts on the day we grant the visa.\n\nFor citizenship purposes, your permanent residency starts on the day we grant the visa.\n\n## Include family\n\nInclude family\n\nYou can include members of the family unit in your application when you apply.\n\nYou can include members of the family unit in your application when you apply.\n\nYou will be required to include details of all your family members, whether they are migrating or not, in the application form.\n\nYou will be required to include details of all your family members, whether they are migrating or not, in the application form.\n\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\n\nFamily members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements.\n\nLearn more abouthealth requirements.\n\nLearn more about\nhealth requirements\n.\n\nLearn more aboutcharacter requirements.\n\nLearn more about\ncharacter requirements\n.\n\n## Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n## Cost\n\nCost\n\nThis visa costs from AUD48,640.00 for a single applicant. There are additional charges for each family member who applies with you.\n\nThis visa costs from AUD48,640.00 for a single applicant. There are additional charges for each family member who applies with you.\n\nYou pay for this visa in 2 parts called instalments. Pay the first instalment when you apply. Pay the second instalment when we ask you to.\n\nYou pay for this visa in 2 parts called instalments. Pay the first instalment when you apply. Pay the second instalment when we ask you to.\n\nYou might also have to pay other costs for each applicant for health checks, police certificates and biometrics. For more information seeFees and charges for other services.\n\nYou might also have to pay other costs for each applicant for health checks, police certificates and biometrics. For more information see\nFees and charges for other services\n.\n\nTo work out what your visa will cost seecurrent visa pricing. See more aboutvisa fees and charges.\n\nTo work out what your visa will cost see\ncurrent visa pricing\n. See more about\nvisa fees and charges\n.\n\n## Apply from\n\nApply from\n\nYou must be in Australia, but not in immigration clearance, when you apply for the visa.\n\nYou must be in Australia, but not in immigration clearance, when you apply for the visa.\n\nAny family members who apply for the visa with you must also be in Australia, but not in immigration clearance, when you apply.\n\nAny family members who apply for the visa with you must also be in Australia, but not in immigration clearance, when you apply.\n\n## Processing times\n\nProcessing times\n\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy.\n\nThe demand for these visas is greater than the number of places available each year. As a result, processing times for these applications are lengthy.\n\nApplications for this visa are subject tocapping and queueingand are processed in the order we receive them.\n\nApplications for this visa are subject to\ncapping and queueing\nand are processed in the order we receive them.\n\nFor an indication of processing times for this visa, seeParent visa queue release dates.\n\nFor an indication of processing times for this visa, see\nParent visa queue release dates\n.\n\nFor more information on priorities, visitFamily visa processing priorities.\n\nFor more information on priorities, visit\nFamily visa processing priorities\n.\n\nYour application might take longer to process if:\n\nYour application might take longer to process if:\n- you don’t fill it in correctly\nyou don’t fill it in correctly\n- you don’t include all of the documents we need or we need more information from you and/or\nyou don’t include all of the documents we need or we need more information from you and/or\n- your information takes a long time to verify.\nyour information takes a long time to verify.\n\nWe can’t process your application if you don’t pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe can’t process your application if you don’t pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nFor further information on Migration Program outcomes against planning for each migration program year, read theReports on Migration Programs.\n\nFor further information on Migration Program outcomes against planning for each migration program year, read the\nReports on Migration Programs\n.\n\n### Assessment\n\nAssessment\n\nWe assess applications for this visa in 2 stages:\n\nWe assess applications for this visa in 2 stages:\n1. An initial assessment to check eligibility and either add the application to the queue or refuse it.\nAn initial assessment to check eligibility and either add the application to the queue or refuse it.\n2. As places become available, applications are released from the queue for final assessment.\nAs places become available, applications are released from the queue for final assessment.\n\nDon’t arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\n\nDon’t arrange to stay permanently in Australia until your visa is granted. We will let you know in writing if we grant you the visa.\n\n### Consider another visa\n\nConsider another visa\n\nOther Parent visas available include the:\n\nOther Parent visas available include the:\n- Contributory Aged Parent (Temporary) visa (subclass 884).Followed by a permanentContributory Aged Parent visa (subclass 864). This 2-step visa process is faster but costs more than the Aged Parent visa (subclass 804). It also costs more than applying directly for the Contributory Aged Parent visa (subclass 864), but the cost is spread across the 2 visas over a longer period.\nContributory Aged Parent (Temporary) visa (subclass 884)\n.\nFollowed by a permanent\nContributory Aged Parent visa (subclass 864)\n. This 2-step visa process is faster but costs more than the Aged Parent visa (subclass 804). It also costs more than applying directly for the Contributory Aged Parent visa (subclass 864), but the cost is spread across the 2 visas over a longer period.\n- Sponsored Parent (Temporary) visa (subclass 870).This is a temporary visa allowing parents to visit their children in Australia for up to 3 or 5 years at a time and a cumulative maximum 10 year period.\nSponsored Parent (Temporary) visa (subclass 870)\n.\nThis is a temporary visa allowing parents to visit their children in Australia for up to 3 or 5 years at a time and a cumulative maximum 10 year period.\n\nYou can view all visa options on ourVisa list page.\n\nYou can view all visa options on our\nVisa list page\n.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nSee what conditions might be attached to this visa on ourvisa conditions page.\n\nSee what conditions might be attached to this visa on our\nvisa conditions page\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.​\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Parent visa applications\n.\n​\n\n## Not have this visa\n\nNot have this visa\n\nYou can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\n\nYou can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\n\n## Have a sponsor\n\nHave a sponsor\nDetails\n\nYou must be sponsored by an eligible sponsor.\n\nYou must be sponsored by an eligible sponsor.\n\nUsually you would be sponsored by an eligible child. If your child is under 18, you can be sponsored by an eligible relative or community organisation.\n\nUsually you would be sponsored by an eligible child. If your child is under 18, you can be sponsored by an eligible relative or community organisation.\n\nWe must approve the sponsorship.\n\nWe must approve the sponsorship.\n\n### If your sponsor dies\n\nIf your sponsor dies\n\nIf you hold a Temporary Contributory Aged Parent (subclass 884) visa, you might still be eligible for this visa if your sponsor dies.\n\nIf you hold a Temporary Contributory Aged Parent (subclass 884) visa, you might still be eligible for this visa if your sponsor dies.\n\nSee what to do ifyour situation changes.\n\nSee what to do if\nyour situation changes\n.\n\n## Be this age\n\nBe this age\n\nYou must be old enough toreceive the age pension in Australia.\n\nYou must be old enough to\nreceive the age pension in Australia\n.\n\n## Meet the balance of family test\n\nMeet the balance of family test\nDetails\n\nYou must meet the balance-of-family test. You do so if:\n\nYou must meet the balance-of-family test. You do so if:\n- at least half of your children and step-children are eligible children, or\nat least half of your children and step-children are eligible children, or\n- there are more eligible children living in Australia than in any other single country\nthere are more eligible children living in Australia than in any other single country\n\nFor more information and examples of how the test is applied, visitbalance of family test.\n\nFor more information and examples of how the test is applied, visit\nbalance of family test\n.\n\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\n\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\n\n## Have assurance of support\n\nHave assurance of support\nDetails\n\nYou must be able to obtain an assurance of support.\n\nYou must be able to obtain an assurance of support.\n\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa for the assurance of support period. The assurance is for you and any family members who come to Australia with you on this visa.\n\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa for the assurance of support period. The assurance is for you and any family members who come to Australia with you on this visa.\n\nWe will let you know when you need to provide the assurance of support.\n\nWe will let you know when you need to provide the assurance of support.\n\nLearn more aboutassurances of support.\n\nLearn more about\nassurances of support\n.\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\nWe might also ask that other non-migrating family members meet the requirement.\n\nWe might also ask that other non-migrating family members meet the requirement.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourcharacter requirement.\n\nYou and any family members who apply for the visa with you must meet our\ncharacter requirement\n.\n\nWe might also ask that other non-migrating family members meet the requirement.\n\nWe might also ask that other non-migrating family members meet the requirement.\n\n## Have paid back your debt to the Australian Government\n\nHave paid back your debt to the Australian Government\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back.\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement in place to pay it back.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Sign the Australian Values Statement\n\nSign the Australian Values Statement\nDetails\n\n​If you are 18 years of age or older, you must:\n\n​If you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australia booklet\nhave read, or had explained to you, the\nLife in Australia booklet\n- sign anAustralian Values Statement. This is to confirm you will respect the Australian way of life and obey Australian laws.\nsign an\nAustralian Values Statement\n. This is to confirm you will respect the Australian way of life and obey Australian laws.\n\n## Best interests of the child\n\nBest interests of the child\n\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.​\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Parent visa applications\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck your passport. If you need help with your application, get someone to act on your behalf.\n\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nYou and anyone who applies for the visa with you must have valid passports before we grant the visa. We will only grant the visa if you have a valid passport.\n\nYou and anyone who applies for the visa with you must have valid passports before we grant the visa. We will only grant the visa if you have a valid passport.\n\nWe will only grant the visa if you have a valid passport.\n\nWe will only grant the visa if you have a valid passport.\nSee how\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner\na\nlegal practitioner\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter. To learn more visitauthorised recipients.\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter. To learn more visit\nauthorised recipients\n.\nSee how\n\n#### If you have an existing Parent visa application\n\nIf you have an existing Parent visa application\n\nIf you have applied for a different parent visa, but we have not made a decision about that visa, you must withdraw that application at the same time that you apply for this visa.\n\nIf you have applied for a different parent visa, but we have not made a decision about that visa, you must withdraw that application at the same time that you apply for this visa.\n\nUse Part B ofForm 47PA Application for a parent to migrate to Australia (3MB PDF).\n\nUse Part B of\nForm 47PA Application for a parent to migrate to Australia (3MB PDF)\n.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nGather all your documents, including for any partner or dependents who might be applying with you. You will also need your sponsor documents.\n\nGather all your documents, including for any partner or dependents who might be applying with you. You will also need your sponsor documents.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nThere are consequences to not providing accurate or complete information. To learn more, visitproviding accurate information.\n\nThere are consequences to not providing accurate or complete information. To learn more, visit\nproviding accurate information\n.\nSee how\n\n#### Contributory Aged Parent (Temporary) (subclass 884) visa holders\n\nContributory Aged Parent (Temporary) (subclass 884) visa holders\n\nYou won't need to provide us with some of the documents we usually ask for if:\n\nYou won't need to provide us with some of the documents we usually ask for if:\n- you hold a subclass 884 visa, or\nyou hold a subclass 884 visa, or\n- your subclass 884 visa ended in the 28 days immediately before you apply for this visa\nyour subclass 884 visa ended in the 28 days immediately before you apply for this visa\n\nYou will still need to provide documents:\n\nYou will still need to provide documents:\n- to let us know you are getting help with your application\nto let us know you are getting help with your application\n- if there has been a change in your situation since we granted you the 884 visa\nif there has been a change in your situation since we granted you the 884 visa\n\nChanges in your situation we need evidence of include:\n\nChanges in your situation we need evidence of include:\n- your family member is no longer a dependent\nyour family member is no longer a dependent\n- your partnership relationship has changed\nyour partnership relationship has changed\n- you have had a baby\nyou have had a baby\n- your contact details have changed\nyour contact details have changed\n- you have a new passport\nyou have a new passport\n- you want to nominate a new sponsor\nyou want to nominate a new sponsor\n- your sponsor has died\nyour sponsor has died\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nWe need proof of your identity. If you can't prove your identity:\n\nWe need proof of your identity. If you can't prove your identity:\n- we will refuse your visa application\nwe will refuse your visa application\n- we might not grant you another visa for 10 years\nwe might not grant you another visa for 10 years\n- we might not grant any family members you listed on your application a visa for 10 years.\nwe might not grant any family members you listed on your application a visa for 10 years.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name.\nproof of change of name.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\nSee how\n\n#### Sponsor documents\n\nSponsor documents\n\nYou must be sponsored by an eligible sponsor.\n\nYou must be sponsored by an eligible sponsor.\n\nYour sponsor must completeForm 40 Sponsorship for migration to Australia (469KB PDF).\n\nYour sponsor must complete\nForm 40 Sponsorship for migration to Australia (469KB PDF)\n.\nSee how\n\n#### Balance of family documents\n\nBalance of family documents\n\nYou must show us that you meet thebalance of family test. You can do so by giving us:\n\nYou must show us that you meet the\nbalance of family test\n. You can do so by giving us:\n- evidence of how you are related to each child\nevidence of how you are related to each child\n- evidence of each child's Australian citizenship or country of permanent residence\nevidence of each child's Australian citizenship or country of permanent residence\n- evidence that your child should not be included in the balance-of-family test (for example, their death certificate\nevidence that your child should not be included in the balance-of-family test (for example, their death certificate\n\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\n\nIf you hold a Contributory Aged Parent (subclass 884) (Temporary) visa, you have already met the balance of family test.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe might ask for character documents, including police certificates. Don’t arrange a police check until we ask you to.\n\nWe might ask for character documents, including police certificates. Don’t arrange a police check until we ask you to.\n\nLearn more aboutpolice certificates.\n\nLearn more about\npolice certificates\n.\nSee how\n\n#### Assurance of support\n\nAssurance of support\n\nWhen we ask for it, provide us with anassurance of support.\n\nWhen we ask for it, provide us with an\nassurance of support\n.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with you, provide:\n\nFor every dependant under 18 years old who is applying with you, provide:\n- identity documents\nidentity documents\n- evidence of your relationship with them, like a birth or marriage certificate\nevidence of your relationship with them, like a birth or marriage certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to stay in Australia on this visa\na statutory declaration giving their consent for the child to stay in Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nTo be included in your visa application as a dependent child, your child must be:\n\nTo be included in your visa application as a dependent child, your child must be:\n- under 18 years\nunder 18 years\n- over 18 years of age but not yet turned 23, and dependent on you or your partner\nover 18 years of age but not yet turned 23, and dependent on you or your partner\n- over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner.\nover 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner.\n\nFor every dependant 18 years old or older who is applying with you, provide:\n\nFor every dependant 18 years old or older who is applying with you, provide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n- proof of dependency.\nproof of dependency.\n\nFor more information on visa processing times, seeParent visa queue release dates.\n\nFor more information on visa processing times, see\nParent visa queue release dates\n.\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents.\ncharacter documents.\nSee how\n\n#### Proof of dependency\n\nProof of dependency\n\nYou need to prove that this person is dependent on you. Provide:\n\nYou need to prove that this person is dependent on you. Provide:\n- a completedForm 47a - Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a - Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of your relationship with the dependent such as a birth certificate or adoption papers\nproof of your relationship with the dependent such as a birth certificate or adoption papers\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are currently studying\nproof they are currently studying\nSee how\n\n#### Partner documents\n\nPartner documents\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- documents about other relationships, if applicable.\ndocuments about other relationships, if applicable.\n\nProvide either:\n\nProvide either:\n- your current marriage certificate or\nyour current marriage certificate or\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply.\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply.\n\nDocuments that prove your de facto relationship include:\n\nDocuments that prove your de facto relationship include:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show you have lived at the same address as your partner.\ndocuments that show you have lived at the same address as your partner.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide 4 recent photos (45mm x 35mm) of anyone included in the application.\n\nProvide 4 recent photos (45mm x 35mm) of anyone included in the application.\n\nPhotographs must be:\n\nPhotographs must be:\n- 45mm x 35mm\n45mm x 35mm\n- less than 6 months old\nless than 6 months old\n- good quality colour. We don't accept laser copies\ngood quality colour. We don't accept laser copies\n- a full-face view of your head and shoulders\na full-face view of your head and shoulders\n- taken against a plain light-coloured background.\ntaken against a plain light-coloured background.\n\nYou can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face.\n\nYou can wear untinted prescription glasses. If you wear a head covering for religious reasons, you can show only your face.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia don't have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia don't have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating.\nqualifications and experience in the language they are translating.\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nDon't certify police certificates. You need to send us the originals.\n\nDon't certify police certificates. You need to send us the originals.\n\nHave all other documentscertified. This includes:\n\nHave all other documents\ncertified\n. This includes:\n- non-English documents\nnon-English documents\n- English translations.\nEnglish translations.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much relevant information as possible to help us make a decision on your application\nas much relevant information as possible to help us make a decision on your application\n- each document only once, even if you are using to show more than one thing\neach document only once, even if you are using to show more than one thing\n- all documents with your application, if you can.\nall documents with your application, if you can.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa on paper. You must be in Australia, but not in immigration clearance, when the application is submitted.\n\nYou must apply for this visa on paper. You must be in Australia, but not in immigration clearance, when the application is submitted.\n\nYou can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\n\nYou can't apply for this visa if you have already applied for or hold a Sponsored Parent (Temporary) (subclass 870) visa.\nShow\n                    steps\n\n#### Apply on paper\n\nApply on paper\n\nIf your subclass 884 visa is current or has ended within the last 28 days, completeForm 47PT Application for migration to Australia by a Contributory Parent (Temporary) or Contributory Aged Parent (Temporary) (2MB PDF)visa holder.\n\nIf your subclass 884 visa is current or has ended within the last 28 days, complete\nForm 47PT Application for migration to Australia by a Contributory Parent (Temporary) or Contributory Aged Parent (Temporary) (2MB PDF)\nvisa holder.\n\nIf you don’t hold, (or have never held) a subclass 884 visa, you must completeForm 47PA Application for a parent to migrate to Australia (3MB PDF).\n\nIf you don’t hold, (or have never held) a subclass 884 visa, you must complete\nForm 47PA Application for a parent to migrate to Australia (3MB PDF)\n.\n\nYour sponsor will need to completeForm 40 Sponsorship for migration to Australia (469KB PDF).\n\nYour sponsor will need to complete\nForm 40 Sponsorship for migration to Australia (469KB PDF)\n.\n\nWhether migrating or not, each member of the family unit aged 18 years or over must also completeForm 47A Details of child or other dependent family member aged 18 years or over. (307KB PDF)\n\nWhether migrating or not, each member of the family unit aged 18 years or over must also complete\nForm 47A Details of child or other dependent family member aged 18 years or over. (307KB PDF)\n\nYou must complete all forms in English.\n\nYou must complete all forms in English.\n\nYou must pay the first instalment when you apply. For payment options seehow to pay.\n\nYou must pay the first instalment when you apply. For payment options see\nhow to pay\n.\n\nYou can't apply for this visa in person. Send the application by post or courier to the address on the form. Include all required documents, forms and evidence of visa application charge payment with your application.\n\nYou can't apply for this visa in person. Send the application by post or courier to the address on the form. Include all required documents, forms and evidence of visa application charge payment with your application.\n\nDon’t send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDon’t send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\n\nIf any of the above steps are incomplete, your application may be invalid. We don’t process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We don’t process invalid applications. We will notify you if this is the case, and if requested, return your application.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents. There are other things you need to know and might have to do.\n\nWe will let you know when we have received your application and documents. There are other things you need to know and might have to do.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you receive your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you receive your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages sent to you\nview messages sent to you\n- update your details\nupdate your details\n- view the status of your application.\nview the status of your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (ImmiCard, passport or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (ImmiCard, passport or Titre de Voyage number).\nidentity document number (ImmiCard, passport or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import both new and on-hand applications.\n\nYou can import both new and on-hand applications.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't provide updates on your application's progress within normal processing times. We will let you know if you need to provide anything further.\n\nWe can't provide updates on your application's progress within normal processing times. We will let you know if you need to provide anything further.\n\nLearn more about the processing times atParent visa queue release dates.\n\nLearn more about the processing times at\nParent visa queue release dates\n.\n\n#### Travel\n\nTravel\n\nTell us if you want to travel outside Australia while we process your application. We need to know because you must be in Australia when we make our decision.\n\nTell us if you want to travel outside Australia while we process your application. We need to know because you must be in Australia when we make our decision.\n\nIf you leave Australia, make sure you have a valid visa to return.\n\nIf you leave Australia, make sure you have a valid visa to return.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you needhealth examinations\n\nWe will let you know if you need\nhealth examinations\n\n#### Provide character documents\n\nProvide character documents\n\nWe will let you know when you need to provide character documents.\n\nWe will let you know when you need to provide character documents.\n\nLearn more aboutcharacter requirements.\n\nLearn more about\ncharacter requirements\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. These include fingerprints and photos. We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n. These include fingerprints and photos. We will let you know if you need to provide them.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia and your current temporary visa is about to expire, you should make sure you stay lawful by holding valid visa while we process your application.\n\nIf you are in Australia and your current temporary visa is about to expire, you should make sure you stay lawful by holding valid visa while we process your application.\n\nWhen you apply for this visa in Australia, you are likely to be granted a bridging visa. If your current visa expires before we make a decision on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\n\nWhen you apply for this visa in Australia, you are likely to be granted a bridging visa. If your current visa expires before we make a decision on your application, the bridging visa will start. You can stay in Australia on the bridging visa while we process your new visa application.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Pay the second instalment\n\nPay the second instalment\n\nYou must pay the second instalment before we grant the visa. We will send you an invoice when it is due. If you don’t pay the invoice, we will refuse your application.\n\nYou must pay the second instalment before we grant the visa. We will send you an invoice when it is due. If you don’t pay the invoice, we will refuse your application.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you have imported your application into ImmiAccount, you can use it to upload any additional documents that you did not provide with your application.\n\nIf you have imported your application into ImmiAccount, you can use it to upload any additional documents that you did not provide with your application.\n\nAlternatively, you can send any documents to the Parent Visa Centre in Perth.\n\nAlternatively, you can send any documents to the Parent Visa Centre in Perth.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou might be able to add family members to your application before we make a decision.\n\nYou might be able to add family members to your application before we make a decision.\n\nComplete and send usForm 1436 Adding an additional applicant after lodgement (481KB PDF).\n\nComplete and send us\nForm 1436 Adding an additional applicant after lodgement (481KB PDF)\n.\n\nYou will also need to provide evidence of your relationship and the family member’s passport.\n\nYou will also need to provide evidence of your relationship and the family member’s passport.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form and any additional documents.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form and any additional documents.\n\nAny family members you add to your application after you apply must be in Australia when you add them.\n\nAny family members you add to your application after you apply must be in Australia when you add them.\nSee how\n\n#### Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you make a mistake on your application.\n\nLet us know as soon as you can if you make a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF).\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms to the office you submitted your application to.\n\nSend written notification or your forms to the office you submitted your application to.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nSee what to do ifyour situation changes.\n\nSee what to do if\nyour situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou must be in Australia, but not in immigration clearance, when we make a decision on your application.\n\nYou must be in Australia, but not in immigration clearance, when we make a decision on your application.\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nIf we grant you the visa, we will let you know:\n\nIf we grant you the visa, we will let you know:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions.\nyour visa conditions.\n\nWe recommend you keep a copy of our decision.\n\nWe recommend you keep a copy of our decision.\n\nIf we refuse your visa we will let you know:\n\nIf we refuse your visa we will let you know:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision.\nwhether you have a right to a review of the decision.\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\nWhen you have this visa\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.​\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, seeUpdate to ImmiAccount — new online services for paper-based Parent visa applications.\n\nFrom 2 April 2025, applicants for Parent visa subclasses 143, 173, 804, 864 and 884 will be able to import their paper application into ImmiAccount after lodgement. Parent visa (subclass 103) applications lodged after November 2018 can also be imported. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Parent visa applications\n.\n​\nIn Australia\nLeaving Australia\n\n## In Australia\n\nIn Australia\n\n### What you must do when you have this visa\n\nWhat you must do when you have this visa\n\nYou and your dependants must meet all visa conditions and obey all Australian laws.\n\nYou and your dependants must meet all visa conditions and obey all Australian laws.\n\n### Tell us if things change\n\nTell us if things change\n\nSee what to do ifyour situation changes.\n\nSee what to do if\nyour situation changes\n.\n\n### What can you do on your visa\n\nWhat can you do on your visa\n\nSee your visa expiry, conditions and work and study entitlements inVEVO.\n\nSee your visa expiry, conditions and work and study entitlements in\nVEVO\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\n### Access Australian Government benefits\n\nAccess Australian Government benefits\n\nAs a newly arrived resident, you might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents waiting periods fromServices Australia.\n\nAs a newly arrived resident, you might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents waiting periods from\nServices Australia\n.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid.\n\nIf you want to travel after the initial 5-year travel facility:\n\nIf you want to travel after the initial 5-year travel facility:\n- to re-enter Australia as a permanent resident you will need to apply for and be granted aResident Return (RRV)\nto re-enter Australia as a permanent resident you will need to apply for and be granted a\nResident Return (RRV)\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times forAustralian citizenship.\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for\nAustralian citizenship\n.\n\nTo see when your travel facility ends, useVEVO.\n\nTo see when your travel facility ends, use\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\nTo get proof of your travel in and out of Australia,request your international movement records.\n\nTo get proof of your travel in and out of Australia,\nrequest your international movement records\n.\n\n### Working\n\nWorking\n\nWith this visa you become a permanent resident. This means you can work and study. You are protected by Australian workplace law.See your workplace rights and entitlements.\n\nWith this visa you become a permanent resident. This means you can work and study. You are protected by Australian workplace law.\nSee your workplace rights and entitlements\n.\n\n### Bringing a family member\n\nBringing a family member\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship.  Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship.  Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, your permanent residence starts on the day we grant the visa.\n\nFor citizenship purposes, your permanent residence starts on the day we grant the visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your travel facility is still valid\n\nEnsure your travel facility is still valid\n\nTo see when your travel facility ends, useVEVO.\n\nTo see when your travel facility ends, use\nVEVO\n.\n\nSee what to do if yourtravel facility has expired or is about to expire.\n\nSee what to do if your\ntravel facility has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Departures SmartGate\n\nDepartures SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Proving you have been to Australia\n\nProving you have been to Australia\n\nTo get proof of your travel in and out of Australia,request your international movement records.\n\nTo get proof of your travel in and out of Australia,\nrequest your international movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-temporary-884",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#Overview",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/sponsored-parent-temporary-870",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864/balance-of-family-test",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/contributory-aged-parent-864#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:07:20.249723",
  "metadata": {}
}