{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/higher-education-sector-573",
  "title": "Higher Education Sector visa (subclass 573)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Higher Education Sector visa (subclass 573) Page Content ​You can no longer apply for the Higher Education Sector visa (subclass 573). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 500) Visa holders Details This information is for people who have already been granted a Higher Education Sector visa (subclass 573) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations. You can use the free Visa Entitlement Verification Online (VEVO) to check your visa details and conditions. How long your visa lasts Details If you already have a Higher Education Sector visa (subclass 573), it will be valid until the expiry date you were given when your visa was granted. What this visa lets you do Details With this visa: you can study in Australia eligible dependant family members can accompany you to Australia when you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You must also comply with State and Territory workplace laws . your family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia. If you are doing a postgraduate course, such as a Masters degree, your family members can work unlimited hours once you commence this course. your family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia Obligations Details Student Details You must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws. If you want to change to a course that is in a different education sector to your current course for example changing from high school to a Diploma course, you will need to apply for a new Student Visa (subclass 500) because your visa subclass will not be appropriate for your new course (or package of courses). If you were granted your visa under streamlined visa processing (SVP), you must continue to satisfy the requirement for the grant of the visa. This means we could consider cancelling your visa if you seek to transfer to a different education provider who was not an eligible education provider (before 1 July 2016) If: it is within the first 12 months of your visa being granted, or you are not from a country that was Assessment Level 1 before 1 July 2016. Check which conditions apply to your visa with Visa Entitlement Verification Online (VEVO) or your visa grant letter. Changing your education provider Details In addition to ensuring that you comply with your visa conditions, there are also requirements under the Education Services for Overseas Students (ESOS) National Code that apply if you want to change your education provider. If you have not completed six months of your principal course (the main course of study you are undertaking) and you want to change your education provider, the ESOS National Code sets out the circumstances in which this will be possible. Unless special circumstances apply, you are usually required to have the permission of your existing education provider in order to transfer to another education provider. If you do want to transfer, your education provider must assess or consider your request to transfer. All education providers must have documented procedures on their transfer policy. You should make sure you understand your education provider's transfer policy, and what your written agreement says you must do, before you attempt to enrol with a new education provider. If your education provider does not give you permission to transfer to another education provider and you are not satisfied with the outcome, you should first access the internal appeal process with your education provider. If you are still not satisfied, you can appeal the education provider's decision at an external complaints handling body, such as the State or Territory Ombudsman or the Overseas Student Ombudsman. Students under 18 years of age Details If you are under 18 years of age you must maintain adequate accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18. If your welfare arrangements are approved by your education provider you cannot travel to Australia until your welfare arrangements commence. The date your welfare arrangements commence is the welfare start date that your education provider has nominated on the Confirmation of Appropriate Accommodation/Welfare Arrangements (CAAW) letter. If a student guardian is providing for your welfare arrangements and they need to leave Australia without you, you will need to make alternative welfare arrangements and these must be approved by us first. If you do not do this, your visa could be cancelled. 'No further stay' condition Details Some visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation Family member Details Your dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia. Your family members must: remain a member of your family for the duration of their stay in Australia have adequate financial support maintain adequate health cover work no more than 40 hours per fortnight. Exception: family members of the students who are studying a Master Degree course, can work unlimited hours once the student starts their main course attend school if they are of school age. Important: It is your responsibility to ensure that your family members meet the above conditions.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Higher Education Sector visa (subclass 573)\n\nHigher Education Sector visa (subclass 573)\nPage Content\n\n​You can no longer apply for the Higher Education Sector visa (subclass 573). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  aStudent Visa (subclass 500).\n\n​You can no longer apply for the Higher Education Sector visa (subclass 573). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  a\nStudent Visa (subclass 500)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Higher Education Sector visa (subclass 573) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Higher Education Sector visa (subclass 573) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can use the freeVisa Entitlement Verification Online (VEVO)to check your visa details and conditions.\n\nYou can use the free\nVisa Entitlement Verification Online (VEVO)\nto check your visa details and conditions.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you already have a Higher Education Sector visa (subclass 573), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already have a Higher Education Sector visa (subclass 573), it will be valid until the expiry date you were given when your visa was granted.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nWith this visa:\n\nWith this visa:\n- you can study in Australia\nyou can study in Australia\n- eligible dependant family members can accompany you to Australia\neligible dependant family members can accompany you to Australia\n- when you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You must also comply with State and Territory workplace laws .\nwhen you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You must also comply with State and Territory workplace laws .\n- your family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia. If you are doing a postgraduate course, such as a Masters degree, your family members can work unlimited hours once you commence this course.\nyour family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia. If you are doing a postgraduate course, such as a Masters degree, your family members can work unlimited hours once you commence this course.\n- your family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia\nyour family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia\n\n## Obligations\n\nObligations\nDetails\n\n### Student\n\nStudent\nDetails\n\nYou must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws.If you want to change to a course that is in a different education sector to your current course for example changing from high school to a Diploma course, you will need to apply for a new Student Visa (subclass 500) because your visa subclass will not be appropriate for your new course (or package of courses).If you were granted your visa under streamlined visa processing (SVP), you must continue to satisfy the requirement for the grant of the visa. This means we could consider cancelling your visa if you seek to transfer to a different education provider who was not aneligible education provider(before 1 July 2016) If:\n\nYou must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws.\nIf you want to change to a course that is in a different education sector to your current course for example changing from high school to a Diploma course, you will need to apply for a new Student Visa (subclass 500) because your visa subclass will not be appropriate for your new course (or package of courses).\nIf you were granted your visa under streamlined visa processing (SVP), you must continue to satisfy the requirement for the grant of the visa. This means we could consider cancelling your visa if you seek to transfer to a different education provider who was not an\neligible education provider\n(before 1 July 2016) If:\n- it is within the first 12 months of your visa being granted, or\nit is within the first 12 months of your visa being granted, or\n- you are not from a country that was Assessment Level 1 before 1 July 2016.\nyou are not from a country that was Assessment Level 1 before 1 July 2016.\n\nCheck which conditions apply to your visa withVisa Entitlement Verification Online (VEVO)or your visa grant letter.\n\nCheck which conditions apply to your visa with\nVisa Entitlement Verification Online (VEVO)\nor your visa grant letter.\n\n#### Changing your education provider\n\nChanging your education provider\nDetails\n\nIn addition to ensuring that you comply with your visa conditions, there are also requirements under the Education Services for Overseas Students (ESOS) National Code that apply if you want to change your education provider.\n\nIn addition to ensuring that you comply with your visa conditions, there are also requirements under the Education Services for Overseas Students (ESOS) National Code that apply if you want to change your education provider.\n\nIf you have not completed six months of your principal course (the main course of study you are undertaking) and you want to change your education provider, the ESOS National Code sets out the circumstances in which this will be possible. Unless special circumstances apply, you are usually required to have the permission of your existing education provider in order to transfer to another education provider.\n\nIf you have not completed six months of your principal course (the main course of study you are undertaking) and you want to change your education provider, the ESOS National Code sets out the circumstances in which this will be possible. Unless special circumstances apply, you are usually required to have the permission of your existing education provider in order to transfer to another education provider.\n\nIf you do want to transfer, your education provider must assess or consider your request to transfer. All education providers must have documented procedures on their transfer policy. You should make sure you understand your education provider's transfer policy, and what your written agreement says you must do, before you attempt to enrol with a new education provider.\n\nIf you do want to transfer, your education provider must assess or consider your request to transfer. All education providers must have documented procedures on their transfer policy. You should make sure you understand your education provider's transfer policy, and what your written agreement says you must do, before you attempt to enrol with a new education provider.\n\nIf your education provider does not give you permission to transfer to another education provider and you are not satisfied with the outcome, you should first access the internal appeal process with your education provider. If you are still not satisfied, you can appeal the education provider's decision at an external complaints handling body, such as the State or Territory Ombudsman or the Overseas Student Ombudsman.\n\nIf your education provider does not give you permission to transfer to another education provider and you are not satisfied with the outcome, you should first access the internal appeal process with your education provider. If you are still not satisfied, you can appeal the education provider's decision at an external complaints handling body, such as the State or Territory Ombudsman or the Overseas Student Ombudsman.\n\n#### Students under 18 years of age\n\nStudents under 18 years of age\nDetails\n\nIf you are under 18 years of age you must maintain adequate  accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18.\n\nIf you are under 18 years of age you must maintain adequate  accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18.\n\nIf yourwelfare arrangementsare approved by your education provider you cannot travel to Australia until your welfare arrangements commence. The date your welfare arrangements commence is the welfare start date that your education provider has nominated on the Confirmation of Appropriate Accommodation/Welfare Arrangements (CAAW) letter.\n\nIf your\nwelfare arrangements\nare approved by your education provider you cannot travel to Australia until your welfare arrangements commence. The date your welfare arrangements commence is the welfare start date that your education provider has nominated on the Confirmation of Appropriate Accommodation/Welfare Arrangements (CAAW) letter.\n\nIf a student guardian is providing for your welfare arrangements and they need to leave Australia without you, you will need to make alternative welfare arrangements and these must be approved by us first. If you do not do this, your visa could be cancelled.\n\nIf a student guardian is providing for your welfare arrangements and they need to leave Australia without you, you will need to make alternative welfare arrangements and these must be approved by us first. If you do not do this, your visa could be cancelled.\n\n#### 'No further stay' condition\n\n'No further stay' condition\nDetails\n\nSome visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\nSome visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### Family member\n\nFamily member\nDetails\n\nYour dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia.\n\nYour dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia.\n\nYour family members must:\n\nYour family members must:\n- remain a member of your family for the duration of their stay in Australia\nremain a member of your family for the duration of their stay in Australia\n- have adequate financial support\nhave adequate financial support\n- maintain adequate health cover\nmaintain adequate health cover\n- work no more than 40 hours per fortnight. Exception: family members of the students who are studying a Master Degree course, can work unlimited hours once the student starts their main course\nwork no more than 40 hours per fortnight. Exception: family members of the students who are studying a Master Degree course, can work unlimited hours once the student starts their main course\n- attend school if they are of school age.\nattend school if they are of school age.\n\nImportant:It is your responsibility to ensure that your family members meet the above conditions.\n\nImportant:\nIt is your responsibility to ensure that your family members meet the above conditions.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/higher-education-sector-573#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/higher-education-sector-573#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:38:14.466588",
  "metadata": {}
}