{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590",
  "title": "Student Guardian visa",
  "raw_text": "===== main placeholder ========================================== Subclass 590 Student Guardian visa Visit to support a child who holds a student visa. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay This is a temporary visa. We will determine the length of the visa by the student visa holder’s stay and their age. Cost From AUD2,000.00 Cost Exemption From 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application. See About this visa To work out what your visa will cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa you can come to Australia to provide care and support for a student visa holder who is under 18 years of age or older due to exceptional circumstances See all conditions Check your eligibility You must be the student's parent, custodian or relative who is 21 years or older have and show evidence of sufficient funds to support yourself and the student during your stay have adequate health insurance in place be able to provide accommodation, welfare and other support hold an eligible substantive visa, if in Australia. Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application Apply About this visa With this visa you can How long you can stay Stay longer Include family Cost Apply from Processing times Your obligations Travel Financial support Visa label With this visa you can come to Australia to provide care and support for a student visa holder who is under 18 years of age (or over 18 in exceptional circumstances) care for more than one student study an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months You cannot work. How long you can stay You can stay in Australia until a date specified on your visa grant letter. In deciding this date, we usually consider the length of the student visa holder’s stay or when that student turns 18. Stay longer You can stay in Australia by applying for a further Student Guardian visa. Include family We will not grant you a visa if any members of the family unit is under 6 years old unless: there are compelling and compassionate reasons or granting the visa would significantly benefit the relationship between the Australian Government and the government of another country This applies even if your family members under 6 years old are not planning to travel to Australia with you. If a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa. You can't include children under 6 years old after you have submitted your application. Cost The visa costs from AUD2,000.00 for the main applicant. There is also a charge for each family member who applies for the visa with you. You might also have to pay other costs for: health checks police certificates biometrics To work out what your visa will cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. Cost for eligible Pacific Island and Timor-Leste Student and Student Guardian visa applicants From 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application. We will charge eligible applicants the lower visa application cost during the application process in ImmiAccount . We will recognise eligible applicants by the valid passport from the specified countries used in the application when they apply. Family members are also eligible for the lower visa cost. We base this on the passport of the primary applicant (or visa holder who satisfies the primary visa criteria). The primary applicant must hold a valid passport issued by one of the following countries: Federated States of Micronesia Fiji Kiribati Nauru Palau Papua New Guinea Republic of the Marshall Islands Samoa Solomon Islands Timor-Leste Tonga Tuvalu Vanuatu. Apply from You can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see 'Have this visa if applying while in Australia' under Eligibility Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application may take longer to process if: you do not fill it in correctly you do not include all the documents we need or we need more information from you it takes us time to verify your information We cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. Your obligations You and your family members must meet all visa conditions and obey Australian laws. See which conditions will and might be attached to this visa. Travel You can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have made alternative welfare arrangements The time you spend outside Australia does not extend the visa. Financial support You will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Have this visa if applying while in Australia Details You can be in or outside Australia when you apply for the visa. You can apply in Australia if you hold a substantive visa except for one of these: Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) Temporary Graduate visa (subclass 485) Visitor visa (subclass 600) Electronic Travel Authority visa (subclass 601) (ETA) Medical Treatment visa (subclass 602) eVisitor visa (subclass 651) Transit visa (subclass 771) Maritime Crew visa (subclass 988) Diplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia If you don't hold an eligible substantive visa you can apply within 28 days of either: holding a student visa, a special purpose visa, or a dependent Diplomatic (temporary) visa being notified by the Tribunal that your visa cancellation has been set aside. Be a parent, custodian or relative Details To be a Student Guardian you must be: the parent of the student visa holder, or a person who has custody of the student, or a relative of the student, aged 21 years or older and nominated in writing by a parent or person who has custody of the student. You are required to provide care and support for: a student visa holder who is under 18 years of age or a student visa holder who is 18 years of age or older and needs care and support due to exceptional circumstances. For this visa, a relative is the student's: parent or step-parent grandparent or step-grandparent sibling or stepsibling aunt, uncle, step-aunt or step-uncle niece, nephew or step-niece or step-nephew partner or child or stepchild. Be able to provide for the student Details You must be able to provide accommodation, general welfare and support to the student. Have enough money for your stay Details You must show us evidence that you have enough money to pay for your stay in Australia. This includes meeting the costs and expenses of yourself, your accompanying family members and the student visa holder. To see what you will need to provide, go to Gather Documents in the 'Step by Step tab' Bringing children to Australia Details We will not grant you a visa if any members of the family unit is under 6 years old unless: there are compelling and compassionate reasons or granting the visa would significantly benefit the relationship between the Australian Government and the government of another country This applies even if your family members under 6 years old are not planning to travel to Australia with you. If a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa. Making welfare arrangements for dependants overseas Details You must make adequate arrangements for the accommodation, support and welfare of any non-migrating children of your family who: are not coming with you to Australia are under 18 years of age and does not have a Student visa. We consider you have made adequate welfare arrangements for your children aged 6 to 18 years if they will be living with: another parent or custodian or a relative who is at least 21 years old You must show evidence of welfare arrangements and a letter from the appointed guardian accepting responsibility for the non-migrating child while you reside in Australia. The letter should detail the guardian's consent that the child will be wholly or substantially reliant on the guardian's financial support. The child must also reside in the guardian's household. A copy of the guardian's current personal particulars (bio-data) page of their passport or a valid driver's licence showing the signature field should also be included. Have adequate health insurance Details You are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. You must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport. See a guide to what we consider adequate health insurance Learn more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Be a genuine temporary entrant Details You must only intend to: stay temporarily in Australia do the things you are allowed to do on this visa You must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held. When we assess whether you plan to stay in Australia temporarily we will consider: your personal circumstances in your home country your potential circumstances in Australia your immigration history anything else that relates to your plan to remain in Australia temporarily. Meeting our health requirement Details You and any family members who apply for the visa with you must meet our health requirement Meeting our character requirement Details If you are a relative of the student visa holder, you must meet our character requirement Sign the Australian values statement Details You must: have read, or had explained to you, the Life in Australia booklet and sign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws Have no debt to the Australian Government Details If you or any family members owe the Australian Government money, you or they must have paid it back or arranged to pay it back. Not had a visa cancelled or an application refused Details We will consider your immigration history when we decide on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. If applying for a visa from outside Australia see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Best interests of the child Details We might not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply You might need to organise health exams. See what to do if you want help with your application. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide accurate information. See what happens if you cannot prove your identity or do not give us true information Show steps Identity documents We need proof of your identity. If you cannot prove your identity: we will refuse your visa application we might not grant you another visa for 10 years we might not grant any family members you listed on your application a visa for 10 years You must provide: the pages of your current passport showing your photo, personal details, and passport issue and expiry dates a national identity card, if you have one proof of any change of name (if applicable) Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. You must have any document(s) in a language other than English translated into English. Provide copies of both the translated documents and the document in the original language. See how Student guardianship documents Provide a completed Form 157N - Student guardianship arrangements (291KB PDF) Your application will not be valid if you do not provide the completed Form 157N. See how Genuine temporary entrant documents Show proof that you are staying in Australia temporarily: Write a personal statement addressing the Genuine Temporary Entry (GTE) requirement. If you are not comfortable writing it in English, you can write your statement in your own language and submit a translated copy with your application. In your written statement, provide evidence or information about circumstances in your home country, ties to your home country or country of residence and incentive to return. This could include: evidence of immediate family members in your home country your visa or residence status in your home country and your right to return your previous immigration history proof of property or other significant assets in your home country a letter from your employer confirming your leave. We consider your personal circumstances when we make a decision. When we assess whether you are a genuine temporary entrant, we consider your overall situation. See how Evidence you have enough money for your stay The living costs we ask you to declare and provide with your visa application indicate the cost of living in Australia. Actual living costs vary throughout Australia. We recommend you research the area you intend to live, including the cost of living in that area. There are options to prove you have genuine access to enough money for your stay. You must ensure you have enough money to support yourself, the student visa holder(s) and any children who come to Australia with you. You need enough money to pay for: travel costs for you and the student visa holder(s) 12 months of course fees for the student visa holder(s) (or pro rata fees, if the course is less than 12 months) 12 months of living costs for you, the student visa holder(s) and accompanying family members (or pro rata living costs, if stay is less than 12 months) school fees for school-age children who accompany you (or pro rata fees, if the child will be at school for less than 12 months). Evidence you can provide includes: money deposits held within a financial institution loans from a financial institution and/or government scholarship or financial support. If someone else is providing you funds, give us evidence of your relationship with them and their identity documents. If you are providing evidence of deposits of money, explain their source. Only certain people are acceptable in terms of providing you with financial support. Work out how much money you need Use the following information to work out how much money you need. To calculate pro rata costs, divide the annual cost by 365 and multiply the result by the number of days you intend to stay in Australia. Living costs 12-month living costs: for you – AUD29,710 for a child coming with you – AUD4,449. Schooling costs You must have 12 months of course fees for the student visa holder(s) or pro-rata if less than 12 months. If you are including children (under 6 years old) in your application, add schooling costs of at least AUD13,502 per year, per child. Costs vary between states, territories and schools in Australia. You are responsible for finding out how much schooling will cost. Travel Costs As a guide, allow $2000 per person. Evidence you have genuine access to the money You must show you will have genuine access to funds while you are in Australia for: meeting the costs and expenses of yourself, your accompanying family members and in most cases, the student visa holder. proving your financial capacity for the matters specified above Annual income Alternatively, you could also show us that your spouse or de facto partner, (who is not travelling to Australia), will support you. They must have an annual income of AUD102,500 or more in the 12 months immediately before you apply. You must provide evidence of personal income. This must be in the form of official government documents, such as tax assessments that are less than 12 months old. We will not accept bank statements or direct evidence from an employer as evidence of annual income. See how Health insurance You will need to provide evidence of adequate health insurance for you and your family members for the first 12 months of your stay in Australia. This can be an Overseas Visitors Health Cover (OVHC) premium or another health insurance product from Australia or your home country that provides a similar level of cover. OVHC is available through several private and general insurers in Australia. However, the benefits available, membership costs and eligibility can vary between insurers. Learn more about Overseas Visitors & Overseas Students and adequate health insurance See how Polio vaccination certificate If you are applying from outside Australia and you are travelling from, or spent time in, a country considered at risk of polio, you need to give us a polio vaccination certificate. For the current countries of risk, see Threats to public health See how Character documents If you are a relative of the student visa holder, you must provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. You are also required to provide an overseas police certificate from every country , where you spent a total of 12 months or more in the last 10 years since you turned 16. This includes your home country. Learn more about country-specific instructions on how to obtain a police certificate and Character requirements for visas See how Documents for dependants under 6 years old If you have any dependants under 6 years old, you must provide: a statement to demonstrate compelling and compassionate circumstances or provide written support from the government of your home country or a letter of support from the Australian Department of Foreign Affairs and Trade. For every dependant under 6 years old who is applying with you, you must also provide: copies of birth certificates or the family book showing the names of both parents of all your dependent children and copies of the adoption paper, if applicable Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child. They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) or a statutory declaration giving their consent for the child to visit Australia on this visa. Alternatively, if you have sole responsibility of the student(s) you must, provide evidence. Acceptable evidence may include: a court order, custody documentation, or a death certificate of the other parent, or that the laws of your home country allow them to migrate. You must also include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence and adoption papers or other court documents if applicable. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Prepare your documents See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. Scan or photograph documents Scan or photograph all documents (English and non-English) in colour. The scans and photos must be legible. If a document is more than 1 page, save it all as 1 file. Keep a copy Keep a copy of your completed application. Step 3 Apply for the visa You must apply for this visa online. You should apply at the same time as the student. Show steps If you are in Australia You must hold an eligible substantive visa, or apply: within 28 days of holding a Student visa, a Special Purpose visa, or a dependent Diplomatic (temporary) visa, or within 28 days of being notified by the Tribunal that your visa cancellation has been set aside. You cannot apply for a Student Guardian visa in Australia if you hold one of these: Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) Temporary Graduate visa (subclass 485) Visitor visa (subclass 600) Electronic Travel Authority visa (subclass 601) Medical Treatment visa (subclass 602) eVisitor visa (subclass 651) Transit visa (subclass 771) Maritime crew visa (subclass 988) Diplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia See how Do not provide false and misleading information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply online Log in or create an ImmiAccount Attach documents Pay the application fee . We will not process your application until you pay the fee. See how Step 4 After you apply We will let you know when we have received your application and documents. See what you can and must do after you apply. Show steps Status updates Do not call if it is in standard processing times . We can't give any further updates on the application's progress. You can see if we have asked for more information in your ImmiAccount Travel after you apply You do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision. But if you leave Australia, make sure you have a valid visa to return. You can't leave Australia without the student visa holder unless you you have made alternative welfare arrangements Learn about visa expiry See how Health exams We will let you know if you need health examinations Biometrics We might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them. Provide more information If you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount We might also ask you to provide more information. Stay lawful If you are in Australia, make sure you stay lawful by holding a valid visa while we process your application. If you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure. Do not get cancel your current visa cancelled. If you do, you will be in Australia unlawfully. Learn more about visa expiry See how Mistakes on your application Let us know as soon as you can. If you do not tell us you made a mistake on your application, we might refuse it. Complete Form 1023 Notification of incorrect answers (168KB PDF) and upload in ImmiAccount. Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome We will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you: your visa grant number the date your visa starts your visa conditions Keep a copy of the decision with you when in Australia. If we refuse your visa, we will tell you why it was refused and whether you have a right to a review of the decision. We will not refund the application fee if we refuse your application. When you have this visa Now you have your visa Coming to Australia In Australia Leaving Australia Now you have your visa If we have granted you a Student Guardian (subclass 590) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us. We will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare. To withdraw any other visa application, you must tell us in writing. More information is available on our website at You want to withdraw an application Coming to Australia Before you leave Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the border Completing an Incoming Passenger Card All people arriving Australia must complete the Incoming Passenger Card . You will get the card on board. In Australia What you can do when you have this visa come to Australia to provide care and support for a student visa holder who is under the age of 18 (or over 18 in exceptional circumstances) care for more than one student study an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months What you must do on this visa You, and your family members, must comply with all visa conditions and Australian laws. Check your conditions in your grant letter or in VEVO If a family member under 6 gets the visa, they must apply for their own Student visa once they turn 6 to keep studying in Australia. Tell us if things change Things you need to let us know about include changes to your phone number, email, address or passport changes to your relationship status changes to your work the birth of a child changes to your welfare arrangements See how to let us know if there is a change in your situation How long you can stay This is a temporary visa. You can stay in Australia until the date provided in your visa grant letter. To see when you must leave, use VEVO Staying longer You can stay in Australia longer by applying for a further Student Guardian visa. Travelling on your visa You can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have made alternative welfare arrangements The time you spend outside Australia does not extend the visa. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working on this visa To see your conditions for work, use VEVO If your visa has condition 8101, you must not work in Australia. This means when in Australia, you must not do work that a person would normally get paid for. For more information and examples of how this condition might apply to you see visa conditions Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. You can't leave Australia without the student visa holder unless you have made alternative welfare arrangements . You must have: compassionate or compelling reasons alternative and suitable arrangements in place the approval of the minor's education provider If you leave Australia without alternative welfare arrangements, you may be in breach of condition 8538 . We may cancel your visa. At the border Leaving the airport faster (all visas) We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave To prove you have been to Australia Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 590\n\n# Student Guardian visa\n\nStudent Guardian visa\n\nVisit to support a child who holds a student visa.\n\nVisit to support a child who holds a student visa.\n\nVisit to support a child who holds a student visa.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nThis is a temporary visa. We will determine the length of the visa by the student visa holder’s stay and their age.\n\nThis is a temporary visa. We will determine the length of the visa by the student visa holder’s stay and their age.\n\n#### Cost\n\nCost\n\nFromAUD2,000.00Cost ExemptionFrom 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application. SeeAbout this visa.To work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nFromAUD2,000.00\n\nFrom\nAUD2,000.00\n\n#### Cost Exemption\n\nCost Exemption\n\nFrom 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application. SeeAbout this visa.\n\nFrom 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application. See\nAbout this visa\n.\n\nTo work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa you can\n\nWith this visa you can\n- come to Australia to provide care and support for a student visa holder who is under 18 years of age or older due to exceptional circumstances\ncome to Australia to provide care and support for a student visa holder who is under 18 years of age or older due to exceptional circumstances\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be the student's parent, custodian or relative who is 21 years or older\nbe the student's parent, custodian or relative who is 21 years or older\n- have and show evidence of sufficient funds to support yourself and the student during your stay\nhave and show evidence of sufficient funds to support yourself and the student during your stay\n- have adequate health insurance in place\nhave adequate health insurance in place\n- be able to provide accommodation, welfare and other support\nbe able to provide accommodation, welfare and other support\n- hold an eligible substantive visa, if in Australia.\nhold an eligible substantive visa, if in Australia.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\n\nApply\n\nApply\nAbout this visa\nWith this visa you can\nHow long you can stay\nStay longer\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nTravel\nFinancial support\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- come to Australia to provide care and support for a student visa holder who is under 18 years of age (or over 18 in exceptional circumstances)\ncome to Australia to provide care and support for a student visa holder who is under 18 years of age (or over 18 in exceptional circumstances)\n- care for more than one student\ncare for more than one student\n- study an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months\nstudy an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months\n\nYou cannot work.\n\nYou cannot work.\n\n## How long you can stay\n\nHow long you can stay\n\nYou can stay in Australia until a date specified on your visa grant letter. In deciding this date, we usually consider the length of the student visa holder’s stay or when that student turns 18.\n\nYou can stay in Australia until a date specified on your visa grant letter. In deciding this date, we usually consider the length of the student visa holder’s stay or when that student turns 18.\n\n## Stay longer\n\nStay longer\n\nYou can stay in Australia by applying for a further Student Guardian visa.\n\nYou can stay in Australia by applying for a further Student Guardian visa.\n\n## Include family\n\nInclude family\n\nWe will not grant you a visa if anymembers of the family unitis under 6 years old unless:\n\nWe will not grant you a visa if any\nmembers of the family unit\nis under 6 years old unless:\n- there are compelling and compassionate reasons or\nthere are compelling and compassionate reasons or\n- granting the visa would significantly benefit the relationship between the Australian Government and the government of another country\ngranting the visa would significantly benefit the relationship between the Australian Government and the government of another country\n\nThis applies even if your family members under 6 years old are not planning to travel to Australia with you.\n\nThis applies even if your family members under 6 years old are not planning to travel to Australia with you.\n\nIf a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa.\n\nIf a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa.\n\nYou can't include children under 6 years old after you have submitted your application.\n\nYou can't include children under 6 years old after you have submitted your application.\n\n## Cost\n\nCost\n\nThe visa costs fromAUD2,000.00for the main applicant.\n\nThe visa costs from\nAUD2,000.00\nfor the main applicant.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nYou might also have to pay other costs for:\n\nYou might also have to pay other costs for:\n- health checks\nhealth checks\n- police certificates\npolice certificates\n- biometrics.\nbiometrics\n.\n\nTo work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n### Cost for eligible Pacific Island and Timor-Leste Student and Student Guardian visa applicants\n\nCost for eligible Pacific Island and Timor-Leste Student and Student Guardian visa applicants\n\nFrom 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application.\n\nFrom 22 March 2025, a lower visa cost applies to eligible Pacific Island and Timor-Leste citizens who lodge a valid Student or Student Guardian visa application.\n\nWe will charge eligible applicants the lower visa application cost during the application process inImmiAccount. We will recognise eligible applicants by the valid passport from the specified countries used in the application when they apply.\n\nWe will charge eligible applicants the lower visa application cost during the application process in\nImmiAccount\n. We will recognise eligible applicants by the valid passport from the specified countries used in the application when they apply.\n\nFamily members are also eligible for the lower visa cost. We base this on the passport of the primary applicant (or visa holder who satisfies the primary visa criteria).\n\nFamily members are also eligible for the lower visa cost. We base this on the passport of the primary applicant (or visa holder who satisfies the primary visa criteria).\n\nThe primary applicant must hold a valid passport issued by one of the following countries:\n\nThe primary applicant must hold a valid passport issued by one of the following countries:\n- Federated States of Micronesia\nFederated States of Micronesia\n- Fiji\nFiji\n- Kiribati\nKiribati\n- Nauru\nNauru\n- Palau\nPalau\n- Papua New Guinea\nPapua New Guinea\n- Republic of the Marshall Islands\nRepublic of the Marshall Islands\n- Samoa\nSamoa\n- Solomon Islands\nSolomon Islands\n- Timor-Leste\nTimor-Leste\n- Tonga\nTonga\n- Tuvalu\nTuvalu\n- Vanuatu.\nVanuatu.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see 'Have this visa if applying while in Australia' underEligibility.\n\nYou can be in or outside Australia when you apply for the visa and when we decide on your application. If you are in Australia you must hold an eligible substantive visa. For more information see 'Have this visa if applying while in Australia' under\nEligibility\n.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application may take longer to process if:\n\nYour application may take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need or we need more information from you\nyou do not include all the documents we need or we need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe cannot process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nSeewhich conditions will and might be attached to this visa.\n\nSee\nwhich conditions will and might be attached to this visa.\n\n## Travel\n\nTravel\n\nYou can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have madealternative welfare arrangements.\n\nYou can travel outside Australia and return as many times as you want while the visa is valid. But you can't leave Australia without the student visa holder unless you have made\nalternative welfare arrangements\n.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n## Financial support\n\nFinancial support\n\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members\n\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Have this visa if applying while in Australia\n\nHave this visa if applying while in Australia\nDetails\n\nYou can be in or outside Australia when you apply for the visa.\n\nYou can be in or outside Australia when you apply for the visa.\n\nYou can apply in Australia if you hold asubstantive visaexcept for one of these:\n\nYou can apply in Australia if you hold a\nsubstantive visa\nexcept for one of these:\n- Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream\nTemporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream\n- Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\nDomestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\n- Temporary Graduate visa (subclass 485)\nTemporary Graduate visa (subclass 485)\n- Visitor visa (subclass 600)\nVisitor visa (subclass 600)\n- Electronic Travel Authority visa (subclass 601) (ETA)\nElectronic Travel Authority visa (subclass 601) (ETA)\n- Medical Treatment visa (subclass 602)\nMedical Treatment visa (subclass 602)\n- eVisitor visa (subclass 651)\neVisitor visa (subclass 651)\n- Transit visa (subclass 771)\nTransit visa (subclass 771)\n- Maritime Crew visa (subclass 988)\nMaritime Crew visa (subclass 988)\n- Diplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia\nDiplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia\n\nIf you don't hold an eligiblesubstantive visayou can apply within 28 days of either:\n\nIf you don't hold an eligible\nsubstantive visa\nyou can apply within 28 days of either:\n- holding a student visa, a special purpose visa, or a dependent Diplomatic (temporary) visa\nholding a student visa, a special purpose visa, or a dependent Diplomatic (temporary) visa\n- being notified by the Tribunal that your visa cancellation has been set aside.\nbeing notified by the Tribunal that your visa cancellation has been set aside.\n\n## Be a parent, custodian or relative\n\nBe a parent, custodian or relative\nDetails\n\nTo be a Student Guardian you must be:\n\nTo be a Student Guardian you must be:\n- the parent of the student visa holder, or\nthe parent of the student visa holder, or\n- a person who has custody of the student, or\na person who has custody of the student, or\n- a relative of the student, aged 21 years or older and nominated in writing by a parent or person who has custody of the student.\na relative of the student, aged 21 years or older and nominated in writing by a parent or person who has custody of the student.\n\nYou are required to provide care and support for:\n\nYou are required to provide care and support for:\n- a student visa holder who is under 18 years of age or\na student visa holder who is under 18 years of age or\n- a student visa holder who is 18 years of age or older and needs care and support due to exceptional circumstances.\na student visa holder who is 18 years of age or older and needs care and support due to exceptional circumstances.\n\nFor this visa, a relative is the student's:\n\nFor this visa, a relative is the student's:\n- parent or step-parent\nparent or step-parent\n- grandparent or step-grandparent\ngrandparent or step-grandparent\n- siblingor stepsibling\nsibling\nor stepsibling\n- aunt, uncle, step-aunt or step-uncle\naunt, uncle, step-aunt or step-uncle\n- niece, nephew or step-niece or step-nephew\nniece, nephew or step-niece or step-nephew\n- partneror\npartner\nor\n- childorstepchild.\nchild\nor\nstepchild.\n\n## Be able to provide for the student\n\nBe able to provide for the student\nDetails\n\nYou must be able to provide accommodation, general welfare and support to the student.\n\nYou must be able to provide accommodation, general welfare and support to the student.\n\n## Have enough money for your stay\n\nHave enough money for your stay\nDetails\n\nYou must show us evidence that you have enough money to pay for your stay in Australia. This includes meeting the costs and expenses of yourself, your accompanying family members and the student visa holder.\n\nYou must show us evidence that you have enough money to pay for your stay in Australia. This includes meeting the costs and expenses of yourself, your accompanying family members and the student visa holder.\n\nTo see what you will need to provide, go toGather Documents in the 'Step by Step tab'.\n\nTo see what you will need to provide, go to\nGather Documents in the 'Step by Step tab'\n.\n\n## Bringing children to Australia\n\nBringing children to Australia\nDetails\n\nWe will not grant you a visa if anymembers of the family unitis under 6 years old unless:\n\nWe will not grant you a visa if any\nmembers of the family unit\nis under 6 years old unless:\n- there are compelling and compassionate reasons or\nthere are compelling and compassionate reasons or\n- granting the visa would significantly benefit the relationship between the Australian Government and the government of another country\ngranting the visa would significantly benefit the relationship between the Australian Government and the government of another country\n\nThis applies even if your family members under 6 years old are not planning to travel to Australia with you.\n\nThis applies even if your family members under 6 years old are not planning to travel to Australia with you.\n\nIf a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa.\n\nIf a family member under 6 years old meets all the criteria and is granted a visa, it will only be valid until their 6th birthday. After that, they must apply for their own Student visa to continue their study in Australia. Children 6 years old or older can travel to Australia with you, but they must apply for their own Student visa.\n\n## Making welfare arrangements for dependants overseas\n\nMaking welfare arrangements for dependants overseas\nDetails\n\nYou must make adequate arrangements for the accommodation, support and welfare of any non-migrating children of your family who:\n\nYou must make adequate arrangements for the accommodation, support and welfare of any non-migrating children of your family who:\n- are not coming with you to Australia\nare not coming with you to Australia\n- are under 18 years of age and\nare under 18 years of age and\n- does not have a Student visa.\ndoes not have a Student visa.\n\nWe consider you have made adequate welfare arrangements for your children aged 6 to 18 years if they will be living with:\n\nWe consider you have made adequate welfare arrangements for your children aged 6 to 18 years if they will be living with:\n- another parent or custodian or\nanother parent or custodian or\n- a relative who is at least 21 years old\na relative who is at least 21 years old\n\nYou must show evidence of welfare arrangements and a letter from the appointed guardian accepting responsibility for the non-migrating child while you reside in Australia. The letter should detail the guardian's consent that the child will be wholly or substantially reliant on the guardian's financial support. The child must also reside in the guardian's household.\n\nYou must show evidence of welfare arrangements and a letter from the appointed guardian accepting responsibility for the non-migrating child while you reside in Australia. The letter should detail the guardian's consent that the child will be wholly or substantially reliant on the guardian's financial support. The child must also reside in the guardian's household.\n\nA copy of the guardian's current personal particulars (bio-data) page of their passport or a valid driver's licence showing the signature field should also be included.\n\nA copy of the guardian's current personal particulars (bio-data) page of their passport or a valid driver's licence showing the signature field should also be included.\n\n## Have adequate health insurance\n\nHave adequate health insurance\nDetails\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\n\nYou must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\n\nYou must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\n\nSee a guide to what we consideradequate health insurance.\n\nSee a guide to what we consider\nadequate health insurance\n.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors\n.\n\n#### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Be a genuine temporary entrant\n\nBe a genuine temporary entrant\nDetails\n\nYou must only intend to:\n\nYou must only intend to:\n- stay temporarily in Australia\nstay temporarily in Australia\n- do the things you are allowed to do on this visa\ndo the things you are allowed to do on this visa\n\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\n\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\n\nWhen we assess whether you plan to stay in Australia temporarily we will consider:\n\nWhen we assess whether you plan to stay in Australia temporarily we will consider:\n- your personal circumstances in your home country\nyour personal circumstances in your home country\n- your potential circumstances in Australia\nyour potential circumstances in Australia\n- your immigration history\nyour immigration history\n- anything else that relates to your plan to remain in Australia temporarily.\nanything else that relates to your plan to remain in Australia temporarily.\n\n## Meeting our health requirement\n\nMeeting our health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n\n## Meeting our character requirement\n\nMeeting our character requirement\nDetails\n\nIf you are a relative of the student visa holder, you must meet ourcharacter requirement.\n\nIf you are a relative of the student visa holder, you must meet our\ncharacter requirement\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nYou must:\n\nYou must:\n- have read, or had explained to you, theLife in Australia bookletand\nhave read, or had explained to you, the\nLife in Australia booklet\nand\n- sign anAustralian Values Statementthat confirms you will respect the Australian way of life and obey Australian laws\nsign an\nAustralian Values Statement\nthat confirms you will respect the Australian way of life and obey Australian laws\n\n## Have no debt to the Australian Government\n\nHave no debt to the Australian Government\nDetails\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\n\n## Not had a visa cancelled or an application refused\n\nNot had a visa cancelled or an application refused\nDetails\n\nWe will consider your immigration history when we decide on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we decide on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIf applying for a visa from outside Australia seeCan I go to Australia.\n\nIf applying for a visa from outside Australia see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Best interests of the child\n\nBest interests of the child\nDetails\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nYou might need to organise health exams. See what to do if you wanthelp with your application.\n\nYou might need to organise health exams. See what to do if you want\nhelp with your application.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide accurate information. See what happens if you cannotprove your identity or do not give us true information.\n\nProvide accurate information. See what happens if you cannot\nprove your identity or do not give us true information\n.\nShow\n                    steps\n\n#### Identity documents\n\nIdentity documents\n\nWe need proof of your identity. If you cannot prove your identity:\n\nWe need proof of your identity. If you cannot prove your identity:\n- we will refuse your visa application\nwe will refuse your visa application\n- we might not grant you another visa for 10 years\nwe might not grant you another visa for 10 years\n- we might not grant any family members you listed on your application a visa for 10 years\nwe might not grant any family members you listed on your application a visa for 10 years\n\nYou must provide:\n\nYou must provide:\n- the pages of your current passport showing your photo, personal details, and passport issue and expiry dates\nthe pages of your current passport showing your photo, personal details, and passport issue and expiry dates\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of any change of name (if applicable)\nproof of any change of name (if applicable)\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\n\nYou must have any document(s) in a language other than English translated into English. Provide copies of both the translated documents and the document in the original language.\n\nYou must have any document(s) in a language other than English translated into English. Provide copies of both the translated documents and the document in the original language.\nSee how\n\n#### Student guardianship documents\n\nStudent guardianship documents\n\nProvide a completedForm 157N - Student guardianship arrangements (291KB PDF).\n\nProvide a completed\nForm 157N - Student guardianship arrangements (291KB PDF)\n.\n\nYour application will not be valid if you do not provide the completed Form 157N.\n\nYour application will not be valid if you do not provide the completed Form 157N.\nSee how\n\n#### Genuine temporary entrant documents\n\nGenuine temporary entrant documents\n\nShow proof that you are staying in Australia temporarily:\n\nShow proof that you are staying in Australia temporarily:\n\nWrite a personal statement addressing the Genuine Temporary Entry (GTE) requirement. If you are not comfortable writing it in English, you can write your statement in your own language and submit a translated copy with your application.\n\nWrite a personal statement addressing the Genuine Temporary Entry (GTE) requirement. If you are not comfortable writing it in English, you can write your statement in your own language and submit a translated copy with your application.\n\nIn your written statement, provide evidence or information about circumstances in your home country, ties to your home country or country of residence and incentive to return. This could include:\n\nIn your written statement, provide evidence or information about circumstances in your home country, ties to your home country or country of residence and incentive to return. This could include:\n- evidence of immediate family members in your home country\nevidence of immediate family members in your home country\n- your visa or residence status in your home country and your right to return\nyour visa or residence status in your home country and your right to return\n- your previous immigration history\nyour previous immigration history\n- proof of property or other significant assets in your home country\nproof of property or other significant assets in your home country\n- a letter from your employer confirming your leave.\na letter from your employer confirming your leave.\n\nWe consider your personal circumstances when we make a decision. When we assess whether you are a genuine temporary entrant, we consider your overall situation.\n\nWe consider your personal circumstances when we make a decision. When we assess whether you are a genuine temporary entrant, we consider your overall situation.\nSee how\n\n#### Evidence you have enough money for your stay\n\nEvidence you have enough money for your stay\n\nThe living costs we ask you to declare and provide with your visa application indicate the cost of living in Australia. Actual living costs vary throughout Australia. We recommend you research the area you intend to live, including the cost of living in that area.\n\nThe living costs we ask you to declare and provide with your visa application indicate the cost of living in Australia. Actual living costs vary throughout Australia. We recommend you research the area you intend to live, including the cost of living in that area.\n\nThere are options to prove you have genuine access to enough money for your stay.\n\nThere are options to prove you have genuine access to enough money for your stay.\n\nYou must ensure you have enough money to support yourself, the student visa holder(s) and any children who come to Australia with you.\n\nYou must ensure you have enough money to support yourself, the student visa holder(s) and any children who come to Australia with you.\n\nYou need enough money to pay for:\n\nYou need enough money to pay for:\n- travel costs for you and the student visa holder(s)\ntravel costs for you and the student visa holder(s)\n- 12 months of course fees for the student visa holder(s) (or pro rata fees, if the course is less than 12 months)\n12 months of course fees for the student visa holder(s) (or pro rata fees, if the course is less than 12 months)\n- 12 months of living costs for you, the student visa holder(s) and accompanying family members (or pro rata living costs, if stay is less than 12 months)\n12 months of living costs for you, the student visa holder(s) and accompanying family members (or pro rata living costs, if stay is less than 12 months)\n- school fees for school-age children who accompany you (or pro rata fees, if the child will be at school for less than 12 months).\nschool fees for school-age children who accompany you (or pro rata fees, if the child will be at school for less than 12 months).\n\nEvidence you can provide includes:\n\nEvidence you can provide includes:\n- money deposits held within a financial institution\nmoney deposits held within a financial institution\n- loans from a financial institution and/or government\nloans from a financial institution and/or government\n- scholarship or financial support.\nscholarship or financial support.\n\nIf someone else is providing you funds, give us evidence of your relationship with them and their identity documents.\n\nIf someone else is providing you funds, give us evidence of your relationship with them and their identity documents.\n\nIf you are providing evidence of deposits of money, explain their source. Only certain people are acceptable in terms of providing you with financial support.\n\nIf you are providing evidence of deposits of money, explain their source. Only certain people are acceptable in terms of providing you with financial support.\n\n### Work out how much money you need\n\nWork out how much money you need\n\nUse the following information to work out how much money you need. To calculate pro rata costs, divide the annual cost by 365 and multiply the result by the number of days you intend to stay in Australia.\n\nUse the following information to work out how much money you need. To calculate pro rata costs, divide the annual cost by 365 and multiply the result by the number of days you intend to stay in Australia.\n\n#### Living costs\n\nLiving costs\n\n12-month living costs:\n\n12-month living costs:\n- for you – AUD29,710\nfor you – AUD29,710\n- for a child coming with you – AUD4,449.\nfor a child coming with you – AUD4,449.\n\n#### Schooling costs\n\nSchooling costs\n\nYou must have 12 months of course fees for the student visa holder(s) or pro-rata if less than 12 months.\n\nYou must have 12 months of course fees for the student visa holder(s) or pro-rata if less than 12 months.\n\nIf you are including children (under 6 years old) in your application, add schooling costs of at least AUD13,502 per year, per child. Costs vary between states, territories and schools in Australia.\n\nIf you are including children (under 6 years old) in your application, add schooling costs of at least AUD13,502 per year, per child. Costs vary between states, territories and schools in Australia.\n\nYou are responsible for finding out how much schooling will cost.\n\nYou are responsible for finding out how much schooling will cost.\n\n#### Travel Costs\n\nTravel Costs\n\nAs a guide, allow $2000 per person.\n\nAs a guide, allow $2000 per person.\n\n### Evidence you have genuine access to the money\n\nEvidence you have genuine access to the money\n\nYou must show you will have genuine access to funds while you are in Australia for:\n\nYou must show you will have genuine access to funds while you are in Australia for:\n- meeting the costs and expenses of yourself, your accompanying family members and in most cases, the student visa holder.\nmeeting the costs and expenses of yourself, your accompanying family members and in most cases, the student visa holder.\n- proving your financial capacity for the matters specified above\nproving your financial capacity for the matters specified above\n\n### Annual income\n\nAnnual income\n\nAlternatively, you could also show us that your spouse or de facto partner, (who is not travelling to Australia), will support you. They must have an annual income of AUD102,500 or more in the 12 months immediately before you apply.\n\nAlternatively, you could also show us that your spouse or de facto partner, (who is not travelling to Australia), will support you. They must have an annual income of AUD102,500 or more in the 12 months immediately before you apply.\n\nYou must provide evidence of personal income.\n\nYou must provide evidence of personal income.\n\nThis must be in the form of official government documents, such as tax assessments that are less than 12 months old.\n\nThis must be in the form of official government documents, such as tax assessments that are less than 12 months old.\n\nWe will not accept bank statements or direct evidence from an employer as evidence of annual income.\n\nWe will not accept bank statements or direct evidence from an employer as evidence of annual income.\nSee how\n\n#### Health insurance\n\nHealth insurance\n\nYou will need to provide evidence ofadequate health insurancefor you and your family members for the first 12 months of your stay in Australia.\n\nYou will need to provide evidence of\nadequate health insurance\nfor you and your family members for the first 12 months of your stay in Australia.\n\nThis can be an Overseas Visitors Health Cover (OVHC) premium or another health insurance product from Australia or your home country that provides a similar level of cover.\n\nThis can be an Overseas Visitors Health Cover (OVHC) premium or another health insurance product from Australia or your home country that provides a similar level of cover.\n\nOVHC is available through several private and general insurers in Australia. However, the benefits available, membership costs and eligibility can vary between insurers.\n\nOVHC is available through several private and general insurers in Australia. However, the benefits available, membership costs and eligibility can vary between insurers.\n\nLearn more aboutOverseas Visitors & Overseas Studentsandadequate health insurance.\n\nLearn more about\nOverseas Visitors & Overseas Students\nand\nadequate health insurance\n.\nSee how\n\n#### Polio vaccination certificate\n\nPolio vaccination certificate\n\nIf you are applying from outside Australia and you are travelling from, or spent time in, a country considered at risk of polio, you need to give us a polio vaccination certificate.\n\nIf you are applying from outside Australia and you are travelling from, or spent time in, a country considered at risk of polio, you need to give us a polio vaccination certificate.\n\nFor the current countries of risk, seeThreats to public health.\n\nFor the current countries of risk, see\nThreats to public health\n.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nIf you are a relative of the student visa holder, you must provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nIf you are a relative of the student visa holder, you must provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nWe only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nWe only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nYou are also required to provide anoverseas police certificate from every country, where you spent a total of 12 months or more in the last 10 years since you turned 16. This includes your home country.\n\nYou are also required to provide an\noverseas police certificate from every country\n, where you spent a total of 12 months or more in the last 10 years since you turned 16. This includes your home country.\n\nLearn more aboutcountry-specific instructions on how to obtain a police certificateandCharacter requirements for visas.\n\nLearn more about\ncountry-specific instructions on how to obtain a police certificate\nand\nCharacter requirements for visas\n.\nSee how\n\n#### Documents for dependants under 6 years old\n\nDocuments for dependants under 6 years old\n\nIf you have any dependants under 6 years old, you must provide:\n\nIf you have any dependants under 6 years old, you must provide:\n- a statement to demonstrate compelling and compassionate circumstances or\na statement to demonstrate compelling and compassionate circumstances or\n- provide written support from the government of your home country or a letter of support from the Australian Department of Foreign Affairs and Trade.\nprovide written support from the government of your home country or a letter of support from the Australian Department of Foreign Affairs and Trade.\n\nFor every dependant under 6 years old who is applying with you, you must also provide:\n\nFor every dependant under 6 years old who is applying with you, you must also provide:\n- copies of birth certificates or the family book showing the names of both parents of all your dependent children and\ncopies of birth certificates or the family book showing the names of both parents of all your dependent children and\n- copies of the adoption paper, if applicable\ncopies of the adoption paper, if applicable\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child.\nis not coming to Australia with the child.\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)or\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nor\n- a statutory declaration giving their consent for the child to visit Australia on this visa.\na statutory declaration giving their consent for the child to visit Australia on this visa.\n\nAlternatively, if you have sole responsibility of the student(s) you must, provide evidence. Acceptable evidence may include:\n\nAlternatively, if you have sole responsibility of the student(s) you must, provide evidence. Acceptable evidence may include:\n- a court order, custody documentation, or a death certificate of the other parent, or\na court order, custody documentation, or a death certificate of the other parent, or\n- that the laws of your home country allow them to migrate.\nthat the laws of your home country allow them to migrate.\n\nYou must also include:\n\nYou must also include:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence and\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence and\n- adoption papers or other court documents if applicable.\nadoption papers or other court documents if applicable.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\n\n#### Scan or photograph documents\n\nScan or photograph documents\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be legible.\n\nThe scans and photos must be legible.\n\nIf a document is more than 1 page, save it all as 1 file.\n\nIf a document is more than 1 page, save it all as 1 file.\n\n#### Keep a copy\n\nKeep a copy\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa online. You should apply at the same time as the student.\n\nYou must apply for this visa online. You should apply at the same time as the student.\nShow\n                    steps\n\n#### If you are in Australia\n\nIf you are in Australia\n\nYou must hold an eligible substantive visa, or apply:\n\nYou must hold an eligible substantive visa, or apply:\n- within 28 days of holding a Student visa, a Special Purpose visa, or a dependent Diplomatic (temporary) visa, or\nwithin 28 days of holding a Student visa, a Special Purpose visa, or a dependent Diplomatic (temporary) visa, or\n- within 28 days of being notified by the Tribunal that your visa cancellation has been set aside.\nwithin 28 days of being notified by the Tribunal that your visa cancellation has been set aside.\n\nYou cannot apply for a Student Guardian visa in Australia if you hold one of these:\n\nYou cannot apply for a Student Guardian visa in Australia if you hold one of these:\n- Temporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream\nTemporary Work (International Relations) visa (subclass 403) in the Domestic Worker (Diplomatic or consular) stream\n- Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\nDomestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\n- Temporary Graduate visa (subclass 485)\nTemporary Graduate visa (subclass 485)\n- Visitor visa (subclass 600)\nVisitor visa (subclass 600)\n- Electronic Travel Authority visa (subclass 601)\nElectronic Travel Authority visa (subclass 601)\n- Medical Treatment visa (subclass 602)\nMedical Treatment visa (subclass 602)\n- eVisitor visa (subclass 651)\neVisitor visa (subclass 651)\n- Transit visa (subclass 771)\nTransit visa (subclass 771)\n- Maritime crew visa (subclass 988)\nMaritime crew visa (subclass 988)\n- Diplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia\nDiplomatic (Temporary) visa (subclass 995) – primary visa holder only. A family member of a Diplomatic (Temporary) visa (subclass 995) can apply for a Student visa in Australia\nSee how\n\n#### Do not provide false and misleading information\n\nDo not provide false and misleading information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Apply online\n\nApply online\n1. Log in or create anImmiAccount\nLog in or create an\nImmiAccount\n2. Attach documents\nAttach documents\n3. Pay the application fee. We will not process your application until you pay the fee.\nPay the application fee\n. We will not process your application until you pay the fee.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nDo not call if it is instandard processing times. We can't give any further updates on the application's progress. You can see if we have asked for more information in yourImmiAccount.\n\nDo not call if it is in\nstandard processing times\n. We can't give any further updates on the application's progress. You can see if we have asked for more information in your\nImmiAccount\n.\n\n#### Travel after you apply\n\nTravel after you apply\n\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nBut if you leave Australia, make sure you have a valid visa to return.\n\nBut if you leave Australia, make sure you have a valid visa to return.\n\nYou can't leave Australia without the student visa holder unless you you have madealternative welfare arrangements.\n\nYou can't leave Australia without the student visa holder unless you you have made\nalternative welfare arrangements\n.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you needhealth examinations.\n\nWe will let you know if you need\nhealth examinations\n.\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics(fingerprints and photo). We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n(fingerprints and photo). We will let you know if you need to provide them.\n\n#### Provide more information\n\nProvide more information\n\nIf you did not attach all documents when you applied, attach them as soon as possible inImmiAccount.\n\nIf you did not attach all documents when you applied, attach them as soon as possible in\nImmiAccount\n.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\n\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\n\nDo not get cancel your current visa cancelled. If you do, you will be in Australia unlawfully.\n\nDo not get cancel your current visa cancelled. If you do, you will be in Australia unlawfully.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can. If you do not tell us you made a mistake on your application, we might refuse it.\n\nLet us know as soon as you can. If you do not tell us you made a mistake on your application, we might refuse it.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)and upload in ImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\nand upload in ImmiAccount.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how to tell us ifyour situation changes.\n\nSee how to tell us if\nyour situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you:\n\nWe will let you know in writing our decision about your visa application. If we grant you the visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of the decision with you when in Australia.\n\nKeep a copy of the decision with you when in Australia.\n\nIf we refuse your visa, we will tell you why it was refused and whether you have a right to a review of the decision.\n\nIf we refuse your visa, we will tell you why it was refused and whether you have a right to a review of the decision.\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\nWhen you have this visa\nNow you have your visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Now you have your visa\n\nNow you have your visa\n\nIf we have granted you a Student Guardian (subclass 590) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\n\nIf we have granted you a Student Guardian (subclass 590) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\n\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\n\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\n\nTo withdraw any other visa application, you must tell us in writing. More information is available on our website atYou want to withdraw an application.\n\nTo withdraw any other visa application, you must tell us in writing. More information is available on our website at\nYou want to withdraw an application\n.\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the border\n\nAt the border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving Australia must complete theIncoming Passenger Card. You will get the card on board.\n\nAll people arriving Australia must complete the\nIncoming Passenger Card\n. You will get the card on board.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- come to Australia to provide care and support for a student visa holder who is under the age of 18 (or over 18 in exceptional circumstances)\ncome to Australia to provide care and support for a student visa holder who is under the age of 18 (or over 18 in exceptional circumstances)\n- care for more than one student\ncare for more than one student\n- study an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months\nstudy an English Language Intensive Course for Overseas Students (ELICOS) for less than 20 hours per week, or any other study or training for no more than 3 months\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou, and your family members, must comply with all visa conditions and Australian laws. Check your conditions in your grant letter or inVEVO.\n\nYou, and your family members, must comply with all visa conditions and Australian laws. Check your conditions in your grant letter or in\nVEVO\n.\n\nIf a family member under 6 gets the visa, they must apply for their own Student visa once they turn 6 to keep studying in Australia.\n\nIf a family member under 6 gets the visa, they must apply for their own Student visa once they turn 6 to keep studying in Australia.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about include\n\nThings you need to let us know about include\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- changes to your work\nchanges to your work\n- the birth of a child\nthe birth of a child\n- changes to your welfare arrangements\nchanges to your welfare arrangements\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa. You can stay in Australia until the date provided in your visa grant letter.\n\nThis is a temporary visa. You can stay in Australia until the date provided in your visa grant letter.\n\nTo see when you must leave, useVEVO.\n\nTo see when you must leave, use\nVEVO\n.\n\n### Staying longer\n\nStaying longer\n\nYou can stay in Australia longer by applying for a further Student Guardian visa.\n\nYou can stay in Australia longer by applying for a further Student Guardian visa.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nBut you can't leave Australia without the student visa holder unless you have madealternative welfare arrangements.\n\nBut you can't leave Australia without the student visa holder unless you have made\nalternative welfare arrangements\n.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working on this visa\n\nWorking on this visa\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\nIf your visa has condition 8101, you must not work in Australia.\n\nIf your visa has condition 8101, you must not work in Australia.\n\nThis means when in Australia, you must not doworkthat a person would normally get paid for.\n\nThis means when in Australia, you must not do\nwork\nthat a person would normally get paid for.\n\nFor more information and examples of how this condition might apply to you seevisa conditions.\n\nFor more information and examples of how this condition might apply to you see\nvisa conditions\n.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou can't leave Australia without the student visa holder unless you have madealternative welfare arrangements. You must have:\n\nYou can't leave Australia without the student visa holder unless you have made\nalternative welfare arrangements\n. You must have:\n- compassionate or compelling reasons\ncompassionate or compelling reasons\n- alternative and suitable arrangements in place\nalternative and suitable arrangements in place\n- the approval of the minor's education provider\nthe approval of the minor's education provider\n\nIf you leave Australia without alternative welfare arrangements, you may be in breach ofcondition 8538. We may cancel your visa.\n\nIf you leave Australia without alternative welfare arrangements, you may be in breach of\ncondition 8538\n. We may cancel your visa.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster (all visas)\n\nLeaving the airport faster (all visas)\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### To prove you have been to Australia\n\nTo prove you have been to Australia\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-500/welfare-arrangements-students-under-18",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#haveThisVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/student-590#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:04:00.029398",
  "metadata": {}
}