{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400",
  "title": "Temporary Work (Short Stay Specialist) visa",
  "raw_text": "===== main placeholder ========================================== Subclass 400 Temporary Work (Short Stay Specialist) visa The Highly Specialised Work stream of this temporary visa lets you do short-term, highly specialised work in Australia. It is suitable if you have specialised skills, knowledge or experience not generally available in Australia. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay We can grant this visa for up to 6 months (depending on the circumstances). Generally, for a stay period longer than 3 months, a strong business case must be provided with the application. Your stay period in Australia commences once you arrive and does not restart each time you travel. You can't apply for this visa in Australia or stay longer by extending this visa. Cost AUD430.00 (except in limited circumstances) Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can do short-term work in a highly specialised job the work or activity must be non-ongoing See all conditions Check your eligibility You must have highly specialised skills, knowledge or experience that can help Australian business and can't reasonably be found in Australia only do the work or activities for which your visa was granted Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa With this visa you can How long you can stay Stay longer Include family Cost Apply from Processing times Your obligations Adequate health insurance Travel Visa label With this visa you can do short-term work in a highly specialised job bring family members with you, but they are not allowed to work or study in Australia, except to do a language training program Employers must provide a contract or letter of offer. See what they have to do in: Learn about employing migrants Step by step, Gather documents, Work documents How long you can stay This is a temporary visa. You can stay in Australia for up to 6 months, depending on the circumstances. You must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified by the Minister. We will let you know when you must arrive in your visa grant letter. Your visa stay period as shown on your visa grant letter will start on your first date of arrival in Australia. The stay period will not restart each time you arrive in Australia. You can check your visa details in the visa grant letter or use VEVO Stay longer You can't stay in Australia longer by extending this visa. Explore your visa options Include family You can include Members of the family unit in your application when you apply. Both you and your family members who apply for the visa must meet our health requirements and character requirements Any family members included in your application are not permitted to work or study in Australia. You must be able to show that you and your family have enough means to support yourselves while in Australia. Cost The visa costs AUD430.00 for the main applicant. You will not need to pay this application charge if you are: coming to Australia to act as a representative of a foreign government listed in a legislative instrument (your inviting organisation will tell you if this applies to you) There is also a charge for each family member who applies for the visa with you. You might also have to pay other costs for health checks, police certificates and biometrics To work out what your visa will cost use the Visa Pricing Estimator . The estimator does not take into account the other costs. Apply from You must be outside Australia when you apply for the visa and when we make a decision on your application. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application can take longer to process if: you do not fill it in correctly you do not include all the documents we need, or we need more information from you it takes us time to verify your information We can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case. When applying for your subclass 400 visa, you will need to allow time for the application to be processed, taking into account the date you are intending to travel to Australia. Your obligations You and your family must comply with all visa conditions and Australian laws. Learn more about conditions for this visa Adequate health insurance Health insurance We recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. See more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Travel This is a temporary visa. You will have 6 months from the date the visa is granted to first enter Australia (or a lesser period specified). The period of stay you were granted starts on the date you first enter Australia. The visa is granted with either: single entry – you will only be allowed to enter Australia once. You can't re-enter Australia on the visa. To return to Australia after you leave, you will need to apply for a new visa, or multiple entry - you can leave and re-enter Australia as many times as you want during the visa stay period. Re-entering Australia on a multiple entry visa does not restart the period of stay you were granted. The time you spend outside Australia does not extend the visa. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Have highly specialised skills, knowledge or experience Details You can apply for this visa if you have specialised skills, knowledge or experience that: can assist Australian business can't reasonably be found in the Australian labour market will be non-ongoing Non-ongoing work means work that is likely to be completed within 6 months or less, and you do not expect or arrange to stay in Australia after this time for any reason related to that work. You will need to show that you have the skills, knowledge or experience to do this work. Things you could show us include: a copy of your resume any licenses or qualifications you have a letter from your overseas employer explaining your current position and duties. The Australian business or overseas employer might need to show that they have tried to find Australian workers to do the work first, as this visa can't be granted if it affects employment or training opportunities for Australian citizens or permanent residents. Have work, not in the Australian entertainment industry Details You will need to provide proof that you have work. To see what you need to provide go to Step by Step, Gather documents. You can apply for a subclass 400 to: direct, produce or have any other role in a production that will not be shown in Australia (you will need to provide a distribution contract or other evidence to support this) come to Australia for a promotional activity, for example: an actor visiting Australia for a red carpet premiere a rock band in Australia for a promotional tour but no performances The subclass 400 visa does not allow a person to: perform as an entertainer in Australia or support an entertainer or group of entertainers performing in Australia direct, produce or take any other part in a production that will be shown, broadcast or performed in Australia (including theatre, film, television, radio, concert or a recording). If you want to do these activities, you should consider applying for the Temporary Activity visa (subclass 408) – Entertainment Be able to support yourself and any dependants While you are in Australia, you and your family members must have adequate means to support yourselves. Meet our health requirement You and your family members must meet our health requirement Meet our character requirement You and family members aged 16 years and over who apply for the visa with you must meet our character requirement Be a genuine visitor You must only intend to: stay temporarily in Australia do the things you are allowed to do on this visa Details Genuine temporary entrant requirement Details You can't use our temporary visa program to maintain ongoing residency in Australia. The genuine temporary entrant (GTE) requirement helps us to make sure that you use temporary visas correctly. We must be satisfied that you have a genuine intention to stay here temporarily to do the things you are allowed to do on this visa. When assessing this, we will consider: your situation your immigration history previous compliance with visa conditions any other relevant matter Have paid back your debt to the Australian government If you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back. Not had a visa cancelled or an application refused We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia If applying for a visa from outside Australia see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply See if you want help with your application or to organise health exams before applying Show steps Organise health exams You might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them. Find out the health examinations you need and how to arrange them if you want to have them before you apply. See how Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Gather documents to prove your identity and show you have your employer's support, financial support and recommend health insurance. You will need to prepare them to submit online. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Identity documents Provide the pages of your current passport showing your photo, personal details and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority, or documents that show other names you have been known by See how Work documents You should provide a letter of invitation, job offer, employment contract or other document from an Australian organisation confirming they have employed you to work in Australia showing: details of your position, duties, or project of work you will undertake the duration of your work the reason why you are required to work in Australia support for your visa application your employment conditions and wages the Australian workplace standards or Industry Award that applies to your position Workers in Australia, including visa holders with permission to work, have rights under Australian workplace law. For information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements see Fair Work Ombudsman’s Pay and Conditions Tool (PACT) Some freelance work might be allowed (for example, a freelance journalist/photographer undertaking a media assignment). If you are doing this type of work, you will need to provide a copy of your itinerary and the details of your work assignment. See how Financial documents To prove that you can support yourself and any family you bring to Australia, provide: evidence of funds (employment contract, bank statements), or a letter from your bank or financial institution stating your financial position We can also consider allowances, accommodation and other help from your employer. See how Character documents We will tell you if and when you need to provide police certificates Partner documents Provide: identity documents character documents documents about other relationships, if applicable Provide either: your current marriage certificate, or enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply Documents that prove your de facto relationship include: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Dependants under 18 documents For every dependant under 18 years old who is applying with you, provide: your child's identity documents proof of your relationship with them, like a birth or marriage certificate your child's character documents, if applicable See how Parental responsibility documents You must get consent for the child to come to Australia from anyone who: has a legal right to decide where the child lives is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) or statutory declaration giving their consent for the child to visit Australia on this visa Include a document with the signature and photo of the person who completed the form or declaration, such as a: passport, or driver’s licence See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Prepare your documents Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Scan or photograph documents Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file See how Step 3 Apply for the visa You apply for this visa online in ImmiAccount. You and anyone included in your visa application must be outside Australia when you apply and when your visa application is decided. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply for the visa online in ImmiAccount Create an account or login to ImmiAccount Attach documents Have family applications processed together Pay the application fee Note the transaction reference number (TRN) We will not process your application until you pay the charge. Each family member must have their application charge paid and documents attached to their application. Step 4 After you apply You can track and manage your application through ImmiAccount Show steps What will happen after you apply We will let you know when we have received your application and documents Status updates We can't give updates on applications within the standard processing time. You can check if we need more information from you in ImmiAccount Travel after you apply Do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. Health exams If you did not have health examinations before you applied, we will let you know if we need them. Biometrics We might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them. Attach more information If you did not attach all documents when you applied attach them as soon as you can in ImmiAccount We might also ask you to provide more information. Stay lawful If you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application. Add family You can add family members to your application at any time before we decide on your application. For this visa your family members are: your partner your dependent child and stepchild your partner's dependent children and stepchildren See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Let us know as soon as you can. Complete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome We will let you know our decision by email. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions Keep a copy of the email with you when in Australia. If we refuse your visa, we will tell you why we refused the visa. We will not refund the application charge if we refuse your application. When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia Before you leave Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the Border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card . You will get the card on board. Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you can do when you have this visa work in a temporary, short-term, highly specialised job bring family members who were granted a visa with you To see your specific conditions and work entitlements use VEVO What you must do on this visa (your obligations) You and your family members must meet all visa conditions and obey Australian laws. See your conditions in VEVO Tell us if things change Things you need to let us know about when you have this visa include: changes to your phone number, address or passport the birth of a child See what to do if your situation changes See how long you can stay The visa stay period starts on the date you enter Australia. You can check your visa stay period in your visa grant letter or use VEVO To see when you must leave, use VEVO Staying longer You can't stay in Australia longer by extending this visa. You can't apply for this visa from within Australia. You must apply for a different visa if you want to stay longer. See your options Travelling on your visa You must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified in the grant letter. The visa stay period starts on the date you enter Australia. Your visa stay period is on your visa grant letter. If you are granted a single entry visa, you will only be allowed to enter Australia once. To return to Australia after you leave, you will need to apply for a new visa. If you are granted a multiple entry visa, you can leave and re-enter Australia as many times as you want during the visa stay period. The visa stay period does not restart each time you enter Australia. Time spent outside Australia does not extend the visa. See your visa details and conditions in VEVO Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working To see your conditions for work, use VEVO You are protected by Australian workplace law. See your workplace rights and entitlements Family members who come with you are not allowed to work. Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your visa is still valid See what to do if your visa has expired or is about to expire At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Get your superannuation You are likely to have some money in a superannuation fund if you worked in Australia and you are: 18 years old or older paid AUD450 or more before tax in a month See how to access your super To prove you have been to Australia Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 400\n\n# Temporary Work (Short Stay Specialist) visa\n\nTemporary Work (Short Stay Specialist) visa\n\nThe Highly Specialised Work stream of this temporary visa lets you  do short-term, highly specialised work in Australia. It is suitable if you have specialised skills, knowledge or experience not generally available in Australia.\n\nThe Highly Specialised Work stream of this temporary visa lets you  do short-term, highly specialised work in Australia. It is suitable if you have specialised skills, knowledge or experience not generally available in Australia.\n\nThe Highly Specialised Work stream of this temporary visa lets you  do short-term, highly specialised work in Australia. It is suitable if you have specialised skills, knowledge or experience not generally available in Australia.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nWe can grant this visa for up to 6 months (depending on the circumstances).\n\nWe can grant this visa for up to 6 months (depending on the circumstances).\n\nGenerally, for a stay period longer than 3 months, a strong business case must be provided with the application.\n\nGenerally, for a stay period longer than 3 months, a strong business case must be provided with the application.\n\nYour stay period in Australia commences once you arrive and does not restart each time you travel.\n\nYour stay period in Australia commences once you arrive and does not restart each time you travel.\n\nYou can't apply for this visa in Australia or stay longer by extending this visa.\n\nYou can't apply for this visa in Australia or stay longer by extending this visa.\n\n#### Cost\n\nCost\n\nAUD430.00(except in limited circumstances)\n\nAUD430.00(except in limited circumstances)\n\nAUD430.00\n(except in limited circumstances)\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- do short-term work in a highly specialised job\ndo short-term work in a highly specialised job\n- the work or activity must be non-ongoing\nthe work or activity must be non-ongoing\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- have highly specialised skills, knowledge or experience that can help Australian business and can't reasonably be found in Australia\nhave highly specialised skills, knowledge or experience that can help Australian business and can't reasonably be found in Australia\n- only do the work or activities for which your visa was granted\nonly do the work or activities for which your visa was granted\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\nWith this visa you can\nHow long you can stay\nStay longer\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nAdequate health insurance\nTravel\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- do short-term work in a highly specialised job\ndo short-term work in a highly specialised job\n- bring family members with you, but they are not allowed to work or study in Australia, except to do a language training program\nbring family members with you, but they are not allowed to work or study in Australia, except to do a language training program\n\nEmployers must provide a contract or letter of offer. See what they have to do in:\n\nEmployers must provide a contract or letter of offer. See what they have to do in:\n- Learn about employing migrants\nLearn about employing migrants\n- Step by step, Gather documents, Work documents\nStep by step, Gather documents, Work documents\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa. You can stay in Australia for up to 6 months, depending on the circumstances.\n\nThis is a temporary visa. You can stay in Australia for up to 6 months, depending on the circumstances.\n\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified by the Minister. We will let you know when you must arrive in your visa grant letter.\n\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified by the Minister. We will let you know when you must arrive in your visa grant letter.\n\nYour visa stay period as shown on your visa grant letter will start on your first date of arrival in Australia. The stay period will not restart each time you arrive in Australia.\n\nYour visa stay period as shown on your visa grant letter will start on your first date of arrival in Australia. The stay period will not restart each time you arrive in Australia.\n\nYou can check your visa details in the visa grant letter or useVEVO.\n\nYou can check your visa details in the visa grant letter or use\nVEVO\n.\n\n## Stay longer\n\nStay longer\n\nYou can't stay in Australia longer by extending this visa.\n\nYou can't stay in Australia longer by extending this visa.\n\nExplore your visa options\n\nExplore your visa options\n\n## Include family\n\nInclude family\n\nYou can includeMembers of the family unitin your application when you apply.\n\nYou can include\nMembers of the family unit\nin your application when you apply.\n\nBoth you and your family members who apply for the visa must meet ourhealth requirementsandcharacter requirements.\n\nBoth you and your family members who apply for the visa must meet our\nhealth requirements\nand\ncharacter requirements\n.\n\nAny family members included in your application are not permitted to work or study in Australia. You must be able to show that you and your family have enough means to support yourselves while in Australia.\n\nAny family members included in your application are not permitted to work or study in Australia. You must be able to show that you and your family have enough means to support yourselves while in Australia.\n\n## Cost\n\nCost\n\nThe visa costsAUD430.00for the main applicant.\n\nThe visa costs\nAUD430.00\nfor the main applicant.\n\nYou will not need to pay this application charge if you are:\n\nYou will not need to pay this application charge if you are:\n- coming to Australia to act as a representative of a foreign government\ncoming to Australia to act as a representative of a foreign government\n- listed in a legislative instrument (your inviting organisation will tell you if this applies to you)\nlisted in a legislative instrument (your inviting organisation will tell you if this applies to you)\n\nThere is also a charge for each family member who applies for the visa with you.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nYou might also have to pay other costs for health checks, police certificates andbiometrics.\n\nYou might also have to pay other costs for health checks, police certificates and\nbiometrics\n.\n\nTo work out what your visa will cost use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nYou must be outside Australia when you apply for the visa and when we make a decision on your application.\n\nYou must be outside Australia when you apply for the visa and when we make a decision on your application.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application can take longer to process if:\n\nYour application can take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need, or we need more information from you\nyou do not include all the documents we need, or we need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case.\n\nWhen applying for your subclass 400 visa, you will need to allow time for the application to be processed, taking into account the date you are intending to travel to Australia.\n\nWhen applying for your subclass 400 visa, you will need to allow time for the application to be processed, taking into account the date you are intending to travel to Australia.\n\n## Your obligations\n\nYour obligations\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nLearn more aboutconditions for this visa.\n\nLearn more about\nconditions for this visa\n.\n\n## Adequate health insurance\n\nAdequate health insurance\n\n### Health insurance\n\nHealth insurance\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nSee more abouthealth insurance for overseas visitors.\n\nSee more about\nhealth insurance for overseas visitors\n.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Travel\n\nTravel\n\nThis is a temporary visa. You will have 6 months from the date the visa is granted to first enter Australia (or a lesser period specified). The period of stay you were granted starts on the date you first enter Australia.\n\nThis is a temporary visa. You will have 6 months from the date the visa is granted to first enter Australia (or a lesser period specified). The period of stay you were granted starts on the date you first enter Australia.\n\nThe visa is granted with either:\n\nThe visa is granted with either:\n- single entry – you will only be allowed to enter Australia once. You can't re-enter Australia on the visa. To return to Australia after you leave, you will need to apply for a new visa, or\nsingle entry – you will only be allowed to enter Australia once. You can't re-enter Australia on the visa. To return to Australia after you leave, you will need to apply for a new visa, or\n- multiple entry - you can leave and re-enter Australia as many times as you want during the visa stay period.\nmultiple entry - you can leave and re-enter Australia as many times as you want during the visa stay period.\n\nRe-entering Australia on a multiple entry visa does not restart the period of stay you were granted.\n\nRe-entering Australia on a multiple entry visa does not restart the period of stay you were granted.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Have highly specialised skills, knowledge or experience\n\nHave highly specialised skills, knowledge or experience\nDetails\n\nYou can apply for this visa if you have specialised skills, knowledge or experience that:\n\nYou can apply for this visa if you have specialised skills, knowledge or experience that:\n- can assist Australian business\ncan assist Australian business\n- can't reasonably be found in the Australian labour market\ncan't reasonably be found in the Australian labour market\n- will be non-ongoing\nwill be non-ongoing\n\nNon-ongoing work means work that is likely to be completed within 6 months or less, and you do not expect or arrange to stay in Australia after this time for any reason related to that work.\n\nNon-ongoing work means work that is likely to be completed within 6 months or less, and you do not expect or arrange to stay in Australia after this time for any reason related to that work.\n\nYou will need to show that you have the skills, knowledge or experience to do this work. Things you could show us include:\n\nYou will need to show that you have the skills, knowledge or experience to do this work. Things you could show us include:\n- a copy of your resume\na copy of your resume\n- any licenses or qualifications you have\nany licenses or qualifications you have\n- a letter from your overseas employer explaining your current position and duties.\na letter from your overseas employer explaining your current position and duties.\n\nThe Australian business or overseas employer might need to show that they have tried to find Australian workers to do the work first, as this visa can't be granted if it affects employment or training opportunities for Australian citizens or permanent residents.\n\nThe Australian business or overseas employer might need to show that they have tried to find Australian workers to do the work first, as this visa can't be granted if it affects employment or training opportunities for Australian citizens or permanent residents.\n\n## Have work, not in the Australian entertainment industry\n\nHave work, not in the Australian entertainment industry\nDetails\n\nYou will need to provide proof that you have work.  To see what you need to provide go to Step by Step, Gather documents.\n\nYou will need to provide proof that you have work.  To see what you need to provide go to Step by Step, Gather documents.\n\nYou can apply for a subclass 400 to:\n\nYou can apply for a subclass 400 to:\n- direct, produce or have any other role in a production that will not be shown in Australia (you will need to provide a distribution contract or other evidence to support this)\ndirect, produce or have any other role in a production that will not be shown in Australia (you will need to provide a distribution contract or other evidence to support this)\n- come to Australia for a promotional activity, for example:an actor visiting Australia for a red carpet premierea rock band in Australia for a promotional tour but no performances\ncome to Australia for a promotional activity, for example:\n- an actor visiting Australia for a red carpet premiere\nan actor visiting Australia for a red carpet premiere\n- a rock band in Australia for a promotional tour but no performances\na rock band in Australia for a promotional tour but no performances\n\nThe subclass 400 visa does not allow a person to:\n\nThe subclass 400 visa does not allow a person to:\n- perform as an entertainer in Australia or support an entertainer or group of entertainers performing in Australia\nperform as an entertainer in Australia or support an entertainer or group of entertainers performing in Australia\n- direct, produce or take any other part in a production that will be shown, broadcast or performed in Australia (including theatre, film, television, radio, concert or a recording).\ndirect, produce or take any other part in a production that will be shown, broadcast or performed in Australia (including theatre, film, television, radio, concert or a recording).\n\nIf you want to do these activities, you should consider applying for theTemporary Activity visa (subclass 408) – Entertainment.\n\nIf you want to do these activities, you should consider applying for the\nTemporary Activity visa (subclass 408) – Entertainment\n.\n\n## Be able to support yourself and any dependants\n\nBe able to support yourself and any dependants\n\nWhile you are in Australia, you and your family members must have adequate means to support yourselves.\n\nWhile you are in Australia, you and your family members must have adequate means to support yourselves.\n\n## Meet our health requirement\n\nMeet our health requirement\n\nYou and your family members must meet ourhealth requirement.\n\nYou and your family members must meet our\nhealth requirement\n.\n\n## Meet our character requirement\n\nMeet our character requirement\n\nYou and family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirement\n.\n\n## Be a genuine visitor\n\nBe a genuine visitor\n\nYou must only intend to:\n\nYou must only intend to:\n- stay temporarily in Australia\nstay temporarily in Australia\n- do the things you are allowed to do on this visa\ndo the things you are allowed to do on this visa\nDetails\n\n### Genuine temporary entrant requirement\n\nGenuine temporary entrant requirement\nDetails\n\nYou can't use our temporary visa program to maintain ongoing residency in Australia.\n\nYou can't use our temporary visa program to maintain ongoing residency in Australia.\n\nThe genuine temporary entrant (GTE) requirement helps us to make sure that you use temporary visas correctly.\n\nThe genuine temporary entrant (GTE) requirement helps us to make sure that you use temporary visas correctly.\n\nWe must be satisfied that you have a genuine intention to stay here temporarily to do the things you are allowed to do on this visa.\n\nWe must be satisfied that you have a genuine intention to stay here temporarily to do the things you are allowed to do on this visa.\n\nWhen assessing this, we will consider:\n\nWhen assessing this, we will consider:\n- your situation\nyour situation\n- your immigration history\nyour immigration history\n- previous compliance with visa conditions\nprevious compliance with visa conditions\n- any other relevant matter\nany other relevant matter\n\n## Have paid back your debt to the Australian government\n\nHave paid back your debt to the Australian government\n\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\n\nIf you owe the Australian Government money, you must have paid it back or have a formal arrangement to pay it back.\n\n## Not had a visa cancelled or an application refused\n\nNot had a visa cancelled or an application refused\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused seeLimitations on applications in Australia.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see\nLimitations on applications in Australia\n.\n\nIf applying for a visa from outside Australia seeCan I go to Australia.\n\nIf applying for a visa from outside Australia see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nSee if you want help with your application or to organise health exams before applying\n\nSee if you want help with your application or to organise health exams before applying\nShow\n                    steps\n\n#### Organise health exams\n\nOrganise health exams\n\nYou might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them.\n\nYou might need to have health examinations. You can complete them before you apply or you can wait until we tell you to have them.\n\nFind out thehealth examinationsyou need and how to arrange them if you want to have them before you apply.\n\nFind out the\nhealth examinations\nyou need and how to arrange them if you want to have them before you apply.\nSee how\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nGather documents to prove your identity and show you have your employer's support, financial support and recommend health insurance. You will need to prepare them to submit online.\n\nGather documents to prove your identity and show you have your employer's support, financial support and recommend health insurance. You will need to prepare them to submit online.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens ifyou can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens if\nyou can't prove your identity or don't provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority, or\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority, or\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Work documents\n\nWork documents\n\nYou should provide a letter of invitation, job offer, employment contract or other document from an Australian organisation confirming they have employed you to work in Australia showing:\n\nYou should provide a letter of invitation, job offer, employment contract or other document from an Australian organisation confirming they have employed you to work in Australia showing:\n- details of your position, duties, or project of work you will undertake\ndetails of your position, duties, or project of work you will undertake\n- the duration of your work\nthe duration of your work\n- the reason why you are required to work in Australia\nthe reason why you are required to work in Australia\n- support for your visa application\nsupport for your visa application\n- your employment conditions and wages\nyour employment conditions and wages\n- the Australian workplace standards or Industry Award that applies to your position\nthe Australian workplace standards or Industry Award that applies to your position\n\nWorkers in Australia, including visa holders with permission to work, have rights under Australian workplace law. For information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements seeFair Work Ombudsman’s Pay and Conditions Tool (PACT).\n\nWorkers in Australia, including visa holders with permission to work, have rights under Australian workplace law. For information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements see\nFair Work Ombudsman’s Pay and Conditions Tool (PACT)\n.\n\nSome freelance work might be allowed (for example, a freelance journalist/photographer undertaking a media assignment). If you are doing this type of work, you will need to provide a copy of your itinerary and the details of your work assignment.\n\nSome freelance work might be allowed (for example, a freelance journalist/photographer undertaking a media assignment). If you are doing this type of work, you will need to provide a copy of your itinerary and the details of your work assignment.\nSee how\n\n#### Financial documents\n\nFinancial documents\n\nTo prove that you can support yourself and any family you bring to Australia, provide:\n\nTo prove that you can support yourself and any family you bring to Australia, provide:\n- evidence of funds (employment contract, bank statements), or\nevidence of funds (employment contract, bank statements), or\n- a letter from your bank or financial institution stating your financial position\na letter from your bank or financial institution stating your financial position\n\nWe can also consider allowances, accommodation and other help from your employer.\n\nWe can also consider allowances, accommodation and other help from your employer.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe will tell you if and when you need to providepolice certificates.\n\nWe will tell you if and when you need to provide\npolice certificates\n.\n\n#### Partner documents\n\nPartner documents\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nProvide either:\n\nProvide either:\n- your current marriage certificate, or\nyour current marriage certificate, or\n- enough documents to prove you have been in a de facto relationship with yourpartnerfor at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your\npartner\nfor at least 12 months before you apply\n\nDocuments that prove your de facto relationship include:\n\nDocuments that prove your de facto relationship include:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with you, provide:\n\nFor every dependant under 18 years old who is applying with you, provide:\n- your child's identity documents\nyour child's identity documents\n- proof of your relationship with them, like a birth or marriage certificate\nproof of your relationship with them, like a birth or marriage certificate\n- your child's character documents, if applicable\nyour child's character documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for the child to come to Australia from anyone who:\n\nYou must get consent for the child to come to Australia from anyone who:\n- has a legal right to decide where the child lives\nhas a legal right to decide where the child lives\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)or\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nor\n- astatutory declarationgiving their consent for the child to visit Australia on this visa\na\nstatutory declaration\ngiving their consent for the child to visit Australia on this visa\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n- passport, or\npassport, or\n- driver’s licence\ndriver’s licence\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Scan or photograph documents\n\nScan or photograph documents\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file\n\nIf a document is more than one page, save it all as one file\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou apply for this visa online in ImmiAccount. You and anyone included in your visa application must be outside Australia when you apply and when your visa application is decided.\n\nYou apply for this visa online in ImmiAccount. You and anyone included in your visa application must be outside Australia when you apply and when your visa application is decided.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens ifyou can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens if\nyou can't prove your identity or don't provide true information\n.\n\n#### Apply for the visa online in ImmiAccount\n\nApply for the visa online in ImmiAccount\n1. Create an account or login toImmiAccount\nCreate an account or login to\nImmiAccount\n2. Attach documents\nAttach documents\n3. Have family applications processed together\nHave family applications processed together\n4. Pay the application fee\nPay the application fee\n5. Note the transaction reference number (TRN)\nNote the transaction reference number (TRN)\n\nWe will not process your application until you pay the charge.\n\nWe will not process your application until you pay the charge.\n\nEach family member must have their application charge paid and documents attached to their application.\n\nEach family member must have their application charge paid and documents attached to their application.\n\nStep 4\n\nStep 4\nAfter you apply\n\nYou can track and manage your application throughImmiAccount.\n\nYou can track and manage your application through\nImmiAccount\n.\nShow\n                    steps\n\n#### What will happen after you apply\n\nWhat will happen after you apply\n\nWe will let you know when we have received your application and documents\n\nWe will let you know when we have received your application and documents\n\n#### Status updates\n\nStatus updates\n\nWe can't give updates on applications within the standard processing time.\n\nWe can't give updates on applications within the standard processing time.\n\nYou can check if we need more information from you inImmiAccount.\n\nYou can check if we need more information from you in\nImmiAccount\n.\n\n#### Travel after you apply\n\nTravel after you apply\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\n\n#### Health exams\n\nHealth exams\n\nIf you did not havehealth examinationsbefore you applied, we will let you know if we need them.\n\nIf you did not have\nhealth examinations\nbefore you applied, we will let you know if we need them.\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics(fingerprints and photo). We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n(fingerprints and photo). We will let you know if you need to provide them.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not attach all documents when you applied attach them as soon as you can inImmiAccount.\n\nIf you did not attach all documents when you applied attach them as soon as you can in\nImmiAccount\n.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\n#### Stay lawful\n\nStay lawful\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application.\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application.\n\n#### Add family\n\nAdd family\n\nYou can add family members to your application at any time before we decide on your application.\n\nYou can add family members to your application at any time before we decide on your application.\n\nFor this visa your family members are:\n\nFor this visa your family members are:\n- yourpartner\nyour\npartner\n- yourdependent childandstepchild\nyour\ndependent child\nand\nstepchild\n- your partner's dependent children and stepchildren\nyour partner's dependent children and stepchildren\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to doif your child is born after you apply.\n\nFind out what to do\nif your child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can.\n\nLet us know as soon as you can.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)and attach it inImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\nand attach it in\nImmiAccount\n.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how to tell us if yoursituation changes.\n\nSee how to tell us if your\nsituation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know our decision by email.\n\nWe will let you know our decision by email.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of the email with you when in Australia.\n\nKeep a copy of the email with you when in Australia.\n\nIf we refuse your visa, we will tell you why we refused the visa.\n\nIf we refuse your visa, we will tell you why we refused the visa.\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the Border\n\nAt the Border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card. You will get the card on board.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n. You will get the card on board.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- work in a temporary, short-term, highly specialised job\nwork in a temporary, short-term, highly specialised job\n- bring family members who were granted a visa with you\nbring family members who were granted a visa with you\n\nTo see your specific conditions and work entitlements useVEVO.\n\nTo see your specific conditions and work entitlements use\nVEVO\n.\n\n### What you must do on this visa (your obligations)\n\nWhat you must do on this visa (your obligations)\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nSee your conditions inVEVO.\n\nSee your conditions in\nVEVO\n.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- the birth of a child\nthe birth of a child\n\nSee what to do if yoursituation changes.\n\nSee what to do if your\nsituation changes\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThe visa stay period starts on the date you enter Australia.\n\nThe visa stay period starts on the date you enter Australia.\n\nYou can check your visa stay period in your visa grant letter or useVEVO.\n\nYou can check your visa stay period in your visa grant letter or use\nVEVO\n.\n\nTo see when you must leave, useVEVO.\n\nTo see when you must leave, use\nVEVO\n.\n\n### Staying longer\n\nStaying longer\n\nYou can't stay in Australia longer by extending this visa. You can't apply for this visa from within Australia.\n\nYou can't stay in Australia longer by extending this visa. You can't apply for this visa from within Australia.\n\nYou must apply for a different visa if you want to stay longer.See your options.\n\nYou must apply for a different visa if you want to stay longer.\nSee your options\n.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified in the grant letter.\n\nYou must arrive in Australia within 6 months of the date the visa is granted, or a lesser period specified in the grant letter.\n\nThe visa stay period starts on the date you enter Australia. Your visa stay period is on your visa grant letter.\n\nThe visa stay period starts on the date you enter Australia. Your visa stay period is on your visa grant letter.\n\nIf you are granted a single entry visa, you will only be allowed to enter Australia once. To return to Australia after you leave, you will need to apply for a new visa.\n\nIf you are granted a single entry visa, you will only be allowed to enter Australia once. To return to Australia after you leave, you will need to apply for a new visa.\n\nIf you are granted a multiple entry visa, you can leave and re-enter Australia as many times as you want during the visa stay period. The visa stay period does not restart each time you enter Australia.\n\nIf you are granted a multiple entry visa, you can leave and re-enter Australia as many times as you want during the visa stay period. The visa stay period does not restart each time you enter Australia.\n\nTime spent outside Australia does not extend the visa.\n\nTime spent outside Australia does not extend the visa.\n\nSee your visa details and conditions inVEVO.\n\nSee your visa details and conditions in\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\nYou are protected by Australian workplace law.See your workplace rights and entitlements.\n\nYou are protected by Australian workplace law.\nSee your workplace rights and entitlements\n.\n\nFamily members who come with you are not allowed to work.\n\nFamily members who come with you are not allowed to work.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your visa is still valid\n\nEnsure your visa is still valid\n\nSee what to do if yourvisa has expired or is about to expire.\n\nSee what to do if your\nvisa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Get your superannuation\n\nGet your superannuation\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n- 18 years old or older\n18 years old or older\n- paid AUD450 or more before tax in a month\npaid AUD450 or more before tax in a month\n\nSeehow to access your super.\n\nSee\nhow to access your super\n.\n\n#### To prove you have been to Australia\n\nTo prove you have been to Australia\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-activity-408",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-400#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:16:10.158256",
  "metadata": {}
}