{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461",
  "title": "New Zealand Citizen Family Relationship visa",
  "raw_text": "===== main placeholder ========================================== Subclass 461 New Zealand Citizen Family Relationship visa This visa is for a person who is not a New Zealand citizen but is a member of a family unit of a New Zealand citizen. It lets you live and work in Australia for five years. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview We strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents. From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Stay This is a temporary visa. You can stay in Australia for 5 years. Cost From AUD445.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa you can live, work and study in Australia for 5 years from the date your visa is granted travel to and from Australia as many times as you want during the 5 year period. See all conditions Check your eligibility You must not be a New Zealand citizen at the time of application meet certain eligibility criteria Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa We strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents. From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications With this visa you can ​How long you can stay Include family Stay longer Cost Apply from Processing times Your obligations Travel Visa label With this visa you can live, work and study in Australia for 5 years from the date your visa is granted travel to and from Australia as many times as you want during the 5 year period. ​How long you can stay This is a temporary visa. You can stay in Australia for 5 years. The visa is granted with multiple entry. You can travel to and from Australia as many times as you want during the 5 year period. The visa will be in effect from the date your visa is granted. Include family You can combine your application with other members of the family unit when you apply. Members of the family unit who apply for the visa must meet health and character requirements You can't add family members to a Subclass 461 visa application after it is lodged. While applicants can include members of their familyunit when they lodge the application, all applicants are assessed individually. Newborn children Find out what to do if your child is born after you apply Note: a child born to a New Zealand citizen parent in Australia may not be eligible for New Zealand citizenship by descent. For information about New Zealand citizenship, see the New Zealand government website Stay longer You can't stay in Australia after your visa ceases unless you are the holder of another visa. You can apply for a further Subclass 461 visa if you meet the eligibility requirements. Cost The below are the costs to make a valid application for a Subclass 461 visa: AUD445.00 for the main applicant. AUD225.00 for members of the family unit over 18 years of age and AUD110.00 for those under 18 who make a combined application with the main applicant. You might also have to pay other costs such as for health examinations, police certificates and biometrics To work out what your visa application might cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. Apply from You can be in or outside Australia when you apply for the visa but not in immigration clearance. Note: If you seek to satisfy the visa requirements that apply to an applicant who is outside Australia at the time of application, you should lodge your application when you are outside Australia and remain outside Australia until the Department sends you an acknowledgment letter confirming that the Department has received the application. You can only enter Australia if you hold a visa that is in effect. See the Step-by-Step section for information on how to apply. See Visa outcome for information on where you must be if we grant you the visa. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application can take longer to process if: you do not fill the form out correctly you do not include all the documents or if more information is requested from you it takes us longer than usual to verify your information. We cannot process your application if you do not pay the correct cost. We will notify you if this is the case and if necessary return your application without processing it. Your obligations You and members of your family unit must meet all visa conditions that apply and follow all Australian laws. See the conditions for this visa Travel You can travel outside Australia and return as many times as you want during the 5 years you may hold your visa. Visa label We will digitally link your visa to your passport. You will not get a visa label in your passport. Eligibility We strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents. From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications You are not an Australian citizen Details You cannot be granted this visa if you are an Australian citizen. You are not a New Zealand citizen Details You cannot be granted this visa if you are a New Zealand citizen. If you become a New Zealand citizen during the processing of your application you can continue with the application, or instead withdraw it and apply for a Subclass 444 visa and be granted that visa if you meet the requirements. Certain persons may not be eligible for New Zealand citizenship by descent. For information about New Zealand citizenship, see the New Zealand government website Relationship to a New Zealand citizen Details You might be able to be granted this visa if you are in any of the below three categories. You are a member of the family unit of a New Zealand citizen, who is not an eligible New Zealand citizen and who either: is in Australia as the holder of a Subclass 444 visa (they can check in VEVO will be travelling with you to Australia and will be granted a Subclass 444 visa on entry (check Eligibility). Note: Your New Zealand family member must have (or be eligible for) a Subclass 444 visa New Zealand citizens are not automatically granted a Subclass 444 visa To find out if your New Zealand family member already holds a visa, use VEVO You are in Australia and you meet all of the following: You hold a Subclass 461 visa or you do not hold a substantive visa and the last substantive visa you held was a Subclass 461 visa You are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa You have not become a member of the family unit of any other person (whether or not you are still a member of the family unit of that other person). You are outside Australia and you meet all of the following: You held a Subclass 461 visa when you last left Australia You are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa You have not become a member of the family unit of another person (whether or not you are still a member of the family unit of that other person). If you are outside Australia, you must also meet one of the following: You have been in Australia as the holder of a Subclass 461 visa for at least 2 years in the past 5 years immediately before you made your visa application You have substantial business, cultural, employment or personal ties with Australia that are of benefit to Australia. You must also have not been away from Australia for a continuous period of 5 years or more immediately before applying for this visa (unless you have compelling reasons for your absence). For more information on family units see members of the family unit Your immigration status when you apply Details If you are outside Australia when you apply You can apply for the subclass 461 visa without needing to hold another type of visa. If you are in Australia when you apply You must either: hold a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream , or have last held a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream, within the last 12 months prior to your application. Otherwise, you will be required to meet additional criteria applicable to unlawful non-citizens and certain Bridging visa holders. Meet the health requirement Details You and any members of your family unit who apply for the visa with you must meet certain health requirements We strongly encourage you to undertake any required health examinations before lodging your application. Lodging a complete application assists with quicker processing times. To complete your health examinations prior to submitting your visa application visit My Health Declarations(MHD) Meet the character requirement Details You and any members of your family unit 16 years of age or over who apply for the visa with you must meet certain character requirements. Other family members might also need to meet certain character requirements. Have health insurance Details We recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. See what is considered as adequate health insurance See more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Sign the Australian values statement Details ​If you are 18 years of age or older when you make your application, you must sign the Australian Values Statement unless we decide you are not required to sign it due to any compelling circumstances that you have demonstrated. Have paid back your debt to the Australian Government Details You should not have any outstanding debts to the Australian Government. If you owe the Australian Government any money, you must have made appropriate arrangements to pay it back. Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Best interests of the child Details If you are under 18 years of age, we might not grant this visa if it is not in your best interest. Not have a No Further Stay condition Details You might not be able to apply for this visa if you have a No Further Stay condition. Check if this affects you For all criteria see Schedule 2 for subclass 461 visa in the Migration Regulations 1994 Meet all these criteria? Check how to apply in our step by step guide. Step by step We strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents. From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Step 1 Before you apply You might want to get help with your application. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Have a valid passport or travel documents All applicants should have a valid passport or other travel document before we grant this visa. If you need a new passport, plan to get it before you apply for this visa. If you cannot get a passport or travel document, tell us as soon as possible. If you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell us your passport details have changed See how Step 2 Gather your documents You must give us documents proving your identity and relationship to a New Zealand citizen, along with documents about any members of your family unit who are applying with you. If your current visa is about to cease you can lodge a Subclass 461 visa application by submitting the application form and the identity documents for all applicants and the New Zealand family member. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or do not provide true information See how Identity documents Provide identity documents and evidence of your relationship to a New Zealand citizen. We need proof of your identity. If you can't prove your identity we might: refuse your visa application not grant you another visa for 10 years not grant any family members you listed on your application a visa for 10 years. Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name, if applicable. Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. Other relationships Provide a death certificate, divorce or separation documents, or a statutory declaration if anyone in your application has been: widowed divorced permanently separated. Photos Provide two recent passport-size photos (45mm x 35mm) for each person in your application. The photos must have: a plain background head and shoulders only the name of the person on the back. See how Character documents Provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16 years of age. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. Also provide: an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 years of age military service records or discharge papers if you served in the armed forces of any country in the last 10 years. Complete and provide the following forms: Form 80 Personal particulars for assessment including character assessment (596KB PDF) Form 1221 Additional personal particulars information (331KB PDF) You are strongly encouraged to undertake any character checks before lodging your application. Lodging a complete application assists with quicker processing times. See how Police Certificate - New Zealand If you spent a total of 12 months or more in the last 10 years in New Zealand you must provide a New Zealand police certificate. The Department of Home Affairs will initiate the request of a New Zealand criminal record check on your behalf. A case officer will contact you directly to facilitate the check. You will need to complete the Consent to Exchange of Criminal Record Check Information - Jan 2024 form. You may also be required to provide additional documentation to us if there are any convictions of concern. See how Health exams Check ImmiAccount if you need to do any health examinations . If health examinations are required, you are strongly encouraged to do them before lodging your application so that we can process your application more quickly. Even though you cannot lodge an application for this visa in ImmiAccount, you can do any required health examinations in ImmiAccount before you lodge your application. For more information see health requirements See how Evidence of relationship to a New Zealand citizen You must be the partner of a New Zealand citizen, or the child or step-child of a New Zealand citizen or their partner Evidence of your relationship to a New Zealand citizen can include: birth certificates for each person claiming to be a member of the family unit of the New Zealand citizen marriage certificates death certificates adoption certificates family status certificates or family books (if these documents are officially issued and maintained) evidence that you are part of the New Zealand citizen's family. See the type of documents you need to provide to us as evidence that you are either the partner or dependent child or step-child of a New Zealand citizen in the sections below. Also give us evidence that the New Zealand citizen holds or is eligible for a Subclass 444 visa . This can include: the New Zealand citizen’s birth certificate the New Zealand citizen's passport. See how Partner documents We need to see evidence that you are in a genuine and ongoing relationship with your spouse or de facto partner . Provide: evidence of your partner’s identity, including a copy of their passport, a national identity card if they have one and proof of their change of name (if applicable) your marriage certificate, or enough evidence to prove that you are in a de facto relationship with your partner evidence of the genuine and ongoing nature of your relationship with your partner, such as: statements from friends or relatives supporting that your relationship is genuine statements from you and your partner detailing the level of commitment to one another and support derived from the relationship photographs of joint activities and evidence of any joint travel joint bank account statements or evidence that you pool your financial resources billing accounts in joint names joint leases or mortgages documents that show you live at the same address as your partner. If either you or your partner have been married previously, provide evidence of divorce. See how Dependants under 18 documents For every dependent under 18 years of age who is applying with you, provide: identity documents proof of your relationship with them, like a birth or marriage certificate adoption papers or parental court orders, if applicable character documents, if applicable. See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child (or step-child) lives and is not coming to Australia with the child (or step-child). They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child (or step-child) to visit Australia on this visa. Alternatively, you can show us: an Australian court order that allows your child (or step-child) to migrate to Australia, or that the laws of your home country allow them to leaved their home country. Include a document with the signature and photo of the person who completed the form or declaration, such as: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable. If the child (or step-child) is not staying with a relative or legal guardian, provide Form 1257 Undertaking declaration (211KB PDF) . The person they are staying with must sign the form. See how Dependants over 18 documents Provide identity documents, photos and information about other relationships for dependants who are 18 years of age or older. For every dependant 18 years of age or older who is applying with you, provide: identity documents and photos documents about their other relationships, if applicable character documents proof of enrolment at school, college or university, if applicable proof of dependency. See how Proof of dependency You need to prove that this person is dependent on you. Provide: a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of your relationship with the dependent such as a birth certificate or adoption papers. You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide: proof they live with you their tax records proof they are currently studying. Usually, your child (or step-child) must be under 23 years of age to be included in your application form and be under 23 years of age at the time of visa grant. However, a child (or step-child) over 23 years of age can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, please provide information about the physical or cognitive limitations. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters (NAATI) Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify When you apply on paper you must provide certified copies of your documents. This includes: non-English documents English translations. If you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan. See how Keep Keep a copy of your completed application. See how Send Send us: police certificates as much information as possible to help us decide on your application each document only once, even if you are using to show more than one thing all documents with your application, if you can. See how Step 3 Apply for the visa Show steps Apply online You can't apply for this visa online. Apply on paper Submit a valid application before any existing visa ceases. Pay the application charge. See how to pay Complete Form 147 Application for a New Zealand Citizen Family Relationship visa (subclass 461) (499KB PDF) Attach: the payment receipt (we will not process your application until we see this) copies of identity and travel documents for all applicants and your New Zealand citizen family member copies of all other relevant supporting documents If your passport has expired, provide details and a copy of this passport and evidence that you have applied for a new passport. Post your application: Postal address New Zealand Family Relationship visa office GPO Box 9984 SYDNEY NSW 2001 Australia Ensure you pay the correct postage amount. You can’t submit this application in person. If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After you apply We will let you know when we have received your application and documents. See what you can and must do after you apply. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa. See how Status updates If it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required. We do not acknowledge receipt of documents you send after you have submitted your application. See how Travel If you apply in Australia, tell us if you want to travel outside Australia while we process your application. If you leave Australia, make sure you hold a visa that will allow you to return. Learn about visa expiry Learn about Bridging visas See how Health exams We will let you know if you need to do any other health examinations See how Biometrics We might ask for biometrics . We will let you know if you need to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount. If you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter. We do not acknowledge receipt of documents you send after you apply. See how Newborn children Find out what to do if your child is born after you apply See how Stay lawful If you are in Australia, make sure you continue being a lawful non-citizen by holding a visa while we your application is being processed. If you held a substantive visa when you applied for this visa, you may be eligible for an associated bridging visa A (BVA). If you are granted a BVA and your current visa ceases before your Subclass 461 visa is decided, the BVA will come into effect. You can stay lawfully in Australia on the BVA while your application is being processed. See what to do if your visa has ceased or is about to cease Learn more about visa expiry See how Mistakes on your application Let us know as soon as you can. Complete Form 1023 - Notification of incorrect answers (168KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter. See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter. For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child (or step-child) you want to withdraw your application. See what to do if your situation changes See how Step 5 Visa outcome You can be in or outside Australian when we make a decision. Ensure you keep your contact details with us up to date. We will let you know in writing our decision about your visa application. If your visa is granted, we will tell you: your visa grant number the date your visa starts your visa conditions. Keep a copy of the decision with you when in Australia. If your visa is refused, we will let you know in writing. We will tell you why your visa was refused and whether you have a right to a review of the decision. When you have this visa We strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents. From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Coming to Australia In Australia Leaving Australia Coming to Australia Check your travel documents You must have: a visa to enter Australia a valid passport or other travel document. At the border Complete an Incoming Passenger Card All people arriving Australia must complete an Incoming Passenger Card Using the SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you must do on your visa You and your family members must meet all visa conditions and follow Australian laws. See your conditions in your grant letter or in VEVO Tell us about a change in your situation Things you need to let us know about include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child (or step-child). See how to tell us when your situation changes What you can do on your visa Check your visa conditions and expiry See your conditions and work and study entitlements in VEVO See how long you can stay This is a temporary visa. You can stay in Australia for 5 years. The visa starts on the date it is granted. To see when you must leave Australia, use VEVO Staying longer You can apply for another Subclass 461 visa if you meet the eligibility criteria If you no longer meet the eligibility criteria for another Subclass 461 visa, or want to apply for permanent residence, you should explore your options with the Visa finder. Travelling on your visa The visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while you hold your Subclass 461 visa. The time you spend outside Australia does not extend the visa. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Request your international movement records to get proof of your travel in and out of Australia. Working This visa lets you work and study in Australia. You are protected by Australian workplace law. See your workplace rights and entitlements. Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. At the border Departures SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Get your super You are likely to have some money in a superannuation fund if you worked in Australia and you are: 18 years of age or older paid AUD450 or more before tax in a month. See how to access your super International Movement Record Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 461\n\n# New Zealand Citizen Family Relationship visa\n\nNew Zealand Citizen Family Relationship visa\n\nThis visa is for a person who is not a New Zealand citizen but is a member of a family unit of a New Zealand citizen. It lets you live and work in Australia for five years.\n\nThis visa is for a person who is not a New Zealand citizen but is a member of a family unit of a New Zealand citizen. It lets you live and work in Australia for five years.\n\nThis visa is for a person who is not a New Zealand citizen but is a member of a family unit of a New Zealand citizen. It lets you live and work in Australia for five years.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n#### Stay\n\nStay\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\n#### Cost\n\nCost\n\nFromAUD445.00\n\nFromAUD445.00\n\nFrom\nAUD445.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa you can\n\nWith this visa you can\n- live, work and study in Australia for 5 years from the date your visa is granted\nlive, work and study in Australia for 5 years from the date your visa is granted\n- travel to and from Australia as many times as you want during the 5 year period.\ntravel to and from Australia as many times as you want during the 5 year period.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- not be a New Zealand citizen at the time of application\nnot be a New Zealand citizen at the time of application\n- meet certaineligibility criteria\nmeet certain\neligibility criteria\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nWith this visa you can\n​How long you can stay\nInclude family\nStay longer\nCost\nApply from\nProcessing times\nYour obligations\nTravel\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- live, work and study in Australia for 5 years from the date your visa is granted\nlive, work and study in Australia for 5 years from the date your visa is granted\n- travel to and from Australia as many times as you want during the 5 year period.\ntravel to and from Australia as many times as you want during the 5 year period.\n\n## ​How long you can stay\n\n​How long you can stay\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\nThe visa is granted with multiple entry. You can travel to and from Australia as many times as you want during the 5 year period.\n\nThe visa is granted with multiple entry. You can travel to and from Australia as many times as you want during the 5 year period.\n\nThe visa will be in effect from the date your visa is granted.\n\nThe visa will be in effect from the date your visa is granted.\n\n## Include family\n\nInclude family\n\nYou can combine your application with othermembers of the family unitwhen you apply.\n\nYou can combine your application with other\nmembers of the family unit\nwhen you apply.\n\nMembers of the family unitwho apply for the visa must meethealthandcharacter requirements.\n\nMembers of the family unit\nwho apply for the visa must meet\nhealth\nand\ncharacter requirements\n.\n\nYou can't add family members to a Subclass 461 visa application after it is lodged.\n\nYou can't add family members to a Subclass 461 visa application after it is lodged.\n\nWhile applicants can include members of their familyunit when they lodge the application, all applicants are assessed individually.\n\nWhile applicants can include members of their familyunit when they lodge the application, all applicants are assessed individually.\n\n### Newborn children\n\nNewborn children\n\nFind out what to do if yourchild is born after you apply.\n\nFind out what to do if your\nchild is born after you apply\n.\n\nNote: a child born to a New Zealand citizen parent in Australia may not be eligible for New Zealand citizenship by descent. For information about New Zealand citizenship, see theNew Zealand government website.\n\nNote: a child born to a New Zealand citizen parent in Australia may not be eligible for New Zealand citizenship by descent. For information about New Zealand citizenship, see the\nNew Zealand government website\n.\n\n## Stay longer\n\nStay longer\n\nYou can't stay in Australia after your visa ceases unless you are the holder of another visa.\n\nYou can't stay in Australia after your visa ceases unless you are the holder of another visa.\n\nYou can apply for a further Subclass 461 visa if you meet the eligibility requirements.\n\nYou can apply for a further Subclass 461 visa if you meet the eligibility requirements.\n\n## Cost\n\nCost\n\nThe below are the costs to make a valid application for a Subclass 461 visa:\n\nThe below are the costs to make a valid application for a Subclass 461 visa:\n- AUD445.00for the main applicant.\nAUD445.00\nfor the main applicant.\n- AUD225.00for members of the family unit over 18 years of age andAUD110.00for those under 18 who make a combined application with the main applicant.\nAUD225.00\nfor members of the family unit over 18 years of age and\nAUD110.00\nfor those under 18 who make a combined application with the main applicant.\n\nYou might also have to pay other costs such as for health examinations, police certificates andbiometrics.\n\nYou might also have to pay other costs such as for health examinations, police certificates and\nbiometrics\n.\n\nTo work out what your visa application might cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa application might cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance.\n\nNote: If you seek to satisfy the visa requirements that apply to an applicant who is outside Australia at the time of application, you should lodge your application when you are outside Australia and remain outside Australia until the Department sends you an acknowledgment letter confirming that the Department has received the application. You can only enter Australia if you hold a visa that is in effect.\n\nNote: If you seek to satisfy the visa requirements that apply to an applicant who is outside Australia at the time of application, you should lodge your application when you are outside Australia and remain outside Australia until the Department sends you an acknowledgment letter confirming that the Department has received the application. You can only enter Australia if you hold a visa that is in effect.\n\nSee theStep-by-Step sectionfor information on how to apply.\n\nSee the\nStep-by-Step section\nfor information on how to apply.\n\nSeeVisa outcomefor information on where you must be if we grant you the visa.\n\nSee\nVisa outcome\nfor information on where you must be if we grant you the visa.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application can take longer to process if:\n\nYour application can take longer to process if:\n- you do not fill the form out correctly\nyou do not fill the form out correctly\n- you do not include all the documents or if more information is requested from you\nyou do not include all the documents or if more information is requested from you\n- it takes us longer than usual to verify your information.\nit takes us longer than usual to verify your information.\n\nWe cannot process your application if you do not pay the correct cost. We will notify you if this is the case and if necessary return your application without processing it.\n\nWe cannot process your application if you do not pay the correct cost. We will notify you if this is the case and if necessary return your application without processing it.\n\n## Your obligations\n\nYour obligations\n\nYou and members of your family unit must meet all visa conditions that apply and follow all Australian laws.\n\nYou and members of your family unit must meet all visa conditions that apply and follow all Australian laws.\n\nSee theconditions for this visa.\n\nSee the\nconditions for this visa\n.\n\n## Travel\n\nTravel\n\nYou can travel outside Australia and return as many times as you want during the 5 years you may hold your visa.\n\nYou can travel outside Australia and return as many times as you want during the 5 years you may hold your visa.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a visa label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a visa label in your passport.\nEligibility\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n## You are not an Australian citizen\n\nYou are not an Australian citizen\nDetails\n\nYou cannot be granted this visa if you are an Australian citizen.\n\nYou cannot be granted this visa if you are an Australian citizen.\n\n## You are not a New Zealand citizen\n\nYou are not a New Zealand citizen\nDetails\n\nYou cannot be granted this visa if you are a New Zealand citizen.\n\nYou cannot be granted this visa if you are a New Zealand citizen.\n\nIf you become a New Zealand citizen during the processing of your application you can continue with the application, or instead withdraw it and apply for aSubclass 444 visaand be granted that visa if you meet the requirements.\n\nIf you become a New Zealand citizen during the processing of your application you can continue with the application, or instead withdraw it and apply for a\nSubclass 444 visa\nand be granted that visa if you meet the requirements.\n\nCertain persons may not be eligible for New Zealand citizenship by descent.\n\nCertain persons may not be eligible for New Zealand citizenship by descent.\n\nFor information about New Zealand citizenship, see theNew Zealand government website.\n\nFor information about New Zealand citizenship, see the\nNew Zealand government website\n.\n\n## Relationship to a New Zealand citizen\n\nRelationship to a New Zealand citizen\nDetails\n\nYou might be able to be granted this visa if you are in any of the below three categories.\n\nYou might be able to be granted this visa if you are in any of the below three categories.\n\nYou are a member of the family unit of a New Zealand citizen, who is not aneligible New Zealand citizenand who either:\n\nYou are a member of the family unit of a New Zealand citizen, who is not an\neligible New Zealand citizen\nand who either:\n- is in Australia as the holder of aSubclass 444 visa(they can check inVEVO)\nis in Australia as the holder of a\nSubclass 444 visa\n(they can check in\nVEVO\n)\n- will be travelling with you to Australia and will be granted aSubclass 444 visaon entry (check Eligibility).\nwill be travelling with you to Australia and will be granted a\nSubclass 444 visa\non entry (check Eligibility).\n\nNote:Your New Zealand family member must have (or be eligible for) aSubclass 444 visa.\n\nNote:\nYour New Zealand family member must have (or be eligible for) a\nSubclass 444 visa\n.\n\nNew Zealand citizens are not automatically granted aSubclass 444 visa.\n\nNew Zealand citizens are not automatically granted a\nSubclass 444 visa\n.\n\nTo find out if your New Zealand family member already holds a visa, useVEVO.\n\nTo find out if your New Zealand family member already holds a visa, use\nVEVO\n.\n\nYou are in Australia and you meet all of the following:\n\nYou are in Australia and you meet all of the following:\n- You hold a Subclass 461 visa or you do not hold a substantive visa and the last substantive visa you held was a Subclass 461 visa\nYou hold a Subclass 461 visa or you do not hold a substantive visa and the last substantive visa you held was a Subclass 461 visa\n- You are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa\nYou are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa\n- You have not become a member of the family unit of any other person (whether or not you are still a member of the family unit of that other person).\nYou have not become a member of the family unit of any other person (whether or not you are still a member of the family unit of that other person).\n\nYou are outside Australia and you meet all of the following:\n\nYou are outside Australia and you meet all of the following:\n- You held a Subclass 461 visa when you last left Australia\nYou held a Subclass 461 visa when you last left Australia\n- You are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa\nYou are no longer a member of the family unit of the person in relation to whom you were previously granted a Subclass 461 visa\n- You have not become a member of the family unit of another person (whether or not you are still a member of the family unit of that other person).\nYou have not become a member of the family unit of another person (whether or not you are still a member of the family unit of that other person).\n\nIf you are outside Australia, you must also meet one of the following:\n\nIf you are outside Australia, you must also meet one of the following:\n- You have been in Australia as the holder of a Subclass 461 visa for at least 2 years in the past 5 years immediately before you made your visa application\nYou have been in Australia as the holder of a Subclass 461 visa for at least 2 years in the past 5 years immediately before you made your visa application\n- You have substantial business, cultural, employment or personal ties with Australia that are of benefit to Australia. You must also have not been away from Australia for a continuous period of 5 years or more immediately before applying for this visa (unless you have compelling reasons for your absence).\nYou have substantial business, cultural, employment or personal ties with Australia that are of benefit to Australia. You must also have not been away from Australia for a continuous period of 5 years or more immediately before applying for this visa (unless you have compelling reasons for your absence).\n\nFor more information on family units seemembers of the family unit.\n\nFor more information on family units see\nmembers of the family unit\n.\n\n## Your immigration status when you apply\n\nYour immigration status when you apply\nDetails\n\n### If you are outside Australia when you apply\n\nIf you are outside Australia when you apply\n\nYou can apply for the subclass 461 visa without needing to hold another type of visa.\n\nYou can apply for the subclass 461 visa without needing to hold another type of visa.\n\n### If you are in Australia when you apply\n\nIf you are in Australia when you apply\n\nYou must either:\n\nYou must either:\n- hold a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in theDomestic Worker (Diplomatic or Consular) stream, or\nhold a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in the\nDomestic Worker (Diplomatic or Consular) stream\n, or\n- have last held a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream, within the last 12 months prior to your application.\nhave last held a substantive temporary visa, other than a subclass 403 Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular) stream, within the last 12 months prior to your application.\n\nOtherwise, you will be required to meet additional criteria applicable to unlawful non-citizens and certain Bridging visa holders.\n\nOtherwise, you will be required to meet additional criteria applicable to unlawful non-citizens and certain Bridging visa holders.\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nYou and any members of your family unit who apply for the visa with you must meet certainhealth requirements.\n\nYou and any members of your family unit who apply for the visa with you must meet certain\nhealth requirements\n.\n\nWe strongly encourage you to undertake any required health examinations before lodging your application. Lodging a complete application assists with quicker processing times. To complete your health examinations prior to submitting your visa application visitMy Health Declarations(MHD).\n\nWe strongly encourage you to undertake any required health examinations before lodging your application. Lodging a complete application assists with quicker processing times. To complete your health examinations prior to submitting your visa application visit\nMy Health Declarations(MHD)\n.\n\n.\n\n.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nYou and any members of your family unit 16 years of age or over who apply for the visa with you must meet certaincharacter requirements.\n\nYou and any members of your family unit 16 years of age or over who apply for the visa with you must meet certain\ncharacter requirements.\n\nOther family members might also need to meet certain character requirements.\n\nOther family members might also need to meet certain character requirements.\n\n## Have health insurance\n\nHave health insurance\nDetails\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nSee what is considered asadequate health insurance.\n\nSee what is considered as\nadequate health insurance\n.\n\nSee more abouthealth insurance for overseas visitors.\n\nSee more about\nhealth insurance for overseas visitors\n.\n\nReciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\n​If you are 18 years of age or older when you make your application, you must sign theAustralian Values Statementunless we decide you are not required to sign it due to any compelling circumstances that you have demonstrated.\n\n​If you are 18 years of age or older when you make your application, you must sign the\nAustralian Values Statement\nunless we decide you are not required to sign it due to any compelling circumstances that you have demonstrated.\n\n## Have paid back your debt to the Australian Government\n\nHave paid back your debt to the Australian Government\nDetails\n\nYou should not have any outstanding debts to the Australian Government. If you owe the Australian Government any money, you must have made appropriate arrangements to pay it back.\n\nYou should not have any outstanding debts to the Australian Government. If you owe the Australian Government any money, you must have made appropriate arrangements to pay it back.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Best interests of the child\n\nBest interests of the child\nDetails\n\nIf you are under 18 years of age, we might not grant this visa if it is not in your best interest.\n\nIf you are under 18 years of age, we might not grant this visa if it is not in your best interest.\n\n## Not have a No Further Stay condition\n\nNot have a No Further Stay condition\nDetails\n\nYou might not be able to apply for this visa if you have a No Further Stay condition.\n\nYou might not be able to apply for this visa if you have a No Further Stay condition.\n\nCheck if this affects you.\n\nCheck if this affects you\n.\n\nFor all criteria seeSchedule 2 for subclass 461 visa in the Migration Regulations 1994.\n\nFor all criteria see\nSchedule 2 for subclass 461 visa in the Migration Regulations 1994\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nYou might want to get help with your application.\n\nYou might want to get help with your application.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\n#### Have a valid passport or travel documents\n\nHave a valid passport or travel documents\n\nAll applicants should have a valid passport or other travel document before we grant this visa.\n\nAll applicants should have a valid passport or other travel document before we grant this visa.\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\nIf you cannot get a passport or travel document, tell us as soon as possible.\n\nIf you cannot get a passport or travel document, tell us as soon as possible.\n\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell usyour passport details have changed.\n\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell us\nyour passport details have changed\n.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou must give us documents proving your identity and relationship to a New Zealand citizen, along with documents about any members of your family unit who are applying with you.\n\nYou must give us documents proving your identity and relationship to a New Zealand citizen, along with documents about any members of your family unit who are applying with you.\n\nIf your current visa is about to cease you can lodge a Subclass 461 visa application by submitting the application form and the identity documents for all applicants and the New Zealand family member.\n\nIf your current visa is about to cease you can lodge a Subclass 461 visa application by submitting the application form and the identity documents for all applicants and the New Zealand family member.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if youcan't prove your identity or do not provide true information.\n\nProvide accurate information. See what happens if you\ncan't prove your identity or do not provide true information\n.\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nProvide identity documents and evidence of your relationship to a New Zealand citizen.\n\nProvide identity documents and evidence of your relationship to a New Zealand citizen.\n\nWe need proof of your identity. If you can't prove your identity we might:\n\nWe need proof of your identity. If you can't prove your identity we might:\n- refuse your visa application\nrefuse your visa application\n- not grant you another visa for 10 years\nnot grant you another visa for 10 years\n- not grant any family members you listed on your application a visa for 10 years.\nnot grant any family members you listed on your application a visa for 10 years.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if applicable.\nproof of change of name, if applicable.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\n\n#### Other relationships\n\nOther relationships\n\nProvide a death certificate, divorce or separation documents, or a statutory declaration if anyone in your application has been:\n\nProvide a death certificate, divorce or separation documents, or a statutory declaration if anyone in your application has been:\n- widowed\nwidowed\n- divorced\ndivorced\n- permanently separated.\npermanently separated.\n\n#### Photos\n\nPhotos\n\nProvide two recent passport-size photos (45mm x 35mm) for each person in your application. The photos must have:\n\nProvide two recent passport-size photos (45mm x 35mm) for each person in your application. The photos must have:\n- a plain background\na plain background\n- head and shoulders only\nhead and shoulders only\n- the name of the person on the back.\nthe name of the person on the back.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16 years of age. We only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16 years of age. We only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nAlso provide:\n\nAlso provide:\n- anoverseas police certificatefrom every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 years of age\nan\noverseas police certificate\nfrom every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 years of age\n- military service records or discharge papers if you served in the armed forces of any country in the last 10 years.\nmilitary service records or discharge papers if you served in the armed forces of any country in the last 10 years.\n\nComplete and provide the following forms:\n\nComplete and provide the following forms:\n- Form 80 Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n- Form 1221 Additional personal particulars information (331KB PDF)\nForm 1221 Additional personal particulars information (331KB PDF)\n\nYou are strongly encouraged to undertake any character checks before lodging your application. Lodging a complete application assists with quicker processing times.\n\nYou are strongly encouraged to undertake any character checks before lodging your application. Lodging a complete application assists with quicker processing times.\nSee how\n\n#### Police Certificate - New Zealand\n\nPolice Certificate - New Zealand\n\nIf you spent a total of 12 months or more in the last 10 years in New Zealand you must provide a New Zealand police certificate.\n\nIf you spent a total of 12 months or more in the last 10 years in New Zealand you must provide a New Zealand police certificate.\n\nThe Department of Home Affairs will initiate the request of a New Zealandcriminal record checkon your behalf. A case officer will contact you directly to facilitate the check.\n\nThe Department of Home Affairs will initiate the request of a New Zealand\ncriminal record check\non your behalf. A case officer will contact you directly to facilitate the check.\n\nYou will need to complete theConsent to Exchange of Criminal Record Check Information - Jan 2024form. You may also be required to provide additional documentation to us if there are any convictions of concern.\n\nYou will need to complete the\nConsent to Exchange of Criminal Record Check Information - Jan 2024\nform. You may also be required to provide additional documentation to us if there are any convictions of concern.\nSee how\n\n#### Health exams\n\nHealth exams\n\nCheckImmiAccountif you need to do anyhealth examinations. If health examinations are required, you are strongly encouraged to do them before lodging your application so that we can process your application more quickly.\n\nCheck\nImmiAccount\nif you need to do any\nhealth examinations\n. If health examinations are required, you are strongly encouraged to do them before lodging your application so that we can process your application more quickly.\n\nEven though you cannot lodge an application for this visa in ImmiAccount, you can do any required health examinations in ImmiAccount before you lodge your application.\n\nEven though you cannot lodge an application for this visa in ImmiAccount, you can do any required health examinations in ImmiAccount before you lodge your application.\n\nFor more information seehealth requirements.\n\nFor more information see\nhealth requirements\n.\nSee how\n\n#### Evidence of relationship to a New Zealand citizen\n\nEvidence of relationship to a New Zealand citizen\n\nYou must be the partner of a New Zealand citizen, or the child or step-child of a New Zealand citizen or theirpartner.\n\nYou must be the partner of a New Zealand citizen, or the child or step-child of a New Zealand citizen or their\npartner\n.\n\nEvidence of your relationship to a New Zealand citizen can include:\n\nEvidence of your relationship to a New Zealand citizen can include:\n- birth certificates for each person claiming to be a member of the family unit of the New Zealand citizen\nbirth certificates for each person claiming to be a member of the family unit of the New Zealand citizen\n- marriage certificates\nmarriage certificates\n- death certificates\ndeath certificates\n- adoption certificates\nadoption certificates\n- family status certificates or family books (if these documents are officially issued and maintained)\nfamily status certificates or family books (if these documents are officially issued and maintained)\n- evidence that you are part of the New Zealand citizen's family.\nevidence that you are part of the New Zealand citizen's family.\n\nSee the type of documents you need to provide to us as evidence that you are either the partner or dependent child or step-child of a New Zealand citizen in the sections below.\n\nSee the type of documents you need to provide to us as evidence that you are either the partner or dependent child or step-child of a New Zealand citizen in the sections below.\n\nAlsogive us evidence that the New Zealand citizen holds or is eligible for aSubclass 444 visa. This can include:\n\nAlso\ngive us evidence that the New Zealand citizen holds or is eligible for a\nSubclass 444 visa\n. This can include:\n- the New Zealand citizen’s birth certificate\nthe New Zealand citizen’s birth certificate\n- the New Zealand citizen's passport.\nthe New Zealand citizen's passport.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nWe need to see evidence that you are in a genuine and ongoing relationship with your spouse or de factopartner. Provide:\n\nWe need to see evidence that you are in a genuine and ongoing relationship with your spouse or de facto\npartner\n. Provide:\n- evidence of your partner’s identity, including a copy of their passport, a national identity card if they have one and proof of their change of name (if applicable)\nevidence of your partner’s identity, including a copy of their passport, a national identity card if they have one and proof of their change of name (if applicable)\n- your marriage certificate, or enough evidence to prove that you are in a de facto relationship with your partner\nyour marriage certificate, or enough evidence to prove that you are in a de facto relationship with your partner\n- evidence of the genuine and ongoing nature of your relationship with your partner, such as:statements from friends or relatives supporting that your relationship is genuinestatements from you and your partner detailing the level of commitment to one another and support derived from the relationshipphotographs of joint activities and evidence of any joint traveljoint bank account statements or evidence that you pool your financial resourcesbilling accounts in joint namesjoint leases or mortgagesdocuments that show you live at the same address as your partner.\nevidence of the genuine and ongoing nature of your relationship with your partner, such as:\n- statements from friends or relatives supporting that your relationship is genuine\nstatements from friends or relatives supporting that your relationship is genuine\n- statements from you and your partner detailing the level of commitment to one another and support derived from the relationship\nstatements from you and your partner detailing the level of commitment to one another and support derived from the relationship\n- photographs of joint activities and evidence of any joint travel\nphotographs of joint activities and evidence of any joint travel\n- joint bank account statements or evidence that you pool your financial resources\njoint bank account statements or evidence that you pool your financial resources\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show you live at the same address as your partner.\ndocuments that show you live at the same address as your partner.\n\nIf either you or your partner have been married previously, provide evidence of divorce.\n\nIf either you or your partner have been married previously, provide evidence of divorce.\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependent under 18 years of age who is applying with you, provide:\n\nFor every dependent under 18 years of age who is applying with you, provide:\n- identity documents\nidentity documents\n- proof of your relationship with them, like a birth or marriage certificate\nproof of your relationship with them, like a birth or marriage certificate\n- adoption papers or parental court orders, if applicable\nadoption papers or parental court orders, if applicable\n- character documents, if applicable.\ncharacter documents, if applicable.\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child (or step-child) lives and\nhas a legal right to decide where the child (or step-child) lives and\n- is not coming to Australia with the child (or step-child).\nis not coming to Australia with the child (or step-child).\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child (or step-child) to visit Australia on this visa.\na statutory declaration giving their consent for the child (or step-child) to visit Australia on this visa.\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child (or step-child) to migrate to Australia, or\nan Australian court order that allows your child (or step-child) to migrate to Australia, or\n- that the laws of your home country allow them to leaved their home country.\nthat the laws of your home country allow them to leaved their home country.\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as:\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable.\nadoption papers or other court documents if applicable.\n\nIf the child (or step-child) is not staying with a relative or legal guardian, provideForm 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\n\nIf the child (or step-child) is not staying with a relative or legal guardian, provide\nForm 1257 Undertaking declaration (211KB PDF)\n. The person they are staying with must sign the form.\nSee how\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nProvide identity documents, photos and information about other relationships for dependants who are 18 years of age or older.\n\nProvide identity documents, photos and information about other relationships for dependants who are 18 years of age or older.\n\nFor every dependant 18 years of age or older who is applying with you, provide:\n\nFor every dependant 18 years of age or older who is applying with you, provide:\n- identity documents and photos\nidentity documents and photos\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n- proof of enrolment at school, college or university, if applicable\nproof of enrolment at school, college or university, if applicable\n- proof of dependency.\nproof of dependency.\nSee how\n\n#### Proof of dependency\n\nProof of dependency\n\nYou need to prove that this person is dependent on you. Provide:\n\nYou need to prove that this person is dependent on you. Provide:\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of your relationship with the dependent such as a birth certificate or adoption papers.\nproof of your relationship with the dependent such as a birth certificate or adoption papers.\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are currently studying.\nproof they are currently studying.\n\nUsually, yourchild(or step-child) must be under 23 years of age to be included in your application form and be under 23 years of age at the time of visa grant.\n\nUsually, your\nchild\n(or step-child) must be under 23 years of age to be included in your application form and be under 23 years of age at the time of visa grant.\n\nHowever, a child (or step-child) over 23 years of age can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, please provide information about the physical or cognitive limitations.\n\nHowever, a child (or step-child) over 23 years of age can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, please provide information about the physical or cognitive limitations.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters (NAATI).\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters (NAATI)\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nWhen you apply on paper you must providecertified copiesof your documents.\n\nWhen you apply on paper you must provide\ncertified copies\nof your documents.\n\nThis includes:\n\nThis includes:\n- non-English documents\nnon-English documents\n- English translations.\nEnglish translations.\n\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\n\nIf you are emailing us documents after you apply, the documents do not need to be certified. Use a good quality photograph or scan.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\nSee how\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- police certificates\npolice certificates\n- as much information as possible to help us decide on your application\nas much information as possible to help us decide on your application\n- each document only once, even if you are using to show more than one thing\neach document only once, even if you are using to show more than one thing\n- all documents with your application, if you can.\nall documents with your application, if you can.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\nShow\n                    steps\n\n#### Apply online\n\nApply online\n\nYou can't apply for this visa online.\n\nYou can't apply for this visa online.\n\n#### Apply on paper\n\nApply on paper\n\nSubmit a valid application before any existing visa ceases.\n\nSubmit a valid application before any existing visa ceases.\n1. Pay the application charge. Seehow to pay.\nPay the application charge. See\nhow to pay\n.\n2. CompleteForm 147 Application for a New Zealand Citizen Family Relationship visa (subclass 461) (499KB PDF).\nComplete\nForm 147 Application for a New Zealand Citizen Family Relationship visa (subclass 461) (499KB PDF)\n.\n3. Attach:the payment receipt (we will not process your application until we see this)copies of identity and travel documents for all applicants and your New Zealand citizen family membercopies of all other relevant supporting documentsIf your passport has expired, provide details and a copy of this passport and evidence that you have applied for a new passport.\nAttach:\n1. the payment receipt (we will not process your application until we see this)\nthe payment receipt (we will not process your application until we see this)\n1. copies of identity and travel documents for all applicants and your New Zealand citizen family member\ncopies of identity and travel documents for all applicants and your New Zealand citizen family member\n1. copies of all other relevant supporting documents\ncopies of all other relevant supporting documents\n1. If your passport has expired, provide details and a copy of this passport and evidence that you have applied for a new passport.\nIf your passport has expired, provide details and a copy of this passport and evidence that you have applied for a new passport.\n4. Post your application:Postal addressNew Zealand Family Relationship visa officeGPO Box 9984SYDNEY NSW 2001AustraliaEnsure you pay the correct postage amount.You can’t submit this application in person.\nPost your application:\n\nPostal addressNew Zealand Family Relationship visa officeGPO Box 9984SYDNEY NSW 2001Australia\n\nPostal address\nNew Zealand Family Relationship visa office\nGPO Box 9984\nSYDNEY NSW 2001\nAustralia\n\nEnsure you pay the correct postage amount.\n\nEnsure you pay the correct postage amount.\n\nYou can’t submit this application in person.\n\nYou can’t submit this application in person.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa.\n\nYou can import any new and existing applications for this visa.\nSee how\n\n#### Status updates\n\nStatus updates\n\nIf it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required.\n\nIf it is within standard processing times, do not call or email. We do not provide updates on the progress of your application. You will be contacted if additional information is required.\n\nWe do not acknowledge receipt of documents you send after you have submitted your application.\n\nWe do not acknowledge receipt of documents you send after you have submitted your application.\nSee how\n\n#### Travel\n\nTravel\n\nIf you apply in Australia, tell us if you want to travel outside Australia while we process your application.\n\nIf you apply in Australia, tell us if you want to travel outside Australia while we process your application.\n\nIf you leave Australia, make sure you hold a visa that will allow you to return.\n\nIf you leave Australia, make sure you hold a visa that will allow you to return.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\n\nLearn aboutBridging visas.\n\nLearn about\nBridging visas\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you need to do any otherhealth examinations.\n\nWe will let you know if you need to do any other\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n. We will let you know if you need to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents you can upload them into ImmiAccount.\n\nIf you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, to provide any additional documents send them to the email address given in your acknowledgement letter.\n\nWe do not acknowledge receipt of documents you send after you apply.\n\nWe do not acknowledge receipt of documents you send after you apply.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia, make sure you continue being a lawful non-citizen by holding a visa while we your application is being processed.\n\nIf you are in Australia, make sure you continue being a lawful non-citizen by holding a visa while we your application is being processed.\n\nIf you held a substantive visa when you applied for this visa, you may be eligible for an associated bridging visa A (BVA). If you are granted a BVA and your current visa ceases before your Subclass 461 visa is decided, the BVA will come into effect. You can stay lawfully in Australia on the BVA while your application is being processed.\n\nIf you held a substantive visa when you applied for this visa, you may be eligible for an associated bridging visa A (BVA). If you are granted a BVA and your current visa ceases before your Subclass 461 visa is decided, the BVA will come into effect. You can stay lawfully in Australia on the BVA while your application is being processed.\n\nSee what to do ifyour visa has ceased or is about to cease.\n\nSee what to do if\nyour visa has ceased or is about to cease\n.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can. CompleteForm 1023 - Notification of incorrect answers (168KB PDF).\n\nLet us know as soon as you can. Complete\nForm 1023 - Notification of incorrect answers (168KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nIf you can’t use ImmiAccount, send the completed form to the email address given in your acknowledgement letter.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child (or step-child)\nthe birth of a child (or step-child)\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nSeewhat to do if your situation changes.\n\nSee\nwhat to do if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australian when we make a decision.\n\nYou can be in or outside Australian when we make a decision.\n\nEnsure you keep your contact details with us up to date. We will let you know in writing our decision about your visa application. If your visa is granted, we will tell you:\n\nEnsure you keep your contact details with us up to date. We will let you know in writing our decision about your visa application. If your visa is granted, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions.\nyour visa conditions.\n\nKeep a copy of the decision with you when in Australia.\n\nKeep a copy of the decision with you when in Australia.\n\nIf your visa is refused, we will let you know in writing. We will tell you why your visa was refused and whether you have a right to a review of the decision.\n\nIf your visa is refused, we will let you know in writing. We will tell you why your visa was refused and whether you have a right to a review of the decision.\nWhen you have this visa\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.From 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nWe strongly encourage you to undertake any required health examinations and character checks before lodging their application. Lodging a complete application assists with quicker processing times. See Step by Step – Gather your documents.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for New Zealand Citizen Family Relationship (subclass 461) visa applicants can import their paper application into ImmiAccount. For more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a visa to enter Australia\na visa to enter Australia\n- a valid passport or other travel document.\na valid passport or other travel document.\n\n### At the border\n\nAt the border\n\n#### Complete an Incoming Passenger Card\n\nComplete an Incoming Passenger Card\n\nAll people arriving Australia must complete anIncoming Passenger Card.\n\nAll people arriving Australia must complete an\nIncoming Passenger Card\n.\n\n#### Using the SmartGate\n\nUsing the SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you must do on your visa\n\nWhat you must do on your visa\n\nYou and your family members must meet all visa conditions and follow Australian laws. See your conditions in your grant letter or inVEVO.\n\nYou and your family members must meet all visa conditions and follow Australian laws. See your conditions in your grant letter or in\nVEVO\n.\n\n### Tell us about a change in your situation\n\nTell us about a change in your situation\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child (or step-child).\nthe birth of a child (or step-child).\n\nSeehow to tell us when your situation changes\n\nSee\nhow to tell us when your situation changes\n\n### What you can do on your visa\n\nWhat you can do on your visa\n\n#### Check your visa conditions and expiry\n\nCheck your visa conditions and expiry\n\nSee your conditions and work and study entitlements inVEVO.\n\nSee your conditions and work and study entitlements in\nVEVO\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\nThis is a temporary visa. You can stay in Australia for 5 years.\n\nThe visa starts on the date it is granted.\n\nThe visa starts on the date it is granted.\n\nTo see when you must leave Australia, useVEVO\n\nTo see when you must leave Australia, use\nVEVO\n\n### Staying longer\n\nStaying longer\n\nYou can apply for another Subclass 461 visa if you meet theeligibility criteria.\n\nYou can apply for another Subclass 461 visa if you meet the\neligibility criteria\n.\n\nIf you no longer meet the eligibility criteria for another Subclass 461 visa, or want to apply for permanent residence, you should explore your options with theVisa finder.\n\nIf you no longer meet the eligibility criteria for another Subclass 461 visa, or want to apply for permanent residence, you should explore your options with the\nVisa finder.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while you hold your Subclass 461 visa.\n\nThe visa is granted with multiple entry. You can leave and re-enter Australia as many times as you want while you hold your Subclass 461 visa.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.\n\n### Working\n\nWorking\n\nThis visa lets you work and study in Australia. You are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nThis visa lets you work and study in Australia. You are protected by Australian workplace law. See your\nworkplace rights and entitlements.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n### At the border\n\nAt the border\n\n#### Departures SmartGate\n\nDepartures SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Get your super\n\nGet your super\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n- 18 years of age or older\n18 years of age or older\n- paid AUD450 or more before tax in a month.\npaid AUD450 or more before tax in a month.\n\nSeehow to access your super.\n\nSee\nhow to access your super\n.\n\n#### International Movement Record\n\nInternational Movement Record\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-work-403/domestic-worker",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/new-zealand-citizen-family-relationship-temporary-461#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:08:34.056570",
  "metadata": {}
}