{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once",
  "title": "​​​Check twice, submit once​",
  "raw_text": "===== main placeholder ========================================== Page Image ​​​Check twice, submit once​ Get it right the first time for a faster visa process. Page Content ​​ ​​​​​ Applying for a visitor visa Get here sooner, not later. Applying for a student visa Don't miss your deadline. Applying for a skilled visa New opportunities await. Applying for a family visa Join your family sooner than expected. ​​ Get your visa application right the first time If you want to get to Australia sooner, make sure you have all the information and documents we need when you apply. You will get a faster outcome, so make sure you check your application twice before you submit it. Tips for submitting a ‘decision ready’ visa application Check that you have given us all required documents and correct information when you apply. Have all non-English documents translated into English. If you are in Australia you need to include the translator’s National Accreditation Authority of Translators and Interpreters (NAATI) practitioner number. If you are outside of Australia you need to include the translator’s full name, address, phone number and qualifications in the language they are translating. For more information visit NAATI Check you have spelt your name correctly and that it matches the passport you are using to apply for a visa. Check for autocorrect and be sure to list all names you have been known by. If you are under 18 you need to submit a copy of your passport, birth certificate and each of your parents’ passports. Get your police certificates before you apply. We accept police certificates issued in the 12 months before you apply for your visa. For most visa applications, you need to have a health check. You may be able to get your health check before you apply using the My Health Declarations Service. You can access the My Health Declarations service through Check when to have health examinations. Check your ImmiAccount inbox regularly for updates and requests for more information. Respond quickly if we ask for information. If we have to wait for information it will delay processing. If you do not have what we need, let us know and explain why. Get your biometric data collected quickly once we request it from you. ​​Submit your application well ahead of when you want to travel. We suggest you book your flight after we grant your visa. For more information on what to submit with your visa application follow these steps: Visit Department of Home Affairs Enter the visa subclass you are applying for into the search bar. A visa subclass is the number that sits alongside the visa. For example, Visitor (subclass 600). Select the web page of your chosen visa subclass. Click the ‘step by step’ tab. Navigate to ‘gather your documents’, click ‘show steps’ and click through the ‘see how’ options. ImmiAccount – your gateway to an Australian visa You must apply online for most Australian visas through ImmiAccount. When you are setting up your ImmiAccount, make sure that you choose to receive electronic communication from us. This includes updates about your application. Learn how to create an ImmiAccount or login. You can use ImmiAccount to: track the progress of your application see requests for more information add more information or documents to your application update your contact details. ​​​​",
  "main_content": "===== main placeholder ==========================================\nPage Image\n\n# ​​​Check twice, submit once​\n\n​​​Check twice, submit once​\n\nGet it right the first time for a faster visa process.\n\nGet it right the first time for a faster visa process.\nPage Content\n​​ ​​​​​\n\n### Applying for a visitor visa\n\nApplying for a visitor visa\nGet here sooner, not later.\n\n### Applying for a student visa\n\nApplying for a student visa\nDon't miss your deadline.\n\n### Applying for a skilled visa\n\nApplying for a skilled visa\nNew opportunities await.\n\n### Applying for a family visa\n\nApplying for a family visa\nJoin your family sooner than expected.\n​​\n\n## Get your visa application right the first time\n\nGet your visa application right the first time\n\nIf you want to get to Australia sooner, make sure you have all the information and documents we need when you apply. You will get a faster outcome, so make sure you check your application twice before you submit it.\n\nIf you want to get to Australia sooner, make sure you have all the information and documents we need when you apply. You will get a faster outcome, so make sure you check your application twice before you submit it.\n\nTips for submitting a ‘decision ready’ visa application\n\nTips for submitting a ‘decision ready’ visa application\n- Check that you have given us all required documents and correct information when you apply.\nCheck that you have given us all required documents and correct information when you apply.\n- Have all non-English documents translated into English. If you are in Australia you need to include the translator’s National Accreditation Authority of Translators and Interpreters (NAATI) practitioner number. If you are outside of Australia you need to include the translator’s full name, address, phone number and qualifications in the language they are translating. For more information visitNAATI.\nHave all non-English documents translated into English. If you are in Australia you need to include the translator’s National Accreditation Authority of Translators and Interpreters (NAATI) practitioner number. If you are outside of Australia you need to include the translator’s full name, address, phone number and qualifications in the language they are translating. For more information visit\nNAATI\n.\n- Check you have spelt your name correctly and that it matches the passport you are using to apply for a visa. Check for autocorrect and be sure to list all names you have been known by.\nCheck you have spelt your name correctly and that it matches the passport you are using to apply for a visa. Check for autocorrect and be sure to list all names you have been known by.\n- If you are under 18 you need to submit a copy of your passport, birth certificate and each of your parents’ passports.\nIf you are under 18 you need to submit a copy of your passport, birth certificate and each of your parents’ passports.\n- Get your police certificates before you apply. We accept police certificates issued in the 12 months before you apply for your visa.\nGet your police certificates before you apply. We accept police certificates issued in the 12 months before you apply for your visa.\n- For most visa applications, you need to have a health check. You may be able to get your health check before you apply using the My Health Declarations Service. You can access the My Health Declarations service through Checkwhen to have health examinations.\nFor most visa applications, you need to have a health check. You may be able to get your health check before you apply using the My Health Declarations Service. You can access the My Health Declarations service through Check\nwhen to have health examinations.\n- Check your ImmiAccount inbox regularly for updates and requests for more information.\nCheck your ImmiAccount inbox regularly for updates and requests for more information.\n- Respond quickly if we ask for information. If we have to wait for information it will delay processing. If you do not have what we need, let us know and explain why.\nRespond quickly if we ask for information. If we have to wait for information it will delay processing. If you do not have what we need, let us know and explain why.\n- Get yourbiometric datacollected quickly once we request it from you.\nGet your\nbiometric data\ncollected quickly once we request it from you.\n- ​​Submit your application well ahead of when you want to travel. We suggest you book your flight after we grant your visa.\n​​Submit your application well ahead of when you want to travel. We suggest you book your flight after we grant your visa.\n\nFor more information on what to submit with your visa application follow these steps:\n\nFor more information on what to submit with your visa application follow these steps:\n- VisitDepartment of Home Affairs.\nVisit\nDepartment of Home Affairs\n.\n- Enter the visa subclass you are applying for into the search bar. A visa subclass is the number that sits alongside the visa. For example, Visitor (subclass 600).\nEnter the visa subclass you are applying for into the search bar. A visa subclass is the number that sits alongside the visa. For example, Visitor (subclass 600).\n- Select the web page of your chosen visa subclass.\nSelect the web page of your chosen visa subclass.\n- Click the ‘step by step’ tab.\nClick the ‘step by step’ tab.\n- Navigate to ‘gather your documents’, click ‘show steps’ and click through the ‘see how’ options.\nNavigate to ‘gather your documents’, click ‘show steps’ and click through the ‘see how’ options.\n​\n\n## ImmiAccount – your gateway to an Australian visa\n\nImmiAccount – your gateway to an Australian visa\n\nYou must apply online for most Australian visas through ImmiAccount. When you are setting up your ImmiAccount, make sure that you choose to receive electronic communication from us. This includes updates about your application. Learn how tocreate an ImmiAccountorlogin.\n\nYou must apply online for most Australian visas through ImmiAccount. When you are setting up your ImmiAccount, make sure that you choose to receive electronic communication from us. This includes updates about your application. Learn how to\ncreate an ImmiAccount\nor\nlogin.\n\nYou can use ImmiAccount to:\n\nYou can use ImmiAccount to:\n- track the progress of your application\ntrack the progress of your application\n- see requests for more information\nsee requests for more information\n- add more information or documents to your application\nadd more information or documents to your application\n- update your contact details.\nupdate your contact details.\n​\n​\n​​​​",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-finder",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/fees-and-charges",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:00:01.707404",
  "metadata": {}
}