{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790",
  "title": "Safe Haven Enterprise visa",
  "raw_text": "===== main placeholder ========================================== Subclass 790 Safe Haven Enterprise visa This visa is for people who arrived in Australia without a visa, and want to seek asylum. It lets you stay in Australia temporarily if you engage Australia's protection obligations and meet all other requirements for the grant of the visa. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay 5 years Cost Processing times Processing times for this visa are unavailable. With this visa, you can stay in Australia temporarily for 5 years work and study access government services such as Centrelink See all conditions Check your eligibility You must engage Australia’s protection obligations (or be a member of the same family unit of someone who does) meet all other visa requirements, such as health, character, identity and security sign a declaration on the application form that you intend to work or study in regional Australia Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa With this visa, you can How long you can stay Stay longer Apply from Including family members Processing times Your obligations Travel Visa label Withdraw your application With this visa, you can live, work and study in Australia temporarily for 5 years access government services such as Workforce Australia Medicare and Centrelink services access short-term counselling for torture and trauma when required attend English language classes for free if you are eligible travel overseas to countries other than your home country if you obtain our written approval to travel due to compassionate or compelling circumstances How long you can stay This is a temporary visa. It lets you stay in Australia for 5 years. Stay longer If we grant you this visa on or after 14 February 2023, you must apply for subsequent Safe Haven Enterprise visa (SHEV) or a Temporary Protection visa (TPV) before your current SHEV expires, if you still need Australia's protection and are not subject to any application bars. SHEV and TPV holders and former holders who arrived in Australia before 14 February 2023 may be eligible to apply for a permanent Resolution of Status (RoS) visa (subclass 851) Apply from You, and any members of your family unit included in your application, must be in Australia when you apply for this visa. Including family members Members of the same family unit may apply together on the same application. They must: be in Australia at the time of application be eligible to apply for this visa Members of the same family unit are: spouse or de facto partner of the family head dependent child or step-child of the family head dependent child or step-child of the family head’s partner other dependent relatives of the family head The family head can be you. It can also be someone else in your family who has not applied for this visa. dependent child is a child or step-child who is under 18 years old. A dependent child can be 18 years old or older if they are: incapacitated for work due to loss of their bodily or mental functions; or wholly or substantially reliant on their parent or step-parent for financial, psychological or physical support A child or step-child of any age is not considered to be a dependent child if they are currently married, engaged to be married or in a de facto relationship. Children who are not dependent children must apply for their own visa. Other dependent relatives may include relatives such as the family head’s: parent brother/sister grandparent/grandchild aunt/uncle cousin niece/nephew or step equivalent to any of the above A relative will be considered a dependent relative of the family head if they: do not have a spouse or de facto partner usually lives with the family head; and are wholly or substantially reliant on the family head for financial, psychological or physical support Members of the same family unit applying for this visa must meet our health character and security requirements. Newborn child If a child is born after you submit your application and before we make a decision on your application, the child will be taken to be included in that application. You must tell us as soon as possible by: completing Form 1022 Notification of change of circumstances providing a clear colour copy of their original birth certificate attaching them in ImmiAccount or sending them by post to the address where you sent your application (you will need to send a certified copy of the child’s birth certificate if you send it by post) If your child is born in Australia, they are automatically granted the same visas their parents hold at the time of the child’s birth. If either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth See the requirements for evidence of Australian citizenship Processing times We aim to finalise SHEV applications as quickly as possible. This is a very complex process and will take some time. You can help by responding to any of our requests in the specified timeframes. Your application can take longer to process if: you do not fill in your application correctly you do not include all the documents we need we need more information from you you do not respond to requests for information quickly it takes us time to verify your information Review rights If your SHEV application is refused, you can apply for merits review by the Administrative Review Tribunal (ART) If we refuse your SHEV application, your refusal letter will provide further information about your review rights, including timeframes to apply for review. Your obligations You and the members of your same family unit included in your application must meet all visa conditions and obey Australian laws. See which conditions apply to this visa Travel Waiting for your SHEV application to be decided If you leave Australia before we decide your SHEV application, your bridging visa will expire and you will not be allowed to re-enter Australia. If you hold a SHEV If we have granted you a SHEV, visa condition 8570 (Restricted travel) applies to your visa. Visa condition 8570 (Restricted travel) Visa condition 8570 (Restricted travel) restricts your right to travel. You can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given you written approval to travel before you leave Australia. If you travel overseas without the Department’s written approval, you will breach visa condition 8570, and we may cancel your visa (and the visas of members of your family unit) while you are offshore. For more information, see Leaving Australia Visa label We will digitally link your visa to your travel document or ImmiCard . You will not get a label in your travel document. Withdraw your application If you hold a bridging visa and withdraw your SHEV application before we make a decision, you may be prevented from applying for a SHEV or a Temporary Protection visa, and your bridging visa will expire 35 days after you withdraw your application. You may withdraw your SHEV application in writing at any time before we make our decision. Your request must include: your full name date of birth details of the application you are withdrawing Any additional applicants who are 18 years of age or older must sign the letter of withdrawal or send a separate email or letter withdrawing their application. Eligibility Arrived in Australia illegally Details If you entered Australia without a valid visa or were not immigration cleared on arrival, you may only be eligible to apply for a Temporary Protection visa (TPV) or a Safe Haven Enterprise visa (SHEV). You cannot apply for a permanent Protection visa (subclass 866). To apply for a Safe Haven Enterprise visa, you must: be unable to make a valid application for a permanent Protection visa (subclass 866) and be an unauthorised maritime arrival, or have not been immigration cleared at Australia's border when you last entered Australia, or have entered Australia without a valid visa, or hold or have held one of the following visas: Temporary Protection visa (subclass 785) Temporary Safe Haven visa (subclass 449) Temporary (Humanitarian Concern) visa (subclass 786), or Safe Haven Enterprise visa (subclass 790) Be a refugee or satisfy Australia’s complementary protection criteria Details As defined by the Migration Act 1958 (Migration Act) you must: be a refugee or meet the complementary protection criteria Australia must not return people to their home country where there is a risk that the person may suffer harm because they engage Australia's protection obligations Meet our identity requirements Details You may be required to provide documents as evidence of your identity, nationality or citizenship with your application. It is your responsibility to cooperate and provide this evidence so we can complete identity checks. We may ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before. We will use the information collected about your identity when assessing your claims for protection and completing character and security checks. Not be barred from lodging a SHEV application Details You may not be able to make a valid Safe Haven Enterprise (SHEV) visa application if you: are an unauthorised maritime arrival, or were immigration cleared when you arrived in Australia, or have been refused a protection visa since your last arrival to Australia, or have had a protection visa cancelled since your last arrival to Australia, or hold or held a Humanitarian Stay (Temporary)(subclass 449) visa since last entering Australia, or are a transitory person The Minister has the power to lift any application bar if it is determined to be in the public interest, and may have already lifted any relevant application bar(s) in your case. We will let you know if an application bar affects your SHEV application. Meet our security requirements As part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a SHEV. Meet our health requirement Details You must undergo health examinations . This will protect your health and the health of the Australian community. These examinations are conducted by Bupa Medical Visa Services You will receive a health identifier (HAP ID) and information about how to arrange your health examinations after you have lodged your visa application. Meet our character requirement You must meet certain character requirements Sign the Australian values statement If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia booklet and confirm you will respect the Australian way of life and obey Australian laws when you sign or accept the Australian Values Statement Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply Check that you are eligible. You can then: prepare and submit your application yourself, or get someone to act on your behalf Show steps Get help with your application Only certain people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents You need to provide documents to support your application for this visa. We can make a decision on your application using the information you provide when you lodge your application. Show steps Provide accurate information Provide accurate information. See what happens if you don't provide true information It is in your interest to provide as much information as possible in your application. You should ensure that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application. Important documents You can find a list of documents that must be included with your application in the online application form in ImmiAccount You must provide all relevant documents to pay the visa application charge when you apply. See How to pay See how Identity documents You must provide colour scans or photos of original and translated documents of identity, nationality and citizenship such as: all pages of current or expired passports (including biodata page) birth certificate national identity card driver's licence proof of change of name, if applicable any other documents that support your identity, nationality or citizenship. Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. If you can't provide these documents, provide a statement with your application to explain why you have no travel or identity documents. See how Claims for protection You must answer all the questions on the application form about your claims for protection. If you do not have enough space, submit additional information and attach it to the application. When preparing your claims for protection, the form will ask you to provide all the details about why you are seeking protection. You must provide, wherever possible, documentation to support your claims. You will need to address the following questions: What country are you seeking protection from? Why did you leave that country? Why are you unable to return to that country? Have you experienced harm in that country? If so, what is the harm you have experienced? Who caused the harm to you? What do you fear might happen to you if you return to that country? Why do you think this will happen to you if you return? Is there an area in that country where you would not be harmed? Would you be able to relocate there? Are the authorities in your country able to protect you? When did you leave your home country? How did you get to Australia? We will use this information to assess whether you engage Australia's protection obligations See how Evidence and supporting documents You should provide with your application any documents or evidence that you think will support your claims for protection. You should attach all relevant documents to your ImmiAccount. Relationship documents Provide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships See how Character documents Provide military service records or discharge papers if you or any other person included in the application served in the armed forces of any country. You must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age (other than a country from which you are claiming protection). Do not arrange for police certificates until we ask you. See how Visas or residence permits Provide a copy of any visas or residence permits you and each person included in the application hold. Family members included in your application Provide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant) See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person Upload your written notification or your forms to ImmiAccount See how Prepare your documents You must apply for this visa by submitting an online application in ImmiAccount. See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters For online applications You do not need to have any documents certified. See how Scan or photograph all documents Scan or photograph all documents (English and non-English) in colour. The scans and photographs must be clear. If a document is more than one page, save it all as one file. Ensure you save photographs under the name of the person in the photograph. Clearly label all other files in English. See how Attach Attach: colour scans or photos of original and translated documents, if you can as much information as possible to help us decide on your application each document only once, even if you are using it to show more than one thing. Learn more about attaching documents See how Step 3 Apply for the visa Show steps Completing your application You must tell the truth in your application. If you provide incorrect information on purpose, we may question your credibility and we might refuse your application for a SHEV. It is important that you include all details about your claims for protection and your identity, nationality and citizenship . It is also important that you provide supporting documentation relating to protection claims and your identity and nationality or citizenship. The form asks for information about your education, work, travel, relationship and address history. Make sure you include all information, so that there are no gaps in the timelines. For example, if you were unemployed for a period, put this on the form to explain the gap between your jobs. If a migration agent completes your application form, you must read and understand all the information that is included in the form before signing it and before signing any statutory declaration you make. You are responsible for any claims made in the form. It is very important that you do not sign blank pages or documents even if you are asked to do so. See how Apply online in ImmiAccount Protection visa applications must be lodged online through ImmiAccount. When you lodge online you can: check the status of your application continue a saved application attach documents to an application update personal details access a copy of your application at any time To apply online, follow these steps: Log in or create an ImmiAccount Attach documents Pay the application fee . We will not process your application until you pay the fee. Note: If you are in immigration detention when you apply for this visa and have not been immigration cleared, you do not have to pay the application fee. Keep a record of your Transaction Reference Number (TRN). The online form will guide you to answer the questions we need from you. It has help text if you need support. When you finish your online application, you will come to a page that will prompt you to attach documents and make payment online. You can save your application at any page and go back to it when you are ready. Once you have submitted your application online, you will be able to check the status of your application through ImmiAccount. If you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application. For help and support for technical issues with ImmiAccount refer to technical help See how Communicating by email The online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post. If you have already applied and you want us to communicate with you by email but you did not select this option when completing your application, complete Form 1193 Communicating by email with the Department See how Step 4 After you apply We will let you know when we have received your application by sending you an acknowledgement letter. Show steps Status updates We can’t give updates on applications. You can check if we need more information from you in ImmiAccount Stay lawful We may grant you a bridging visa that allows you to stay lawfully in Australia while we process your Safe Haven Enterprise visa (subclass 790) application. The type of bridging visa we may grant you and whether you can work in Australia while holding this visa depends on a number of factors. Travel after you apply If you leave Australia before we grant you a SHEV, your bridging visa will expire and you will not be allowed to re-enter Australia unless you hold another valid visa. Health examinations We will let you know when you need to arrange your health examinations. You will receive a health identifier (HAP ID) and information about how to arrange your health examinations Biometrics We may ask you to provide biometrics for you or any members of the same family unit included in your application. We may not ask you to provide biometrics again if you have already provided them to us. We will take a digital photograph of your face and a scan of your fingerprints. If you do not let us collect this information: your application will be invalid and we cannot consider it if we grant you a bridging visa when you apply, it will end 35 days after you are notified that your application is invalid. You will then become unlawful. See more information about how we collect biometrics See how Waivers for photographs and fingerprints Waivers can apply in exceptional circumstances and we will consider as required. If you are younger than 18 years of age or an incapable person If you are younger than 18 years of age, you will need a parent, guardian or other adult (such as a relative or friend), either to give their permission for us to take your photograph or your fingerprints, or to be present while we take them. We will not take fingerprints of people who are: younger than 10 years of age incapable physically unable (because you may have missing fingers or a medical or physical condition that doesn't allow us to collect your fingerprints accurately). We will not take facial images of minors who are younger than 5 years of age. An incapable person is someone who is not able to understand why they need to provide their photograph or fingerprints. This includes people who have an intellectual disability. See how Attend an interview if we request it We will contact you if we require you to attend an interview. The interview is to discuss your protection visa application. It is also an opportunity for you to clarify the claims in your application. However, we may make our decision on the information provided in your visa application and you may not get another opportunity to present these claims. That is why it is important that you provide all claims, supporting documentation and evidence when you submit your application. We conduct most protection visa interviews via videoconference. If we invite you to attend an interview, you will be provided with instructions on how to join the videoconference. If we conduct the interview in person, we will provide details of the relevant office. At interview you need to give us all the information we need to make a decision about your visa application. We might ask you about: your situation, including why you are applying for a protection visa your family information you provided in your application. You must make every reasonable effort to attend your scheduled interview. Let us know as soon as possible if there are any reasons why you can’t attend your interview. We may consider if it is possible to reschedule it. If you do not attend your scheduled interview, we can decide your protection visa application on the information available at the time. See how Submitting further information before interview It is important that you provide all claims, supporting documentation and evidence when you submit your application. You can provide more information about your claims or your application before we make our decision. An officer may decide on your application with no further contact. If you want to provide more information before your interview, submit it at least 5 working days before the interview via ImmiAccount If you submit information less than 5 working days before the interview, we will still consider it. The officer may need more time for this, and your interview may not proceed as advised. The officer may cancel the interview and seek more information from you in writing. See how Documents you need to have at interview Please bring the following documents to the interview: your ‘request to attend interview’ letter, if your interview is at the departmental office all your original identity documents. These may include: passport, national identity card, birth certificate and/or your driver’s licence any other proof to support your protection claims your religious book, if you are going to make an oath during the interview. If you make an affirmation instead of an oath, you do not need a religious book. Bring English translations of all documents. Translations must be certified by a translator accredited by the National Accreditation Authority for Translators and Interpreters See how Who can attend with you An officer from the Department will attend the interview. Your migration agent or representative can attend the interview, if you have one. If you need an interpreter, we will provide one. The interpreter is not allowed to disclose anything they hear during the interview. They can only assist with language interpretation. They are not involved in the decision made on your application. You may be able to bring a support person, such as a friend or relative, to the interview. At least 2 working days before the interview, contact the officer on your 'request to attend interview' letter to ask for permission. This person should provide photograph identification to prove their identity. You should make childcare arrangements for your children while you attend the interview, as this will allow you to speak with our officer uninterrupted. See how During the interview You should be ready 15 minutes before your scheduled interview. We will give you information explaining Australia's protection obligations Interviews are audio-recorded. Our officer will discuss this with you. They will ask your permission to record the interview as an accurate record of the discussion. We will keep the recording confidential. The officer making the decision will consider the recording, along with all other information you have provided. The Privacy Act 1988 protects your personal information, including the information you provide at the interview. Before your interview you should read the information in Form 1442i - Privacy notice At the interview, the interviewing officer will: check your documents. These may include proof of your identity, nationality and citizenship or country of residence ask you to make an oath or affirmation that the information you provide is true ask you questions about your claims for protection, identity and other information you have provided. It is important that you tell the truth during the protection visa process. You must give us clear and complete answers, and explain all of the reasons why you are seeking protection in Australia. You must give enough evidence to establish your protection claims. At the interview, you can change any information you have given before. Giving false or misleading information is a serious offence in Australian law. You may be subject to criminal penalties and we may refuse your application. See how Provide more information You can provide more relevant information to us, in writing, at any time until we make a decision on your application. If you did not provide all relevant documents when you applied, attach them as soon as possible in ImmiAccount We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If we receive information from another person that could result in the refusal of your visa, we will give you the opportunity to comment on the information. See how Add family members to your application You can add members of your same family unit to your application at any time before we decide it. The members of your family unit will also have to be in Australia when they apply. If you want to add family members after you submit your application, you can only add: spouse or de facto partner of someone who has already applied for the visa dependent child of someone who has already applied for the visa. You can only add them after you submit your application if: they are in Australia they are eligible to apply for this visa we have not yet decided your application. To add a family member, complete Form 1436 Adding an additional applicant after lodgement and attach this form and evidence of relationship documents to ImmiAccount. See how Evidentiary requirements Provide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant). See how Newborn child If a child is born after you submit your application and before we make a decision, the child will be taken to be included in that application, unless they are an Australian citizen at birth. You must tell us of the child's birth as soon as possible by: completing Form 1022 Notification of change of circumstances providing the child's birth certificate (colour photo or scan) attaching both documents in ImmiAccount. If your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth. If either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth. See how Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers and upload it to ImmiAccount Help with your application Let us know if you no longer want someone to: receive your correspondence, complete Form 956A Appointment or withdrawal of an authorised recipient provide immigration advice, complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your name, phone number, email, address or passport changes to your marital or de facto status you are pregnant or you become pregnant the birth of a child a death in your family you want to withdraw your application See how to tell us if your situation changes See how Get support If you have submitted a valid application, in limited circumstances you might be able to get financial or other assistance from the Status Resolution Support Services (SRSS) program Enrol in Medicare service centre To access public healthcare, enrol in Medicare. Take your 'acknowledgement of visa application' letter and supporting documents to a Medicare Service centre Step 5 Visa outcome We will let you know our decision on your visa application in writing. Show steps If we grant your visa If we grant your visa, we will send you a visa grant notification letter. Your letter will tell you: your visa grant number your visa grant date and expiry date your visa conditions information about a range of topics including travel outside of Australia visa conditions applying for a subsequent SHEV or TPV notice of application bar lift (for unauthorised maritime arrivals) Australian working conditions your entitlements to government services ImmiCard Translating and Interpreting Service (TIS). You should keep a copy of this letter in a safe place. See how If we refuse your visa If we refuse your visa, we will send you a refusal notification letter. Your letter will tell you: why we refused the visa your review right with the Administrative Review Tribunal (ART) , including timeframes to apply for review. We will not refund the application fee if we refuse your application. If your Safe Haven Enterprise visa application has been finally determined , and you do not engage Australia's protection obligations and you do not hold another visa, you do not have a lawful right to stay in Australia. You will need to return to your home country or to another country where you have right of entry. If you become unlawful in Australia and do not depart voluntarily, we will take steps to remove you from Australia. If we refuse your SHEV application or cancel your SHEV after we have granted it, and you have exhausted all appeal rights, you can ask the Minister for Home Affairs to intervene in your case . The Minister does not have to consider your request. See how When you have this visa When you have this visa Get support Leaving Australia When you have this visa You can: live, work and study in Australia temporarily for 5 years access government services such as Workforce Australia Centrelink and Medicare and short-term counselling for torture and trauma when required travel overseas to countries other than your home country if we give you written approval to travel on compassionate or compelling grounds attend English language classes for free if you are eligible Your visa will come with conditions attached to it. To see your conditions use VEVO What you must do on this visa You and your family members must obey all Australian laws. Tell us if things change Things you need to let us know about when you have this visa: changes to your name, phone number, email, address or passport changes to your marital or de facto status the birth of a child death in your family See what to do if your situation changes Visa details To prove you have a visa and show your conditions to someone, use VEVO ImmiCard You and your eligible family members can obtain an ImmiCard An ImmiCard is an official, secure immigration credential that contains a photograph and personal details such as family name, given names, date of birth and gender. ImmiCards also have a unique number that is linked to biometric and visa details in our system. Working on your visa To see your conditions for work, use VEVO You are protected by Australian workplace law. See your workplace rights and entitlements. Bringing family You can't sponsor family members for a visa through the Australian Humanitarian or Family Migration Programs while you hold a Safe Haven Enterprise visa. Becoming an Australian citizen You are not eligible to apply for Australian citizenship while you hold a Safe Haven Enterprise visa. Applying for a subsequent SHEV or TPV SHEVs are temporary visas and cease 5 years after date of grant. If you are a SHEV holder and you arrived in Australia on or after 14 February 2023, you must apply for a subsequent TPV or SHEV before your current SHEV expires in order to stay in Australia and remain lawful, if you still need Australia's protection. If you currently hold or formerly held a TPV or SHEV and you arrived in Australia before 14 February 2023 you may be eligible to apply for a permanent Resolution of Status (subclass 851) visa instead of a subsequent TPV or SHEV. Make sure you keep your contact details with the Department updated so that you receive the bar lift notice. For more information, see: Your personal details have changed You must apply after we notify you and before your visa expires, or you will become unlawful and be barred from applying for a subsequent visa. If you make a valid application for either a subsequent SHEV, TPV or a Resolution of Status visa while you still hold your SHEV, your SHEV will remain in effect until we make a decision on your application: Your work and study rights will continue while you wait for a decision on your subsequent application Your eligibility for Medicare and Centrelink will continue, but you will need to renew your Medicare card. Update your contact details Make sure that you give us your current contact details, so you can receive the bar lift letter and the mobile and email reminders. It is your responsibility as a visa holder to let us know within 28 days if you change your address and to keep your contact details up to date. See how you can let us know your personal details have changed After bar lift notification, we recommend you apply for a subsequent visa at least 3 months before your current SHEV ceases. To see when your visa expires, use VEVO If your visa has expired To see if your SHEV has expired already, use VEVO. If your SHEV has already expired, and you have not applied for a subsequent SHEV or TPV, you: are unlawful and must make arrangements to depart Australia may be barred from re-applying for a SHEV or TPV If your SHEV has already expired and you are unlawful, see My visa is about to expire or has expired or contact the Status Resolution Service by calling 1300 853 773. If you need interpreting assistance, call 131 450. Get support Australian Government services You may be able to access a range of services offered by the Australian Government such as Workforce Australia Centrelink Medicare and short-term counselling for torture or trauma where required. Services Australia delivers a range of social and health-related payments and services. For more information about the range of services that may be available to you and your eligibility to access them go to Services Australia Unaccompanied Humanitarian Minor program If you are an unaccompanied humanitarian minor, you can get support through the Unaccompanied Humanitarian Minors program. Australian Taxation Office To receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to the Australian Taxation Office Information pack on domestic and family violence, sexual assault and forced marriage The Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage. The family safety pack also includes important information about essential services and emergency contacts in Australia. Leaving Australia Before you leave Check your travel documents Check your visa travel facility in VEVO As a SHEV holder, you can travel overseas on your visa. However, you must: seek our written approval under Travel Condition 8570 before you travel not enter your home country or use your home country passport to travel get a travel document from the Australian Passport Office of the Department of Foreign Affairs and Trade (DFAT) check that your DFAT travel document allows you to enter the country you want to visit update your travel document details with us if you get a new travel document ensure that your visa is in effect for the entire time you are outside Australia. If you are overseas and your SHEV expires, you will not be able to return to Australia or apply for another SHEV or TPV. You should not use the passport or travel document issued to you by your country of nationality. If you do so, we may consider that you no longer need Australia's protection and we may cancel your visa. TPV and SHEV holders are eligible to apply for a travel document issued by the Department of Foreign Affairs and Trade (DFAT). Contact any Australian Passport Office in DFAT to apply for a Convention Travel Document or a Certificate of Identity Obtain our written approval to travel overseas before leaving Under Visa condition 8570 (Restricted Travel) you can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given you written approval to travel before you leave Australia. If you travel overseas without our written approval, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit) while you are offshore. If you enter the country from which we granted you protection, even for a short time, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit). Before you travel, complete Form 1454 Request for approval to travel under condition 8570 and email it to travel.request@homeaffairs.gov.au . You must have compassionate or compelling circumstances justifying your travel. Consular assistance may not be available while overseas We would normally facilitate re-entry to Australia for visa holders who have valid travel documents issued by the Australian Passport Office, such as a Convention Travel Document (also known as a Titre de Voyage). If you travel overseas, with or without obtaining approval to travel, you do so at your own risk. Consular assistance is only available to Australian citizens, and only to permanent residents in crisis situations. At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate",
  "main_content": "===== main placeholder ==========================================\nSubclass 790\n\n# Safe Haven Enterprise visa\n\nSafe Haven Enterprise visa\n\nThis visa is for people who arrived in Australia without a visa, and want to seek asylum. It lets you stay in Australia temporarily if you engage Australia's protection obligations and meet all other requirements for the grant of the visa.\n\nThis visa is for people who arrived in Australia without a visa, and want to seek asylum. It lets you stay in Australia temporarily if you engage Australia's protection obligations and meet all other requirements for the grant of the visa.\n\nThis visa is for people who arrived in Australia without a visa, and want to seek asylum. It lets you stay in Australia temporarily if you engage Australia's protection obligations and meet all other requirements for the grant of the visa.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\n5 years\n\n5 years\n\n#### Cost\n\nCost\n\n#### Processing times\n\nProcessing times\n\nProcessing times for this visa are unavailable.\n\nProcessing times for this visa are unavailable.\n\n#### With this visa, you can\n\nWith this visa, you can\n- stay in Australia temporarily for 5 years\nstay in Australia temporarily for 5 years\n- work and study\nwork and study\n- access government services such asCentrelink\naccess government services such as\nCentrelink\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- engageAustralia’s protection obligations(or be a member of the same family unit of someone who does)\nengage\nAustralia’s protection obligations\n(or be a member of the same family unit of someone who does)\n- meet all other visa requirements, such as health, character, identity and security\nmeet all other visa requirements, such as health, character, identity and security\n- sign a declaration on the application form that you intend to work or study in regional Australia\nsign a declaration on the application form that you intend to work or study in regional Australia\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\nWith this visa, you can\nHow long you can stay\nStay longer\nApply from\nIncluding family members\nProcessing times\nYour obligations\nTravel\nVisa label\nWithdraw your application\n\n## With this visa, you can\n\nWith this visa, you can\n- live, work and study in Australia temporarily for 5 years\nlive, work and study in Australia temporarily for 5 years\n- access government services such asWorkforce Australia,MedicareandCentrelinkservices\naccess government services such as\nWorkforce Australia\n,\nMedicare\nand\nCentrelink\nservices\n- access short-term counselling for torture and trauma when required\naccess short-term counselling for torture and trauma when required\n- attendEnglish language classes for freeif you are eligible\nattend\nEnglish language classes for free\nif you are eligible\n- travel overseas to countries other than your home country if you obtain ourwritten approvalto travel due to compassionate or compelling circumstances\ntravel overseas to countries other than your home country if you obtain our\nwritten approval\nto travel due to compassionate or compelling circumstances\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa. It lets you stay in Australia for 5 years.\n\nThis is a temporary visa. It lets you stay in Australia for 5 years.\n\n## Stay longer\n\nStay longer\n\nIf we grant you this visa on or after 14 February 2023, you must apply forsubsequent Safe Haven Enterprise visa (SHEV) or a Temporary Protection visa (TPV)before your current SHEV expires, if you still need Australia's protection and are not subject to any application bars.\n\nIf we grant you this visa on or after 14 February 2023, you must apply for\nsubsequent Safe Haven Enterprise visa (SHEV) or a Temporary Protection visa (TPV)\nbefore your current SHEV expires, if you still need Australia's protection and are not subject to any application bars.\n\nSHEV and TPV holders and former holders who arrived in Australia before 14 February 2023 may be eligible to apply for a permanentResolution of Status (RoS) visa (subclass 851).\n\nSHEV and TPV holders and former holders who arrived in Australia before 14 February 2023 may be eligible to apply for a permanent\nResolution of Status (RoS) visa (subclass 851)\n.\n\n## Apply from\n\nApply from\n\nYou, and any members of your family unit included in your application, must be in Australia when you apply for this visa.\n\nYou, and any members of your family unit included in your application, must be in Australia when you apply for this visa.\n\n## Including family members\n\nIncluding family members\n\nMembers of the same family unit may apply together on the same application. They must:\n\nMembers of the same family unit may apply together on the same application. They must:\n- be in Australia at the time of application\nbe in Australia at the time of application\n- be eligible to apply for this visa\nbe eligible to apply for this visa\n\nMembers of the same family unit are:\n\nMembers of the same family unit are:\n- spouseorde factopartner of the family head\nspouse\nor\nde facto\npartner of the family head\n- dependent child or step-child of the family head\ndependent child or step-child of the family head\n- dependent child or step-child of the family head’s partner\ndependent child or step-child of the family head’s partner\n- other dependent relatives of the family head\nother dependent relatives of the family head\n\nThe family head can be you. It can also be someone else in your family who has not applied for this visa.\n\nThe family head can be you. It can also be someone else in your family who has not applied for this visa.\n\nAdependent childis a child or step-child who is under 18 years old. A dependent child can be 18 years old or older if they are:\n\nA\ndependent child\nis a child or step-child who is under 18 years old. A dependent child can be 18 years old or older if they are:\n- incapacitated for work due to loss of their bodily or mental functions; or\nincapacitated for work due to loss of their bodily or mental functions; or\n- wholly or substantially reliant on their parent or step-parent for financial, psychological or physical support\nwholly or substantially reliant on their parent or step-parent for financial, psychological or physical support\n\nA child or step-child of any age is not considered to be a dependent child if they are currently married, engaged to be married or in a de facto relationship.\n\nA child or step-child of any age is not considered to be a dependent child if they are currently married, engaged to be married or in a de facto relationship.\n\nChildren who are not dependent children must apply for their own visa.\n\nChildren who are not dependent children must apply for their own visa.\n\nOtherdependent relativesmay include relatives such as the family head’s:\n\nOther\ndependent relatives\nmay include relatives such as the family head’s:\n- parent\nparent\n- brother/sister\nbrother/sister\n- grandparent/grandchild\ngrandparent/grandchild\n- aunt/uncle\naunt/uncle\n- cousin\ncousin\n- niece/nephew\nniece/nephew\n- or step equivalent to any of the above\nor step equivalent to any of the above\n\nA relative will be considered a dependent relative of the family head if they:\n\nA relative will be considered a dependent relative of the family head if they:\n- do not have a spouse or de facto partner\ndo not have a spouse or de facto partner\n- usually lives with the family head; and\nusually lives with the family head; and\n- are wholly or substantially reliant on the family head for financial, psychological or physical support\nare wholly or substantially reliant on the family head for financial, psychological or physical support\n\nMembers of the same family unit applying for this visa must meet ourhealth,characterand security requirements.\n\nMembers of the same family unit applying for this visa must meet our\nhealth\n,\ncharacter\nand security requirements.\n\n### Newborn child\n\nNewborn child\n\nIf a child is born after you submit your application and before we make a decision on your application, the child will be taken to be included in that application. You must tell us as soon as possible by:\n\nIf a child is born after you submit your application and before we make a decision on your application, the child will be taken to be included in that application. You must tell us as soon as possible by:\n- completingForm 1022 Notification of change of circumstances\ncompleting\nForm 1022 Notification of change of circumstances\n- providing a clear colour copy of their original birth certificate\nproviding a clear colour copy of their original birth certificate\n- attaching them in ImmiAccount or sending them by post to the address where you sent your application (you will need to send acertified copyof the child’s birth certificate if you send it by post)\nattaching them in ImmiAccount or sending them by post to the address where you sent your application (you will need to send a\ncertified copy\nof the child’s birth certificate if you send it by post)\n\nIf your child is born in Australia, they are automatically granted the same visas their parents hold at the time of the child’s birth.\n\nIf your child is born in Australia, they are automatically granted the same visas their parents hold at the time of the child’s birth.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth See therequirements for evidence of Australian citizenship.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth See the\nrequirements for evidence of Australian citizenship\n.\n\n## Processing times\n\nProcessing times\n\nWe aim to finalise SHEV applications as quickly as possible. This is a very complex process and will take some time. You can help by responding to any of our requests in the specified timeframes.\n\nWe aim to finalise SHEV applications as quickly as possible. This is a very complex process and will take some time. You can help by responding to any of our requests in the specified timeframes.\n\nYour application can take longer to process if:\n\nYour application can take longer to process if:\n- you do not fill in your application correctly\nyou do not fill in your application correctly\n- you do not include all the documents we need\nyou do not include all the documents we need\n- we need more information from you\nwe need more information from you\n- you do not respond to requests for information quickly\nyou do not respond to requests for information quickly\n- it takes us time to verify your information\nit takes us time to verify your information\n\n### Review rights\n\nReview rights\n\nIf your SHEV application is refused, you can apply for merits review by theAdministrative Review Tribunal (ART).\n\nIf your SHEV application is refused, you can apply for merits review by the\nAdministrative Review Tribunal (ART)\n.\n\nIf we refuse your SHEV application, your refusal letter will provide further information about your review rights, including timeframes to apply for review.\n\nIf we refuse your SHEV application, your refusal letter will provide further information about your review rights, including timeframes to apply for review.\n\n## Your obligations\n\nYour obligations\n\nYou and the members of your same family unit included in your application must meet all visa conditions and obey Australian laws.\n\nYou and the members of your same family unit included in your application must meet all visa conditions and obey Australian laws.\n\nSeewhich conditions apply to this visa\n\nSee\nwhich conditions apply to this visa\n\n## Travel\n\nTravel\n\n### Waiting for your SHEV application to be decided\n\nWaiting for your SHEV application to be decided\n\nIf you leave Australia before we decide your SHEV application, your bridging visa will expire and you will not be allowed to re-enter Australia.\n\nIf you leave Australia before we decide your SHEV application, your bridging visa will expire and you will not be allowed to re-enter Australia.\n\n### If you hold a SHEV\n\nIf you hold a SHEV\n\nIf we have granted you a SHEV, visa condition 8570 (Restricted travel) applies to your visa.\n\nIf we have granted you a SHEV, visa condition 8570 (Restricted travel) applies to your visa.\n\n#### Visa condition 8570 (Restricted travel)\n\nVisa condition 8570 (Restricted travel)\n\nVisa condition 8570 (Restricted travel)restricts your right to travel. You can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given youwritten approvalto travel before you leave Australia.\n\nVisa condition 8570 (Restricted travel)\nrestricts your right to travel. You can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given you\nwritten approval\nto travel before you leave Australia.\n\nIf you travel overseas without the Department’s written approval, you will breach visa condition 8570, and we may cancel your visa (and the visas of members of your family unit) while you are offshore.\n\nIf you travel overseas without the Department’s written approval, you will breach visa condition 8570, and we may cancel your visa (and the visas of members of your family unit) while you are offshore.\n\nFor more information, seeLeaving Australia.\n\nFor more information, see\nLeaving Australia\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your travel document orImmiCard. You will not get a label in your travel document.\n\nWe will digitally link your visa to your travel document or\nImmiCard\n. You will not get a label in your travel document.\n\n## Withdraw your application\n\nWithdraw your application\n\nIf you hold a bridging visa and withdraw your SHEV application before we make a decision, you may be prevented from applying for a SHEV or a Temporary Protection visa, and your bridging visa will expire 35 days after you withdraw your application.\n\nIf you hold a bridging visa and withdraw your SHEV application before we make a decision, you may be prevented from applying for a SHEV or a Temporary Protection visa, and your bridging visa will expire 35 days after you withdraw your application.\n\nYou may withdraw your SHEV application in writing at any time before we make our decision.\n\nYou may withdraw your SHEV application in writing at any time before we make our decision.\n\nYour request must include:\n\nYour request must include:\n- your full name\nyour full name\n- date of birth\ndate of birth\n- details of the application you are withdrawing\ndetails of the application you are withdrawing\n\nAny additional applicants who are 18 years of age or older must sign the letter of withdrawal or send a separate email or letter withdrawing their application.\n\nAny additional applicants who are 18 years of age or older must sign the letter of withdrawal or send a separate email or letter withdrawing their application.\nEligibility\n\n## Arrived in Australia illegally\n\nArrived in Australia illegally\nDetails\n\nIf you entered Australia without a valid visa or were not immigration cleared on arrival, you may only be eligible to apply for a Temporary Protection visa (TPV) or a Safe Haven Enterprise visa (SHEV). You cannot apply for a permanent Protection visa (subclass 866).\n\nIf you entered Australia without a valid visa or were not immigration cleared on arrival, you may only be eligible to apply for a Temporary Protection visa (TPV) or a Safe Haven Enterprise visa (SHEV). You cannot apply for a permanent Protection visa (subclass 866).\n\nTo apply for a Safe Haven Enterprise visa, you must:\n\nTo apply for a Safe Haven Enterprise visa, you must:\n- be unable to make a valid application for a permanent Protection visa (subclass 866) and\nbe unable to make a valid application for a permanent Protection visa (subclass 866) and\n- be an unauthorised maritime arrival, or\nbe an unauthorised maritime arrival, or\n- have not beenimmigration clearedat Australia's border when you last entered Australia, or\nhave not been\nimmigration cleared\nat Australia's border when you last entered Australia, or\n- have entered Australia without a valid visa, or\nhave entered Australia without a valid visa, or\n- hold or have held one of the following visas:Temporary Protection visa (subclass 785)Temporary Safe Haven visa (subclass 449)Temporary (Humanitarian Concern) visa (subclass 786), orSafe Haven Enterprise visa (subclass 790)\nhold or have held one of the following visas:\n- Temporary Protection visa (subclass 785)\nTemporary Protection visa (subclass 785)\n- Temporary Safe Haven visa (subclass 449)\nTemporary Safe Haven visa (subclass 449)\n- Temporary (Humanitarian Concern) visa (subclass 786), or\nTemporary (Humanitarian Concern) visa (subclass 786), or\n- Safe Haven Enterprise visa (subclass 790)\nSafe Haven Enterprise visa (subclass 790)\n\n## Be a refugee or satisfy Australia’s complementary protection criteria\n\nBe a refugee or satisfy Australia’s complementary protection criteria\nDetails\n\nAs defined by theMigration Act 1958(Migration Act) you must:\n\nAs defined by the\nMigration Act 1958\n(Migration Act) you must:\n- be a refugee or\nbe a refugee or\n- meet the complementary protection criteria\nmeet the complementary protection criteria\n\nAustralia must not return people to their home country where there is a risk that the person may suffer harm because they engageAustralia's protection obligations.\n\nAustralia must not return people to their home country where there is a risk that the person may suffer harm because they engage\nAustralia's protection obligations\n.\n\n## Meet our identity requirements\n\nMeet our identity requirements\nDetails\n\nYou may be required to provide documents asevidence of your identity, nationality or citizenshipwith your application. It is your responsibility to cooperate and provide this evidence so we can complete identity checks.\n\nYou may be required to provide documents as\nevidence of your identity, nationality or citizenship\nwith your application. It is your responsibility to cooperate and provide this evidence so we can complete identity checks.\n\nWe may ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before.\n\nWe may ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before.\n\nWe will use the information collected about your identity when assessing your claims for protection and completing character and security checks.\n\nWe will use the information collected about your identity when assessing your claims for protection and completing character and security checks.\n\n## Not be barred from lodging a SHEV application\n\nNot be barred from lodging a SHEV application\nDetails\n\nYou may not be able to make a valid Safe Haven Enterprise (SHEV) visa application if you:\n\nYou may not be able to make a valid Safe Haven Enterprise (SHEV) visa application if you:\n- are an unauthorised maritime arrival, or\nare an unauthorised maritime arrival, or\n- were immigration cleared when you arrived in Australia, or\nwere immigration cleared when you arrived in Australia, or\n- have been refused a protection visa since your last arrival to Australia, or\nhave been refused a protection visa since your last arrival to Australia, or\n- have had a protection visa cancelled since your last arrival to Australia, or\nhave had a protection visa cancelled since your last arrival to Australia, or\n- hold or held a Humanitarian Stay (Temporary)(subclass 449) visa since last entering Australia, or\nhold or held a Humanitarian Stay (Temporary)(subclass 449) visa since last entering Australia, or\n- are a transitory person\nare a transitory person\n\nThe Minister has the power to lift any application bar if it is determined to be in the public interest, and may have already lifted any relevant application bar(s) in your case.\n\nThe Minister has the power to lift any application bar if it is determined to be in the public interest, and may have already lifted any relevant application bar(s) in your case.\n\nWe will let you know if an application bar affects your SHEV application.\n\nWe will let you know if an application bar affects your SHEV application.\n\n## Meet our security requirements\n\nMeet our security requirements\n\nAs part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a SHEV.\n\nAs part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a SHEV.\n\n## Meet our health requirement\n\nMeet our health requirement\nDetails\n\nYou must undergohealth examinations. This will protect your health and the health of the Australian community.\n\nYou must undergo\nhealth examinations\n. This will protect your health and the health of the Australian community.\n\nThese examinations are conducted byBupa Medical Visa Services.\n\nThese examinations are conducted by\nBupa Medical Visa Services\n.\n\nYou will receive a health identifier (HAP ID) and information about how to arrange yourhealth examinationsafter you have lodged your visa application.\n\nYou will receive a health identifier (HAP ID) and information about how to arrange your\nhealth examinations\nafter you have lodged your visa application.\n\n## Meet our character requirement\n\nMeet our character requirement\n\nYou must meet certaincharacter requirements.\n\nYou must meet certain\ncharacter requirements\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\n\nIf you are 18 years of age or older, you must:\n\nIf you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australia bookletand\nhave read, or had explained to you, the\nLife in Australia booklet\nand\n- confirm you will respect the Australian way of life and obey Australian laws when you sign or accept theAustralian Values Statement.\nconfirm you will respect the Australian way of life and obey Australian laws when you sign or accept the\nAustralian Values Statement\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck that you are eligible. You can then:\n\nCheck that you are eligible. You can then:\n- prepare and submit your application yourself,or\nprepare and submit your application yourself,\nor\n- getsomeone to act on your behalf.\nget\nsomeone to act on your behalf\n.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly certain people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly certain people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou need to provide documents to support your application for this visa. We can make a decision on your application using the information you provide when you lodge your application.\n\nYou need to provide documents to support your application for this visa. We can make a decision on your application using the information you provide when you lodge your application.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens if youdon't provide true information.\n\nProvide accurate information. See what happens if you\ndon't provide true information\n.\n\nIt is in your interest to provide as much information as possible in your application. You should ensure that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application.\n\nIt is in your interest to provide as much information as possible in your application. You should ensure that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application.\n\n#### Important documents\n\nImportant documents\n\nYou can find a list of documents that must be included with your application in the online application form inImmiAccount.\n\nYou can find a list of documents that must be included with your application in the online application form in\nImmiAccount\n.\n\nYou must provide all relevant documents to pay the visa application charge when you apply. SeeHow to pay.\n\nYou must provide all relevant documents to pay the visa application charge when you apply. See\nHow to pay\n.\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nYou must provide colour scans or photos of original and translated documents ofidentity, nationality and citizenshipsuch as:\n\nYou must provide colour scans or photos of original and translated documents of\nidentity, nationality and citizenship\nsuch as:\n- all pages of current or expired passports (including biodata page)\nall pages of current or expired passports (including biodata page)\n- birth certificate\nbirth certificate\n- national identity card\nnational identity card\n- driver's licence\ndriver's licence\n- proof of change of name, if applicable\nproof of change of name, if applicable\n- any other documents that support your identity, nationality or citizenship.\nany other documents that support your identity, nationality or citizenship.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\n\nIf you can't provide these documents, provide a statement with your application to explain why you have no travel or identity documents.\n\nIf you can't provide these documents, provide a statement with your application to explain why you have no travel or identity documents.\nSee how\n\n#### Claims for protection\n\nClaims for protection\n\nYou must answer all the questions on the application form about your claims for protection. If you do not have enough space, submit additional information and attach it to the application.\n\nYou must answer all the questions on the application form about your claims for protection. If you do not have enough space, submit additional information and attach it to the application.\n\nWhen preparing your claims for protection, the form will ask you to provide all the details about why you are seeking protection. You must provide, wherever possible, documentation to support your claims. You will need to address the following questions:\n\nWhen preparing your claims for protection, the form will ask you to provide all the details about why you are seeking protection. You must provide, wherever possible, documentation to support your claims. You will need to address the following questions:\n- What country are you seeking protection from?\nWhat country are you seeking protection from?\n- Why did you leave that country?\nWhy did you leave that country?\n- Why are you unable to return to that country?\nWhy are you unable to return to that country?\n- Have you experienced harm in that country? If so, what is the harm you have experienced?\nHave you experienced harm in that country? If so, what is the harm you have experienced?\n- Who caused the harm to you?\nWho caused the harm to you?\n- What do you fear might happen to you if you return to that country?\nWhat do you fear might happen to you if you return to that country?\n- Why do you think this will happen to you if you return?\nWhy do you think this will happen to you if you return?\n- Is there an area in that country where you would not be harmed? Would you be able to relocate there?\nIs there an area in that country where you would not be harmed? Would you be able to relocate there?\n- Are the authorities in your country able to protect you?\nAre the authorities in your country able to protect you?\n- When did you leave your home country?\nWhen did you leave your home country?\n- How did you get to Australia?\nHow did you get to Australia?\n\nWe will use this information to assess whether you engageAustralia's protection obligations.\n\nWe will use this information to assess whether you engage\nAustralia's protection obligations\n.\nSee how\n\n#### Evidence and supporting documents\n\nEvidence and supporting documents\n\nYou should provide with your application any documents or evidence that you think will support your claims for protection. You should attach all relevant documents to your ImmiAccount.\n\nYou should provide with your application any documents or evidence that you think will support your claims for protection. You should attach all relevant documents to your ImmiAccount.\n\n#### Relationship documents\n\nRelationship documents\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships\nSee how\n\n#### Character documents\n\nCharacter documents\n\nProvide military service records or discharge papers if you or any other person included in the application served in the armed forces of any country.\n\nProvide military service records or discharge papers if you or any other person included in the application served in the armed forces of any country.\n\nYou must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age (other than a country from which you are claiming protection).\n\nYou must provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age (other than a country from which you are claiming protection).\n\nDo not arrange for police certificates until we ask you.\n\nDo not arrange for police certificates until we ask you.\nSee how\n\n#### Visas or residence permits\n\nVisas or residence permits\n\nProvide a copy of any visas or residence permits you and each person included in the application hold.\n\nProvide a copy of any visas or residence permits you and each person included in the application hold.\n\n#### Family members included in your application\n\nFamily members included in your application\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant)\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant)\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\n\nYou must apply for this visa by submitting an online application in ImmiAccount.\n\nYou must apply for this visa by submitting an online application in ImmiAccount.\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\n#### For online applications\n\nFor online applications\n\nYou do not need to have any documents certified.\n\nYou do not need to have any documents certified.\nSee how\n\n#### Scan or photograph all documents\n\nScan or photograph all documents\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photographs must be clear.\n\nThe scans and photographs must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\n\nEnsure you save photographs under the name of the person in the photograph. Clearly label all other files in English.\n\nEnsure you save photographs under the name of the person in the photograph. Clearly label all other files in English.\nSee how\n\n#### Attach\n\nAttach\n\nAttach:\n\nAttach:\n- colour scans or photos of original and translated documents, if you can\ncolour scans or photos of original and translated documents, if you can\n- as much information as possible to help us decide on your application\nas much information as possible to help us decide on your application\n- each document only once, even if you are using it to show more than one thing.\neach document only once, even if you are using it to show more than one thing.\n\nLearn more aboutattaching documents.\n\nLearn more about\nattaching documents\n.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\nShow\n                    steps\n\n#### Completing your application\n\nCompleting your application\n\nYou must tell the truth in your application. If you provide incorrect information on purpose, we may question your credibility and we might refuse your application for a SHEV.\n\nYou must tell the truth in your application. If you provide incorrect information on purpose, we may question your credibility and we might refuse your application for a SHEV.\n\nIt is important that you include all details about your claims for protection and youridentity, nationality and citizenship. It is also important that you provide supporting documentation relating to protection claims and your identity and nationality or citizenship.\n\nIt is important that you include all details about your claims for protection and your\nidentity, nationality and citizenship\n. It is also important that you provide supporting documentation relating to protection claims and your identity and nationality or citizenship.\n\nThe form asks for information about your education, work, travel, relationship and address history. Make sure you include all information, so that there are no gaps in the timelines. For example, if you were unemployed for a period, put this on the form to explain the gap between your jobs.\n\nThe form asks for information about your education, work, travel, relationship and address history. Make sure you include all information, so that there are no gaps in the timelines. For example, if you were unemployed for a period, put this on the form to explain the gap between your jobs.\n\nIf a migration agent completes your application form, you must read and understand all the information that is included in the form before signing it and before signing any statutory declaration you make. You are responsible for any claims made in the form. It is very important that you do not sign blank pages or documents even if you are asked to do so.\n\nIf a migration agent completes your application form, you must read and understand all the information that is included in the form before signing it and before signing any statutory declaration you make. You are responsible for any claims made in the form. It is very important that you do not sign blank pages or documents even if you are asked to do so.\nSee how\n\n#### Apply online in ImmiAccount\n\nApply online in ImmiAccount\n\nProtection visa applications must be lodged online through ImmiAccount. When you lodge online you can:\n\nProtection visa applications must be lodged online through ImmiAccount. When you lodge online you can:\n- check the status of your application\ncheck the status of your application\n- continue a saved application\ncontinue a saved application\n- attach documents to an application\nattach documents to an application\n- update personal details\nupdate personal details\n- access a copy of your application at any time\naccess a copy of your application at any time\n\nTo apply online, follow these steps:\n\nTo apply online, follow these steps:\n1. Log in or create anImmiAccount\nLog in or create an\nImmiAccount\n2. Attach documents\nAttach documents\n3. Pay the application fee. We will not process your application until you pay the fee.Note:If you are in immigration detention when you apply for this visa and have not been immigration cleared, you do not have to pay the application fee.\nPay the application fee\n. We will not process your application until you pay the fee.\nNote:\nIf you are in immigration detention when you apply for this visa and have not been immigration cleared, you do not have to pay the application fee.\n4. Keep a record of your Transaction Reference Number (TRN).\nKeep a record of your Transaction Reference Number (TRN).\n\nThe online form will guide you to answer the questions we need from you.\n\nThe online form will guide you to answer the questions we need from you.\n\nIt has help text if you need support. When you finish your online application, you will come to a page that will prompt you to attach documents and make payment online. You can save your application at any page and go back to it when you are ready.\n\nIt has help text if you need support. When you finish your online application, you will come to a page that will prompt you to attach documents and make payment online. You can save your application at any page and go back to it when you are ready.\n\nOnce you have submitted your application online, you will be able to check the status of your application through ImmiAccount.\n\nOnce you have submitted your application online, you will be able to check the status of your application through ImmiAccount.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application. For help and support for technical issues with ImmiAccount refer totechnical help.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application. For help and support for technical issues with ImmiAccount refer to\ntechnical help\n.\nSee how\n\n#### Communicating by email\n\nCommunicating by email\n\nThe online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post.\n\nThe online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post.\n\nIf you have already applied and you want us to communicate with you by email but you did not select this option when completing your application, completeForm 1193 Communicating by email with the Department.\n\nIf you have already applied and you want us to communicate with you by email but you did not select this option when completing your application, complete\nForm 1193 Communicating by email with the Department\n.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application by sending you an acknowledgement letter.\n\nWe will let you know when we have received your application by sending you an acknowledgement letter.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe can’t give updates on applications.\n\nWe can’t give updates on applications.\n\nYou can check if we need more information from you inImmiAccount.\n\nYou can check if we need more information from you in\nImmiAccount\n.\n\n#### Stay lawful\n\nStay lawful\n\nWe may grant you a bridging visa that allows you to stay lawfully in Australia while we process your Safe Haven Enterprise visa (subclass 790) application.\n\nWe may grant you a bridging visa that allows you to stay lawfully in Australia while we process your Safe Haven Enterprise visa (subclass 790) application.\n\nThe type of bridging visa we may grant you and whether you can work in Australia while holding this visa depends on a number of factors.\n\nThe type of bridging visa we may grant you and whether you can work in Australia while holding this visa depends on a number of factors.\n\n#### Travel after you apply\n\nTravel after you apply\n\nIf you leave Australia before we grant you a SHEV, your bridging visa will expire and you will not be allowed to re-enter Australia unless you hold another valid visa.\n\nIf you leave Australia before we grant you a SHEV, your bridging visa will expire and you will not be allowed to re-enter Australia unless you hold another valid visa.\n\n#### Health examinations\n\nHealth examinations\n\nWe will let you know when you need to arrange your health examinations. You will receive a health identifier (HAP ID) and information about how to arrange yourhealth examinations.\n\nWe will let you know when you need to arrange your health examinations. You will receive a health identifier (HAP ID) and information about how to arrange your\nhealth examinations\n.\n\n#### Biometrics\n\nBiometrics\n\nWe may ask you to provide biometrics for you or any members of the same family unit included in your application.\n\nWe may ask you to provide biometrics for you or any members of the same family unit included in your application.\n\nWe may not ask you to provide biometrics again if you have already provided them to us.\n\nWe may not ask you to provide biometrics again if you have already provided them to us.\n\nWe will take a digital photograph of your face and a scan of your fingerprints.\n\nWe will take a digital photograph of your face and a scan of your fingerprints.\n\nIf you do not let us collect this information:\n\nIf you do not let us collect this information:\n- your application will be invalid and we cannot consider it\nyour application will be invalid and we cannot consider it\n- if we grant you a bridging visa when you apply, it will end 35 days after you are notified that your application is invalid. You will then become unlawful.\nif we grant you a bridging visa when you apply, it will end 35 days after you are notified that your application is invalid. You will then become unlawful.\n\nSee more information about how we collectbiometrics.\n\nSee more information about how we collect\nbiometrics\n.\nSee how\n\n#### Waivers for photographs and fingerprints\n\nWaivers for photographs and fingerprints\n\nWaivers can apply in exceptional circumstances and we will consider as required.\n\nWaivers can apply in exceptional circumstances and we will consider as required.\n\n#### If you are younger than 18 years of age or an incapable person\n\nIf you are younger than 18 years of age or an incapable person\n\nIf you are younger than 18 years of age, you will need a parent, guardian or other adult (such as a relative or friend), either to give their permission for us to take your photograph or your fingerprints, or to be present while we take them.\n\nIf you are younger than 18 years of age, you will need a parent, guardian or other adult (such as a relative or friend), either to give their permission for us to take your photograph or your fingerprints, or to be present while we take them.\n\nWe will not take fingerprints of people who are:\n\nWe will not take fingerprints of people who are:\n- younger than 10 years of age\nyounger than 10 years of age\n- incapable\nincapable\n- physically unable (because you may have missing fingers or a medical or physical condition that doesn't allow us to collect your fingerprints accurately).\nphysically unable (because you may have missing fingers or a medical or physical condition that doesn't allow us to collect your fingerprints accurately).\n\nWe will not take facial images of minors who are younger than 5 years of age.\n\nWe will not take facial images of minors who are younger than 5 years of age.\n\nAn incapable person is someone who is not able to understand why they need to provide their photograph or fingerprints. This includes people who have an intellectual disability.\n\nAn incapable person is someone who is not able to understand why they need to provide their photograph or fingerprints. This includes people who have an intellectual disability.\nSee how\n\n#### Attend an interview if we request it\n\nAttend an interview if we request it\n\nWe will contact you if we require you to attend an interview. The interview is to discuss your protection visa application. It is also an opportunity for you to clarify the claims in your application.\n\nWe will contact you if we require you to attend an interview. The interview is to discuss your protection visa application. It is also an opportunity for you to clarify the claims in your application.\n\nHowever, we may make our decision on the information provided in your visa application and you may not get another opportunity to present these claims. That is why it is important that you provide all claims, supporting documentation and evidence when you submit your application.\n\nHowever, we may make our decision on the information provided in your visa application and you may not get another opportunity to present these claims. That is why it is important that you provide all claims, supporting documentation and evidence when you submit your application.\n\nWe conduct most protection visa interviews via videoconference. If we invite you to attend an interview, you will be provided with instructions on how to join the videoconference. If we conduct the interview in person, we will provide details of the relevant office.\n\nWe conduct most protection visa interviews via videoconference. If we invite you to attend an interview, you will be provided with instructions on how to join the videoconference. If we conduct the interview in person, we will provide details of the relevant office.\n\nAt interview you need to give us all the information we need to make a decision about your visa application.\n\nAt interview you need to give us all the information we need to make a decision about your visa application.\n\nWe might ask you about:\n\nWe might ask you about:\n- your situation, including why you are applying for a protection visa\nyour situation, including why you are applying for a protection visa\n- your family\nyour family\n- information you provided in your application.\ninformation you provided in your application.\n\nYou must make every reasonable effort to attend your scheduled interview. Let us know as soon as possible if there are any reasons why you can’t attend your interview. We may consider if it is possible to reschedule it.\n\nYou must make every reasonable effort to attend your scheduled interview. Let us know as soon as possible if there are any reasons why you can’t attend your interview. We may consider if it is possible to reschedule it.\n\nIf you do not attend your scheduled interview, we can decide your protection visa application on the information available at the time.\n\nIf you do not attend your scheduled interview, we can decide your protection visa application on the information available at the time.\nSee how\n\n#### Submitting further information before interview\n\nSubmitting further information before interview\n\nIt is important that you provide all claims, supporting documentation and evidence when you submit your application. You can provide more information about your claims or your application before we make our decision. An officer may decide on your application with no further contact.\n\nIt is important that you provide all claims, supporting documentation and evidence when you submit your application. You can provide more information about your claims or your application before we make our decision. An officer may decide on your application with no further contact.\n\nIf you want to provide more information before your interview, submit itat least 5 working days beforethe interview viaImmiAccount.\n\nIf you want to provide more information before your interview, submit it\nat least 5 working days before\nthe interview via\nImmiAccount\n.\n\nIf you submit information less than 5 working days before the interview, we will still consider it. The officer may need more time for this, and your interview may not proceed as advised. The officer may cancel the interview and seek more information from you in writing.\n\nIf you submit information less than 5 working days before the interview, we will still consider it. The officer may need more time for this, and your interview may not proceed as advised. The officer may cancel the interview and seek more information from you in writing.\nSee how\n\n#### Documents you need to have at interview\n\nDocuments you need to have at interview\n\nPlease bring the following documents to the interview:\n\nPlease bring the following documents to the interview:\n- your ‘request to attend interview’ letter, if your interview is at the departmental office\nyour ‘request to attend interview’ letter, if your interview is at the departmental office\n- all your original identity documents. These may include: passport, national identity card, birth certificate and/or your driver’s licence\nall your original identity documents. These may include: passport, national identity card, birth certificate and/or your driver’s licence\n- any other proof to support your protection claims\nany other proof to support your protection claims\n- your religious book, if you are going to make an oath during the interview. If you make an affirmation instead of an oath, you do not need a religious book.\nyour religious book, if you are going to make an oath during the interview. If you make an affirmation instead of an oath, you do not need a religious book.\n\nBring English translations of all documents. Translations must be certified by a translator accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nBring English translations of all documents. Translations must be certified by a translator accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\nSee how\n\n#### Who can attend with you\n\nWho can attend with you\n\nAn officer from the Department will attend the interview. Your migration agent or representative can attend the interview, if you have one.\n\nAn officer from the Department will attend the interview. Your migration agent or representative can attend the interview, if you have one.\n\nIf you need an interpreter, we will provide one. The interpreter is not allowed to disclose anything they hear during the interview. They can only assist with language interpretation. They are not involved in the decision made on your application.\n\nIf you need an interpreter, we will provide one. The interpreter is not allowed to disclose anything they hear during the interview. They can only assist with language interpretation. They are not involved in the decision made on your application.\n\nYou may be able to bring a support person, such as a friend or relative, to the interview. At least 2 working days before the interview, contact the officer on your 'request to attend interview' letter to ask for permission. This person should provide photograph identification to prove their identity.\n\nYou may be able to bring a support person, such as a friend or relative, to the interview. At least 2 working days before the interview, contact the officer on your 'request to attend interview' letter to ask for permission. This person should provide photograph identification to prove their identity.\n\nYou should make childcare arrangements for your children while you attend the interview, as this will allow you to speak with our officer uninterrupted.\n\nYou should make childcare arrangements for your children while you attend the interview, as this will allow you to speak with our officer uninterrupted.\nSee how\n\n#### During the interview\n\nDuring the interview\n\nYou should be ready 15 minutes before your scheduled interview. We will give you information explainingAustralia's protection obligations.\n\nYou should be ready 15 minutes before your scheduled interview. We will give you information explaining\nAustralia's protection obligations\n.\n\nInterviews are audio-recorded. Our officer will discuss this with you. They will ask your permission to record the interview as an accurate record of the discussion. We will keep the recording confidential. The officer making the decision will consider the recording, along with all other information you have provided.\n\nInterviews are audio-recorded. Our officer will discuss this with you. They will ask your permission to record the interview as an accurate record of the discussion. We will keep the recording confidential. The officer making the decision will consider the recording, along with all other information you have provided.\n\nThePrivacy Act 1988 protectsyour personal information, including the information you provide at the interview. Before your interview you should read the information inForm 1442i - Privacy notice.\n\nThe\nPrivacy Act 1988 protects\nyour personal information, including the information you provide at the interview. Before your interview you should read the information in\nForm 1442i - Privacy notice\n.\n\nAt the interview, the interviewing officer will:\n\nAt the interview, the interviewing officer will:\n- check your documents. These may include proof of your identity, nationality and citizenship or country of residence\ncheck your documents. These may include proof of your identity, nationality and citizenship or country of residence\n- ask you to make an oath or affirmation that the information you provide is true\nask you to make an oath or affirmation that the information you provide is true\n- ask you questions about your claims for protection, identity and other information you have provided.\nask you questions about your claims for protection, identity and other information you have provided.\n\nIt is important that you tell the truth during the protection visa process. You must give us clear and complete answers, and explain all of the reasons why you are seeking protection in Australia. You must give enough evidence to establish your protection claims. At the interview, you can change any information you have given before.\n\nIt is important that you tell the truth during the protection visa process. You must give us clear and complete answers, and explain all of the reasons why you are seeking protection in Australia. You must give enough evidence to establish your protection claims. At the interview, you can change any information you have given before.\n\nGiving false or misleading information is a serious offence in Australian law. You may be subject to criminal penalties and we may refuse your application.\n\nGiving false or misleading information is a serious offence in Australian law. You may be subject to criminal penalties and we may refuse your application.\nSee how\n\n#### Provide more information\n\nProvide more information\n\nYou can provide more relevant information to us, in writing, at any time until we make a decision on your application.\n\nYou can provide more relevant information to us, in writing, at any time until we make a decision on your application.\n\nIf you did not provide all relevant documents when you applied, attach them as soon as possible inImmiAccount.\n\nIf you did not provide all relevant documents when you applied, attach them as soon as possible in\nImmiAccount\n.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf we receive information from another person that could result in the refusal of your visa, we will give you the opportunity to comment on the information.\n\nIf we receive information from another person that could result in the refusal of your visa, we will give you the opportunity to comment on the information.\nSee how\n\n#### Add family members to your application\n\nAdd family members to your application\n\nYou can add members of your same family unit to your application at any time before we decide it. The members of your family unit will also have to be in Australia when they apply.\n\nYou can add members of your same family unit to your application at any time before we decide it. The members of your family unit will also have to be in Australia when they apply.\n\nIf you want to add family members after you submit your application, you can only add:\n\nIf you want to add family members after you submit your application, you can only add:\n- spouse or de facto partner of someone who has already applied for the visa\nspouse or de facto partner of someone who has already applied for the visa\n- dependent child of someone who has already applied for the visa.\ndependent child of someone who has already applied for the visa.\n\nYou can only add them after you submit your application if:\n\nYou can only add them after you submit your application if:\n- they are in Australia\nthey are in Australia\n- they are eligible to apply for this visa\nthey are eligible to apply for this visa\n- we have not yet decided your application.\nwe have not yet decided your application.\n\nTo add a family member, completeForm 1436 Adding an additional applicant after lodgementand attach this form and evidence of relationship documents to ImmiAccount.\n\nTo add a family member, complete\nForm 1436 Adding an additional applicant after lodgement\nand attach this form and evidence of relationship documents to ImmiAccount.\nSee how\n\n#### Evidentiary requirements\n\nEvidentiary requirements\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant).\n\nProvide any documents/evidence to support the relationship between each person in the application (e.g. birth certificates, notarial certificates, marriage certificates, financial documents and undertakings for de facto relationships, financial documents to evidence that dependants over the age of 18 are dependent on you, and any other evidence to support relationships between each applicant).\nSee how\n\n#### Newborn child\n\nNewborn child\n\nIf a child is born after you submit your application and before we make a decision, the child will be taken to be included in that application, unless they are an Australian citizen at birth. You must tell us of the child's birth as soon as possible by:\n\nIf a child is born after you submit your application and before we make a decision, the child will be taken to be included in that application, unless they are an Australian citizen at birth. You must tell us of the child's birth as soon as possible by:\n- completingForm 1022 Notification of change of circumstances\ncompleting\nForm 1022 Notification of change of circumstances\n- providing the child's birth certificate (colour photo or scan)\nproviding the child's birth certificate (colour photo or scan)\n- attaching both documents in ImmiAccount.\nattaching both documents in ImmiAccount.\n\nIf your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth.\n\nIf your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child may be an Australian citizen by birth.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answersand upload it toImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers\nand upload it to\nImmiAccount\n.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence, completeForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence, complete\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration advice, completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration advice, complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your name, phone number, email, address or passport\nchanges to your name, phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- you are pregnant or you become pregnant\nyou are pregnant or you become pregnant\n- the birth of a child\nthe birth of a child\n- a death in your family\na death in your family\n- you want to withdraw your application\nyou want to withdraw your application\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\nSee how\n\n#### Get support\n\nGet support\n\nIf you have submitted a valid application, in limited circumstances you might be able to get financial or other assistance from theStatus Resolution Support Services (SRSS) program.\n\nIf you have submitted a valid application, in limited circumstances you might be able to get financial or other assistance from the\nStatus Resolution Support Services (SRSS) program\n.\n\n#### Enrol in Medicare service centre\n\nEnrol in Medicare service centre\n\nTo access public healthcare, enrol in Medicare. Take your 'acknowledgement of visa application' letter and supporting documents to aMedicare Service centre.\n\nTo access public healthcare, enrol in Medicare. Take your 'acknowledgement of visa application' letter and supporting documents to a\nMedicare Service centre\n.\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know our decision on your visa application in writing.\n\nWe will let you know our decision on your visa application in writing.\nShow\n                    steps\n\n#### If we grant your visa\n\nIf we grant your visa\n\nIf we grant your visa, we will send you a visa grant notification letter. Your letter will tell you:\n\nIf we grant your visa, we will send you a visa grant notification letter. Your letter will tell you:\n- your visa grant number\nyour visa grant number\n- your visa grant date and expiry date\nyour visa grant date and expiry date\n- your visa conditions\nyour visa conditions\n- information about a range of topics includingtravel outside of Australiavisa conditionsapplying for a subsequent SHEV or TPVnotice of application bar lift (for unauthorised maritime arrivals)Australian working conditionsyour entitlements to government servicesImmiCardTranslating and Interpreting Service(TIS).\ninformation about a range of topics including\n- travel outside of Australia\ntravel outside of Australia\n- visa conditions\nvisa conditions\n- applying for a subsequent SHEV or TPV\napplying for a subsequent SHEV or TPV\n- notice of application bar lift (for unauthorised maritime arrivals)\nnotice of application bar lift (for unauthorised maritime arrivals)\n- Australian working conditions\nAustralian working conditions\n- your entitlements to government services\nyour entitlements to government services\n- ImmiCard\nImmiCard\n- Translating and Interpreting Service(TIS).\nTranslating and Interpreting Service\n(TIS).\n\nYou should keep a copy of this letter in a safe place.\n\nYou should keep a copy of this letter in a safe place.\nSee how\n\n#### If we refuse your visa\n\nIf we refuse your visa\n\nIf we refuse your visa, we will send you a refusal notification letter. Your letter will tell you:\n\nIf we refuse your visa, we will send you a refusal notification letter. Your letter will tell you:\n- why we refused the visa\nwhy we refused the visa\n- yourreview right with the Administrative Review Tribunal (ART), including timeframes to apply for review.\nyour\nreview right with the Administrative Review Tribunal (ART)\n, including timeframes to apply for review.\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\n\nIf your Safe Haven Enterprise visa application has beenfinally determined, and you do notengage Australia's protection obligationsand you do not hold another visa, you do not have a lawful right to stay in Australia.\n\nIf your Safe Haven Enterprise visa application has been\nfinally determined\n, and you do not\nengage Australia's protection obligations\nand you do not hold another visa, you do not have a lawful right to stay in Australia.\n\nYou will need to return to your home country or to another country where you have right of entry.\n\nYou will need to return to your home country or to another country where you have right of entry.\n\nIf you become unlawful in Australia and do not depart voluntarily, we will take steps to remove you from Australia.\n\nIf you become unlawful in Australia and do not depart voluntarily, we will take steps to remove you from Australia.\n\nIf we refuse your SHEV application or cancel your SHEV after we have granted it, and you have exhausted all appeal rights, you can ask theMinister for Home Affairs to intervene in your case. The Minister does not have to consider your request.\n\nIf we refuse your SHEV application or cancel your SHEV after we have granted it, and you have exhausted all appeal rights, you can ask the\nMinister for Home Affairs to intervene in your case\n. The Minister does not have to consider your request.\nSee how\nWhen you have this visa\nWhen you have this visa\nGet support\nLeaving Australia\n\n## When you have this visa\n\nWhen you have this visa\n\nYou can:\n\nYou can:\n- live, work and study in Australia temporarily for 5 years\nlive, work and study in Australia temporarily for 5 years\n- access government services such asWorkforce Australia,CentrelinkandMedicareand short-term counselling for torture and trauma when required\naccess government services such as\nWorkforce Australia\n,\nCentrelink\nand\nMedicare\nand short-term counselling for torture and trauma when required\n- travel overseas to countries other than your home country if we give you written approval to travel on compassionate or compelling grounds\ntravel overseas to countries other than your home country if we give you written approval to travel on compassionate or compelling grounds\n- attendEnglish language classes for freeif you are eligible\nattend\nEnglish language classes for free\nif you are eligible\n\nYour visa will come with conditions attached to it. To see your conditions useVEVO.\n\nYour visa will come with conditions attached to it. To see your conditions use\nVEVO\n.\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about when you have this visa:\n\nThings you need to let us know about when you have this visa:\n- changes to your name, phone number, email, address or passport\nchanges to your name, phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- death in your family\ndeath in your family\n\nSee what to doif your situation changes.\n\nSee what to do\nif your situation changes\n.\n\n### Visa details\n\nVisa details\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### ImmiCard\n\nImmiCard\n\nYou and your eligible family members can obtain anImmiCard.\n\nYou and your eligible family members can obtain an\nImmiCard\n.\n\nAn ImmiCard is an official, secure immigration credential that contains a photograph and personal details such as family name, given names, date of birth and gender.\n\nAn ImmiCard is an official, secure immigration credential that contains a photograph and personal details such as family name, given names, date of birth and gender.\n\nImmiCards also have a unique number that is linked to biometric and visa details in our system.\n\nImmiCards also have a unique number that is linked to biometric and visa details in our system.\n\n### Working on your visa\n\nWorking on your visa\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\nYou are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nYou are protected by Australian workplace law. See your\nworkplace rights and entitlements.\n\n### Bringing family\n\nBringing family\n\nYou can't sponsor family members for a visa through the Australian Humanitarian or Family Migration Programs while you hold a Safe Haven Enterprise visa.\n\nYou can't sponsor family members for a visa through the Australian Humanitarian or Family Migration Programs while you hold a Safe Haven Enterprise visa.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nYou are not eligible to apply for Australian citizenship while you hold a Safe Haven Enterprise visa.\n\nYou are not eligible to apply for Australian citizenship while you hold a Safe Haven Enterprise visa.\n\n### Applying for a subsequent SHEV or TPV\n\nApplying for a subsequent SHEV or TPV\n\nSHEVs are temporary visas and cease 5 years after date of grant.\n\nSHEVs are temporary visas and cease 5 years after date of grant.\n\nIf you are a SHEV holder and you arrived in Australia on or after 14 February 2023, you must apply for a subsequent TPV or SHEV before your current SHEV expires in order to stay in Australia and remain lawful, if you still need Australia's protection.\n\nIf you are a SHEV holder and you arrived in Australia on or after 14 February 2023, you must apply for a subsequent TPV or SHEV before your current SHEV expires in order to stay in Australia and remain lawful, if you still need Australia's protection.\n\nIf you currently hold or formerly held a TPV or SHEV and you arrived in Australia before 14 February 2023 you may be eligible to apply for a permanentResolution of Status (subclass 851) visainstead of a subsequent TPV or SHEV.\n\nIf you currently hold or formerly held a TPV or SHEV and you arrived in Australia before 14 February 2023 you may be eligible to apply for a permanent\nResolution of Status (subclass 851) visa\ninstead of a subsequent TPV or SHEV.\n\nMake sure you keep your contact details with the Department updated so that you receive the bar lift notice. For more information, see:Your personal details have changed.\n\nMake sure you keep your contact details with the Department updated so that you receive the bar lift notice. For more information, see:\nYour personal details have changed\n.\n\nYou must apply after we notify you and before your visa expires, or you will become unlawful and be barred from applying for a subsequent visa.\n\nYou must apply after we notify you and before your visa expires, or you will become unlawful and be barred from applying for a subsequent visa.\n\nIf you make a valid application for either a subsequent SHEV, TPV or a Resolution of Status visa while you still hold your SHEV, your SHEV will remain in effect until we make a decision on your application:\n\nIf you make a valid application for either a subsequent SHEV, TPV or a Resolution of Status visa while you still hold your SHEV, your SHEV will remain in effect until we make a decision on your application:\n- Your work and study rights will continue while you wait for a decision on your subsequent application\nYour work and study rights will continue while you wait for a decision on your subsequent application\n- Your eligibility for Medicare and Centrelink will continue, but you will need to renew your Medicare card.\nYour eligibility for Medicare and Centrelink will continue, but you will need to renew your Medicare card.\n\n### Update your contact details\n\nUpdate your contact details\n\nMake sure that you give us your current contact details, so you can receive the bar lift letter and the mobile and email reminders. It is your responsibility as a visa holder to let us know within 28 days if you change your address and to keep your contact details up to date.\n\nMake sure that you give us your current contact details, so you can receive the bar lift letter and the mobile and email reminders. It is your responsibility as a visa holder to let us know within 28 days if you change your address and to keep your contact details up to date.\n\nSee how you can let us knowyour personal details have changed.\n\nSee how you can let us know\nyour personal details have changed\n.\n\nAfter bar lift notification, we recommend you apply for a subsequent visa at least 3 months before your current SHEV ceases.\n\nAfter bar lift notification, we recommend you apply for a subsequent visa at least 3 months before your current SHEV ceases.\n\nTo see when your visa expires, useVEVO.\n\nTo see when your visa expires, use\nVEVO\n.\n\n### If your visa has expired\n\nIf your visa has expired\n\nTo see if your SHEV has expired already, use VEVO.\n\nTo see if your SHEV has expired already, use VEVO.\n\nIf your SHEV has already expired, and you have not applied for a subsequent SHEV or TPV, you:\n\nIf your SHEV has already expired, and you have not applied for a subsequent SHEV or TPV, you:\n- are unlawful and must make arrangements todepart Australia\nare unlawful and must make arrangements to\ndepart Australia\n- may be barred from re-applying for a SHEV or TPV\nmay be barred from re-applying for a SHEV or TPV\n\nIf your SHEV has already expired and you are unlawful, seeMy visa is about to expire or has expiredor contact the Status Resolution Service by calling 1300 853 773.\n\nIf your SHEV has already expired and you are unlawful, see\nMy visa is about to expire or has expired\nor contact the Status Resolution Service by calling 1300 853 773.\n\nIf you need interpreting assistance, call 131 450.\n\nIf you need interpreting assistance, call 131 450.\n\n## Get support\n\nGet support\n\n#### Australian Government services\n\nAustralian Government services\n\nYou may be able to access a range of services offered by the Australian Government such asWorkforce Australia,Centrelink,Medicareand short-term counselling for torture or trauma where required. Services Australia delivers a range of social and health-related payments and services.\n\nYou may be able to access a range of services offered by the Australian Government such as\nWorkforce Australia\n,\nCentrelink\n,\nMedicare\nand short-term counselling for torture or trauma where required. Services Australia delivers a range of social and health-related payments and services.\n\nFor more information about the range of services that may be available to you and your eligibility to access them go toServices Australia.\n\nFor more information about the range of services that may be available to you and your eligibility to access them go to\nServices Australia\n.\n\n#### Unaccompanied Humanitarian Minor program\n\nUnaccompanied Humanitarian Minor program\n\nIf you are an unaccompanied humanitarian minor, you can get support through the Unaccompanied Humanitarian Minors program.\n\nIf you are an unaccompanied humanitarian minor, you can get support through the Unaccompanied Humanitarian Minors program.\n\n#### Australian Taxation Office\n\nAustralian Taxation Office\n\nTo receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to theAustralian Taxation Office.\n\nTo receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to the\nAustralian Taxation Office\n.\n\n#### Information pack on domestic and family violence, sexual assault and forced marriage\n\nInformation pack on domestic and family violence, sexual assault and forced marriage\n\nThe Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage.The family safety packalso includes important information about essential services and emergency contacts in Australia.\n\nThe Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage.\nThe family safety pack\nalso includes important information about essential services and emergency contacts in Australia.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nCheck your visa travel facility inVEVO.\n\nCheck your visa travel facility in\nVEVO\n.\n\nAs a SHEV holder, you can travel overseas on your visa. However, you must:\n\nAs a SHEV holder, you can travel overseas on your visa. However, you must:\n- seek ourwritten approvalunder Travel Condition 8570 before you travel\nseek our\nwritten approval\nunder Travel Condition 8570 before you travel\n- not enter your home country or use your home country passport to travel\nnot enter your home country or use your home country passport to travel\n- get atravel document from the Australian Passport Officeof the Department of Foreign Affairs and Trade (DFAT)\nget a\ntravel document from the Australian Passport Office\nof the Department of Foreign Affairs and Trade (DFAT)\n- check that your DFAT travel document allows you to enter the country you want to visit\ncheck that your DFAT travel document allows you to enter the country you want to visit\n- update your travel document details with us if you get a new travel document\nupdate your travel document details with us if you get a new travel document\n- ensure that your visa is in effect for the entire time you are outside Australia. If you are overseas and your SHEV expires, you will not be able to return to Australia or apply for another SHEV or TPV.\nensure that your visa is in effect for the entire time you are outside Australia. If you are overseas and your SHEV expires, you will not be able to return to Australia or apply for another SHEV or TPV.\n\nYou should not use the passport or travel document issued to you by your country of nationality. If you do so, we may consider that you no longer need Australia's protection and we may cancel your visa.\n\nYou should not use the passport or travel document issued to you by your country of nationality. If you do so, we may consider that you no longer need Australia's protection and we may cancel your visa.\n\nTPV and SHEV holders are eligible to apply for a travel document issued by the Department of Foreign Affairs and Trade (DFAT).\n\nTPV and SHEV holders are eligible to apply for a travel document issued by the Department of Foreign Affairs and Trade (DFAT).\n\nContact any Australian Passport Office in DFAT toapply for a Convention Travel Document or a Certificate of Identity.\n\nContact any Australian Passport Office in DFAT to\napply for a Convention Travel Document or a Certificate of Identity\n.\n\n#### Obtain our written approval to travel overseas before leaving\n\nObtain our written approval to travel overseas before leaving\n\nUnder Visa condition8570(Restricted Travel) you can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given youwritten approvalto travel before you leave Australia.\n\nUnder Visa condition\n8570\n(Restricted Travel) you can't travel to your home country under any circumstances and you can only enter any other country if you have compassionate or compelling reasons for travel and we have given you\nwritten approval\nto travel before you leave Australia.\n\nIf you travel overseas without our written approval, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit) while you are offshore.\n\nIf you travel overseas without our written approval, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit) while you are offshore.\n\nIf you enter the country from which we granted you protection, even for a short time, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit).\n\nIf you enter the country from which we granted you protection, even for a short time, you will breach visa condition 8570. As a result, we may cancel your visa (and the visas of members of your same family unit).\n\nBefore you travel, completeForm 1454 Request for approval to travel under condition 8570and email it totravel.request@homeaffairs.gov.au. You must have compassionate or compelling circumstances justifying your travel.\n\nBefore you travel, complete\nForm 1454 Request for approval to travel under condition 8570\nand email it to\ntravel.request@homeaffairs.gov.au\n. You must have compassionate or compelling circumstances justifying your travel.\n\n#### Consular assistance may not be available while overseas\n\nConsular assistance may not be available while overseas\n\nWe would normally facilitate re-entry to Australia for visa holders who have valid travel documents issued by the Australian Passport Office, such as a Convention Travel Document (also known as a Titre de Voyage).\n\nWe would normally facilitate re-entry to Australia for visa holders who have valid travel documents issued by the Australian Passport Office, such as a Convention Travel Document (also known as a Titre de Voyage).\n\nIf you travel overseas, with or without obtaining approval to travel, you do so at your own risk. Consular assistance is only available to Australian citizens, and only to permanent residents in crisis situations.\n\nIf you travel overseas, with or without obtaining approval to travel, you do so at your own risk. Consular assistance is only available to Australian citizens, and only to permanent residents in crisis situations.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use\nSmartGate\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/protection-866/australias-protection-obligations",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-protection-785#When",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790/identity-requirements",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/safe-haven-enterprise-790#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:17:59.459063",
  "metadata": {}
}