{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times",
  "title": "Visa processing timesVisa processing times",
  "raw_text": "===== main placeholder ========================================== Page Image Visa processing times Visa processing times Overview Processing times guide Visa processing priorities - Family visa processing priorities - Parent visas queue release dates - Other family visas queue release dates - Skilled visa processing priorities - Student visa processing priorities Quarterly report Overview Processing times guide Visa processing priorities Quarterly report Published Page Content We aim to improve processing times while maintaining program integrity. Variations in processing times Processing times vary for many reasons, including: If applications have all necessary supporting documents. If applications are lodged online or as a paper applications – applying online helps streamline processing. How quickly responses for further information are provided. How long it takes to receive information from external agencies, particularly relating to health, character and national security requirements. For permanent visa applications, the number of places available in the migration program. The complexity of a visa application. The number of visa applications increases or decreases. Changes to Ministerial Directions. Deciding older applications increases processing times. Median processing times for key programs The information below shows the median visa processing times for key visa categories. This is the most accurate way to show the amount of time it is taking most visa applications to be finalised. Visa processing times vary between different visas within these categories, and in some cases it may take longer for those visas to be finalised. Processing Times by visa category (median) Permanent Visa Program Visa Category October 2025 Comments Skilled (Permanent) 13 Months We are focusing on reducing processing times for all permanent visas. As we are deciding both new and older existing applications, processing times may change each month. This may continue as we progress the oldest applications in the Permanent Visa Program. Partner (Provisional/Temporary) 16 Months We are focusing on reducing processing times for all Partner visas, with a particular focus on deciding older and complex applications. This will affect overall processing times which may change each month. This may continue as we progress the oldest applications in the Partner Visa Program. Temporary Visa Program Visa Category October 2025 Comments Skilled (Temporary) 123 Days We are focused on reducing processing times for all skilled (temporary) visas. Incomplete applications, where we need to request further information, delays the processing of applications. For tips on lodging a complete application, see Sponsored skilled visa tips and Check twice, submit once . Where possible, we also encourage the simultaneous lodgement of nomination and visa applications which results in more efficient processing. We are also focussed on deciding older and complex applications. This focus will affect the overall monthly program processing time. Student 41 Days Student visa applications lodged outside Australia are processed in accordance with a Ministerial Direction. Applications lodged before 14 November 2025 are processed according to Ministerial Direction 111 (10MB PDF) , and applications lodged on or after 14 November 2025 are processed according to Ministerial Direction 115 (851KB PDF) . For more information see Student visa processing priorities . We recommend applications be lodged well in advance of course commencement and with all supporting documentation. Visitor Less than 1 Day This median processing time is inclusive of subclasses 600, 601 and 651. For more information on subclass specific processing times, please visit the processing times guide at Global visa processing times Working Holiday Maker Less than 1 Day N/A How to view processing times If you have made a visa application you can check processing times information using the visa processing times guide Information on processing times for visas is updated regularly as new data is available. Processing times are available for most visas, except: visas that are closed to new applications family visas that are capped and queued visas that have too few decisions in the month to provide a reliable indicator of processing times. To help us process applications as quickly as possible submit all necessary supporting documents at the time of applying.",
  "main_content": "===== main placeholder ==========================================\nPage Image\n\n# Visa processing timesVisa processing times\n\nVisa processing times\nVisa processing times\nOverview\nProcessing times guide\nVisa processing priorities\n- Family visa processing priorities\n- Parent visas queue release dates\n- Other family visas queue release dates\n- Skilled visa processing priorities\n- Student visa processing priorities\nQuarterly report\n- Overview\nOverview\n- Processing times guide\nProcessing times guide\n- Visa processing priorities\nVisa processing priorities\n- Quarterly report\nQuarterly report\nPublished\nPage Content\n\nWe aim to improve processing times while maintaining program integrity.\n\nWe aim to improve processing times while maintaining program integrity.\n\n## Variations in processing times\n\nVariations in processing times\n\nProcessing times vary for many reasons, including:\n\nProcessing times vary for many reasons, including:\n- If applications have all necessary supporting documents.\nIf applications have all necessary supporting documents.\n- If applications are lodged online or as a paper applications – applying online helps streamline processing.\nIf applications are lodged online or as a paper applications – applying online helps streamline processing.\n- How quickly responses for further information are provided.\nHow quickly responses for further information are provided.\n- How long it takes to receive information from external agencies, particularly relating to health, character and national security requirements.\nHow long it takes to receive information from external agencies, particularly relating to health, character and national security requirements.\n- For permanent visa applications, the number of places available in the migration program.\nFor permanent visa applications, the number of places available in the migration program.\n- The complexity of a visa application.\nThe complexity of a visa application.\n- The number of visa applications increases or decreases.\nThe number of visa applications increases or decreases.\n- Changes to Ministerial Directions.\nChanges to Ministerial Directions.\n- Deciding older applications increases processing times.\nDeciding older applications increases processing times.\n\n## Median processing times for key programs\n\nMedian processing times for key programs\n\nThe information below shows the median visa processing times for key visa categories. This is the most accurate way to show the amount of time it is taking most visa applications to be finalised.\n\nThe information below shows the median visa processing times for key visa categories. This is the most accurate way to show the amount of time it is taking most visa applications to be finalised.\n\nVisa processing times vary between different visas within these categories, and in some cases it may take longer for those visas to be finalised.\n\nVisa processing times vary between different visas within these categories, and in some cases it may take longer for those visas to be finalised.\n\nProcessing Times by visa category (median)\n\nProcessing Times by visa category (median)\n\n### Permanent Visa Program\n\nPermanent Visa Program\n\nVisa Category | October 2025 | Comments\nSkilled (Permanent) | 13 Months | We are focusing on reducing processing times for all permanent visas. As we are deciding both new and older existing applications, processing times may change each month. This may continue as we progress the oldest applications in the Permanent Visa Program.\nPartner (Provisional/Temporary) | 16 Months | We are focusing on reducing processing times for all Partner visas, with a particular focus on deciding older and complex applications.  This will affect overall processing times which may change each month. This may continue as we progress the oldest applications in the Partner Visa Program.\n\nVisa Category\nOctober 2025\nComments\nSkilled (Permanent)\n13 Months\nWe are focusing on reducing processing times for all permanent visas. As we are deciding both new and older existing applications, processing times may change each month. This may continue as we progress the oldest applications in the Permanent Visa Program.\nPartner (Provisional/Temporary)\n16 Months\nWe are focusing on reducing processing times for all Partner visas, with a particular focus on deciding older and complex applications.  This will affect overall processing times which may change each month. This may continue as we progress the oldest applications in the Partner Visa Program.\n\n### Temporary Visa Program\n\nTemporary Visa Program\n\nVisa Category | October 2025 | Comments\nSkilled (Temporary) | 123 Days | We are focused on reducing processing times for all skilled (temporary) visas. Incomplete applications, where we need to request further information, delays the processing of applications. For tips on lodging a complete application, seeSponsored skilled visa tipsandCheck twice, submit once. Where possible, we also encourage the simultaneous lodgement of nomination and visa applications which results in more efficient processing. We are also focussed on deciding older and complex applications. This focus will affect the overall monthly program processing time.\nStudent | 41 Days | Student visa  applications lodged outside Australia are processed in accordance with a Ministerial Direction.  Applications lodged before 14 November 2025 are processed according toMinisterial  Direction 111 (10MB PDF), and applications lodged on or after 14 November 2025 are  processed according toMinisterial Direction 115 (851KB PDF). For more information seeStudent visa processing priorities. We recommend applications be lodged well in advance of course commencement and with all supporting  documentation.\nVisitor | Less than 1 Day | This median processing time is inclusive of subclasses 600, 601 and 651. For more information on subclass specific processing times, please visit the processing times guide atGlobal visa processing times.\nWorking Holiday Maker | Less than 1 Day | N/A\n\nVisa Category\nOctober 2025\nComments\nSkilled (Temporary)\n123 Days\nWe are focused on reducing processing times for all skilled (temporary) visas. Incomplete applications, where we need to request further information, delays the processing of applications. For tips on lodging a complete application, see\nSponsored skilled visa tips\nand\nCheck twice, submit once\n. Where possible, we also encourage the simultaneous lodgement of nomination and visa applications which results in more efficient processing. We are also focussed on deciding older and complex applications. This focus will affect the overall monthly program processing time.\nStudent\n41 Days\nStudent visa  applications lodged outside Australia are processed in accordance with a Ministerial Direction.  Applications lodged before 14 November 2025 are processed according to\nMinisterial  Direction 111 (10MB PDF)\n, and applications lodged on or after 14 November 2025 are  processed according to\nMinisterial Direction 115 (851KB PDF)\n. For more information see\nStudent visa processing priorities\n. We recommend applications be lodged well in advance of course commencement and with all supporting  documentation.\nVisitor\nLess than 1 Day\nThis median processing time is inclusive of subclasses 600, 601 and 651. For more information on subclass specific processing times, please visit the processing times guide at\nGlobal visa processing times\n.\nWorking Holiday Maker\nLess than 1 Day\nN/A\n\n## How to view processing times\n\nHow to view processing times\n\nIf you have made a visa application you can check processing times information using the visaprocessing times guide.\n\nIf you have made a visa application you can check processing times information using the visa\nprocessing times guide\n.\n\nInformation on processing times for visas is updated regularly as new data is available.\n\nInformation on processing times for visas is updated regularly as new data is available.\n\nProcessing times are available for most visas, except:\n\nProcessing times are available for most visas, except:\n- visas that are closed to new applications\nvisas that are closed to new applications\n- family visas that arecapped and queued\nfamily visas that are\ncapped and queued\n- visas that have too few decisions in the month to provide a reliable indicator of processing times.\nvisas that have too few decisions in the month to provide a reliable indicator of processing times.\n\nTo help us process applications as quickly as possible submit all necessary supporting documents at the time of applying.\n\nTo help us process applications as quickly as possible submit all necessary supporting documents at the time of applying.\n​",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-finder",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/fees-and-charges",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/overview",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/global-visa-processing-times",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/visa-processing-priorities",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/quarterly-report",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/visa-processing-priorities/student-visa",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times/family-visa-processing-priorities/parent-visas-queue-release-dates",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T14:59:13.533436",
  "metadata": {}
}