{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115",
  "title": "Remaining Relative visa",
  "raw_text": "===== main placeholder ========================================== Subclass 115 Remaining Relative visa This permanent visa lets people move to Australia to be with their only close family members. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview From 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Stay Permanently Cost From AUD5,280.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. For more information, see Other Family Visa Queue With this visa you can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor your relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible if eligible, apply for Australian citizenship See all conditions Check your eligibility You must be outside Australia when you apply for this visa and when we decide your application be a remaining relative of an Australian citizen or Permanent resident or an Eligible New Zealand citizen have an eligible sponsor. Help with your visa If you are getting help with your visa, before you pay someone, read information on who can help with your visa application Process About this visa From 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications With this visa you can How long you can stay Include family Cost Apply from Processing times Your obligations Visa label With this visa you can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor your relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible if eligible, apply for Australian citizenship Newly arrived residents may have to wait before they can access certain Australian Government payments and benefits. Travel to and from Australia for 5 years You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires. If you want to travel after the initial 5-year travel validity: you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when your travel validity ends, use VEVO How long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. For citizenship purposes, you become a permanent resident at the time: you enter Australia on this visa; or if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa Include family You can include members of the family unit in your application when you apply. You an also add them to your application at any time before we make a decision. You should include details of all your family members, whether they are migrating or not, in the application form. Family members who apply for the visa with you must meet our health and character requirements. Family members who are not coming to Australia might also have to meet our health and character requirements. Newborn child Find out what to do if your child is born after you apply Cost This visa costs from AUD5,280.00 There is an additional charge for each family member who applies with you. You pay for this visa in 2 parts, called instalments. Pay the first instalment when you apply and the second instalment when we ask you to. You might also have to pay other costs for health checks, police certificates and biometrics To work out what your visa will cost use the Visa Pricing Estimator . The estimator does not take into account the second instalment or other costs. See more about visa fees and charges Apply from You must be outside Australia when you apply and when we decide your application. Processing times The demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy. For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application might take longer to process if: you do not fill it in correctly you do not include all the documents we need or we need more information from you and/or your information takes longer than usual to verify. We can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. Applications for this visa are subject to capping and queueing Learn more about the Other Family Visa queues and processing priorities The Reports on Migration Programs have further information on Migration Program outcomes against planning for each migration program year. Your obligations You must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant. You and your family members must meet all visa conditions and obey Australian laws. See what conditions might be attached to this visa on our visa conditions page Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility From 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Have a sponsor Details You must be sponsored by an eligible parent or step-parent, sibling or step-sibling, or an eligible partner of your relative. We must approve the sponsorship. Not have other near relatives Details We will not grant you this visa if: you or your partner have a near relative who usually live outside Australia, or you or your partner have a near relative who live in Australia on a temporary visa (and are not an Eligible New Zealand citizen ) or unlawfully. Temporary visas include bridging visas. Have assurance of support Details You must be able to obtain an assurance of support. An assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa. The assurance is for you and any family members who come to Australia with you on this visa. We will let you know when you need to provide the assurance of support. Learn more about assurances of support Meet the health requirement Details You and any family members who apply for the visa with you must meet our health requirement We might also ask that other family members also meet the requirement Meet the character requirement Details You and family members who apply for the visa with you must meet our character requirement We might ask that other non-migrating family members meet the requirement Have paid back your debt to the Australian Government Details If you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement to pay it back. Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Sign the Australian values statement Details If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia booklet sign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws Best interests of the child Details We will not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step From 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Step 1 Before you apply Check your passport. If you need help with your application, get someone to act on your behalf. Show steps Check your passport You don't have to have a valid passport to apply but you must provide details of your most recent passport. However, we will only grant the visa if you have a valid passport. Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide documents to support your application. You will also need your sponsor documents. Show steps Provide accurate documents Provide accurate information. See what happens if you cannot prove your identity or do not provide true information Identity documents We need proof of your identity. If you cannot prove your identity: we will refuse your visa application we might not grant you another visa for 10 years we might not grant any family members you listed on your application a visa for 10 years Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Sponsor documents Your migration must be sponsored by your eligible relative or relative's eligible partner. The sponsor must be: aged 18 years or older and a settled Australian citizen, Australian permanent resident, or eligible New Zealand citizen Your sponsor must complete Form 40 Sponsorship for migration to Australia (469KB PDF) To prove your relationship with your sponsor, you will need to give us: birth certificate marriage certificates death certificates adoption certificates family status certificates or family books if officially issued and maintained To prove that your sponsor is an eligible citizen or permanent resident, give us: citizenship certificate passport valid visa (for eligible New Zealand citizens) See how Character documents We might ask you for character documents, including police certificates. Do not arrange for police certificates until we ask you to. Learn more about police certificates See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Dependants under 18 documents For every dependant under 18 years old who is applying with you, provide: identity documents proof of your relationship with them, like a birth or marriage certificate character documents, if applicable See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to visit Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable If the child is not staying with a relative or legal guardian, provide Form 1257 Undertaking declaration (211KB PDF) . The person they are staying with must sign the form. See how Dependants 18 or older To be included in your visa application as a dependent child, your child must be: under 18 years, or over 18 years of age but not yet turned 23, and dependent on you or your partner, or over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner For every dependant 18 years old or older who is applying with you, provide: identity documents documents about their other relationships, if applicable character documents proof of dependency See how Proof of dependency You need to prove that this person is dependent on you. Provide: a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of your relationship with the dependent such as a birth certificate or adoption papers You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide: proof they live with you their tax records proof they are currently studying Usually, your child or stepchild must be under 23 years old to be included in your application. However, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation. See how Partner documents Provide: identity documents character documents documents about other relationships, if applicable Provide either: your current marriage certificate or enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply Documents that prove your de facto relationship include: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify Do not certify police certificates. You need to send us the originals. Have all other documents certified copy . This includes: non-English documents English translations See how Keep Keep a copy of your completed application. Send Send us: original police certificates certified copies of all other documents as much information as possible to help us decide your application each document only once, even if you are using to show more than one thing all documents with your application, if you can Step 3 Apply for the visa You must apply for the visa on paper. You must be outside Australia when you apply. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply on paper Complete Form 47OF Application for migration to Australia (615KB PDF) Your sponsor must complete: Form 40 Sponsorship for migration to Australia (469KB PDF) Complete the form in English. You can’t pay for this visa in person. You must pay the first instalment when you apply. Pay for the application before it is submitted using the online portal payment function in ImmiAccount . Include evidence the application is paid for with your application. For other payment options see how to pay You can't submit this application in person. Send the application by post or courier to the Parent, Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application. If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After you apply We will let you know when we have received your application and documents. See what you can and must do after you apply. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 25 June 2020. See how Status updates We can't provide you with updates on your application's progress within normal processing times. There may be other things you need to know and might have to do. See how Travel Do not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa. See how Health exams We will let you know if you need health examinations See how Biometrics We might ask for biometrics (fingerprints and photo). We will let you know if you need to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount. If you can’t use ImmiAccount or you lodged the application outside of Australia before 25 June 2020 to provide any additional documents attach them to a completed Other Family Visa Processing Centre online form See how Stay lawful If you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. You must be outside Australia when we make a decision on your application. See how Pay the second instalment Pay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa. You must pay the instalment or we can't grant the visa. See how Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centre online form See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centre online form For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw the application if you have experienced domestic or family violence see Family violence provisions See how to tell us if your situation changes See how Assurance of support You need to provide an assurance of support when we ask you to. Learn more about assurances of support See how Step 5 Visa outcome You must be outside Australia when we decide on your application. We will let you know our decision in writing. We will let you know: your visa grant number the date your visa starts your visa conditions Keep a copy of our decision. If we refuse your visa we will let you know in writing. We will tell you: why we refused the visa whether you have a right to a review of the decision We will not refund the application fee if we refuse your application. When you have this visa From 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Coming to Australia In Australia Leaving Australia Coming to Australia Before you travel Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document. Arrive before first entry arrival date You must enter Australia before the date specified in your grant letter. If your visa is still valid and the date specified in your visa grant letter has passed or will pass before you can travel to Australia, you must ensure that: you plan to travel to Australia within the next 12 months you submit the travel facilitation letter request form We may then send you a travel facilitation letter. This will state that we allow you to enter Australia after the first entry arrival date of your visa. We will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date. At the border Complete an Incoming Passenger Card All people arriving into Australia must complete the Incoming Passenger Card Using the SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport using the SmartGate In Australia What you must do when you have this visa You and your family members must meet all visa conditions and obey Australian laws. You can check visa details and conditions in VEVO Tell us if things change See what to do if your situation changes What you can do on your visa Check your visa conditions and expiry. Check your Resident Return visa expiry, visa conditions, work and study entitlements in VEVO See how long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. For citizenship purposes, you become a permanent resident at the time: you enter Australia on this visa; or if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa To see your specific conditions, work and study entitlements use VEVO Access Australian Government benefits As a newly arrived resident, you may have to wait before you are able to access certain Australian Government payments and benefits. Learn more about newly arrived residents’ waiting period from Services Australia Travelling on your visa You can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires. If you want to travel after the initial 5-year travel validity: you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when your travel validity ends, use VEVO Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO You can request your international movement records by completing the Request for international movement records form Working With this visa you become a permanent resident. You are protected by Australian workplace law. See your workplace rights and entitlements Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, you become a permanent resident at particular time: when you enter Australia on this visa; or if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia—when we grant this visa Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your visa is still valid See what to do if your visa has expired or is about to expire At the border Departures SmartGate We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Proving you have been to Australia To prove you have been to Australia, request your international movement records by completing the Request for international movement records form",
  "main_content": "===== main placeholder ==========================================\nSubclass 115\n\n# Remaining Relative visa\n\nRemaining Relative visa\n\nThis permanent visa lets people move to Australia to be with their only close family members.\n\nThis permanent visa lets people move to Australia to be with their only close family members.\n\nThis permanent visa lets people move to Australia to be with their only close family members.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD5,280.00\n\nFromAUD5,280.00\n\nFrom\nAUD5,280.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor more information, seeOther Family Visa Queue\n\nFor more information, see\nOther Family Visa Queue\n\n#### With this visa you can\n\nWith this visa you can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare.\nenrol in Australia's public healthcare scheme,\nMedicare\n.\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be outside Australia when you apply for this visa and when we decide your application\nbe outside Australia when you apply for this visa and when we decide your application\n- be a remaining relative of an Australian citizen orPermanent residentor anEligible New Zealand citizen\nbe a remaining relative of an Australian citizen or\nPermanent resident\nor an\nEligible New Zealand citizen\n- have an eligible sponsor.\nhave an eligible sponsor.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onwho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nwho can help with your visa application\n.\n\n### Process\n\nProcess\nAbout this visa\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nWith this visa you can\nHow long you can stay\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare.\nenrol in Australia's public healthcare scheme,\nMedicare\n.\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may have to wait before they can access certain Australian Government payments and benefits.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\n\nIf you want to travel after the initial 5-year travel validity:\n\nIf you want to travel after the initial 5-year travel validity:\n- you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when your travel validity ends, useVEVO.\n\nTo see when your travel validity ends, use\nVEVO\n.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nFor citizenship purposes, you become a permanent resident at the time:\n\nFor citizenship purposes, you become a permanent resident at the time:\n- you enter Australia on this visa; or\nyou enter Australia on this visa; or\n- if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa\nif you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa\n\n## Include family\n\nInclude family\n\nYou can includemembers of the family unitin your application when you apply. You an also add them to your application at any time before we make a decision.\n\nYou can include\nmembers of the family unit\nin your application when you apply. You an also add them to your application at any time before we make a decision.\n\nYou should include details of all your family members, whether they are migrating or not, in the application form.\n\nYou should include details of all your family members, whether they are migrating or not, in the application form.\n\nFamily members who apply for the visa with you must meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa with you must meet our\nhealth\nand\ncharacter\nrequirements.\n\nFamily members who are not coming to Australia might also have to meet ourhealthandcharacterrequirements.\n\nFamily members who are not coming to Australia might also have to meet our\nhealth\nand\ncharacter\nrequirements.\n\n### Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n## Cost\n\nCost\n\nThis visa costs fromAUD5,280.00\n\nThis visa costs from\nAUD5,280.00\n\nThere is an additional charge for each family member who applies with you.\n\nThere is an additional charge for each family member who applies with you.\n\nYou pay for this visa in 2 parts, called instalments.\n\nYou pay for this visa in 2 parts, called instalments.\n\nPay the first instalment when you apply and the second instalment when we ask you to.\n\nPay the first instalment when you apply and the second instalment when we ask you to.\n\nYou might also have to pay other costs for health checks, police certificates andbiometrics.\n\nYou might also have to pay other costs for health checks, police certificates and\nbiometrics\n.\n\nTo work out what your visa will cost use theVisa Pricing Estimator. The estimator does not take into account the second instalment or other costs.\n\nTo work out what your visa will cost use the\nVisa Pricing Estimator\n. The estimator does not take into account the second instalment or other costs.\n\nSee more aboutvisa fees and charges.\n\nSee more about\nvisa fees and charges\n.\n\n## Apply from\n\nApply from\n\nYou must be outside Australia when you apply and when we decide your application.\n\nYou must be outside Australia when you apply and when we decide your application.\n\n## Processing times\n\nProcessing times\n\nThe demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\n\nThe demand for Other Family visas is greater than the number of places available each year. As a result, processing times for these applications can be lengthy.\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application might take longer to process if:\n\nYour application might take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need or we need more information from you and/or\nyou do not include all the documents we need or we need more information from you and/or\n- your information takes longer than usual to verify.\nyour information takes longer than usual to verify.\n\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe can't process your application if you don't pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nApplications for this visa are subject tocapping and queueing.\n\nApplications for this visa are subject to\ncapping and queueing\n.\n\nLearn more about theOther Family Visaqueues andprocessing priorities.\n\nLearn more about the\nOther Family Visa\nqueues and\nprocessing priorities\n.\n\nTheReports on Migration Programshave further information on Migration Program outcomes against planning for each migration program year.\n\nThe\nReports on Migration Programs\nhave further information on Migration Program outcomes against planning for each migration program year.\n\n## Your obligations\n\nYour obligations\n\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\n\nYou must enter Australia before the date specified in your grant letter. The first entry date is generally set at 12 months from the date of visa grant.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nSee what conditions might be attached to this visa on ourvisa conditions page.\n\nSee what conditions might be attached to this visa on our\nvisa conditions page\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n## Have a sponsor\n\nHave a sponsor\nDetails\n\nYou must be sponsored by an eligible parent or step-parent, sibling or step-sibling, or an eligible partner of your relative.\n\nYou must be sponsored by an eligible parent or step-parent, sibling or step-sibling, or an eligible partner of your relative.\n\nWe must approve the sponsorship.\n\nWe must approve the sponsorship.\n\n## Not have other near relatives\n\nNot have other near relatives\nDetails\n\nWe will not grant you this visa if:\n\nWe will not grant you this visa if:\n- you or your partner have anear relativewho usually live outside Australia, or\nyou or your partner have a\nnear relative\nwho usually live outside Australia, or\n- you or your partner have anear relativewho live in Australia on a temporary visa (and are not anEligible New Zealand citizen) or unlawfully. Temporary visas include bridging visas.\nyou or your partner have a\nnear relative\nwho live in Australia on a temporary visa (and are not an\nEligible New Zealand citizen\n) or unlawfully. Temporary visas include bridging visas.\n\n## Have assurance of support\n\nHave assurance of support\nDetails\n\nYou must be able to obtain an assurance of support.\n\nYou must be able to obtain an assurance of support.\n\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa. The assurance is for you and any family members who come to Australia with you on this visa.\n\nAn assurance of support assures us that you will not have to rely on government assistance after you enter Australia on this visa. The assurance is for you and any family members who come to Australia with you on this visa.\n\nWe will let you know when you need to provide the assurance of support.\n\nWe will let you know when you need to provide the assurance of support.\n\nLearn more aboutassurances of support.\n\nLearn more about\nassurances of support\n.\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\nWe might also ask that other family members also meet therequirement.\n\nWe might also ask that other family members also meet the\nrequirement\n.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nYou and family members who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members who apply for the visa with you must meet our\ncharacter requirement\n.\n\nWe might ask that other non-migrating family members meet therequirement.\n\nWe might ask that other non-migrating family members meet the\nrequirement\n.\n\n## Have paid back your debt to the Australian Government\n\nHave paid back your debt to the Australian Government\nDetails\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement to pay it back.\n\nIf you or any family members owe the Australian Government money, you or they must have paid it back or have an approved arrangement to pay it back.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must:\n\nIf you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australiabooklet\nhave read, or had explained to you, the\nLife in Australia\nbooklet\n- sign anAustralian Values Statementthat confirms you will respect the Australian way of life and obey Australian laws\nsign an\nAustralian Values Statement\nthat confirms you will respect the Australian way of life and obey Australian laws\n\n## Best interests of the child\n\nBest interests of the child\nDetails\n\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe will not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck your passport. If you need help with your application, get someone to act on your behalf.\n\nCheck your passport. If you need help with your application, get someone to act on your behalf.\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nYou don't have to have a valid passport to apply but you must provide details of your most recent passport.\n\nYou don't have to have a valid passport to apply but you must provide details of your most recent passport.\n\nHowever, we will only grant the visa if you have a valid passport.\n\nHowever, we will only grant the visa if you have a valid passport.\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide documents to support your application. You will also need your sponsor documents.\n\nProvide documents to support your application. You will also need your sponsor documents.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if youcannot prove your identity or do not provide true information.\n\nProvide accurate information. See what happens if you\ncannot prove your identity or do not provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nWe need proof of your identity. If you cannot prove your identity:\n\nWe need proof of your identity. If you cannot prove your identity:\n- we will refuse your visa application\nwe will refuse your visa application\n- we might not grant you another visa for 10 years\nwe might not grant you another visa for 10 years\n- we might not grant any family members you listed on your application a visa for 10 years\nwe might not grant any family members you listed on your application a visa for 10 years\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Sponsor documents\n\nSponsor documents\n\nYour migration must be sponsored by your eligible relative or relative's eligible partner.\n\nYour migration must be sponsored by your eligible relative or relative's eligible partner.\n\nThe sponsor must be:\n\nThe sponsor must be:\n- aged 18 years or older and\naged 18 years or older and\n- a settled Australian citizen, Australian permanent resident, or eligible New Zealand citizen\na settled Australian citizen, Australian permanent resident, or eligible New Zealand citizen\n\nYour sponsor must completeForm 40 Sponsorship for migration to Australia (469KB PDF).\n\nYour sponsor must complete\nForm 40 Sponsorship for migration to Australia (469KB PDF)\n.\n\nTo prove your relationship with your sponsor, you will need to give us:\n\nTo prove your relationship with your sponsor, you will need to give us:\n- birth certificate\nbirth certificate\n- marriage certificates\nmarriage certificates\n- death certificates\ndeath certificates\n- adoption certificates\nadoption certificates\n- family status certificates or family books if officially issued and maintained\nfamily status certificates or family books if officially issued and maintained\n\nTo prove that your sponsor is an eligible citizen or permanent resident, give us:\n\nTo prove that your sponsor is an eligible citizen or permanent resident, give us:\n- citizenship certificate\ncitizenship certificate\n- passport\npassport\n- valid visa (for eligible New Zealand citizens)\nvalid visa (for eligible New Zealand citizens)\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe might ask you for character documents, including police certificates. Do not arrange for police certificates until we ask you to.Learn more about police certificates.\n\nWe might ask you for character documents, including police certificates. Do not arrange for police certificates until we ask you to.\nLearn more about police certificates\n.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with you, provide:\n\nFor every dependant under 18 years old who is applying with you, provide:\n- identity documents\nidentity documents\n- proof of your relationship with them, like a birth or marriage certificate\nproof of your relationship with them, like a birth or marriage certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to visit Australia on this visa\na statutory declaration giving their consent for the child to visit Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\n\nIf the child is not staying with a relative or legal guardian, provideForm 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\n\nIf the child is not staying with a relative or legal guardian, provide\nForm 1257 Undertaking declaration (211KB PDF)\n. The person they are staying with must sign the form.\nSee how\n\n#### Dependants 18 or older\n\nDependants 18 or older\n\nTo be included in your visa application as a dependent child, your child must be:\n\nTo be included in your visa application as a dependent child, your child must be:\n- under 18 years, or\nunder 18 years, or\n- over 18 years of age but not yet turned 23, and dependent on you or your partner, or\nover 18 years of age but not yet turned 23, and dependent on you or your partner, or\n- over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\nover 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\n\nFor every dependant 18 years old or older who is applying with you, provide:\n\nFor every dependant 18 years old or older who is applying with you, provide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n- proof of dependency\nproof of dependency\nSee how\n\n#### Proof of dependency\n\nProof of dependency\n\nYou need to prove that this person is dependent on you. Provide:\n\nYou need to prove that this person is dependent on you. Provide:\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of your relationship with the dependent such as a birth certificate or adoption papers\nproof of your relationship with the dependent such as a birth certificate or adoption papers\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are currently studying\nproof they are currently studying\n\nUsually, your child or stepchild must be under 23 years old to be included in your application.\n\nUsually, your child or stepchild must be under 23 years old to be included in your application.\n\nHowever, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\n\nHowever, a dependant older than 23 years can be included if they are unable to earn a living to support themselves due to physical or cognitive limitations. In this case, provide information about the physical or cognitive limitation.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nProvide either:\n\nProvide either:\n- your current marriage certificate or\nyour current marriage certificate or\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nDocuments that prove your de facto relationship include:\n\nDocuments that prove your de facto relationship include:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nDo not certify police certificates. You need to send us the originals.\n\nDo not certify police certificates. You need to send us the originals.\n\nHave all other documentscertified copy. This includes:\n\nHave all other documents\ncertified copy\n. This includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much information as possible to help us decide your application\nas much information as possible to help us decide your application\n- each document only once, even if you are using to show more than one thing\neach document only once, even if you are using to show more than one thing\n- all documents with your application, if you can\nall documents with your application, if you can\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for the visa on paper. You must be outside Australia when you apply.\n\nYou must apply for the visa on paper. You must be outside Australia when you apply.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Apply on paper\n\nApply on paper\n\nCompleteForm 47OF Application for migration to Australia (615KB PDF).\n\nComplete\nForm 47OF Application for migration to Australia (615KB PDF)\n.\n\nYour sponsor must complete:\n\nYour sponsor must complete:\n- Form 40 Sponsorship for migration to Australia (469KB PDF)\nForm 40 Sponsorship for migration to Australia (469KB PDF)\n\nComplete the form  in English.\n\nComplete the form  in English.\n\nYou can’t pay for this visa in person.\n\nYou can’t pay for this visa in person.\n\nYou must pay the first instalment when you apply. Pay for the application before it is submitted using the online portal payment function inImmiAccount. Include evidence the application is paid for with your application.\n\nYou must pay the first instalment when you apply. Pay for the application before it is submitted using the online portal payment function in\nImmiAccount\n. Include evidence the application is paid for with your application.\n\nFor other payment options seehow to pay.\n\nFor other payment options see\nhow to pay\n.\n\nYou can't submit this application in person. Send the application by post or courier to the Parent, Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\n\nYou can't submit this application in person. Send the application by post or courier to the Parent, Child and Other Family Processing Centre in Perth at the address on the form. Include all required documents and forms with your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\n\nWe will let you know when we have received your application and documents. See what you can and must do after you apply.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 25 June 2020.\n\nYou can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 25 June 2020.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't provide you with updates on your application's progress within normal processing times. There may be other things you need to know and might have to do.\n\nWe can't provide you with updates on your application's progress within normal processing times. There may be other things you need to know and might have to do.\nSee how\n\n#### Travel\n\nTravel\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\n\nDo not arrange to travel to Australia until we let you know, in writing, that we have granted you the visa.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you needhealth examinations.\n\nWe will let you know if you need\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics(fingerprints and photo). We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n(fingerprints and photo). We will let you know if you need to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount.\n\nIf you can’t use ImmiAccount or you lodged the application outside of Australiabefore25 June 2020,to provide any additional documents attach them to a completed Other Family Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount or you lodged the application outside of Australia\nbefore\n25 June 2020\n,\nto provide any additional documents attach them to a completed Other Family Visa Processing Centre\nonline form\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. You must be outside Australia when we make a decision on your application.\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. You must be outside Australia when we make a decision on your application.\nSee how\n\n#### Pay the second instalment\n\nPay the second instalment\n\nPay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa.\n\nPay the second instalment when we tell you to. We will send you an invoice for the instalment after you have met all other requirements for the visa.\n\nYou must pay the instalment or we can't grant the visa.\n\nYou must pay the instalment or we can't grant the visa.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF).\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centre\nonline form\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount attach the completed form to a completed Other Family Visa Processing Centre\nonline form\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw the application\nyou want to withdraw the application\n- if you have experienced domestic or family violence seeFamily violence provisions.\nif you have experienced domestic or family violence see\nFamily violence provisions\n.\n\nSee how to tell us ifyour situation changes.\n\nSee how to tell us if\nyour situation changes\n.\nSee how\n\n#### Assurance of support\n\nAssurance of support\n\nYou need to provide an assurance of support when we ask you to.\n\nYou need to provide an assurance of support when we ask you to.\n\nLearn more aboutassurances of support.\n\nLearn more about\nassurances of support\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou must be outside Australia when we decide on your application. We will let you know our decision in writing.\n\nYou must be outside Australia when we decide on your application. We will let you know our decision in writing.\n\nWe will let you know:\n\nWe will let you know:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of our decision.\n\nKeep a copy of our decision.\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision\nwhether you have a right to a review of the decision\n\nWe will not refund the application fee if we refuse your application.\n\nWe will not refund the application fee if we refuse your application.\nWhen you have this visa\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Other Family subclasses 114, 115, 116, 835, 836 and 838 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 25 June 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you travel\n\nBefore you travel\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document.\na valid passport or other travel document.\n\n#### Arrive before first entry arrival date\n\nArrive before first entry arrival date\n\nYou must enter Australia before the date specified in your grant letter.\n\nYou must enter Australia before the date specified in your grant letter.\n\nIf your visa is still valid and the date specified in your visa grant letter has passed or will pass before you can travel to Australia, you must ensure that:\n\nIf your visa is still valid and the date specified in your visa grant letter has passed or will pass before you can travel to Australia, you must ensure that:\n- you plan to travel to Australia within the next 12 months\nyou plan to travel to Australia within the next 12 months\n- you submit thetravel facilitation letter request form.\nyou submit the\ntravel facilitation letter request form\n.\n\nWe may then send you a travel facilitation letter. This will state that we allow you to enter Australia after the first entry arrival date of your visa.\n\nWe may then send you a travel facilitation letter. This will state that we allow you to enter Australia after the first entry arrival date of your visa.\n\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date.\n\nWe will not issue a travel facilitation letter unless there is less than 3 months remaining on your first entry arrival date.\n\n### At the border\n\nAt the border\n\n#### Complete an Incoming Passenger Card\n\nComplete an Incoming Passenger Card\n\nAll people arriving into Australia must complete theIncoming Passenger Card.\n\nAll people arriving into Australia must complete the\nIncoming Passenger Card\n.\n\n#### Using the SmartGate\n\nUsing the SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport using theSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport using the\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you must do when you have this visa\n\nWhat you must do when you have this visa\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou can check visa details and conditions inVEVO.\n\nYou can check visa details and conditions in\nVEVO\n.\n\n### Tell us if things change\n\nTell us if things change\n\nSeewhat to do if your situation changes.\n\nSee\nwhat to do if your situation changes\n.\n\n### What you can do on your visa\n\nWhat you can do on your visa\n\nCheck your visa conditions and expiry.\n\nCheck your visa conditions and expiry.\n\nCheck your Resident Return visa expiry, visa conditions, work and study entitlements inVEVO.\n\nCheck your Resident Return visa expiry, visa conditions, work and study entitlements in\nVEVO\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nFor citizenship purposes, you become a permanent resident at the time:\n\nFor citizenship purposes, you become a permanent resident at the time:\n- you enter Australia on this visa; or\nyou enter Australia on this visa; or\n- if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa\nif you previously have been present in Australia and held a permanent visa immediately before last leaving Australia, when we grant this visa\n\nTo see your specific conditions, work and study entitlements useVEVO.\n\nTo see your specific conditions, work and study entitlements use\nVEVO\n.\n\n### Access Australian Government benefits\n\nAccess Australian Government benefits\n\nAs a newly arrived resident, you may have to wait before you are able to access certain Australian Government payments and benefits. Learn more about newly arrived residents’ waiting period fromServices Australia.\n\nAs a newly arrived resident, you may have to wait before you are able to access certain Australian Government payments and benefits. Learn more about newly arrived residents’ waiting period from\nServices Australia\n.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\n\nYou can travel to and from Australia as many times as you want for 5 years from the date we grant this visa until the travel validity expires.\n\nIf you want to travel after the initial 5-year travel validity:\n\nIf you want to travel after the initial 5-year travel validity:\n- you will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\nyou will need to apply for and be granted a Resident Return (RRV) so that you can re-enter Australia as a permanent resident\n- you might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nyou might also want to consider Australian citizenship. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when your travel validity ends, useVEVO.\n\nTo see when your travel validity ends, use\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\nYou can request your international movement records by completing theRequest for international movement records form.\n\nYou can request your international movement records by completing the\nRequest for international movement records form\n.\n\n### Working\n\nWorking\n\nWith this visa you become a permanent resident. You are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nWith this visa you become a permanent resident. You are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, you become a permanent resident at particular time:\n\nFor citizenship purposes, you become a permanent resident at particular time:\n- when you enter Australia on this visa; or\nwhen you enter Australia on this visa; or\n- if you previously have been present in Australia and held a permanent visa immediately before last leaving Australia—when we grant this visa\nif you previously have been present in Australia and held a permanent visa immediately before last leaving Australia—when we grant this visa\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your visa is still valid\n\nEnsure your visa is still valid\n\nSee what to doif your visa has expired or is about to expire.\n\nSee what to do\nif your visa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Departures SmartGate\n\nDepartures SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Proving you have been to Australia\n\nProving you have been to Australia\n\nTo prove you have been to Australia, request your international movement records by completing theRequest for international movement records form.\n\nTo prove you have been to Australia, request your international movement records by completing the\nRequest for international movement records form\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/remaining-relative-115#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:10:43.998637",
  "metadata": {}
}