{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-(long-stay-activity)-visa-(sublass-401)",
  "title": "Temporary Work (Long Stay Activity) visa (subclass 401)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Temporary Work (Long Stay Activity) visa (subclass 401) Page Content ​​​ The Temporary Work (Long Stay Activty) visa (subclass 401) is closed to new applications from 19 November 2016. This visa has been replaced by the Temporary Activity visa (subclass 408) Visa holders Details This information is for people who have already been granted a Temporary Work (Long Stay Activity) visa (subclass 401). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details Your visa is valid for the duration of the nominated position, or up to two years, whichever is earlier (sport stream visa holders will usually only be permitted a stay in Australia for the duration of the sporting season). What this visa lets you do Details This visa allows you to: stay in Australia for the period of the nominated position, with a maximum stay of two years do the work or activity specified in your nomination bring eligible family members with you to Australia enter and leave Australia as many times as you want while your visa is valid. Your obligations Details You and your family must comply with all visa conditions and Australian laws. During your stay in Australia, you must: maintain adequate health insurance while you are in Australia continue to meet the requirements of the visa stream in which you were granted the visa leave Australia when your visa ends (unless you are granted another visa) only engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job) only engage in work or activity consistent with the position nominated in your visa application. If the sponsor ceases your employment, you must do one of the following: find another employer who is willing to sponsor/support you and apply for a new visa. The Temporary Work (Long Stay Activity) visa (subclass 401) is closed to new applicants. You might want to consider whether the Temporary Activity visa (subclass 408) is appropriate for you. leave Australia within 28 days or sooner if your visa ends before 28 days have passed. Family members Your family cannot enter Australia before you. When your visa ends, your family must leave Australia with you. Your family must: intend to remain members of your family unit. maintain adequate health insurance while they are in Australia. Your family can work or study in Australia while their visa is valid. We will tell you if there are any other conditions they must comply with when you are granted the visa. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation Sponsors Details You can no longer apply to sponsor applicants. This information is for approved sponsors of people who are on a Temporary Work (Long Stay Activity) visa (subclass 401). You can use Visa Entitlement Verification Online (VEVO for Organisations) to check the visa details and entitlements of a person that you have sponsored. From 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date. Sponsor obligations Details You must be able to comply with the following sponsorship obligations: cooperate with inspectors tell us when certain events occur keep records provide records and information to the Minister not recover from, transfer or charge certain costs to another person pay costs to locate and remove an unlawful non-citizen ensure the visa holder participates in the nominated occupation, program or activity Depending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations: secure an offer of a reasonable standard of accommodation pay travel costs to enable sponsored people to leave Australia make the same position available to Australian exchange participants. You are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent. Cooperate with inspectors Details You must be able to comply with the following sponsorship obligations: cooperate with inspectors tell us when certain events occur keep records provide records and information to the Minister not recover from, transfer or charge certain costs to another person pay costs to locate and remove an unlawful non-citizen ensure the visa holder participates in the nominated occupation, program or activity Depending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations: secure an offer of a reasonable standard of accommodation pay travel costs to enable sponsored people to leave Australia make the same position available to Australian exchange participants. You are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent. Keep records - For Exchange, Sport and Domestic Worker (Executive) streams only Details You must keep records that show you have your complied with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. You must keep a record of: any notification that you were required to make to us the date on which you notified us, and how and where you made the notification. This obligation starts on the day the sponsorship is approved. This obligation ends two years after both of the following: you are no longer an approved sponsor, and you are no longer sponsoring anyone. You do not need to keep any records for more than five years. Keep records - For Religious Worker stream only Details You must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following: written requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received how the outward travel costs were paid, how much was paid, for whom they were paid, and when they were paid. Provide records and information to the Minister Details You must provide records or information, if they are requested by a departmental officer that goes to determining whether: a sponsorship obligation is being or has been complied with, and determining whether other circumstances, in which the Minister may take administrative action, exist or have existed, in the manner and timeframe requested by the department. We may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that: you are required to keep under Commonwealth, state or territory law you have an obligation to keep as a sponsor. This obligation starts to apply on the day the sponsorship is approved. This obligation ends two years after: your sponsorship ceases, and you no longer have a sponsored visa holder. Tell us when certain events occur Details You must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring. Events where a sponsor must provide information to us include: a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details; the primary sponsored person fails to participate in the nominated occupation, program or activity the primary sponsored person ceases to participate in the nominated occupation, program or activity a change to the formal agreement between the primary sponsored person and the person a change to the exchange agreement (for sponsors who are party to an exchange agreement) the person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80. This obligation starts to apply on the day the sponsorship is approved. This obligation ends two years after: your sponsorship ceases, and you are no longer sponsoring anyone. Where to send a notice of an event or change You must send details of these events by email or to one of our state or territory offices listed below. By email (preferred): sponsor.notifications@homeaffairs.gov.au By registered post: Australian Capital Territory Sponsor Monitoring GPO Box 717 Canberra ACT 2601 New South Wales Sponsor Monitoring GPO Box 9984 Sydney NSW 2001 Queensland Sponsor Monitoring GPO Box 9984 Brisbane Qld 4001 Northern Territory Sponsor Monitoring GPO Box 864 Darwin NT 0801 South Australia Sponsor Monitoring GPO Box 2399 Adelaide SA 5001 Tasmania Sponsor Monitoring GPO Box 794 Hobart Tas. 7001 Victoria Sponsor Monitoring GPO Box 241 Melbourne Vic. 3001 Western Australia Sponsor Monitoring Locked Bag 7 Northbridge WA 6865 Pay travel costs to enable sponsored people to leave Australia - For Religious Worker stream only Details You must pay reasonable and necessary travel costs to enable the sponsored person you have sponsored and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request ask on their behalf. The costs will be considered reasonable and necessary if they include all of the following: travel from the sponsored persons’ usual place of residence in Australia to their place of departure from Australia travel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to economy class air travel or, where that is not available, a reasonable equivalent. Travel costs must be paid within 30 days of receiving the request. You will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again. This obligation starts on the day: the visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved), or your nomination is approved (if the person already held a visa in this subclass when your nomination is approved). This obligation ends on the day (whichever is the earliest): another sponsor has their nomination application for the sponsored person approved the person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa the person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Pay travel costs to enable domestic workers to enter and leave Australia - For Domestic Worker (Executive) Stream only Details You must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to travel to and to leave Australia. The costs will be considered reasonable and necessary if they include all of the following: the sponsored person’s travel to Australia travel to the sponsored person’s place of residence in Australia from the place of arrival in Australia travel from the sponsored person’s place of residence in Australia to the place of departure from Australia travel from Australia to the country from which the sponsored person came to Australia are for economy class air travel or, where unavailable, a reasonable equivalent. This obligation starts on the day: the visa is granted (if the person does not already hold a 427 visa or 401 visa in the domestic worker (executive) stream, or your nomination is approved. This obligation ends on the day (whichever is the earliest): another sponsor has their nomination application for the same person approved the person you have sponsored is granted a further substantive visa of a different subclass to the one they last held the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Pay costs to locate and remove an unlawful non-citizen Details In the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia. You may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above). This obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia. Secure an offer of a reasonable standard of accommodation - For Sport and Religious Worker Streams only Details If you sponsor someone to work for you as a volunteer without a salary or wages, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them. If the accommodation becomes unavailable, you must find alternative accommodation for them. A ‘reasonable standard of accommodation’ means that the accommodation must: meet all relevant state or territory and local government regulations regarding fire, health and safety offer 24-hour access provide meals or a self-catering kitchen be clean and well-maintained have a lounge area have adequate laundry facilities or a laundry service provide power for lighting, cooking and refrigeration have an adequate ratio of guests to bathroom facilities have uncrowded sleeping areas provide appropriate gender segregated areas and bathroom facilities allow adequate privacy and secure storage for personal items. This obligation starts on the day: your nomination of the sponsored person is approved, or the day the visa is granted (if the person you have sponsored does not already hold this visa or a Religious Worker (Subclass 428) or Sport (Subclass 421) visa when you nominate them). This obligation ends on the day (whichever is earliest): another sponsor has their nomination application for the same person approved the person you have sponsored is granted a further visa of a different type from the one for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa) the person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect. Make the same position available to Australian exchange participants – for Exchange stream only Details Immediately on completion of the exchange, you are required to make available to the Australian citizen or Australian permanent resident who is a participant in the exchange, the same position or equivalent position in Australia that was held by the Australian participant at the time the exchange was entered into. This obligation starts on the day your nomination of the sponsored person is approved. This obligation ends 30 days after completion of the exchange. Monitoring of sponsors and visa holders Details You must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions. We monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways: exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office. writing to you to ask for information in accordance with the obligation to provide records and information site visits, usually to the sponsored business premises, with or without notice Your compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the Migration Act 1958 . Failure to cooperate with inspectors is a breach of the sponsorship obligations Sanctions for not meeting your sponsor obligations Details If you do not meet your obligations, we could take one or more of the following actions: Administrative you could be barred from sponsoring more people for a specified time you could be barred from applying for approval to be a sponsor, in relation to this visa or another one all of your existing approvals as a sponsor could be cancelled. Enforceable undertaking You could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again. Civil we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure. we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure. Other circumstances in which administrative action might be taken In addition, you could also have sanctions imposed if: you provide false or misleading information to us or the Migration Review Tribunal you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Temporary Work (Long Stay Activity) visa (subclass 401)\n\nTemporary Work (Long Stay Activity) visa (subclass 401)\nPage Content\n\n​​​ The Temporary Work (Long Stay Activty) visa (subclass 401) is closed to new applications from 19 November 2016.\n\n​​​ The Temporary Work (Long Stay Activty) visa (subclass 401) is closed to new applications from 19 November 2016.\n\nThis visa has been replaced by theTemporary Activity visa (subclass 408).\n\nThis visa has been replaced by the\nTemporary Activity visa (subclass 408)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Temporary Work (Long Stay Activity) visa (subclass 401). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Temporary Work (Long Stay Activity) visa (subclass 401). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nYour visa is valid for the duration of the nominated position, or up to two years, whichever is earlier (sport stream visa holders will usually only be permitted a stay in Australia for the duration of the sporting season).\n\nYour visa is valid for the duration of the nominated position, or up to two years, whichever is earlier (sport stream visa holders will usually only be permitted a stay in Australia for the duration of the sporting season).\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to:\n\nThis visa allows you to:\n- stay in Australia for the period of the nominated position, with a maximum stay of two years\nstay in Australia for the period of the nominated position, with a maximum stay of two years\n- do the work or activity specified in your nomination\ndo the work or activity specified in your nomination\n- bring eligible family members with you to Australia\nbring eligible family members with you to Australia\n- enter and leave Australia as many times as you want while your visa is valid.\nenter and leave Australia as many times as you want while your visa is valid.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia, you must:\n\nDuring your stay in Australia, you must:\n- maintainadequate health insurancewhile you are in Australia\nmaintain\nadequate health insurance\nwhile you are in Australia\n- continue to meet the requirements of the visa stream in which you were granted the visa\ncontinue to meet the requirements of the visa stream in which you were granted the visa\n- leave Australia when your visa ends (unless you are granted another visa)\nleave Australia when your visa ends (unless you are granted another visa)\n- only engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job)\nonly engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job)\n- only engage in work or activity consistent with the position nominated in your visa application.\nonly engage in work or activity consistent with the position nominated in your visa application.\n\nIf the sponsor ceases your employment, you must do one of the following:\n\nIf the sponsor ceases your employment, you must do one of the following:\n- find another employer who is willing to sponsor/support you and apply for a new visa. The Temporary Work (Long Stay Activity) visa (subclass 401) is closed to new applicants. You might want to consider whether theTemporary Activity visa (subclass 408)is appropriate for you.\nfind another employer who is willing to sponsor/support you and apply for a new visa. The Temporary Work (Long Stay Activity) visa (subclass 401) is closed to new applicants. You might want to consider whether the\nTemporary Activity visa (subclass 408)\nis appropriate for you.\n- leave Australia within 28 days or sooner if your visa ends before 28 days have passed.\nleave Australia within 28 days or sooner if your visa ends before 28 days have passed.\n\n#### Family members\n\nFamily members\n\nYour family cannot enter Australia before you. When your visa ends, your family must leave Australia with you.\n\nYour family cannot enter Australia before you. When your visa ends, your family must leave Australia with you.\n\nYour family must:\n\nYour family must:\n- intend to remain members of your family unit.\nintend to remain members of your family unit.\n- maintainadequate health insurancewhile they are in Australia.\nmaintain\nadequate health insurance\nwhile they are in Australia.\n\nYour family can work or study in Australia while their visa is valid.\n\nYour family can work or study in Australia while their visa is valid.\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n## Sponsors\n\nSponsors\nDetails\n\nYou can no longer apply to sponsor applicants.\n\nYou can no longer apply to sponsor applicants.\n\nThis information is for approved sponsors of people who are on a Temporary Work (Long Stay Activity) visa (subclass 401).\n\nThis information is for approved sponsors of people who are on a Temporary Work (Long Stay Activity) visa (subclass 401).\n\nYou can useVisa Entitlement Verification Online (VEVO for Organisations)to check the visa details and entitlements of a person that you have sponsored.\n\nYou can use\nVisa Entitlement Verification Online (VEVO for Organisations)\nto check the visa details and entitlements of a person that you have sponsored.\n\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date.\n\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date.\n\n### Sponsor obligations\n\nSponsor obligations\nDetails\n\nYou must be able to comply with the following sponsorship obligations:\n\nYou must be able to comply with the following sponsorship obligations:\n- cooperate with inspectors\ncooperate with inspectors\n- tell us when certain events occur\ntell us when certain events occur\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- pay costs  to locate and remove an unlawful non-citizen\npay costs  to locate and remove an unlawful non-citizen\n- ensure the visa holder participates in the nominated occupation, program or activity\nensure the visa holder participates in the nominated occupation, program or activity\n\nDepending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations:\n\nDepending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations:\n- secure an offer of a reasonable standard of accommodation\nsecure an offer of a reasonable standard of accommodation\n- pay travel costs to enable sponsored people  to leave Australia\npay travel costs to enable sponsored people  to leave Australia\n- make the same position available to Australian exchange participants.\nmake the same position available to Australian exchange participants.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\n#### Cooperate with inspectors\n\nCooperate with inspectors\nDetails\n\nYou must be able to comply with the following sponsorship obligations:\n\nYou must be able to comply with the following sponsorship obligations:\n- cooperate with inspectors\ncooperate with inspectors\n- tell us when certain events occur\ntell us when certain events occur\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- pay costs  to locate and remove an unlawful non-citizen\npay costs  to locate and remove an unlawful non-citizen\n- ensure the visa holder participates in the nominated occupation, program or activity\nensure the visa holder participates in the nominated occupation, program or activity\n\nDepending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations:\n\nDepending on the stream in which you are making a nomination, you may also be required to comply with the following sponsorship obligations:\n- secure an offer of a reasonable standard of accommodation\nsecure an offer of a reasonable standard of accommodation\n- pay travel costs to enable sponsored people  to leave Australia\npay travel costs to enable sponsored people  to leave Australia\n- make the same position available to Australian exchange participants.\nmake the same position available to Australian exchange participants.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\n#### Keep records - For Exchange, Sport and Domestic Worker (Executive) streams only\n\nKeep records - For Exchange, Sport and Domestic Worker (Executive) streams only\nDetails\n\nYou must keep records that show you have your complied with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep records that show you have your complied with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep a record of:\n\nYou must keep a record of:\n- any notification that you were required to make to us\nany notification that you were required to make to us\n- the date on which you notified us, and how and where you made the notification.\nthe date on which you notified us, and how and where you made the notification.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation ends two years after both of the following:\n\nThis obligation ends two years after both of the following:\n- you are no longer an approved sponsor, and\nyou are no longer an approved sponsor, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nYou do not need to keep any records for more than five years.\n\nYou do not need to keep any records for more than five years.\n\n#### Keep records - For Religious Worker stream only\n\nKeep records - For Religious Worker stream only\nDetails\n\nYou must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following:\n\nYou must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following:\n- written requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received\nwritten requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received\n- how the outward travel costs were paid, how much was paid, for whom they were paid, and when they were paid.\nhow the outward travel costs were paid, how much was paid, for whom they were paid, and when they were paid.\n\n#### Provide records and information to the Minister\n\nProvide records and information to the Minister\nDetails\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n- a sponsorship obligation is being or has been complied with, and\na sponsorship obligation is being or has been complied with, and\n- determining whether other circumstances, in which the Minister may take administrative action, exist or have existed, in the manner and timeframe requested by the department.\ndetermining whether other circumstances, in which the Minister may take administrative action, exist or have existed, in the manner and timeframe requested by the department.\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n- you are required to keep under Commonwealth, state or territory law\nyou are required to keep under Commonwealth, state or territory law\n- you have an obligation to keep as a sponsor.\nyou have an obligation to keep as a sponsor.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship ceases, and\nyour sponsorship ceases, and\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\n#### Tell us when certain events occur\n\nTell us when certain events occur\nDetails\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nEvents where a sponsor must provide information to us include:\n\nEvents where a sponsor must provide information to us include:\n- a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details;\na change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details;\n- the primary sponsored person fails to participate in the nominated occupation, program or activity\nthe primary sponsored person fails to participate in the nominated occupation, program or activity\n- the primary sponsored person ceases to participate in the nominated occupation, program or activity\nthe primary sponsored person ceases to participate in the nominated occupation, program or activity\n- a change to the formal agreement between the primary sponsored person and the person\na change to the formal agreement between the primary sponsored person and the person\n- a change to the exchange agreement (for sponsors who are party to an exchange agreement)\na change to the exchange agreement (for sponsors who are party to an exchange agreement)\n- the person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80.\nthe person has paid the return travel costs of a primary sponsored person or secondary sponsored person in accordance with the obligation mentioned in regulation 2.80.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation starts to apply on the day the sponsorship is approved.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship ceases, and\nyour sponsorship ceases, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nWhere to send a notice of an event or change\n\nWhere to send a notice of an event or change\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nBy email(preferred):sponsor.notifications@homeaffairs.gov.au\n\nBy email\n(preferred):\nsponsor.notifications@homeaffairs.gov.au\n\nBy registered post:\n\nBy registered post:\n- Australian Capital TerritorySponsor MonitoringGPO Box 717Canberra ACT 2601\nAustralian Capital Territory\nSponsor Monitoring\nGPO Box 717\nCanberra ACT 2601\n- New South WalesSponsor MonitoringGPO Box 9984Sydney NSW 2001\nNew South Wales\nSponsor Monitoring\nGPO Box 9984\nSydney NSW 2001\n- QueenslandSponsor MonitoringGPO Box 9984Brisbane Qld 4001\nQueensland\nSponsor Monitoring\nGPO Box 9984\nBrisbane Qld 4001\n- Northern TerritorySponsor MonitoringGPO Box 864Darwin NT 0801\nNorthern Territory\nSponsor Monitoring\nGPO Box 864\nDarwin NT 0801\n- South AustraliaSponsor MonitoringGPO Box 2399Adelaide SA 5001\nSouth Australia\nSponsor Monitoring\nGPO Box 2399\nAdelaide SA 5001\n- TasmaniaSponsor MonitoringGPO Box 794Hobart Tas. 7001\nTasmania\nSponsor Monitoring\nGPO Box 794\nHobart Tas. 7001\n- VictoriaSponsor MonitoringGPO Box 241Melbourne Vic. 3001\nVictoria\nSponsor Monitoring\nGPO Box 241\nMelbourne Vic. 3001\n- Western AustraliaSponsor MonitoringLocked Bag 7Northbridge WA 6865\nWestern Australia\nSponsor Monitoring\nLocked Bag 7\nNorthbridge WA 6865\n\n#### Pay travel costs to enable sponsored people to leave Australia - For Religious Worker stream only\n\nPay travel costs to enable sponsored people to leave Australia - For Religious Worker stream only\nDetails\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person you have sponsored and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request ask on their behalf.\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person you have sponsored and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request ask on their behalf.\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n- travel from the sponsored  persons’ usual place of residence in Australia to their place of departure from Australia\ntravel from the sponsored  persons’ usual place of residence in Australia to their place of departure from Australia\n- travel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to\ntravel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to\n- economy class air travel or, where that is not available, a reasonable equivalent.\neconomy class air travel or, where that is not available, a reasonable equivalent.\n\nTravel costs must be paid within 30 days of receiving the request.\n\nTravel costs must be paid within 30 days of receiving the request.\n\nYou will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again.\n\nYou will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- the visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved), or\nthe visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved), or\n- your nomination is approved (if the person already held a visa in this subclass when your nomination is approved).\nyour nomination is approved (if the person already held a visa in this subclass when your nomination is approved).\n\nThis obligation ends on the day (whichever is the earliest):\n\nThis obligation ends on the day (whichever is the earliest):\n- another sponsor has their nomination application for the sponsored person approved\nanother sponsor has their nomination application for the sponsored person approved\n- the person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa\nthe person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa\n- the person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Pay travel costs to enable domestic workers to enter and leave Australia - For Domestic Worker (Executive) Stream only\n\nPay travel costs to enable domestic workers to enter and leave Australia - For Domestic Worker (Executive) Stream only\nDetails\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to travel to and to leave Australia.\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to travel to and to leave Australia.\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n\nThe costs will be considered reasonable and necessary if they include all of the following:\n- the sponsored person’s travel to Australia\nthe sponsored person’s travel to Australia\n- travel to the sponsored person’s place of residence in Australia from the place of arrival in Australia\ntravel to the sponsored person’s place of residence in Australia from the place of arrival in Australia\n- travel from the sponsored person’s place of residence in Australia to the place of departure from Australia\ntravel from the sponsored person’s place of residence in Australia to the place of departure from Australia\n- travel from Australia to the country from which the sponsored person came to Australia\ntravel from Australia to the country from which the sponsored person came to Australia\n- are for economy class air travel or, where unavailable, a reasonable equivalent.\nare for economy class air travel or, where unavailable, a reasonable equivalent.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- the visa is granted (if the person does not already hold a 427 visa or 401 visa in the domestic worker (executive) stream, or\nthe visa is granted (if the person does not already hold a 427 visa or 401 visa in the domestic worker (executive) stream, or\n- your nomination is approved.\nyour nomination is approved.\n\nThis obligation ends on the day (whichever is the earliest):\n\nThis obligation ends on the day (whichever is the earliest):\n- another sponsor has their nomination application for the same person approved\nanother sponsor has their nomination application for the same person approved\n- the person you have sponsored is granted a further substantive visa of a different subclass to the one they last held\nthe person you have sponsored is granted a further substantive visa of a different subclass to the one they last held\n- the person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe person you have sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Pay costs to locate and remove an unlawful non-citizen\n\nPay costs to locate and remove an unlawful non-citizen\nDetails\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\n#### Secure an offer of a reasonable standard of accommodation - For Sport and Religious Worker Streams only\n\nSecure an offer of a reasonable standard of accommodation - For Sport and Religious Worker Streams only\nDetails\n\nIf you sponsor someone to work for you as a volunteer without a salary or wages, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf you sponsor someone to work for you as a volunteer without a salary or wages, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nA ‘reasonable standard of accommodation’ means that the accommodation must:\n\nA ‘reasonable standard of accommodation’ means that the accommodation must:\n- meet all relevant state or territory and local government regulations regarding fire, health and safety\nmeet all relevant state or territory and local government regulations regarding fire, health and safety\n- offer 24-hour access\noffer 24-hour access\n- provide meals or a self-catering kitchen\nprovide meals or a self-catering kitchen\n- be clean and well-maintained\nbe clean and well-maintained\n- have a lounge area\nhave a lounge area\n- have adequate laundry facilities or a laundry service\nhave adequate laundry facilities or a laundry service\n- provide power for lighting, cooking and refrigeration\nprovide power for lighting, cooking and refrigeration\n- have an adequate ratio of guests to bathroom facilities\nhave an adequate ratio of guests to bathroom facilities\n- have uncrowded sleeping areas\nhave uncrowded sleeping areas\n- provide appropriate gender segregated areas and bathroom facilities\nprovide appropriate gender segregated areas and bathroom facilities\n- allow adequate privacy and secure storage for personal items.\nallow adequate privacy and secure storage for personal items.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- your nomination of the sponsored person is approved, or\nyour nomination of the sponsored person is approved, or\n- the day the visa is granted (if the person you have sponsored does not already hold this visa or a Religious Worker (Subclass 428) or Sport (Subclass 421) visa when you nominate them).\nthe day the visa is granted (if the person you have sponsored does not already hold this visa or a Religious Worker (Subclass 428) or Sport (Subclass 421) visa when you nominate them).\n\nThis obligation ends on the day (whichever is earliest):\n\nThis obligation ends on the day (whichever is earliest):\n- another sponsor has their nomination application for the same person approved\nanother sponsor has their nomination application for the same person approved\n- the person you have sponsored is granted a further visa of a different type from the one for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\nthe person you have sponsored is granted a further visa of a different type from the one for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\n- the person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect.\nthe person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect.\n\n#### Make the same position available to Australian exchange participants – for Exchange stream only\n\nMake the same position available to Australian exchange participants – for Exchange stream only\nDetails\n\nImmediately on completion of the exchange, you are required to make available to the Australian citizen or Australian permanent resident who is a participant in the exchange, the same position or equivalent position in Australia that was held by the Australian participant at the time the exchange was entered into.\n\nImmediately on completion of the exchange, you are required to make available to the Australian citizen or Australian permanent resident who is a participant in the exchange, the same position or equivalent position in Australia that was held by the Australian participant at the time the exchange was entered into.\n\nThis obligation starts on the day your nomination of the sponsored person is approved.\n\nThis obligation starts on the day your nomination of the sponsored person is approved.\n\nThis obligation ends 30 days after completion of the exchange.\n\nThis obligation ends 30 days after completion of the exchange.\n\n### Monitoring of sponsors and visa holders\n\nMonitoring of sponsors and visa holders\nDetails\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n- exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\nexchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\n- writing to you to ask for information in accordance with the obligation to provide records and information\nwriting to you to ask for information in accordance with the obligation to provide records and information\n- site visits, usually to the sponsored business premises, with or without notice\nsite visits, usually to the sponsored business premises, with or without notice\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under theMigration Act 1958. Failure to cooperate with inspectors is a breach of the sponsorship obligations\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the\nMigration Act 1958\n. Failure to cooperate with inspectors is a breach of the sponsorship obligations\n\n### Sanctions for not meeting your sponsor obligations\n\nSanctions for not meeting your sponsor obligations\nDetails\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nAdministrative\n\nAdministrative\n- you could be barred from sponsoring more people for a specified time\nyou could be barred from sponsoring more people for a specified time\n- you could be barred from applying for approval to be a sponsor, in relation to this visa or another one\nyou could be barred from applying for approval to be a sponsor, in relation to this visa or another one\n- all of your existing approvals as a sponsor could be cancelled.\nall of your existing approvals as a sponsor could be cancelled.\n\nEnforceable undertaking\n\nEnforceable undertaking\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nCivil\n\nCivil\n- we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\nwe can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\n- we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\nwe can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\n\nOther circumstances in which administrative action might be taken\n\nOther circumstances in which administrative action might be taken\n\nIn addition, you could also have sanctions imposed if:\n\nIn addition, you could also have sanctions imposed if:\n- you provide false or misleading information to us or the Migration Review Tribunal\nyou provide false or misleading information to us or the Migration Review Tribunal\n- you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\nyou no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\n- you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\nyou have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\n- the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.\nthe person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-(long-stay-activity)-visa-(sublass-401)#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-(long-stay-activity)-visa-(sublass-401)#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:37:00.166973",
  "metadata": {}
}