{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942",
  "title": "Crew Travel Authority",
  "raw_text": "===== main placeholder ========================================== Crew Travel Authority This Authority is for international airline crew who don't have an Australian or New Zealand passport, or a valid Australian visa who travel to and from Australia as they work. Overview About this authority Eligibility Step by step When you have this authority Overview About this authority Eligibility Step by step When you have this authority Overview Stay International airline crew members and safety inspectors - up to 30 days as holder of a special purpose visa Airline positioning crew members - up to 5 days as holder of a special purpose visa Cost Free Processing times There are no processing times available for this visa. With this travel authority, you can... travel to Australia as part of your work as an international airline crew member or safety inspector as holder of a special purpose visa stay in Australia for up to 30 days if you are an airline crew member or safety inspector as holder of a special purpose visa stay in Australia for up to 5 days if you are a positioning crew member as holder of a special purpose visa The CTA registration is valid for the life of the passport based on the passport expiry date See all conditions Check your eligibility You must: be registered as crew by your air carrier be travelling on a commercial or chartered passenger flight, freight or cargo flight as an airline crew member, airline positioning crew member or aircraft safety inspector About this authority About this authority Private flight operators With this travel authority you can How long you can stay New Zealand passport holders Stay longer Cost Obligations Travel Visa label Include family About this authority Under the Special Purpose visa framework, a Crew Travel Authority (subclass 942) is an electronic immigration record. Commercial airlines register crew members for Crew Travel Authorities to aid uplift. The registration is valid for the life of the passport. Commercial airlines can use the Carrier Portal to check that their international aircrew can legally enter Australia. International airline flights include: commercial passenger flights or chartered passenger flights or freight or cargo flights Crew members with Australian or New Zealand passports do not need Crew Travel Authorities. If you are a New Zealand citizen further information regarding your entry requirements, entitlements and pathway to permanent residence and citizenship can be found at the New Zealand citizens webpage. Private flight operators People operating private flights can't register for, or use a Crew Travel Authority (subclass 942) to enter Australia. The flight must be a commercial or chartered flight carrying passengers or cargo. To see what other visas you might be eligible for use the Visa Finder With this travel authority you can visit Australia as part of your work as an international airline crew member or aircraft safety inspector who is employed by a foreign government arrive as a passenger (as an airline positioning crew member) on a commercial aircraft to move an international aircraft from Australia arrive in Australia as an aircraft safety inspector, if you hold a valid government identity document showing you are employed by a foreign government, or if you hold an International Civil Aviation Organization (ICAO) Safety Inspector Certificate How long you can stay If you are an international airline crew member or aircraft safety inspector, you can stay in Australia for up to 30 days. If you are an airline positioning crew member, you can stay in Australia for up to 5 days. New Zealand passport holders If you are a New Zealand citizen crew member who arrives in Australia and do not hold another visa (such as a permanent residence visa) and you wish to remain in Australia longer than the above periods, you should not enter Australia via SmartGate. Instead, you should approach a border clearance officer and make an application to be granted a Special Category visa (subclass 444) by: completing an incoming passenger card and presenting your New Zealand passport The SCV will allow you to live, visit, work and study in Australia. When you leave Australia, your SCV will end. Next time you enter Australia, you will apply for a new SCV. Entering Australia on a Special Purpose visa as a crew member rather than an SCV may impact your status as a resident for social security purposes. If you apply for the SCV after you arrive in Australia, you will need to apply online and attend an appointment. For further information see New Zealand citizens Stay longer You can't stay in Australia as the holder of a Special Purpose visa longer than allowed. You must apply for another type of visa if you want to stay longer. Cost Free Obligations You must obey Australian laws. You cannot use a Crew Travel Authority to: travel as a passenger to Australia, unless you are an airline positioning crew member or work on more than one domestic leg in Australia, this domestic leg must be part of an international arrival or departure flight Travel You can travel outside Australia and return as many times as you want when working as an airline aircrew member or as an airline safety inspector, while the Crew Travel Authority is valid. The time you spend outside Australia does not extend the Crew Travel Authority. The Crew Travel Authority registration is valid for the life of your passport and is based on your passport expiry date. Visa label We will digitally link your Crew Travel Authority to your passport. You will not get a label in your passport. Include family You can't include family on this travel authority. Eligibility Be an airline crew member, positioning crew or aircraft safety inspector on an eligible international airline flight Details You must be travelling on an international airline flight that is a: commercial passenger flight, or chartered passenger flight, or freight or cargo flight You must also be: an airline crew member who: is employed by an international air carrier as aircrew travels to Australia as part of your job as aircrew will leave Australia by air as part of your job or as a passenger or an airline positioning crew member who: is employed by an international air carrier as aircrew travels to Australia as an air passenger as part of your job will leave Australia as aircrew or an aircraft safety inspector who: is employed by a foreign government to inspect the safety procedures of international air carriers or the safety of aircraft travels to Australia by air as part of your job will leave Australia by air as part of your job or as a passenger Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply Air carriers usually register crew members for Crew Travel Authorities. If you plan to renew your passport, you need to do so before your carrier registers you for a Crew Travel Authority (CTA). Show steps Check your passport Your CTA is linked to your passport number. You need to use the same passport to travel to Australia. Step 2 Gather your documents You will need: a valid passport or other travel document a valid Airline Identity Card or ICAO Safety Inspector Certificate See the documents you will need to show when you arrive in Australia. You are obliged to prove your identity and provide true information with your application Show steps Aircraft safety inspectors We will grant Aircraft safety inspectors a Special Purpose visa for 30 days, beginning when they disembark from the aircraft, provided they hold: a valid passport, and a valid government identity document showing that they are employed by a foreign government, or an International Civil Aviation Organization (ICAO) Safety Inspector Certificate You must also be included in a list of crew members given to us by or for the carrier that operates the aircraft. See how Air crew documents We will grant Airline crew members a Special Purpose visa for 30 days, beginning when they disembark from the aircraft, provided they hold: a valid passport a valid Airline Identity Card They must also be included in a list of crew members provided to us by or for the carrier that operates the aircraft. Crew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier. See how Air positioning crew documents Airline positioning crew members are automatically granted a Special Purpose visa for 5 days, beginning when they disembark from the aircraft, provided they hold a valid passport. They must also have a letter from their employer that: certifies that they are an aircrew member sets out the purpose of their travel details the arrangements for them to leave Australia See how Step 3 Register for the Authority online Carriers can register crew members through Carrier Portal . They can also check whether crew members hold valid Crew Travel Authorities. Carriers that do not have access to the Carrier Portal can register crew for Crew Travel Authorities by emailing appinfringements@abf.gov.au Step 4 After you register The airline carrier will be notified immediately if your registration is successful. See what you can and must do after you are registered. Show steps Stay lawful You must obey all Australian laws while in Australia. Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport you want to withdraw your application See how to tell us if your situation changes For any other issues, email appwebsite@abf.gov.au When you have this authority Going to Australia In Australia Leaving Australia Going to Australia Before you leave Check your travel documents You must have a valid: Crew Travel Authority to enter Australia passport or other travel document Airline Identity Card or ICAO Safety Inspector Certificate At the border After registering for a Crew Travel Authority, you must also show other documents when you arrive in Australia. Airline crew members We will grant Airline crew members a Special Purpose visa for 30 days, beginning from their arrival in Australia, provided they: hold a valid passport or other travel document hold a valid Airline Identity Card and are included on the crew list provided to the Australian Border Force by or for the carrier that operates the aircraft. Crew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier. Airline positioning crew Airline positioning crew members are automatically granted a Special Purpose visa for 5 days, beginning from their arrival in Australia, provided they hold a valid passport or other travel document. They must also have a letter from their employer that: certifies that they are an airline crew member sets out the purpose of their travel details the arrangements for them to leave Australia Aircraft safety inspectors We will grant Aircraft safety inspectors a Special Purpose visa for 30 days, beginning from their arrival in Australia, provided they: hold a valid passport or other travel document hold a valid government identity document showing that they are employed by a foreign government as an airline safety inspector an International Civil Aviation Organization (ICAO) Safety Inspector Certificate and are included in a list of crew members given to the Australian Border Force by or for the carrier that operates the aircraft. In Australia Staying longer You can't stay in Australia longer by extending this travel authority. You must apply for another visa if you want to stay longer. Proving you have a valid Crew Travel Authority Airline carriers and Australian border officials can use the Advance Passenger Processing system to check whether crew members hold valid Crew Travel Authorities. Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. At the Border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave International Movement Record To prove you have been to Australia, request your international movement records",
  "main_content": "===== main placeholder ==========================================\n\n# Crew Travel Authority\n\nCrew Travel Authority\n\nThis Authority is for international airline crew who don't have an Australian or New Zealand passport, or a valid Australian visa who travel to and from Australia as they work.\n\nThis Authority is for international airline crew who don't have an Australian or New Zealand passport, or a valid Australian visa who travel to and from Australia as they work.\n\nThis Authority is for international airline crew who don't have an Australian or New Zealand passport, or a valid Australian visa who travel to and from Australia as they work.\n- Overview\nOverview\n- About this authority\nAbout this authority\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this authority\nWhen you have this authority\nOverview\nAbout this authority\nEligibility\nStep by step\nWhen you have this authority\nOverview\n\n#### Stay\n\nStay\n- International airline crew members and safety inspectors - up to 30 days as holder of a special purpose visa\nInternational airline crew members and safety inspectors - up to 30 days as holder of a special purpose visa\n- Airline positioning crew members - up to 5 days as holder of a special purpose visa\nAirline positioning crew members - up to 5 days as holder of a special purpose visa\n\n#### Cost\n\nCost\n\nFree\n\nFree\n\n#### Processing times\n\nProcessing times\n\nThere are no processing times available for this visa.\n\nThere are no processing times available for this visa.\n\n#### With this travel authority, you can...\n\nWith this travel authority, you can...\n- travel to Australia as part of your work as an international airline crew member or safety inspector as holder of a special purpose visa\ntravel to Australia as part of your work as an international airline crew member or safety inspector as holder of a special purpose visa\n- stay in Australia for up to 30 days if you are an airline crew member or safety inspector as holder of a special purpose visa\nstay in Australia for up to 30 days if you are an airline crew member or safety inspector as holder of a special purpose visa\n- stay in Australia for up to 5 days if you are a positioning crew member as holder of a special purpose visa\nstay in Australia for up to 5 days if you are a positioning crew member as holder of a special purpose visa\n- The CTA registration is valid for the life of the passport based on the passport expiry date\nThe CTA registration is valid for the life of the passport based on the passport expiry date\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must:\n\nYou must:\n- be registered as crew by your air carrier\nbe registered as crew by your air carrier\n- be travelling on a commercial or chartered passenger flight, freight or cargo flight as an airline crew member, airline positioning crew member or aircraft safety inspector\nbe travelling on a commercial or chartered passenger flight, freight or cargo flight as an airline crew member, airline positioning crew member or aircraft safety inspector\nAbout this authority\nAbout this authority\nPrivate flight operators\nWith this travel authority you can\nHow long you can stay\nNew Zealand passport holders\nStay longer\nCost\nObligations\nTravel\nVisa label\nInclude family\n\n## About this authority\n\nAbout this authority\n\nUnder the Special Purpose visa framework, a Crew Travel Authority (subclass 942) is an electronic immigration record. Commercial airlines register crew members for Crew Travel Authorities to aid uplift. The registration is valid for the life of the passport. Commercial airlines can use theCarrier Portalto check that their international aircrew can legally enter Australia.\n\nUnder the Special Purpose visa framework, a Crew Travel Authority (subclass 942) is an electronic immigration record. Commercial airlines register crew members for Crew Travel Authorities to aid uplift. The registration is valid for the life of the passport. Commercial airlines can use the\nCarrier Portal\nto check that their international aircrew can legally enter Australia.\n\nInternational airline flights include:\n\nInternational airline flights include:\n- commercial passenger flights or\ncommercial passenger flights or\n- chartered passenger flights or\nchartered passenger flights or\n- freight or cargo flights\nfreight or cargo flights\n\nCrew members with Australian or New Zealand passports do not need Crew Travel Authorities.\n\nCrew members with Australian or New Zealand passports do not need Crew Travel Authorities.\n\nIf you are a New Zealand citizen further information regarding your entry requirements, entitlements and pathway to permanent residence and citizenship can be found at theNew Zealand citizenswebpage.\n\nIf you are a New Zealand citizen further information regarding your entry requirements, entitlements and pathway to permanent residence and citizenship can be found at the\nNew Zealand citizens\nwebpage.\n\n## Private flight operators\n\nPrivate flight operators\n\nPeople operating private flights can't register for, or use a Crew Travel Authority (subclass 942) to enter Australia. The flight must be a commercial or chartered flight carrying passengers or cargo.\n\nPeople operating private flights can't register for, or use a Crew Travel Authority (subclass 942) to enter Australia. The flight must be a commercial or chartered flight carrying passengers or cargo.\n\nTo see what other visas you might be eligible for use theVisa Finder.\n\nTo see what other visas you might be eligible for use the\nVisa Finder\n.\n\n## With this travel authority you can\n\nWith this travel authority you can\n- visit Australia as part of your work as an international airline crew member or aircraft safety inspector who is employed by a foreign government\nvisit Australia as part of your work as an international airline crew member or aircraft safety inspector who is employed by a foreign government\n- arrive as a passenger (as an airline positioning crew member) on a commercial aircraft to move an international aircraft from Australia\narrive as a passenger (as an airline positioning crew member) on a commercial aircraft to move an international aircraft from Australia\n- arrive in Australia as an aircraft safety inspector, if you hold a valid government identity document showing you are employed by a foreign government, or if you hold an International Civil Aviation Organization (ICAO) Safety Inspector Certificate\narrive in Australia as an aircraft safety inspector, if you hold a valid government identity document showing you are employed by a foreign government, or if you hold an International Civil Aviation Organization (ICAO) Safety Inspector Certificate\n\n## How long you can stay\n\nHow long you can stay\n\nIf you are an international airline crew member or aircraft safety inspector, you can stay in Australia for up to 30 days.\n\nIf you are an international airline crew member or aircraft safety inspector, you can stay in Australia for up to 30 days.\n\nIf you are an airline positioning crew member, you can stay in Australia for up to 5 days.\n\nIf you are an airline positioning crew member, you can stay in Australia for up to 5 days.\n\n## New Zealand passport holders\n\nNew Zealand passport holders\n\nIf you are a New Zealand citizen crew member who arrives in Australia and do not hold another visa (such as a permanent residence visa) and you wish to remain in Australia longer than the above periods, you should not enter Australia via SmartGate. Instead, you should approach a border clearance officer and make an application to be granted aSpecial Category visa (subclass 444)by:\n\nIf you are a New Zealand citizen crew member who arrives in Australia and do not hold another visa (such as a permanent residence visa) and you wish to remain in Australia longer than the above periods, you should not enter Australia via SmartGate. Instead, you should approach a border clearance officer and make an application to be granted a\nSpecial Category visa (subclass 444)\nby:\n- completing an incoming passenger card and\ncompleting an incoming passenger card and\n- presenting your New Zealand passport\npresenting your New Zealand passport\n\nTheSCVwill allow you to live, visit, work and study in Australia.\n\nThe\nSCV\nwill allow you to live, visit, work and study in Australia.\n\nWhen you leave Australia, your SCV will end. Next time you enter Australia, you will apply for a new SCV.\n\nWhen you leave Australia, your SCV will end. Next time you enter Australia, you will apply for a new SCV.\n\nEntering Australia on aSpecial Purpose visaas a crew member rather than an SCV may impact your status as a resident for social security purposes.\n\nEntering Australia on a\nSpecial Purpose visa\nas a crew member rather than an SCV may impact your status as a resident for social security purposes.\n\nIf you apply for the SCV after you arrive in Australia, you will need to apply online and attend an appointment. For further information seeNew Zealand citizens\n\nIf you apply for the SCV after you arrive in Australia, you will need to apply online and attend an appointment. For further information see\nNew Zealand citizens\n\n## Stay longer\n\nStay longer\n\nYou can't stay in Australia as the holder of aSpecial Purpose visalonger than allowed. You must apply for another type of visa if you want to stay longer.\n\nYou can't stay in Australia as the holder of a\nSpecial Purpose visa\nlonger than allowed. You must apply for another type of visa if you want to stay longer.\n\n## Cost\n\nCost\n\nFree\n\nFree\n\n## Obligations\n\nObligations\n\nYou must obey Australian laws. You cannot use a Crew Travel Authority to:\n\nYou must obey Australian laws. You cannot use a Crew Travel Authority to:\n- travel as a passenger to Australia, unless you are an airline positioning crew member or\ntravel as a passenger to Australia, unless you are an airline positioning crew member or\n- work on more than one domestic leg in Australia, this domestic leg must be part of an international arrival or departure flight\nwork on more than one domestic leg in Australia, this domestic leg must be part of an international arrival or departure flight\n\n## Travel\n\nTravel\n\nYou can travel outside Australia and return as many times as you want when working as an airline aircrew member or as an airline safety inspector, while the Crew Travel Authority is valid.\n\nYou can travel outside Australia and return as many times as you want when working as an airline aircrew member or as an airline safety inspector, while the Crew Travel Authority is valid.\n\nThe time you spend outside Australia does not extend the Crew Travel Authority.\n\nThe time you spend outside Australia does not extend the Crew Travel Authority.\n\nThe Crew Travel Authority registration is valid for the life of your passport and is based on your passport expiry date.\n\nThe Crew Travel Authority registration is valid for the life of your passport and is based on your passport expiry date.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your Crew Travel Authority to your passport. You will not get a label in your passport.\n\nWe will digitally link your Crew Travel Authority to your passport. You will not get a label in your passport.\n\n## Include family\n\nInclude family\n\nYou can't include family on this travel authority.\n\nYou can't include family on this travel authority.\nEligibility\n\n## Be an airline crew member, positioning crew or aircraft safety inspector on an eligible international airline flight\n\nBe an airline crew member, positioning crew or aircraft safety inspector on an eligible international airline flight\nDetails\n\nYou must be travelling on an international airline flight that is a:\n\nYou must be travelling on an international airline flight that is a:\n- commercial passenger flight, or\ncommercial passenger flight, or\n- chartered passenger flight, or\nchartered passenger flight, or\n- freight or cargo flight\nfreight or cargo flight\n\nYou must also be:\n\nYou must also be:\n- anairline crew memberwho:is employed by an international air carrier as aircrewtravels to Australia as part of your job as aircrewwill leave Australia by air as part of your job or as a passengeror\nan\nairline crew member\nwho:\n- is employed by an international air carrier as aircrew\nis employed by an international air carrier as aircrew\n- travels to Australia as part of your job as aircrew\ntravels to Australia as part of your job as aircrew\n- will leave Australia by air as part of your job or as a passenger\nwill leave Australia by air as part of your job or as a passenger\nor\n- anairline positioning crew memberwho:is employed by an international air carrier as aircrewtravels to Australia as an air passenger as part of your jobwill leave Australia as aircrewor\nan\nairline positioning crew member\nwho:\n- is employed by an international air carrier as aircrew\nis employed by an international air carrier as aircrew\n- travels to Australia as an air passenger as part of your job\ntravels to Australia as an air passenger as part of your job\n- will leave Australia as aircrew\nwill leave Australia as aircrew\nor\n- anaircraft safety inspectorwho:is employed by a foreign government to inspect the safety procedures of international air carriers or the safety of aircrafttravels to Australia by air as part of your jobwill leave Australia by air as part of your job or as a passenger\nan\naircraft safety inspector\nwho:\n- is employed by a foreign government to inspect the safety procedures of international air carriers or the safety of aircraft\nis employed by a foreign government to inspect the safety procedures of international air carriers or the safety of aircraft\n- travels to Australia by air as part of your job\ntravels to Australia by air as part of your job\n- will leave Australia by air as part of your job or as a passenger\nwill leave Australia by air as part of your job or as a passenger\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nAir carriers usually register crew members for Crew Travel Authorities. If you plan to renew your passport, you need to do so before your carrier registers you for a Crew Travel Authority (CTA).\n\nAir carriers usually register crew members for Crew Travel Authorities. If you plan to renew your passport, you need to do so before your carrier registers you for a Crew Travel Authority (CTA).\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nYour CTA is linked to your passport number. You need to use the same passport to travel to Australia.\n\nYour CTA is linked to your passport number. You need to use the same passport to travel to Australia.\n\nStep 2\n\nStep 2\nGather your documents\n\nYou will need:\n\nYou will need:\n- a valid passport or other travel document\na valid passport or other travel document\n- a valid Airline Identity Card or ICAO Safety Inspector Certificate\na valid Airline Identity Card or ICAO Safety Inspector Certificate\n\nSee the documents you will need to show when you arrive in Australia.\n\nSee the documents you will need to show when you arrive in Australia.\n\nYou are obliged toprove your identity and provide true information with your application.\n\nYou are obliged to\nprove your identity and provide true information with your application\n.\nShow\n                    steps\n\n#### Aircraft safety inspectors\n\nAircraft safety inspectors\n\nWe will grant Aircraft safety inspectors aSpecial Purpose visafor 30 days, beginning when they disembark from the aircraft, provided they hold:\n\nWe will grant Aircraft safety inspectors a\nSpecial Purpose visa\nfor 30 days, beginning when they disembark from the aircraft, provided they hold:\n- a valid passport, and\na valid passport, and\n- a valid government identity document showing that they are employed by a foreign government, or\na valid government identity document showing that they are employed by a foreign government, or\n- an International Civil Aviation Organization (ICAO) Safety Inspector Certificate\nan International Civil Aviation Organization (ICAO) Safety Inspector Certificate\n\nYou must also be included in a list of crew members given to us by or for the carrier that operates the aircraft.\n\nYou must also be included in a list of crew members given to us by or for the carrier that operates the aircraft.\nSee how\n\n#### Air crew documents\n\nAir crew documents\n\nWe will grant Airline crew members aSpecial Purpose visafor 30 days, beginning when they disembark from the aircraft, provided they hold:\n\nWe will grant Airline crew members a\nSpecial Purpose visa\nfor 30 days, beginning when they disembark from the aircraft, provided they hold:\n- a valid passport\na valid passport\n- a valid Airline Identity Card\na valid Airline Identity Card\n\nThey must also be included in a list of crew members provided to us by or for the carrier that operates the aircraft.\n\nThey must also be included in a list of crew members provided to us by or for the carrier that operates the aircraft.\n\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\n\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\nSee how\n\n#### Air positioning crew documents\n\nAir positioning crew documents\n\nAirline positioning crew members are automatically granted aSpecial Purpose visafor 5 days, beginning when they disembark from the aircraft, provided they hold a valid passport.\n\nAirline positioning crew members are automatically granted a\nSpecial Purpose visa\nfor 5 days, beginning when they disembark from the aircraft, provided they hold a valid passport.\n\nThey must also have a letter from their employer that:\n\nThey must also have a letter from their employer that:\n- certifies that they are an aircrew member\ncertifies that they are an aircrew member\n- sets out the purpose of their travel\nsets out the purpose of their travel\n- details the arrangements for them to leave Australia\ndetails the arrangements for them to leave Australia\nSee how\n\nStep 3\n\nStep 3\nRegister for the Authority online\n\nCarriers can register crew members throughCarrier Portal. They can also check whether crew members hold valid Crew Travel Authorities.\n\nCarriers can register crew members through\nCarrier Portal\n. They can also check whether crew members hold valid Crew Travel Authorities.\n\nCarriers that do not have access to the Carrier Portal can register crew for Crew Travel Authorities by emailingappinfringements@abf.gov.au\n\nCarriers that do not have access to the Carrier Portal can register crew for Crew Travel Authorities by emailing\nappinfringements@abf.gov.au\n\nStep 4\n\nStep 4\nAfter you register\n\nThe airline carrier will be notified immediately if your registration is successful. See what you can and must do after you are registered.\n\nThe airline carrier will be notified immediately if your registration is successful. See what you can and must do after you are registered.\nShow\n                    steps\n\n#### Stay lawful\n\nStay lawful\n\nYou must obey all Australian laws while in Australia.\n\nYou must obey all Australian laws while in Australia.\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- you want to withdraw your application\nyou want to withdraw your application\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\n\nFor any other issues, emailappwebsite@abf.gov.au\n\nFor any other issues, email\nappwebsite@abf.gov.au\nWhen you have this authority\nGoing to Australia\nIn Australia\nLeaving Australia\n\n## Going to Australia\n\nGoing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid:\n\nYou must have a valid:\n- Crew Travel Authority to enter Australia\nCrew Travel Authority to enter Australia\n- passport or other travel document\npassport or other travel document\n- Airline Identity Card or ICAO Safety Inspector Certificate\nAirline Identity Card or ICAO Safety Inspector Certificate\n\n### At the border\n\nAt the border\n\nAfter registering for a Crew Travel Authority, you must also show other documents when you arrive in Australia.\n\nAfter registering for a Crew Travel Authority, you must also show other documents when you arrive in Australia.\n\n#### Airline crew members\n\nAirline crew members\n\nWe will grant Airline crew members aSpecial Purpose visafor 30 days, beginning from their arrival in Australia, provided they:\n\nWe will grant Airline crew members a\nSpecial Purpose visa\nfor 30 days, beginning from their arrival in Australia, provided they:\n- hold a valid passport or other travel document\nhold a valid passport or other travel document\n- hold a valid Airline Identity Card and\nhold a valid Airline Identity Card and\n- are included on the crew list provided to the Australian Border Force by or for the carrier that operates the aircraft.\nare included on the crew list provided to the Australian Border Force by or for the carrier that operates the aircraft.\n\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\n\nCrew members on freight flights should also be listed on the General Declaration Form signed on behalf of the air carrier.\n\n#### Airline positioning crew\n\nAirline positioning crew\n\nAirline positioning crew members are automatically granted aSpecial Purpose visafor 5 days, beginning from their arrival in Australia, provided they hold a valid passport or other travel document.\n\nAirline positioning crew members are automatically granted a\nSpecial Purpose visa\nfor 5 days, beginning from their arrival in Australia, provided they hold a valid passport or other travel document.\n\nThey must also have a letter from their employer that:\n\nThey must also have a letter from their employer that:\n- certifies that they are an airline crew member\ncertifies that they are an airline crew member\n- sets out the purpose of their travel\nsets out the purpose of their travel\n- details the arrangements for them to leave Australia\ndetails the arrangements for them to leave Australia\n\n#### Aircraft safety inspectors\n\nAircraft safety inspectors\n\nWe will grant Aircraft safety inspectors aSpecial Purpose visafor 30 days, beginning from their arrival in Australia, provided they:\n\nWe will grant Aircraft safety inspectors a\nSpecial Purpose visa\nfor 30 days, beginning from their arrival in Australia, provided they:\n- hold a valid passport or other travel document\nhold a valid passport or other travel document\n- hold a valid government identity document showing that they are employed by a foreign government as an airline safety inspector\nhold a valid government identity document showing that they are employed by a foreign government as an airline safety inspector\n- an International Civil Aviation Organization (ICAO) Safety Inspector Certificate and\nan International Civil Aviation Organization (ICAO) Safety Inspector Certificate and\n- are included in a list of crew members given to the Australian Border Force by or for the carrier that operates the aircraft.\nare included in a list of crew members given to the Australian Border Force by or for the carrier that operates the aircraft.\n\n## In Australia\n\nIn Australia\n\n### Staying longer\n\nStaying longer\n\nYou can't stay in Australia longer by extending this travel authority. You must apply for another visa if you want to stay longer.\n\nYou can't stay in Australia longer by extending this travel authority. You must apply for another visa if you want to stay longer.\n\n### Proving you have a valid Crew Travel Authority\n\nProving you have a valid Crew Travel Authority\n\nAirline carriers and Australian border officials can use the Advance Passenger Processing system to check whether crew members hold valid Crew Travel Authorities.\n\nAirline carriers and Australian border officials can use the Advance Passenger Processing system to check whether crew members hold valid Crew Travel Authorities.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n### At the Border\n\nAt the Border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### International Movement Record\n\nInternational Movement Record\n\nTo prove you have been to Australia, request yourinternational movement records.\n\nTo prove you have been to Australia, request your\ninternational movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:19:54.459318",
  "metadata": {}
}