{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas",
  "title": "Changing visas",
  "raw_text": "===== main placeholder ========================================== Getting a visa Changing visas Page Content ​​ Overview Understanding visa conditions Remain lawful on a bridging visa Expression of Interest Working on a bridging visa Overview If you want to apply for another visa when you are in Australia you should apply before your visa expires. Find out more about staying longer or options if your visa is expiring Understanding visa conditions You can't apply for a new visa in Australia if your visa has a condition that prevents further stay. You can check your conditions in VEVO In some situations, you can ask us to waive the condition Remain lawful on a bridging visa If you apply for a new visa before your current Substantive visa expires we will usually grant you a Bridging visa A (BVA) or alternative bridging visa. In most cases you apply for the bridging visa automatically as part of applying for a visa. Your bridging visa lets you stay in Australia when: your current Substantive visa expires, and we have not made a decision on your new visa application The bridging visa comes into effect when your current Substantive visa expires. You need to comply with the conditions of your current visa until the bridging visa comes into effect. Cancelling your current visa will not bring your bridging visa into effect. This will cancel your bridging visa and you will be in Australia unlawfully. Expression of Interest Some skilled visas require you to submit an Expression of Interest (EOI) An EOI is not a visa application and you will not be granted a Bridging visa by submitting an EOI. Your eligibility for a Bridging visa would only be considered once a valid visa application is lodged. If you are in Australia and the visa you hold is about to expire before you are invited and able to apply for a skilled visa, you will need to apply for another visa to remain in Australia. If you do not meet the requirements for the grant of another visa, you will need to depart Australia before your visa expires. Explore your visa options Working on a bridging visa You might be allowed to work in Australia depending on the visa conditions that apply to your Bridging Visa A (BVA). Your grant letter will tell you about these conditions. See if you have work restrictions in VEVO If your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship. We will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work restriction condition that was on your previous BVA. You can't be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either: your current BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application or you have applied for a protection visa Protection visa applicants who are applying for a bridging visa on the basis of judicial review and who currently hold the condition 8101 are not able to apply for work rights.",
  "main_content": "===== main placeholder ==========================================\nGetting a visa\n\n# Changing visas\n\nChanging visas\nPage Content\n\n​​\n\n​​\nOverview\nUnderstanding visa conditions\nRemain lawful on a bridging visa\nExpression of Interest\nWorking on a bridging visa\n\n## Overview\n\nOverview\n\nIf you want to apply for another visa when you are in Australia you should apply before your visa expires.\n\nIf you want to apply for another visa when you are in Australia you should apply before your visa expires.\n\nFind out more aboutstaying longeroroptions if your visa is expiring.\n\nFind out more about\nstaying longer\nor\noptions if your visa is expiring\n.\n\n## Understanding visa conditions\n\nUnderstanding visa conditions\n\nYou can't apply for a new visa in Australia if your visa has aconditionthat prevents further stay.\n\nYou can't apply for a new visa in Australia if your visa has a\ncondition\nthat prevents further stay.\n\nYou can check your conditions inVEVO.\n\nYou can check your conditions in\nVEVO\n.\n\nIn some situations, you can ask us towaive the condition.\n\nIn some situations, you can ask us to\nwaive the condition\n.\n\n## Remain lawful on a bridging visa\n\nRemain lawful on a bridging visa\n\nIf you apply for a new visa before your currentSubstantive visaexpires we will usually grant you aBridging visa A (BVA)or alternative bridging visa.\n\nIf you apply for a new visa before your current\nSubstantive visa\nexpires we will usually grant you a\nBridging visa A (BVA)\nor alternative bridging visa.\n\nIn most cases you apply for the bridging visa automatically as part of applying for a visa.\n\nIn most cases you apply for the bridging visa automatically as part of applying for a visa.\n\nYour bridging visa lets you stay in Australia when:\n\nYour bridging visa lets you stay in Australia when:\n- your currentSubstantive visaexpires, and\nyour current\nSubstantive visa\nexpires, and\n- we have not made a decision on your new visa application\nwe have not made a decision on your new visa application\n\nThe bridging visa comes into effect when your currentSubstantive visaexpires. You need to comply with the conditions of your current visa until the bridging visa comes into effect.\n\nThe bridging visa comes into effect when your current\nSubstantive visa\nexpires. You need to comply with the conditions of your current visa until the bridging visa comes into effect.\n\nCancelling your current visawill not bring your bridging visa into effect. This will cancel your bridging visa and you will be in Australia unlawfully.\n\nCancelling your current visa\nwill not bring your bridging visa into effect. This will cancel your bridging visa and you will be in Australia unlawfully.\n\n## Expression of Interest\n\nExpression of Interest\n\nSome skilled visas require you tosubmit an Expression of Interest (EOI).\n\nSome skilled visas require you to\nsubmit an Expression of Interest (EOI)\n.\n\nAn EOI is not a visa application and you will not be granted a Bridging visa by submitting an EOI. Your eligibility for a Bridging visa would only be considered once a valid visa application is lodged.\n\nAn EOI is not a visa application and you will not be granted a Bridging visa by submitting an EOI. Your eligibility for a Bridging visa would only be considered once a valid visa application is lodged.\n\nIf you are in Australia and the visa you hold is about to expire before you are invited and able to apply for a skilled visa, you will need to apply for another visa to remain in Australia.\n\nIf you are in Australia and the visa you hold is about to expire before you are invited and able to apply for a skilled visa, you will need to apply for another visa to remain in Australia.\n\nIf you do not meet the requirements for the grant of another visa, you will need to depart Australia before your visa expires.Explore your visa options.\n\nIf you do not meet the requirements for the grant of another visa, you will need to depart Australia before your visa expires.\nExplore your visa options\n.\n\n## Working on a bridging visa\n\nWorking on a bridging visa\n\nYou might be allowed to work in Australia depending on the visa conditions that apply to your Bridging Visa A (BVA). Your grant letter will tell you about these conditions. See if you have work restrictions inVEVO.\n\nYou might be allowed to work in Australia depending on the visa conditions that apply to your Bridging Visa A (BVA). Your grant letter will tell you about these conditions. See if you have work restrictions in\nVEVO\n.\n\nIf your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship.\n\nIf your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work restriction condition that was on your previous BVA.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work restriction condition that was on your previous BVA.\n\nYou can't be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either:\n\nYou can't be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either:\n- your current BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application or\nyour current BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application or\n- you have applied for a protection visa\nyou have applied for a protection visa\n\nProtection visa applicants who are applying for a bridging visa on the basis of judicial review and who currently hold the condition 8101 are not able to apply for work rights.\n\nProtection visa applicants who are applying for a bridging visa on the basis of judicial review and who currently hold the condition 8101 are not able to apply for work rights.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-finder",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-processing-times",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/fees-and-charges",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/check-twice-submit-once",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#content-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#content-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#content-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#content-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#content-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/moving-between-visas#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T14:59:29.481872",
  "metadata": {}
}