{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-487",
  "title": "Skilled — Regional Sponsored visa (subclass 487)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Skilled — Regional Sponsored visa (subclass 487) Page Content ​The Skilled – Regional Sponsored visa (subclass 487) closed to new applications on 1 January 2013. You might be able to apply for the Skilled – Regional (Provisional) (subclass 489) visa If you have applied for this visa but no visa decision has yet been made, you can add your dependent children to your application at any time until your visa is granted. If you are granted this visa and your eligible family members want to join you in Australia, they can apply for the Skilled – Regional (Provisional) (subclass 489) visa Visa applicants Details The Skilled – Regional Sponsored visa (subclass 487) is closed to new applications. This information is for people who have already applied for a Skilled – Regional Sponsored visa (subclass 487). Your family Details You can add your dependent children to your application at any time until a decision about the visa is made. You cannot add a spouse or other family members to this application. To add dependent children, you must notify us in writing. A fee is payable unless the family member is a newborn child. For newborn children, you can use: Form 1022 Notification of changes in circumstances (172KB PDF) - if there are other changes in your circumstances. For other dependent children, use: Form 1436 Adding an additional applicant after lodgement (481KB PDF) Lodge these forms by ImmiAccount, or by mail or courier at the Adelaide office in South Australia - attention Adelaide General Skilled Migration. If you have added a dependent child who is older than 18 years of age to your application, they might also need to provide evidence of their English language skills to determine whether they need to pay for the second instalment of the visa application charge. Points test If your partner lodged a combined application with you and they meet the threshold requirements for a skilled migration visa, we might use this evidence to award you points in the Points test. After you have applied Details After you have lodged your application and documents, we will acknowledge that we have received your information. Wait for a decision Your application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete. Outside Australia: If you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. In Australia: If you apply for this visa in Australia, you could be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for Bridging visa B (BVB) to travel outside Australia while you wait for a decision. Provide more information You can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 - Notification of incorrect answer(s) (99KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. Report changes in your circumstances You must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family. Please report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms: Form 1446 - Withdrawal of a visa application (338KB PDF) — if you move to a new address or change your passport Form 1022 - Notification of changes in circumstances (172KB PDF) — if there are other changes in your circumstances. If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane. Withdrawing your application You can withdraw the application at any time before we grant or refuse to grant the visa, using the following form: Form 1446 - Withdrawal of a visa application (338KB PDF) Your request must include your full name and date of birth. You should also include the number we gave you when you applied, if you know it - this could be a file reference number, client ID, or a Transaction Reference Number. You can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number. All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal. Visa decision Details If the visa is granted, we will let you know: when you can use the visa the visa grant number any conditions attached to the visa. If the visa is not granted, we will let you know: why the visa was refused your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed the time limit for lodging an appeal. Visa holders Details How long your visa lasts Details This visa is valid until the date we told you on your grant letter. What this visa lets you do Details This visa lets you: remain in Australia in a Specified Regional Area in Australia while your visa is valid. bring your family with you to work or study in in a Specified Regional Area of Australia become eligible to apply for permanent residency Apply for permanent residency You might be eligible for permanent residency after you have: lived in a Specified Regional Area of Australia for two years worked for at least 12 months in a Specified Regional Area of Australia The Skilled – Regional visa (subclass 887) is specifically designed for holders of a provisional skilled visa who want to apply for permanent residency. Your obligations Details You and your family must comply with all visa conditions and Australian laws. If you were nominated for this visa by a state or territory government Details You must live, study and work in regional Australia or a low population growth metropolitan area. There could also be residential conditions specified by the state or territory government in your nomination. If you later apply for a permanent residence Skilled – Regional visa (subclass 887) , you will need to prove that you have spent the specified time in that area. If you were sponsored for this visa by a family member Details You must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area. Meeting these conditions Details If you do not comply with the conditions of your visa: your visa, and your family’s visa, could be cancelled you will not be able to apply for a similar visa while you are in Australia. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane. Sponsors Details How long the sponsorship lasts Details Your sponsorship period last for two years from the date the visa is granted. Sponsor responsibilities Details For two years from the date the visa is granted, you have agreed to: provide adequate accommodation and financial assistance to meet your relative's living needs provide other support, such as child care, to help your relatives attend English language classes give information and advice (including information about employment in Australia) to help your relatives settle in Australia.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Skilled — Regional Sponsored visa (subclass 487)\n\nSkilled — Regional Sponsored visa (subclass 487)\nPage Content\n\n​The Skilled – Regional Sponsored visa (subclass 487) closed to new applications on 1 January 2013. You might be able to apply for theSkilled – Regional (Provisional) (subclass 489) visa.\n\n​The Skilled – Regional Sponsored visa (subclass 487) closed to new applications on 1 January 2013. You might be able to apply for the\nSkilled – Regional (Provisional) (subclass 489) visa\n.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add your dependent children to your application at any time until your visa is granted.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add your dependent children to your application at any time until your visa is granted.\n\nIf you are granted this visa and your eligible family members want to join you in Australia, they can apply for theSkilled – Regional (Provisional) (subclass 489) visa.\n\nIf you are granted this visa and your eligible family members want to join you in Australia, they can apply for the\nSkilled – Regional (Provisional) (subclass 489) visa\n.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\nThe Skilled – Regional Sponsored visa (subclass 487) is closed to new applications.\n\nThe Skilled – Regional Sponsored visa (subclass 487) is closed to new applications.\n\nThis information is for people who have already applied for a Skilled – Regional Sponsored visa (subclass 487).\n\nThis information is for people who have already applied for a Skilled – Regional Sponsored visa (subclass 487).\n\n### Your family\n\nYour family\nDetails\n\nYou can add your dependent children to your application at any time until a decision about the visa is made. You cannot add a spouse or other family members to this application.\n\nYou can add your dependent children to your application at any time until a decision about the visa is made. You cannot add a spouse or other family members to this application.\n\nTo add dependent children, you must notify us in writing. A fee is payable unless the family member is a newborn child.\n\nTo add dependent children, you must notify us in writing. A fee is payable unless the family member is a newborn child.\n\nFor newborn children, you can use:\n\nFor newborn children, you can use:\n- Form 1022 Notification of changes in circumstances  (172KB PDF)- if there are other changes in your circumstances.\nForm 1022 Notification of changes in circumstances  (172KB PDF)\n- if there are other changes in your circumstances.\n\nFor other dependent children, use:\n\nFor other dependent children, use:\n- Form 1436 Adding an additional applicant after lodgement (481KB PDF)\nForm 1436 Adding an additional applicant after lodgement (481KB PDF)\n\nLodge these forms by ImmiAccount, or by mail or courier at theAdelaide officein South Australia - attention Adelaide General Skilled Migration.\n\nLodge these forms by ImmiAccount, or by mail or courier at the\nAdelaide office\nin South Australia - attention Adelaide General Skilled Migration.\n\nIf you have added a dependent child who is older than 18 years of age to your application, they might also need to provide evidence of their English language skills to determine whether they need to pay for the second instalment of the visa application charge.\n\nIf you have added a dependent child who is older than 18 years of age to your application, they might also need to provide evidence of their English language skills to determine whether they need to pay for the second instalment of the visa application charge.\n\nPoints test\n\nPoints test\n\nIf your partner lodged a combined application with you and they meet the threshold requirements for a skilled migration visa, we might use this evidence to award you points in the Points test.\n\nIf your partner lodged a combined application with you and they meet the threshold requirements for a skilled migration visa, we might use this evidence to award you points in the Points test.\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\n#### Wait for a decision\n\nWait for a decision\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nOutside Australia:If you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\n\nOutside Australia:\nIf you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa.\n\nIn Australia:If you apply for this visa in Australia, you could be able to get aBridging visathat allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply forBridging visa B (BVB)to travel outside Australia while you wait for a decision.\n\nIn Australia:\nIf you apply for this visa in Australia, you could be able to get a\nBridging visa\nthat allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for\nBridging visa B (BVB)\nto travel outside Australia while you wait for a decision.\n\n#### Provide more information\n\nProvide more information\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 - Notification of incorrect answer(s) (99KB PDF)\nForm 1023 - Notification of incorrect answer(s) (99KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\n#### Report changes in your circumstances\n\nReport changes in your circumstances\n\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\n\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth, divorce, separation, marriage, de facto relationship or death in your family.\n\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\n\nPlease report changes in your circumstances via ImmiAccount. If you are not able to use ImmiAccount, you can use the following forms:\n- Form 1446 - Withdrawal of a visa application  (338KB PDF)— if you move to a new address or change your passport\nForm 1446 - Withdrawal of a visa application  (338KB PDF)\n— if you move to a new address or change your passport\n- Form 1022 - Notification of changes in circumstances (172KB PDF)— if there are other changes in your circumstances.\nForm 1022 - Notification of changes in circumstances (172KB PDF)\n— if there are other changes in your circumstances.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\n#### Withdrawing your application\n\nWithdrawing your application\n\nYou can withdraw the application at any time before we grant or refuse to grant the visa, using the following form:\n\nYou can withdraw the application at any time before we grant or refuse to grant the visa, using the following form:\n- Form 1446 - Withdrawal of a visa application  (338KB PDF)\nForm 1446 - Withdrawal of a visa application  (338KB PDF)\n\nYour request must include your full name and date of birth. You should also include the number we gave you when you applied, if you know it - this could be a file reference number, client ID, or a Transaction Reference Number.\n\nYour request must include your full name and date of birth. You should also include the number we gave you when you applied, if you know it - this could be a file reference number, client ID, or a Transaction Reference Number.\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\nAll applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.\n\nAll applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will let you know:\n\nIf the visa is granted, we will let you know:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.\nany conditions attached to the visa.\n\nIf the visa is not granted, we will let you know:\n\nIf the visa is not granted, we will let you know:\n- why the visa was refused\nwhy the visa was refused\n- your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\nyour review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\n- the time limit for lodging an appeal.\nthe time limit for lodging an appeal.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis visa is valid until the date we told you on your grant letter.\n\nThis visa is valid until the date we told you on your grant letter.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa lets you:\n\nThis visa lets you:\n- remain in Australia in a Specified Regional Area in Australia while your visa is valid.\nremain in Australia in a Specified Regional Area in Australia while your visa is valid.\n- bring your family with you to work or study in in a Specified Regional Area of Australia\nbring your family with you to work or study in in a Specified Regional Area of Australia\n- become eligible to apply forpermanent residency.\nbecome eligible to apply for\npermanent residency\n.\n\n#### Apply for permanent residency\n\nApply for permanent residency\n\nYou might be eligible for permanent residency after you have:\n\nYou might be eligible for permanent residency after you have:\n- lived in a Specified Regional Area of Australia for two years\nlived in a Specified Regional Area of Australia for two years\n- worked for at least 12 months in a Specified Regional Area of Australia\nworked for at least 12 months in a Specified Regional Area of Australia\n\nTheSkilled – Regional visa (subclass 887)is specifically designed for holders of a provisional skilled visa who want to apply for permanent residency.\n\nThe\nSkilled – Regional visa (subclass 887)\nis specifically designed for holders of a provisional skilled visa who want to apply for permanent residency.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\n#### If you were nominated for this visa by a state or territory government\n\nIf you were nominated for this visa by a state or territory government\nDetails\n\nYou must live, study and work in regional Australia or a low population growth metropolitan area. There could also be residential conditions specified by the state or territory government in your nomination.\n\nYou must live, study and work in regional Australia or a low population growth metropolitan area. There could also be residential conditions specified by the state or territory government in your nomination.\n\nIf you later apply for a permanent residenceSkilled – Regional visa (subclass 887), you will need to prove that you have spent the specified time in that area.\n\nIf you later apply for a permanent residence\nSkilled – Regional visa (subclass 887)\n, you will need to prove that you have spent the specified time in that area.\n\n#### If you were sponsored for this visa by a family member\n\nIf you were sponsored for this visa by a family member\nDetails\n\nYou must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area.\n\nYou must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area.\n\n#### Meeting these conditions\n\nMeeting these conditions\nDetails\n\nIf you do not comply with the conditions of your visa:\n\nIf you do not comply with the conditions of your visa:\n- your visa, and your family’s visa, could be cancelled\nyour visa, and your family’s visa, could be cancelled\n- you will not be able to apply for a similar visa while you are in Australia.\nyou will not be able to apply for a similar visa while you are in Australia.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\n## Sponsors\n\nSponsors\nDetails\n\n### How long the sponsorship lasts\n\nHow long the sponsorship lasts\nDetails\n\nYour sponsorship period last for two years from the date the visa is granted.\n\nYour sponsorship period last for two years from the date the visa is granted.\n\n### Sponsor responsibilities\n\nSponsor responsibilities\nDetails\n\nFor two years from the date the visa is granted, you have agreed to:\n\nFor two years from the date the visa is granted, you have agreed to:\n- provide adequate accommodation and financial assistance to meet your relative's living needs\nprovide adequate accommodation and financial assistance to meet your relative's living needs\n- provide other support, such as child care, to help your relatives attend English language classes\nprovide other support, such as child care, to help your relatives attend English language classes\n- give information and advice (including information about employment in Australia) to help your relatives settle in Australia.\ngive information and advice (including information about employment in Australia) to help your relatives settle in Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-487#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-487#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:33:57.354210",
  "metadata": {}
}