{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/investor-retirement-visa-subclass-405",
  "title": "Investor Retirement visa (subclass 405)",
  "raw_text": "===== main placeholder ========================================== This visa is closed to new applicants The Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018. Further details, including eligibility requirements, processing times and visa application charges can be found at Pathway to permanent residence for Retirees Investor Retirement visa (subclass 405) Page Content ​​​​​​​​​​​​​​​​Investor Retirement visa (subclass 405)​​. This temporary visa is for self-funded retirees who have no dependents and want to live in Australia during their retirement years. About this visa Details What this visa lets you do Details This is a temporary visa. It allows you to: work in Australia for up to 40 hours per fortnight travel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa have your partner (who has also been granted this visa) accompany you to Australia. Eligibility Details You can only apply for this visa if you are: an existing Investor Retirement visa (subclass 405) holder; or a former Investor Retirement visa (subclass 405) holder who has not held another substantive visa since last entering Australia. Cost Details From AUD505.00 There is a second visa application charge payable prior to the grant of the Investor Retirement visa (subclass 405). This charge is payable in respect of each person applying for the visa and must be paid prior to each grant (including each time the visa is renewed). You might have to pay more costs for: additional applicant 18 and over additional applicant under 18 Other costs You may have to pay other costs, such as: health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements. Sponsorship Details You must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites. New South Wales Northern Territory Queensland South Australia Tasmania Victoria Western Australia. Designated Investment Details A designated investment must be maintained for the duration of the Investor Retirement visa (subclass 405). The amount of the designated investment decreases by AUD250,000 the first time you reapply for the visa and then remains constant. If you reapply for your Investor Retirement visa (subclass 405) a designated investment of AUD500,000 must be made and maintained. If you live in regional Australia a designated investment of AUD250,000 must be maintained. Income Details You (or combined with your partner) must have access to a minimum net income of AUD65,000 per year. If you intend to live in regional Australia you (or combined with your partner) must have access to a minimum net income of AUD50,000 per year. This income test applies each time you apply for an Investor Retirement visa (subclass 405). If you choose to reapply for your visa you must show that your net income still meets this requirement. Health Details You must meet certain health requirements . The results of your health examinations are generally valid for 12 months. This applies to you and any dependent family members included in the application. You are able to organise your health examinations upfront before lodging a visa application. Character Details You must meet certain character requirements . If you are 16 years of age or older, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more, during the past 10 years, since you turned 16 years of age. Do not arrange for police certificates until we ask you to. ​Health insurance Details You must have evidence that you and your partner hold an adequate health insurance package for the period of your intended stay in Australia. For health insurance to be considered adequate, it must: be fully comprehensive provide coverage that is at least equivalent to Medicare (including coverage of 85 per cent of costs for hospital, emergency, and general practitioner services) provide coverage for pharmaceuticals. It is preferable that the policy is with an Australian insurer, however alternative arrangements that meet the above requirements can be accepted. Alternative arrangements, with an overseas insurer, will need individual detailed examination of the insurance policy and may result in processing delays. If you do not maintain adequate health insurance it may result in the refusal of future visa applications. Provide biometrics You might be asked to provide biometrics (a scientific form of identification) as part of the application. Compelling and Compassionate Details On 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Investor Retirement (subclass 405) visa applicants, in Australia, applying for a further subclass 405 visa, but cannot meet certain visa criteria. Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner. After you have lodged your application for a further subclass 405, the Department will give you an opportunity to provide more information if you cannot meet certain visa criteria. Debts to the Australian government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Visa applicants Details Your passport Details Usually, you and your partner need to have valid passports to be granted this visa. If you plan to get a new passport, you should do this before applying for your visa. If you get a new passport after you have lodged your application, give the details of your new passport to one of our offices Gather documents Details Applicant documents You need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application. Provide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations. Use this checklist to make sure your application is complete. Forms Form 1383 Application for a temporary visa for retirees (423KB PDF) Application for a temporary visa for retirees Form 1249 State/territory sponsorship Investor retirement visa (245KB PDF) State/territory sponsorship Investor retirement visa Charges Pay the visa application charge. Receiving assistance If someone gives you advice or lodges your application for you, that person completes: Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF) (the agent or exempt person completes the form and you must sign it) . If you would like someone to receive correspondence from us on your behalf, that person completes: Form 956A Appointment or withdrawal of an authorised recipient (the recipient completes the form and you must sign it) (301KB PDF) (the recipient completes the form and you must sign it). Your identity Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates). Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application. These photographs should be of the head and shoulders only against a plain background. Print the name of the person on the back of each photograph. Your relationships Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia. If you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names). Your health insurance Evidence that you and your partner (if applicable), hold an adequate health insurance package. Australian Values Statement An Australian Values Statement signed by everyone included in the application who has turned 18 at the time of the visa application. Your assets A one-page summary statement outlining the assets and liabilities on a single day in the three months preceding your application. You should identify which assets are to be used to: establish yourself in Australia fund the designated investment generate an annual income. Evidence of ownership and value of the assets included in your summary statement for at least two years preceding your application. For cash assets: bank statements, at least two years preceding your application and on a single day in the three months preceding your application. All bank statements must have the same date of issue. For real estate assets: overseas real estate evidence of ownership, such as title deeds evidence of value, such as valuation certificate by an accredited property valuer (valuations by real estate agents who are not accredited property valuers are generally not acceptable) mortgage statements (if applicable) showing balance of amount owed. real estate in Australia certified copy of approval letter for the purchase of real estate in Australia from the Foreign Investment Review Board (FIRB). For business assets: evidence of ownership and value, including business registration certificate or licence, evidence of share of ownership (this may include evidence of purchase, share registers/company registers/share transfer documents or historical company extracts), annual returns of directors and shareholders or partnership/trust/franchise agreements extracts from financial statements for your business, prepared by an independent accountant to International Accounting Standards, including balance sheet, profit and loss statement and notes to the accounts. Financial statements must be provided for two of the four fiscal years prior to application. Note : Letters from an independent accountant must be on company letterhead. Any letter prepared in plain paper will not be acceptable. For personal or business loans: loan agreements, loan statements indicating amount borrowed and repayment schedule, listed in business balance sheet (if loan is to / from a business). For stocks and bonds: share or bond registers, share / fixed interest securities / debentures certificates, transfer certificates, market value. Inheritance: probate or will. Superannuation: statement from superannuation fund managers. Pension: statement from government agency/pension fund stating amount of pension received and date that pension commenced. Other personal asset items: evidence of ownership and evidence of value, such as valuation certificate by an accredited valuer, for example antiques or jewellery. Prepare your documents Details You need to provide documents to prove the claims you make in your application. Some documents could take some time to obtain. You should have all the required documents ready when you lodge your application to reduce any delays in processing. Lodge your application Details You must complete the following application form: Form 1383 Application for temporary visa retirees (423KB PDF) - Application for temporary visa retirees. You also need to complete and lodge Form 1249 State/Territory sponsorship: Investor Retirement visa (245KB PDF) with the state or territory in which you wish to be sponsored (other than the Australian Capital Territory). The relevant state or territory government agency will sign and stamp the form and return it to you if they agree to sponsor you. Once the completed sponsorship form is returned to you it should be lodged along with your application form. Applying in Australia Provide all relevant documents and pay the first instalment of the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs and pay the visa application charge when you apply. Your visa application should be lodged at one of the following addresses: Sending by post Department of Home Affairs Specialist Temporary Entry Centre GPO Box 794 Hobart Tas. 7001 Lodging by courier Department of Home Affairs Specialist Temporary Entry Centre 14th Floor, 188 Collins Street Hobart Tas. 7001 Make a Designated Investment Details As part of the application process you must make a designated investment. The following steps outline the process for making a designated investment: As well as applying to the state or territory government agency for sponsorship you should contact the treasury corporation, in that state or territory. They will forward current information on the terms and conditions and an investment application form. They will also send detailed instructions on how to lodge the designated investment. At the initial inquiry stage, the treasury corporation can only indicate the likely rate of return on a proposed investment. The actual rate of return on your investment will be set when you deposit your funds in the designated investment. Interest rates change regularly and may differ between state and territory treasury corporations. When your application has been processed and other requirements have been met, we will ask you (and your partner, if any) to complete relevant health and character checks. Prospective applicants should not undergo medicals until advised by us. When your health and character checks have been finalised, we will advise you to lodge the designated investment with the treasury corporation in the state or territory in which you have been sponsored. The advice will also include a Form 1031 Declaration: Designated Investment (140KB PDF) , which will have been completed by us and must be sent with your investment application. The individual treasury corporations will be able to provide you advice on the procedures to transfer your funds for the designated investment. The funds cannot be withdrawn for the length of your visa except under exceptional circumstances. When you have submitted evidence that the designated investment has been made, we will advise you in writing to pay the second application charge. After you apply Details Wait for a decision Details After you have lodged your application and documents, we will acknowledge that we have received your information. We have visa processing times for each visa. Your application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete. Outside Australia: If you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Wait for a decision from us before you leave your job, sell your home or book your travel. In Australia: If you apply for this visa in Australia, you could be eligible for a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for a Bridging visa B (BVB) to travel outside Australia while you wait for a decision. Provide more information Details You can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, you can use: Form 1023 - Notification of incorrect answer (168KB PDF) We could also ask you for more information and will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will generally give you the opportunity to comment on the information. Visa decision Details If the visa is granted, we will send you a letter or email to tell you: when you can use the visa the visa grant number any conditions attached to the visa. You will not have a visa label placed in your passport. The letter we send you will also tell you the date you must enter Australia. If the visa is not granted, we will send you a letter or email to tell you: why the visa was not granted your review rights (if any) the time limit for applying for a review (if applicable). Visa holders Details Workers rights Details Workers in Australia – including visa holders with permission to work – have rights under Australian workplace law. The Fair Work Ombudsman’s Pay and Conditions Tool (PACT) provides information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements. See also: Workplace rights for all visa holders working in Australia This information is for people who have already been granted an Investor Retirement visa (subclass 405). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This is a temporary visa. It allows you to: work in Australia for up to 40 hours per fortnight travel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa have your partner (who has also been granted this visa) accompany you to Australia. Your obligations Details You and your family must comply with all visa conditions and Australian laws. Arrival conditions You must enter Australia before the date given to you in your visa grant notification. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation Sponsors Details You must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites. New South Wales Northern Territory Queensland South Australia Tasmania Victoria Western Australia.",
  "main_content": "===== main placeholder ==========================================\n\nThis visa is closed to new applicantsThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.Further details, including eligibility requirements, processing times and visa application charges can be found atPathway to permanent residence for Retirees.\n\nThis visa is closed to new applicants\n\nThis visa is closed to new applicants\n\nThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.Further details, including eligibility requirements, processing times and visa application charges can be found atPathway to permanent residence for Retirees.\n\nThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.\nFurther details, including eligibility requirements, processing times and visa application charges can be found at\nPathway to permanent residence for Retirees\n.\n\n# Investor Retirement visa (subclass 405)\n\nInvestor Retirement visa (subclass 405)\nPage Content\n\n​​​​​​​​​​​​​​​​Investor Retirement visa (subclass 405)​​. This temporary visa is for self-funded retirees who have no dependents and want to live in Australia during their retirement years.\n\n​​​​​​​​​​​​​​​​Investor Retirement visa (subclass 405)​​. This temporary visa is for self-funded retirees who have no dependents and want to live in Australia during their retirement years.\n\n## About this visa\n\nAbout this visa\nDetails\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a temporary visa. It allows you to:\n\nThis is a temporary visa. It allows you to:\n- work in Australia for up to 40 hours per fortnight\nwork in Australia for up to 40 hours per fortnight\n- travel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa\ntravel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa\n- have your partner (who has also been granted this visa) accompany you to Australia.\nhave your partner (who has also been granted this visa) accompany you to Australia.\n\n### Eligibility\n\nEligibility\nDetails\n\nYou can only apply for this visa if you are:\n\nYou can only apply for this visa if you are:\n- an existing Investor Retirement visa (subclass 405) holder; or\nan existing Investor Retirement visa (subclass 405) holder; or\n- a former Investor Retirement visa (subclass 405) holder who has not held another substantive visa since last entering Australia.\na former Investor Retirement visa (subclass 405) holder who has not held another substantive visa since last entering Australia.\n\n### Cost\n\nCost\nDetails\n\nFromAUD505.00\n\nFrom\nAUD505.00\n\nThere is a second visa application charge payable prior to the grant of the Investor Retirement visa (subclass 405). This charge is payable in respect of each person applying for the visa and must be paid prior to each grant (including each time the visa is renewed).\n\nThere is a second visa application charge payable prior to the grant of the Investor Retirement visa (subclass 405). This charge is payable in respect of each person applying for the visa and must be paid prior to each grant (including each time the visa is renewed).\n- You might have to pay more costs for:\nYou might have to pay more costs for:\n- additional applicant 18 and over\nadditional applicant 18 and over\n- additional applicant under 18\nadditional applicant under 18\n\n#### Other costs\n\nOther costs\n\nYou may have to pay other costs, such as: health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements.\n\nYou may have to pay other costs, such as: health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements.\n\n### Sponsorship\n\nSponsorship\nDetails\n\nYou must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites.\n\nYou must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites.\n\nNew South WalesNorthern TerritoryQueenslandSouth AustraliaTasmaniaVictoriaWestern Australia.\n\nNew South Wales\nNorthern Territory\nQueensland\nSouth Australia\nTasmania\nVictoria\nWestern Australia.\n\n### Designated Investment\n\nDesignated Investment\nDetails\n\nA designated investment must be maintained for the duration of the Investor Retirement visa (subclass 405). The amount of the designated investment decreases by AUD250,000 the first time you reapply for the visa and then remains constant. If you reapply for your Investor Retirement visa (subclass 405) a designated investment of AUD500,000 must be made and maintained. If you live in regional Australia a designated investment of AUD250,000 must be maintained.\n\nA designated investment must be maintained for the duration of the Investor Retirement visa (subclass 405). The amount of the designated investment decreases by AUD250,000 the first time you reapply for the visa and then remains constant. If you reapply for your Investor Retirement visa (subclass 405) a designated investment of AUD500,000 must be made and maintained. If you live in regional Australia a designated investment of AUD250,000 must be maintained.\n\n### Income\n\nIncome\nDetails\n\nYou (or combined with your partner) must have access to a minimum net income of AUD65,000 per year.\n\nYou (or combined with your partner) must have access to a minimum net income of AUD65,000 per year.\n\nIf you intend to live in regional Australia you (or combined with your partner) must have access to a minimum net income of AUD50,000 per year.\n\nIf you intend to live in regional Australia you (or combined with your partner) must have access to a minimum net income of AUD50,000 per year.\n\nThis income test applies each time you apply for an Investor Retirement visa (subclass 405). If you choose to reapply for your visa you must show that your net income still meets this requirement.\n\nThis income test applies each time you apply for an Investor Retirement visa (subclass 405). If you choose to reapply for your visa you must show that your net income still meets this requirement.\n\n### Health\n\nHealth\nDetails\n\nYou must meet certainhealth requirements. The results of your health examinations are generally valid for 12 months.\n\nYou must meet certain\nhealth requirements\n. The results of your health examinations are generally valid for 12 months.\n\nThis applies to you and any dependent family members included in the application.\n\nThis applies to you and any dependent family members included in the application.\n\nYou are able toorganise your health examinations upfrontbefore lodging a visa application.\n\nYou are able to\norganise your health examinations upfront\nbefore lodging a visa application.\n\n### Character\n\nCharacter\nDetails\n\nYou must meet certaincharacter requirements. If you are 16 years of age or older, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more, during the past 10 years, since you turned 16 years of age. Do not arrange for police certificates until we ask you to.\n\nYou must meet certain\ncharacter requirements\n. If you are 16 years of age or older, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more, during the past 10 years, since you turned 16 years of age. Do not arrange for police certificates until we ask you to.\n\n### ​Health insurance\n\n​Health insurance\nDetails\n\nYou must have evidence that you and your partner hold an adequate health insurance package for the period of your intended stay in Australia.\n\nYou must have evidence that you and your partner hold an adequate health insurance package for the period of your intended stay in Australia.\n\nFor health insurance to be considered adequate, it must:\n\nFor health insurance to be considered adequate, it must:\n- be fully comprehensive\nbe fully comprehensive\n- provide coverage that is at least equivalent to Medicare (including coverage of 85 per cent of costs for hospital, emergency, and general practitioner services)\nprovide coverage that is at least equivalent to Medicare (including coverage of 85 per cent of costs for hospital, emergency, and general practitioner services)\n- provide coverage for pharmaceuticals.\nprovide coverage for pharmaceuticals.\n\nIt is preferable that the policy is with an Australian insurer, however alternative arrangements that meet the above requirements can be accepted. Alternative arrangements, with an overseas insurer, will need individual detailed examination of the insurance policy and may result in processing delays.\n\nIt is preferable that the policy is with an Australian insurer, however alternative arrangements that meet the above requirements can be accepted. Alternative arrangements, with an overseas insurer, will need individual detailed examination of the insurance policy and may result in processing delays.\n\nIf you do not maintain adequate health insurance it may result in the refusal of future visa applications.\n\nIf you do not maintain adequate health insurance it may result in the refusal of future visa applications.\n\n### Provide biometrics\n\nProvide biometrics\n\nYou might be asked to providebiometrics(a scientific form of identification) as part of the application.\n\nYou might be asked to provide\nbiometrics\n(a scientific form of identification) as part of the application.\n\n### Compelling and Compassionate\n\nCompelling and Compassionate\nDetails\n\nOn 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Investor Retirement (subclass 405) visa applicants, in Australia, applying for a further subclass 405 visa, but cannot meet certain visa criteria.  Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner.\n\nOn 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Investor Retirement (subclass 405) visa applicants, in Australia, applying for a further subclass 405 visa, but cannot meet certain visa criteria.  Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner.\n\nAfter you have lodged your application for a further subclass 405, the Department will give you an opportunity to provide more information if you cannot meet certain visa criteria.\n\nAfter you have lodged your application for a further subclass 405, the Department will give you an opportunity to provide more information if you cannot meet certain visa criteria.\n\n### Debts to the Australian government\n\nDebts to the Australian government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\n### Your passport\n\nYour passport\nDetails\n\nUsually, you and your partner need to have valid passports to be granted this visa.\n\nUsually, you and your partner need to have valid passports to be granted this visa.\n\nIf you plan to get a new passport, you should do this before applying for your visa. If you get a new passport after you have lodged your application, give the details of your new passport to one ofour offices.\n\nIf you plan to get a new passport, you should do this before applying for your visa. If you get a new passport after you have lodged your application, give the details of your new passport to one of\nour offices\n.\n\n### Gather documents\n\nGather documents\nDetails\n\n### Applicant documents\n\nApplicant documents\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nUse this checklist to make sure your application is complete.\n\nUse this checklist to make sure your application is complete.\n\n### Forms\n\nForms\n- Form 1383 Application for a temporary visa for retirees  (423KB PDF)Application for a temporary visa for retirees\nForm 1383 Application for a temporary visa for retirees  (423KB PDF)\nApplication for a temporary visa for retirees\n- Form 1249 State/territory sponsorship Investor retirement visa (245KB PDF)State/territory sponsorship Investor retirement visa.\nForm 1249 State/territory sponsorship Investor retirement visa (245KB PDF)\nState/territory sponsorship Investor retirement visa\n.\n\n### Charges\n\nCharges\n- Pay the visa application charge.\nPay the visa application charge.\n\n### Receiving assistance\n\nReceiving assistance\n- If someone gives you advice or lodges your application for you, that person completes:Form 956 Advice by a migration agent/exempt person of providing immigration assistance  (308KB PDF)(the agent or exempt person completes the form and you must sign it) .\nIf someone gives you advice or lodges your application for you, that person completes:\n- Form 956 Advice by a migration agent/exempt person of providing immigration assistance  (308KB PDF)(the agent or exempt person completes the form and you must sign it) .\nForm 956 Advice by a migration agent/exempt person of providing immigration assistance  (308KB PDF)\n(the agent or exempt person completes the form and you must sign it) .\n- If you would like someone to receive correspondence from us on your behalf, that person completes:Form 956A Appointment or withdrawal of an authorised recipient (the recipient completes the form and you must sign it) (301KB PDF)(the recipient completes the form and you must sign it).\nIf you would like someone to receive correspondence from us on your behalf, that person completes:\n- Form 956A Appointment or withdrawal of an authorised recipient (the recipient completes the form and you must sign it) (301KB PDF)(the recipient completes the form and you must sign it).\nForm 956A Appointment or withdrawal of an authorised recipient (the recipient completes the form and you must sign it) (301KB PDF)\n(the recipient completes the form and you must sign it).\n\n### Your identity\n\nYour identity\n- Certified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\nCertified copies of the biographical pages of the current passports or travel documents of all people included in the application (these are the pages with the holder's photo and personal details and the issue/expiry dates).\n- Two recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.These photographs should be of the head and shoulders only against a plain background.Print the name of the person on the back of each photograph.\nTwo recent passport-sized photographs (45 mm x 35 mm) of each person included in the application.\n- These photographs should be of the head and shoulders only against a plain background.\nThese photographs should be of the head and shoulders only against a plain background.\n- Print the name of the person on the back of each photograph.\nPrint the name of the person on the back of each photograph.\n\n### Your relationships\n\nYour relationships\n- Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nCertified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\n- If you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names).\nIf you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names).\n\n### Your health insurance\n\nYour health insurance\n- Evidence that you and your partner (if applicable), hold an adequate health insurance package.\nEvidence that you and your partner (if applicable), hold an adequate health insurance package.\n\n### Australian Values Statement\n\nAustralian Values Statement\n- AnAustralian Values Statementsigned by everyone included in the application who has turned 18 at the time of the visa application.\nAn\nAustralian Values Statement\nsigned by everyone included in the application who has turned 18 at the time of the visa application.\n\n### Your assets\n\nYour assets\n- A one-page summary statement outlining the assets and liabilities on a single day in the three months preceding your application. You should identify which assets are to be used to:establish yourself in Australiafund the designated investmentgenerate an annual income.\nA one-page summary statement outlining the assets and liabilities on a single day in the three months preceding your application. You should identify which assets are to be used to:\n- establish yourself in Australia\nestablish yourself in Australia\n- fund the designated investment\nfund the designated investment\n- generate an annual income.\ngenerate an annual income.\n- Evidence of ownership and value of the assets included in your summary statement for at least two years preceding your application.\nEvidence of ownership and value of the assets included in your summary statement for at least two years preceding your application.\n\n#### For cash assets:\n\nFor cash assets:\n- bank statements, at least two years preceding your application and on a single day in the three months preceding your application. All bank statements must have the same date of issue.\nbank statements, at least two years preceding your application and on a single day in the three months preceding your application. All bank statements must have the same date of issue.\n\n#### For real estate assets:\n\nFor real estate assets:\n- overseas real estateevidence of ownership, such as title deedsevidence of value, such as valuation certificate by an accredited property valuer (valuations by real estate agents who are not accredited property valuers are generally not acceptable)mortgage statements (if applicable) showing balance of amount owed.\noverseas real estate\n- evidence of ownership, such as title deeds\nevidence of ownership, such as title deeds\n- evidence of value, such as valuation certificate by an accredited property valuer (valuations by real estate agents who are not accredited property valuers are generally not acceptable)\nevidence of value, such as valuation certificate by an accredited property valuer (valuations by real estate agents who are not accredited property valuers are generally not acceptable)\n- mortgage statements (if applicable) showing balance of amount owed.\nmortgage statements (if applicable) showing balance of amount owed.\n- real estate in Australiacertified copy of approval letter for the purchase of real estate in Australia from the Foreign Investment Review Board (FIRB).\nreal estate in Australia\n- certified copy of approval letter for the purchase of real estate in Australia from the Foreign Investment Review Board (FIRB).\ncertified copy of approval letter for the purchase of real estate in Australia from the Foreign Investment Review Board (FIRB).\n\n#### For business assets:\n\nFor business assets:\n- evidence of ownership and value, including business registration certificate or licence, evidence of share of ownership (this may include evidence of purchase, share registers/company registers/share transfer documents or historical company extracts), annual returns of directors and shareholders or partnership/trust/franchise agreements\nevidence of ownership and value, including business registration certificate or licence, evidence of share of ownership (this may include evidence of purchase, share registers/company registers/share transfer documents or historical company extracts), annual returns of directors and shareholders or partnership/trust/franchise agreements\n- extracts from financial statements for your business, prepared by an independent accountant to International Accounting Standards, including balance sheet, profit and loss statement and notes to the accounts. Financial statements must be provided for two of the four fiscal years prior to application.\nextracts from financial statements for your business, prepared by an independent accountant to International Accounting Standards, including balance sheet, profit and loss statement and notes to the accounts. Financial statements must be provided for two of the four fiscal years prior to application.\n\nNote: Letters from an independent accountant must be on company letterhead. Any letter prepared in plain paper will not be acceptable.\n\nNote\n: Letters from an independent accountant must be on company letterhead. Any letter prepared in plain paper will not be acceptable.\n\n#### For personal or business loans:\n\nFor personal or business loans:\n- loan agreements, loan statements indicating amount borrowed and repayment schedule, listed in business balance sheet (if loan is to / from a business).\nloan agreements, loan statements indicating amount borrowed and repayment schedule, listed in business balance sheet (if loan is to / from a business).\n\n#### For stocks and bonds:\n\nFor stocks and bonds:\n- share or bond registers, share / fixed interest securities / debentures certificates, transfer certificates, market value.\nshare or bond registers, share / fixed interest securities / debentures certificates, transfer certificates, market value.\n\n#### Inheritance:\n\nInheritance:\n- probate or will.\nprobate or will.\n\n#### Superannuation:\n\nSuperannuation:\n- statement from superannuation fund managers.\nstatement from superannuation fund managers.\n\n#### Pension:\n\nPension:\n- statement from government agency/pension fund stating amount of pension received and date that pension commenced.\nstatement from government agency/pension fund stating amount of pension received and date that pension commenced.\n\n#### Other personal asset items:\n\nOther personal asset items:\n- evidence of ownership and evidence of value, such as valuation certificate by an accredited valuer, for example antiques or jewellery.\nevidence of ownership and evidence of value, such as valuation certificate by an accredited valuer, for example antiques or jewellery.\n\n### Prepare your documents\n\nPrepare your documents\nDetails\n\nYou need to provide documents to prove the claims you make in your application.\n\nYou need to provide documents to prove the claims you make in your application.\n\nSome documents could take some time to obtain. You should have all the required documents ready when you lodge your application to reduce any delays in processing.\n\nSome documents could take some time to obtain. You should have all the required documents ready when you lodge your application to reduce any delays in processing.\n\n### Lodge your application\n\nLodge your application\nDetails\n\nYou must complete the following application form:\n\nYou must complete the following application form:\n- Form 1383 Application for temporary visa retirees (423KB PDF)- Application for temporary visa retirees.\nForm 1383 Application for temporary visa retirees (423KB PDF)\n- Application for temporary visa retirees.\n\nYou also need to complete and lodgeForm 1249 State/Territory sponsorship: Investor Retirement visa (245KB PDF)with the state or territory in which you wish to be sponsored (other than the Australian Capital Territory). The relevant state or territory government agency will sign and stamp the form and return it to you if they agree to sponsor you. Once the completed sponsorship form is returned to you it should be lodged along with your application form.\n\nYou also need to complete and lodge\nForm 1249 State/Territory sponsorship: Investor Retirement visa (245KB PDF)\nwith the state or territory in which you wish to be sponsored (other than the Australian Capital Territory). The relevant state or territory government agency will sign and stamp the form and return it to you if they agree to sponsor you. Once the completed sponsorship form is returned to you it should be lodged along with your application form.\n\n### Applying in Australia\n\nApplying in Australia\n\nProvide all relevant documents and pay the first instalment of the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs and pay the visa application charge when you apply. Your visa application should be lodged at one of the following addresses:\n\nProvide all relevant documents and pay the first instalment of the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs and pay the visa application charge when you apply. Your visa application should be lodged at one of the following addresses:\n\n#### Sending by post\n\nSending by post\n\nDepartment of Home AffairsSpecialist Temporary Entry CentreGPO Box 794Hobart Tas. 7001\n\nDepartment of Home Affairs\nSpecialist Temporary Entry Centre\nGPO Box 794\nHobart Tas. 7001\n\n#### Lodging by courier\n\nLodging by courier\n\nDepartment of Home AffairsSpecialist Temporary Entry Centre14th Floor, 188 Collins StreetHobart Tas. 7001\n\nDepartment of Home Affairs\nSpecialist Temporary Entry Centre\n14th Floor, 188 Collins Street\nHobart Tas. 7001\n\n### Make a Designated Investment\n\nMake a Designated Investment\nDetails\n\nAs part of the application process you must make a designated investment. The following steps outline the process for making a designated investment:\n\nAs part of the application process you must make a designated investment. The following steps outline the process for making a designated investment:\n1. As well as applying to the state or territory government agency for sponsorship you should contact the treasury corporation, in that state or territory. They will forward current information on the terms and conditions and an investment application form. They will also send detailed instructions on how to lodge the designated investment. At the initial inquiry stage, the treasury corporation can only indicate the likely rate of return on a proposed investment. The actual rate of return on your investment will be set when you deposit your funds in the designated investment. Interest rates change regularly and may differ between state and territory treasury corporations.\nAs well as applying to the state or territory government agency for sponsorship you should contact the treasury corporation, in that state or territory. They will forward current information on the terms and conditions and an investment application form. They will also send detailed instructions on how to lodge the designated investment. At the initial inquiry stage, the treasury corporation can only indicate the likely rate of return on a proposed investment. The actual rate of return on your investment will be set when you deposit your funds in the designated investment. Interest rates change regularly and may differ between state and territory treasury corporations.\n2. When your application has been processed and other requirements have been met, we will ask you (and your partner, if any) to complete relevant health and character checks. Prospective applicants should not undergo medicals until advised by us.\nWhen your application has been processed and other requirements have been met, we will ask you (and your partner, if any) to complete relevant health and character checks. Prospective applicants should not undergo medicals until advised by us.\n3. When your health and character checks have been finalised, we will advise you to lodge the designated investment with the treasury corporation in the state or territory in which you have been sponsored. The advice will also include aForm 1031 Declaration: Designated Investment (140KB PDF), which will have been completed by us and must be sent with your investment application. The individual treasury corporations will be able to provide you advice on the procedures to transfer your funds for the designated investment. The funds cannot be withdrawn for the length of your visa except under exceptional circumstances.\nWhen your health and character checks have been finalised, we will advise you to lodge the designated investment with the treasury corporation in the state or territory in which you have been sponsored. The advice will also include a\nForm 1031 Declaration: Designated Investment (140KB PDF)\n, which will have been completed by us and must be sent with your investment application. The individual treasury corporations will be able to provide you advice on the procedures to transfer your funds for the designated investment. The funds cannot be withdrawn for the length of your visa except under exceptional circumstances.\n4. When you have submitted evidence that the designated investment has been made, we will advise you in writing to pay the second application charge.\nWhen you have submitted evidence that the designated investment has been made, we will advise you in writing to pay the second application charge.\n\n### After you apply\n\nAfter you apply\nDetails\n\n#### Wait for a decision\n\nWait for a decision\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nWe have visa processing times for each visa.\n\nWe have visa processing times for each visa.\n\nYour application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete.\n\n##### Outside Australia:\n\nOutside Australia:\n\nIf you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Wait for a decision from us before you leave your job, sell your home or book your travel.\n\nIf you apply for this visa from outside Australia, do not make arrangements to travel to Australia until you are advised in writing that you have been granted a visa. Wait for a decision from us before you leave your job, sell your home or book your travel.\n\n##### In Australia:\n\nIn Australia:\n\nIf you apply for this visa in Australia, you could be eligible for a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for aBridging visa B (BVB)to travel outside Australia while you wait for a decision.\n\nIf you apply for this visa in Australia, you could be eligible for a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A, you can apply for a\nBridging visa B (BVB)\nto travel outside Australia while you wait for a decision.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, you can use:\n\nYou can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, you can use:\n- Form 1023 - Notification of incorrect answer (168KB PDF)\nForm 1023 - Notification of incorrect answer (168KB PDF)\n\nWe could also ask you for more information and will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information and will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will generally give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will generally give you the opportunity to comment on the information.\n\n#### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will send you a letter or email to tell you:\n\nIf the visa is granted, we will send you a letter or email to tell you:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.\nany conditions attached to the visa.\n\nYou will not have a visa label placed in your passport.\n\nYou will not have a visa label placed in your passport.\n\nThe letter we send you will also tell you the date you must enter Australia.\n\nThe letter we send you will also tell you the date you must enter Australia.\n\nIf the visa is not granted, we will send you a letter or email to tell you:\n\nIf the visa is not granted, we will send you a letter or email to tell you:\n- why the visa was not granted\nwhy the visa was not granted\n- your review rights (if any)\nyour review rights (if any)\n- the time limit for applying for a review (if applicable).\nthe time limit for applying for a review (if applicable).\n\n## Visa holders\n\nVisa holders\nDetails\n\n### Workers rights\n\nWorkers rights\nDetails\n\nWorkers in Australia – including visa holders with permission to work – have rights under Australian workplace law.\n\nWorkers in Australia – including visa holders with permission to work – have rights under Australian workplace law.\n\nTheFair Work Ombudsman’s Pay and Conditions Tool (PACT)provides information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\n\nThe\nFair Work Ombudsman’s Pay and Conditions Tool (PACT)\nprovides information on pay rates, shift calculations, leave arrangements and notice and redundancy entitlements.\n\nSee also:Workplace rights for all visa holders working in Australia\n\nSee also:\nWorkplace rights for all visa holders working in Australia\n\nThis information is for people who have already been granted an Investor Retirement visa (subclass 405). It explains your rights and obligations.\n\nThis information is for people who have already been granted an Investor Retirement visa (subclass 405). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a temporary visa. It allows you to:\n\nThis is a temporary visa. It allows you to:\n- work in Australia for up to 40 hours per fortnight\nwork in Australia for up to 40 hours per fortnight\n- travel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa\ntravel to and remain in Australia for four years from the date the visa is granted – after that time you will need another visa\n- have your partner (who has also been granted this visa) accompany you to Australia.\nhave your partner (who has also been granted this visa) accompany you to Australia.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\n##### Arrival conditions\n\nArrival conditions\n\nYou must enter Australia before the date given to you in your visa grant notification.\n\nYou must enter Australia before the date given to you in your visa grant notification.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n## Sponsors\n\nSponsors\nDetails\n\nYou must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites.\n\nYou must be sponsored by an Australian state or territory government agency (other than the Australian Capital Territory). More information can be found on their websites.\n\nNew South WalesNorthern TerritoryQueenslandSouth AustraliaTasmaniaVictoriaWestern Australia.\n\nNew South Wales\nNorthern Territory\nQueensland\nSouth Australia\nTasmania\nVictoria\nWestern Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/investor-retirement-visa-subclass-405#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/investor-retirement-visa-subclass-405#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:22:08.882028",
  "metadata": {}
}