{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa",
  "title": "Special Purpose visa",
  "raw_text": "===== main placeholder ========================================== Special Purpose visa This is a temporary visa that lets you enter and stay in Australia while you hold your prescribed status. You do not apply for this visa. It is granted automatically to people who have a 'prescribed status'. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay You can stay in Australia temporarily for as long as you have a 'prescribed status', unless we cease your visa for another reason. If you are an airline crew member, aircraft safety inspector or airline positioning crew member see Crew Travel Authority. Cost There is no application fee for this visa. Processing times There are no processing times available for this visa. With this temporary visa, depending on your prescribed status, you can enter and stay in Australia temporarily, while you hold the prescribed status undertake your regular work while in Australia as part of your military duties arrive as an airline crew member, or join a flight as a member of crew. See Crew Travel Authority for the work conditons See all conditions Check your eligibility You must have a 'prescribed status'. This includes but is not limited to being: a member of certain foreign armed forces a person on board a ship of a foreign armed forces an airline, or airline positioning crew member the accompanying spouse or dependant of an eligible person with a prescribed status About this visa With this visa you can, depending on your prescribed status How long you can stay Stay longer Include family Cost Your obligations Health insurance Travel Visa label With this visa you can, depending on your prescribed status enter and stay in Australia temporarily, while you hold the prescribed status undertake your regular work while in Australia as part of your military duties arrive as an airline crew member, or join a flight as a member of crew. See Crew Travel Authority for the work conditions How long you can stay You can stay in Australia on a temporary basis for as long as you have a 'prescribed status'. Your visa will cease if: your prescribed status ends, or we cease your visa Stay longer Your visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa. Explore your visa options Include family In some limited circumstances, your partner or dependent relative may be eligible for a Special Purpose visa. Find out about eligibility Cost There is no application charge for this visa. Your obligations The Special Purpose visa is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease. You must obey all Australian laws. You must comply with all legal obligations attached to your prescribed status. Health insurance We recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability. See what we consider adequate health insurance Learn more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Travel You can enter and depart Australia as many times as you want as long as you hold the prescribed status. Visa label As this temporary visa is based on your prescribed status it may not be linked to your passport. You will not get a label in your passport. Eligibility Have a 'prescribed status' To have a prescribed status, this includes but is not limited to being: An airline crew member You must be an: airline crew member airline positioning crew member aircraft safety inspector For more information, visit: Crew Travel Authority A person on board a ship of foreign armed forces You must be: a person who forms part of the complement of a ship of the regular armed forces of a foreign government and on board the ship when it enters Australia A member of certain foreign armed forces You must be a member of: the military or civilian component of the armed forces of a country that has a Status of Forces Agreement with Australia the armed forces of a specified Asia-Pacific country, travelling to Australia or in Australia as part of your duty the armed forces of a specified Commonwealth country, travelling to Australia or in Australia as part of your duty You are also eligible if you are the accompanying spouse, de facto partner or dependent relative of an eligible armed forces member and are listed on the members military travel orders. Members of the armed forces of Canada, Singapore, the United Kingdom of Great Britain and Northern Ireland, and the United States of America may be eligible to be registered for the Special Purpose Travel Authority (subclass 945) (SPTA). In limited circumstances the SPTA provides a visa grant number (VGN) to eligible military members and their dependents. Eligible military members and their dependents can use the VGN in VEVO to show their status to employers, education providers and other Australian organisations. Military personnel and their dependents should contact their High Commission, Embassy or Defence representative for advice on their visa status. For more information, visit: Military personnel travelling with restricted goods Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 You can't apply for this visa. We automatically grant this visa when you enter Australia. When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia Before you leave You must have a valid passport or other travel document. Military personnel must travel with Military ID and Movement orders indicating their travel to Australia. Dependants must travel with their valid national passport and a certificate or letter stating that they are a dependant of the primary Military person. Airline Crew must hold a valid passport and Airline Identity Card and be included on the crew list, or carry a letter from their employer indicating the purpose of travel as airline positioning crew. At the border We will grant you the Special Purpose visa when you enter Australia. In Australia What you must do on your visa The Special Purpose visa is a temporary visa that is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease. You must follow all Australian laws. You must comply with all legal obligations attached to your eligibility status. What you can do on your visa The Special Purpose visa lets you: enter and stay in Australia temporarily, while you hold the prescribed status undertake your regular work as part of your military duties while you are in Australia arrive as an airline crew member, positioning crew member or aircraft safety inspector If you are a spouse, de facto partner or dependent relative of an eligible armed forces member, and listed on the travel orders as accompanying them to Australia, you are able to work and study while in Australia. If you are an airline crew member, airline positioning crew member or an aircraft safety inspector, see Crew Travel Authority Staying longer Your visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa. Explore your visa options Leaving Australia Before you leave You must have a valid passport or other travel document to leave Australia. After you leave Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\n\n# Special Purpose visa\n\nSpecial Purpose visa\n\nThis is a temporary visa that lets you enter and stay in Australia while you hold your prescribed status. You do not apply for this visa. It is granted automatically to people who have a 'prescribed status'.\n\nThis is a temporary visa that lets you enter and stay in Australia while you hold your prescribed status. You do not apply for this visa. It is granted automatically to people who have a 'prescribed status'.\n\nThis is a temporary visa that lets you enter and stay in Australia while you hold your prescribed status. You do not apply for this visa. It is granted automatically to people who have a 'prescribed status'.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nYou can stay in Australia temporarily for as long as you have a 'prescribed status', unless we cease your visa for another reason.\n\nYou can stay in Australia temporarily for as long as you have a 'prescribed status', unless we cease your visa for another reason.\n\nIf you are an airline crew member, aircraft safety inspector or airline positioning crew member seeCrew Travel Authority.\n\nIf you are an airline crew member, aircraft safety inspector or airline positioning crew member see\nCrew Travel Authority.\n\n#### Cost\n\nCost\n\nThere is no application fee for this visa.\n\nThere is no application fee for this visa.\n\n#### Processing times\n\nProcessing times\n\nThere are no processing times available for this visa.\n\nThere are no processing times available for this visa.\n\n#### With this temporary visa, depending on your prescribed status, you can\n\nWith this temporary visa, depending on your prescribed status, you can\n- enter and stay in Australia temporarily, while you hold the prescribed status\nenter and stay in Australia temporarily, while you hold the prescribed status\n- undertake your regular work while in Australia as part of your military duties\nundertake your regular work while in Australia as part of your military duties\n- arrive as an airline crew member, or join a flight as a member of crew. SeeCrew Travel Authorityfor the work conditons\narrive as an airline crew member, or join a flight as a member of crew. See\nCrew Travel Authority\nfor the work conditons\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n\nhave a 'prescribed status'. This includes but is not limited to being:\n\nhave a 'prescribed status'. This includes but is not limited to being:\n- a member of certain foreign armed forces\na member of certain foreign armed forces\n- a person on board a ship of a foreign armed forces\na person on board a ship of a foreign armed forces\n- an airline, or airline positioning crew member\nan airline, or airline positioning crew member\n- the accompanying spouse or dependant of an eligible person with a prescribed status\nthe accompanying spouse or dependant of an eligible person with a prescribed status\nAbout this visa\nWith this visa you can, depending on your prescribed status\nHow long you can stay\nStay longer\nInclude family\nCost\nYour obligations\nHealth insurance\nTravel\nVisa label\n\n## With this visa you can, depending on your prescribed status\n\nWith this visa you can, depending on your prescribed status\n- enter and stay in Australia temporarily, while you hold the prescribed status\nenter and stay in Australia temporarily, while you hold the prescribed status\n- undertake your regular work while in Australia as part of your military duties\nundertake your regular work while in Australia as part of your military duties\n- arrive as an airline crew member, or join a flight as a member of crew. SeeCrew Travel Authorityfor the work conditions\narrive as an airline crew member, or join a flight as a member of crew. See\nCrew Travel Authority\nfor the work conditions\n\n## How long you can stay\n\nHow long you can stay\n\nYou can stay in Australia on a temporary basis for as long as you have a 'prescribed status'. Your visa will cease if:\n\nYou can stay in Australia on a temporary basis for as long as you have a 'prescribed status'. Your visa will cease if:\n- your prescribed status ends, or\nyour prescribed status ends, or\n- we cease your visa\nwe cease your visa\n\n## Stay longer\n\nStay longer\n\nYour visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa.\n\nYour visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa.\n\nExplore your visa options.\n\nExplore your visa options\n.\n\n## Include family\n\nInclude family\n\nIn some limited circumstances, your partner or dependent relative may be eligible for a Special Purpose visa. Find out abouteligibility.\n\nIn some limited circumstances, your partner or dependent relative may be eligible for a Special Purpose visa. Find out about\neligibility\n.\n\n## Cost\n\nCost\n\nThere is no application charge for this visa.\n\nThere is no application charge for this visa.\n\n## Your obligations\n\nYour obligations\n\nThe Special Purpose visa is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease.\n\nThe Special Purpose visa is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease.\n\nYou must obey all Australian laws.\n\nYou must obey all Australian laws.\n\nYou must comply with all legal obligations attached to your prescribed status.\n\nYou must comply with all legal obligations attached to your prescribed status.\n\n## Health insurance\n\nHealth insurance\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You are personally liable for all your healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nSee what we consideradequate health insurance.\n\nSee what we consider\nadequate health insurance\n.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors\n.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Travel\n\nTravel\n\nYou can enter and depart Australia as many times as you want as long as you hold the prescribed status.\n\nYou can enter and depart Australia as many times as you want as long as you hold the prescribed status.\n\n## Visa label\n\nVisa label\n\nAs this temporary visa is based on your prescribed status it may not be linked to your passport. You will not get a label in your passport.\n\nAs this temporary visa is based on your prescribed status it may not be linked to your passport. You will not get a label in your passport.\nEligibility\n\n## Have a 'prescribed status'\n\nHave a 'prescribed status'\n\nTo have a prescribed status, this includes but is not limited to being:\n\nTo have a prescribed status, this includes but is not limited to being:\n\n### An airline crew member\n\nAn airline crew member\n\nYou must be an:\n\nYou must be an:\n- airline crew member\nairline crew member\n- airline positioning crew member\nairline positioning crew member\n- aircraft safety inspector\naircraft safety inspector\n\nFor more information, visit:Crew Travel Authority\n\nFor more information, visit:\nCrew Travel Authority\n\n### A person on board a ship of foreign armed forces\n\nA person on board a ship of foreign armed forces\n\nYou must be:\n\nYou must be:\n- a person who forms part of the complement of a ship of the regular armed forces of a foreign government and\na person who forms part of the complement of a ship of the regular armed forces of a foreign government and\n- on board the ship when it enters Australia\non board the ship when it enters Australia\n\n### A member of certain foreign armed forces\n\nA member of certain foreign armed forces\n\nYou must be a member of:\n\nYou must be a member of:\n- the military or civilian component of the armed forces of a country that has a Status of Forces Agreement with Australia\nthe military or civilian component of the armed forces of a country that has a Status of Forces Agreement with Australia\n- the armed forces of a specified Asia-Pacific country, travelling to Australia or in Australia as part of your duty\nthe armed forces of a specified Asia-Pacific country, travelling to Australia or in Australia as part of your duty\n- the armed forces of a specified Commonwealth country, travelling to Australia or in Australia as part of your duty\nthe armed forces of a specified Commonwealth country, travelling to Australia or in Australia as part of your duty\n\nYou are also eligible if you are the accompanying spouse, de facto partner or dependent relative of an eligible armed forces member and are listed on the members military travel orders.\n\nYou are also eligible if you are the accompanying spouse, de facto partner or dependent relative of an eligible armed forces member and are listed on the members military travel orders.\n\nMembers of the armed forces of Canada, Singapore, the United Kingdom of Great Britain and Northern Ireland, and the United States of America may be eligible to be registered for the Special Purpose Travel Authority (subclass 945) (SPTA).\n\nMembers of the armed forces of Canada, Singapore, the United Kingdom of Great Britain and Northern Ireland, and the United States of America may be eligible to be registered for the Special Purpose Travel Authority (subclass 945) (SPTA).\n\nIn limited circumstances the SPTA provides a visa grant number (VGN) to eligible military members and their dependents. Eligible military members and their dependents can use the VGN inVEVOto show their status to employers, education providers and other Australian organisations.\n\nIn limited circumstances the SPTA provides a visa grant number (VGN) to eligible military members and their dependents. Eligible military members and their dependents can use the VGN in\nVEVO\nto show their status to employers, education providers and other Australian organisations.\n\nMilitary personnel and their dependents should contact their High Commission, Embassy or Defence representative for advice on their visa status.\n\nMilitary personnel and their dependents should contact their High Commission, Embassy or Defence representative for advice on their visa status.\n\nFor more information, visit:Military personnel travelling with restricted goods\n\nFor more information, visit:\nMilitary personnel travelling with restricted goods\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nYou can't apply for this visa. We automatically grant this visa when you enter Australia.\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\nYou must have a valid passport or other travel document.\n\nYou must have a valid passport or other travel document.\n\nMilitary personnel must travel with Military ID and Movement orders indicating their travel to Australia. Dependants must travel with their valid national passport and a certificate or letter stating that they are a dependant of the primary Military person.\n\nMilitary personnel must travel with Military ID and Movement orders indicating their travel to Australia. Dependants must travel with their valid national passport and a certificate or letter stating that they are a dependant of the primary Military person.\n\nAirline Crew must hold a valid passport and Airline Identity Card and be included on the crew list, or carry a letter from their employer indicating the purpose of travel as airline positioning crew.\n\nAirline Crew must hold a valid passport and Airline Identity Card and be included on the crew list, or carry a letter from their employer indicating the purpose of travel as airline positioning crew.\n\n### At the border\n\nAt the border\n\nWe will grant you the Special Purpose visa when you enter Australia.\n\nWe will grant you the Special Purpose visa when you enter Australia.\n\n## In Australia\n\nIn Australia\n\n### What you must do on your visa\n\nWhat you must do on your visa\n\nThe Special Purpose visa is a temporary visa that is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease.\n\nThe Special Purpose visa is a temporary visa that is only valid as long as you have a 'prescribed status'. If your prescribed status ends, the visa will cease.\n\nYou must follow all Australian laws.\n\nYou must follow all Australian laws.\n\nYou must comply with all legal obligations attached to your eligibility status.\n\nYou must comply with all legal obligations attached to your eligibility status.\n\n### What you can do on your visa\n\nWhat you can do on your visa\n\nThe Special Purpose visa lets you:\n\nThe Special Purpose visa lets you:\n- enter and stay in Australia temporarily, while you hold the prescribed status\nenter and stay in Australia temporarily, while you hold the prescribed status\n- undertake your regular work as part of your military duties while you are in Australia\nundertake your regular work as part of your military duties while you are in Australia\n- arrive as an airline crew member, positioning crew member or aircraft safety inspector\narrive as an airline crew member, positioning crew member or aircraft safety inspector\n\nIf you are a spouse, de facto partner or dependent relative of an eligible armed forces member, and listed on the travel orders as accompanying them to Australia, you are able to work and study while in Australia.\n\nIf you are a spouse, de facto partner or dependent relative of an eligible armed forces member, and listed on the travel orders as accompanying them to Australia, you are able to work and study while in Australia.\n\nIf you are an airline crew member, airline positioning crew member or an aircraft safety inspector, seeCrew Travel Authority\n\nIf you are an airline crew member, airline positioning crew member or an aircraft safety inspector, see\nCrew Travel Authority\n\n### Staying longer\n\nStaying longer\n\nYour visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa.\n\nYour visa will cease if your 'prescribed status' ends. If you want to stay longer in Australia you must apply for a different visa.\n\nExplore your visa options.\n\nExplore your visa options\n.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n### After you leave\n\nAfter you leave\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/crew-travel-authority-942",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-purpose-visa#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:21:44.493705",
  "metadata": {}
}