{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/regional-sponsored-migration-scheme-(subclasses-119-and-857)",
  "title": "Regional Sponsored Migration Scheme (subclasses 119 and 857)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Regional Sponsored Migration Scheme (subclasses 119 and 857) Page Content The Regional Sponsored Migration Scheme visa (subclasses 119 and 857) closed to new applications on 1 July 2012. If you have applied for this visa but no visa decision has yet been made, you can add dependent children to your application at any time until your visa is decided. If you already hold a Regional Sponsored Migration Scheme visa (subclasses 119 and 857), your family members can apply separately for a visa. They can be in or outside Australia when they apply. This visa allows you and your family to live and work in Australia on a permanent basis. Visa applicant Details Adding family to your application Details You can add the following people to your visa application if you tell us in writing and we have not yet made a decision about your application: your partner your child/step-child or your partner’s child/step-child. For detailed information regarding who you can include in your application see including family members in your application They must also be nominated by your employer. Members of your family unit must be able to show that they meet health and character requirements Visa holders Details How long your visa lasts Details This is a permanent residence visa. What this visa lets you do Details This visa allows you and any family members who have been granted this visa to: stay in Australia indefinitely work and study in Australia enrol in Medicare , Australia's scheme for health-related care and expenses take out private health insurance access certain social security payments apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time you will need a resident return Your obligations Details Your visa might be cancelled if either: you did not start your employment with the relevant employer within six months of arriving in Australia and you do not satisfy the Minister that you made a genuine effort to start that employment within the six months. you started the employment, but it was terminated within two years of you starting, and you do not satisfy the Minister that you made a genuine effort to be engaged in that employment for the required period. Employer obligations Details The employer must make sure that all relevant workplace laws and award conditions are met. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Regional Sponsored Migration Scheme (subclasses 119 and 857)\n\nRegional Sponsored Migration Scheme (subclasses 119 and 857)\nPage Content\n\n​\n\n​\n\nThe Regional Sponsored Migration Scheme visa (subclasses 119 and 857) closed to new applications on 1 July 2012.\n\nThe Regional Sponsored Migration Scheme visa (subclasses 119 and 857) closed to new applications on 1 July 2012.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add dependent children to your application at any time until your visa is decided.\n\nIf you have applied for this visa but no visa decision has yet been made, you can add dependent children to your application at any time until your visa is decided.\n\nIf you already hold a Regional Sponsored Migration Scheme visa (subclasses 119 and 857), your family members can apply separately for a visa. They can be in or outside Australia when they apply.\n\nIf you already hold a Regional Sponsored Migration Scheme visa (subclasses 119 and 857), your family members can apply separately for a visa. They can be in or outside Australia when they apply.\n\nThis visa allows you and your family to live and work in Australia on a permanent basis.\n\nThis visa allows you and your family to live and work in Australia on a permanent basis.\n\n## Visa applicant\n\nVisa applicant\nDetails\n\n### Adding family to your application\n\nAdding family to your application\nDetails\n\nYou can add the following people to your visa application if you tell us in writing and we have not yet made a decision about your application:\n\nYou can add the following people to your visa application if you tell us in writing and we have not yet made a decision about your application:\n- your partner\nyour partner\n- your child/step-child or your partner’s child/step-child.\nyour child/step-child or your partner’s child/step-child.\n\nFor detailed information regarding who you can include in your application seeincluding family members in your application.\n\nFor detailed information regarding who you can include in your application see\nincluding family members in your application\n.\n\nThey must also be nominated by your employer.\n\nThey must also be nominated by your employer.\n\nMembers of your family unit must be able to show that they meethealthandcharacterrequirements\n\nMembers of your family unit must be able to show that they meet\nhealth\nand\ncharacter\nrequirements\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis is a permanent residence visa.\n\nThis is a permanent residence visa.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you and any family members who have been granted this visa to:\n\nThis visa allows you and any family members who have been granted this visa to:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicare, Australia's scheme for health-related care and expenses\nenrol in\nMedicare\n, Australia's scheme for health-related care and expenses\n- take out private health insurance\ntake out private health insurance\n- access certain social security payments\naccess certain social security payments\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time you will need a resident return\ntravel to and from Australia for five years from the date the visa is granted (after that time you will need a resident return\n\n### Your obligations\n\nYour obligations\nDetails\n\nYour visa might be cancelled if either:\n\nYour visa might be cancelled if either:\n- you did not start your employment with the relevant employer within six months of arriving in Australia and you do not satisfy the Minister that you made a genuine effort to start that employment within the six months.\nyou did not start your employment with the relevant employer within six months of arriving in Australia and you do not satisfy the Minister that you made a genuine effort to start that employment within the six months.\n- you started the employment, but it was terminated within two years of you starting, and you do not satisfy the Minister that you made a genuine effort to be engaged in that employment for the required period.\nyou started the employment, but it was terminated within two years of you starting, and you do not satisfy the Minister that you made a genuine effort to be engaged in that employment for the required period.\n\n### Employer obligations\n\nEmployer obligations\nDetails\n\nThe employer must make sure that all relevant workplace laws and award conditions are met.\n\nThe employer must make sure that all relevant workplace laws and award conditions are met.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/regional-sponsored-migration-scheme-(subclasses-119-and-857)#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/regional-sponsored-migration-scheme-(subclasses-119-and-857)#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:31:32.690938",
  "metadata": {}
}