{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-sponsored-visa-subclass-886",
  "title": "Skilled — Sponsored visa (subclass 886)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Skilled — Sponsored visa (subclass 886) Page Content ​The Skilled – Sponsored visa (subclass 886) closed to new applications on 1 January 2013. You must be in Australia when this visa is granted. Visa applicants Details This information is for people who have already applied for Skilled – Sponsored visa (subclass 886). You can no longer apply for this visa. Your application will be assessed against the requirements detailed below. After you have applied Details After you have lodged your application and documents, we will acknowledge that we have received your information. We will also assign you a case officer who will consider your application and can ask for an interview, ask for more information and make a decision. Wait for a decision Details Your application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete. If you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A , you can apply for Bridging visa B to travel outside Australia while you wait for a decision. Health and character requirements Details We will contact you when you need to provide health or character documents. Debts to the Australian Government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Provide more information Details You can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 - Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. Withdrawing your application Details You can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number. ​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​ Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to tell us if your situation changes Visa decision Details If the visa is granted, we will let you know: when you can use the visa the visa grant number any conditions attached to the visa.​ If the visa is not granted, we will let you know: why the visa was refused your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed the time limit for lodging an appeal. Contact information Details ​If information needs to be updated, contact the Adelaide General Skilled Migration (GSM) processing centre .​​ Visa holders Details This information is for people who have already been granted a Skilled Sponsored visa (subclass 886). It explains your rights and obligations.​ You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa: stay in Australia indefinitely work and study in Australia enrol in Medicare Australia's scheme for health-related care and expenses apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia). Your obligations Details You and your family must comply with all visa conditions and Australian laws. If you are nominated by a state or territory government agency, states and territories might also specify requirements that include: living in the nominating state or territory for a specified minimum time telling the state or territory your address, both before and after you arrive in Australia completing surveys and providing other post-arrival information they ask for. Sponsors Details This information is for a person who has applied to sponsor a relative for a Skilled Sponsored visa (subclass 886). This visa has now closed to new applications. ​ You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long the sponsorship lasts Details Your sponsorship lasts for two years after your relative’s visa is granted. Sponsor obligations Details As a sponsor you must sign a sponsorship undertaking and agree to help the applicant for two years after their visa is granted. This includes: accommodation and financial assistance as required to help meet their living needs other sup​port, such as children, to help them attend English language classes, if needed information and advice (including information about employment in Australia) to help them settle in Australia.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Skilled — Sponsored visa (subclass 886)\n\nSkilled — Sponsored visa (subclass 886)\nPage Content\n\n​The Skilled – Sponsored visa (subclass 886) closed to new applications on 1 January 2013.\n\n​The Skilled – Sponsored visa (subclass 886) closed to new applications on 1 January 2013.\n\nYou must be in Australia when this visa is granted.\n\nYou must be in Australia when this visa is granted.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\nThis information is for people who have already applied for Skilled – Sponsored visa (subclass 886).\n\nThis information is for people who have already applied for Skilled – Sponsored visa (subclass 886).\n\nYou can no longer apply for this visa.\n\nYou can no longer apply for this visa.\n\nYour application will be assessed against the requirements detailed below.\n\nYour application will be assessed against the requirements detailed below.\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nWe will also assign you a case officer who will consider your application and can ask for an interview, ask for more information and make a decision.\n\nWe will also assign you a case officer who will consider your application and can ask for an interview, ask for more information and make a decision.\n\n#### Wait for a decision\n\nWait for a decision\nDetails\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given aBridging visa A, you can apply forBridging visa Bto travel outside Australia while you wait for a decision.\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a\nBridging visa A\n, you can apply for\nBridging visa B\nto travel outside Australia while you wait for a decision.\n\n#### Health and character requirements\n\nHealth and character requirements\nDetails\n\nWe will contact you when you need to provide health or character documents.\n\nWe will contact you when you need to provide health or character documents.\n\n#### Debts to the Australian Government\n\nDebts to the Australian Government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 - Notification of incorrect answer(s) (168KB PDF)\nForm 1023 - Notification of incorrect answer(s) (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\n#### Withdrawing your application\n\nWithdrawing your application\nDetails\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will let you know:\n\nIf the visa is granted, we will let you know:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.​\nany conditions attached to the visa.​\n\nIf the visa is not granted, we will let you know:\n\nIf the visa is not granted, we will let you know:\n- why the visa was refused\nwhy the visa was refused\n- your review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\nyour review rights (if any). Where applicable, your sponsor can apply for the decision to be reviewed\n- the time limit for lodging an appeal.\nthe time limit for lodging an appeal.\n\n### Contact information\n\nContact information\nDetails\n\n​If information needs to be updated, contact theAdelaide General Skilled Migration (GSM) processing centre.​​\n\n​If information needs to be updated, contact the\nAdelaide General Skilled Migration (GSM) processing centre\n.​​\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Skilled Sponsored visa (subclass 886). It explains your rights and obligations.​\n\nThis information is for people who have already been granted a Skilled Sponsored visa (subclass 886). It explains your rights and obligations.​\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicareAustralia's scheme for health-related care and expenses\nenrol in\nMedicare\nAustralia's scheme for health-related care and expenses\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\ntravel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nIf you are nominated by a state or territory government agency, states and territories might also specify requirements that include:\n\nIf you are nominated by a state or territory government agency, states and territories might also specify requirements that include:\n- living in the nominating state or territory for a specified minimum time\nliving in the nominating state or territory for a specified minimum time\n- telling the state or territory your address, both before and after you arrive in Australia\ntelling the state or territory your address, both before and after you arrive in Australia\n- completing surveys and providing other post-arrival information they ask for.\ncompleting surveys and providing other post-arrival information they ask for.\n\n## Sponsors\n\nSponsors\nDetails\n\nThis information is for a person who has applied to sponsor a relative for a Skilled Sponsored visa (subclass 886).\n\nThis information is for a person who has applied to sponsor a relative for a Skilled Sponsored visa (subclass 886).\n\nThis visa has now closed to new applications. ​\n\nThis visa has now closed to new applications. ​\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long the sponsorship lasts\n\nHow long the sponsorship lasts\nDetails\n\nYour sponsorship lasts for two years after your relative’s visa is granted.\n\nYour sponsorship lasts for two years after your relative’s visa is granted.\n\n### Sponsor obligations\n\nSponsor obligations\nDetails\n\nAs a sponsor you must sign a sponsorship undertaking and agree to help the applicant for two years after their visa is granted.\n\nAs a sponsor you must sign a sponsorship undertaking and agree to help the applicant for two years after their visa is granted.\n\nThis includes:\n\nThis includes:\n- accommodation and financial assistance as required to help meet their living needs\naccommodation and financial assistance as required to help meet their living needs\n- other sup​port, such as children, to help them attend English language classes, if needed\nother sup​port, such as children, to help them attend English language classes, if needed\n- information and advice (including information about employment in Australia) to help them settle in Australia.\ninformation and advice (including information about employment in Australia) to help them settle in Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-sponsored-visa-subclass-886#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-sponsored-visa-subclass-886#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:34:52.451100",
  "metadata": {}
}