{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988",
  "title": "Maritime Crew visa",
  "raw_text": "===== main placeholder ========================================== Subclass 988 Maritime Crew visa This visa allows foreign crew on a Maritime Crew visa eligible ship to enter Australia by sea when on an international voyage. It is also for the partner or dependent child of a foreign crew member of an eligible ship, when on the same ship. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay You can stay in Australia as long as you are a crew member of a Maritime Crew Visa (MCV) eligible ship that is in Australia. Cost Free Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can... arrive and depart Australia by sea as a crew member of an MCV eligible ship stay in Australia for as long as you are signed on as a crew member of an MCV eligible ship sign off your ship to join another MCV eligible ship, or to leave Australia only perform work in Australia that meets the normal operational duties of a crew member of your ship only arrive by sea - if you want to fly to Australia, you will need to hold another valid visa. See all conditions Check your eligibility You must: be outside Australia when you apply comply with Australia's health and quarantine requirements be a crew member, or have a current offer to be a crew member, on an MCV eligible ship, such as a cargo or passenger ship on an international voyage to Australia not be a crew member, or seeking to join, on an ineligible ship including private sector research vessels, most fishing vessels, yachts or superyachts not be an Australian citizen or the holder of a permanent Australian visa. Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application Apply Check your Maritime visa status About this visa With this visa you can Which ships you can work on in Australia Apply from How long you can stay Stay longer Include family Travel Cost Processing times Your obligations Health insurance Visa label With this visa you can arrive and depart Australia by sea as a crew member of an MCV eligible ship stay in Australia for as long as you are signed on as a crew member of an MCV eligible ship sign off your ship in Australia to leave Australia, or to join another MCV eligible ship only perform work in Australia as a crew member that meets the normal operational duties of your MCV eligible ship. With this visa you cannot: enter Australia by air only holding this visa. To fly to Australia, you will also need another visa to enter enter Australia by sea on a type of ship that is not specified as eligible for an MCV stay as a visitor or tourist, or permanently. You can hold a Visitor visa at the same time as you hold an MCV to visit or sightsee Australia while you are not working as a crew member on a ship work in Australia, in port or at sea, doing work that is not directly related to the operation of the ship as a member of crew bypass Australia’s health and quarantine requirements. For more information on visa options, see Explore visa options Which ships you can work on in Australia Ships that do meet the eligibility for a Maritime Crew Visa include: cargo ships carrying goods between Australia and overseas ports international cruise ships with paying passengers foreign government owned and operated research ships ships granted Public Vessel Status by Australia’s Department of Foreign Affairs and Trade ships that have been entered for home consumption or imported under specific sections of Australia’s Customs Act 1901 and that have been registered on the Australian International Shipping Register (this does not include registration on the Australian General Shipping Register). Ships that are not eligible include: small marine crafts, yachts and superyachts petroleum export tankers that go to both an offshore resource activity area and an Australian port on the same international journey trawlers and cable laying vessels most fishing vessels research vessels that are not owned and operated by a foreign government. Apply from You must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided. You must not travel to Australia without a visa. How long you can stay Maritime Crew visas last for three years unless they are ceased for one of the following reasons: you try to enter Australia, or you are working in Australia, on a ship that is not a MCV eligible ship while in Australia, you do work that is not related to the normal operational duties of the ship you arrive in Australia by air and do not sign on to your ship within five days of arrival or before any other visa you hold ceases, whichever is longer you sign off your ship, and you do not: leave Australia hold another type of visa or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs) your ship has been imported or brought into Australia for sale and: was not registered on the Australian International Shipping Register, or it was registered but that registration has ceased, and you do not leave Australia, hold another suitable visa, or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs) you leave a vessel after arriving in Australia without being immigration-cleared you hold another visa and the other visa is cancelled for a reason other than on character grounds we determined that it is undesirable for you to continue to hold a Maritime Crew visa. While the visa is valid you can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want. If you want to enter Australia by air to join a ship, and you hold a Maritime Crew visa, you will need another visa to enter. For more information on visa options, see Explore visa options Stay longer You cannot apply for a new Maritime Crew visa while you are in Australia. You must apply for another visa. You need to do this before your current visa ceases. For more information on visa options, see Explore visa options Include family Members of the family unit can apply for Maritime Crew visas if they are travelling on the same ship as you with permission from the vessel master. They must lodge separate application forms. The Maritime Crew visa held by members of your family unit will cease if: your Maritime Crew visa ceases they enter Australia on a ship without you and don't hold a valid visa other than the Maritime Crew visa they stop travelling with you and do not leave Australia or get another visa. Family members are not permitted to work in Australia on a Maritime Crew visa. Travel You can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want while the visa is valid. You cannot fly into Australia only holding a Maritime Crew visa. Cost Free Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your obligations You and members of your family unit must meet all visa conditions and obey Australian laws. Learn more about conditions for this visa Health insurance You are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. Learn more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Be outside Australia You must be outside Australia when you apply for this visa. Be a crew member on a Maritime Crew visa eligible ship You must be an articled crew member on a Maritime Crew visa eligible ship that is taking an international voyage to Australia. Details Articled crew members This includes: people under contract or subcontract, involved in the usual day to day routine maintenance or duties of a ship while it is at sea people doing scientific research on a research ship owned by a foreign government. It does not include those who only work on a ship while it is in port or dry dock unless they are travelling with the ship. Maritime Crew visa eligible ship To be eligible for crew to enter Australia on a Maritime Crew visa, the ship must meet one of the following activities: used for the commercial trading of cargo between Australia and international ports used for carrying paying passengers owned and operated by a foreign government to do scientific research approved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade has been imported or entered for home consumption under specific sections of Australia’s Customs Act 1901 and is registered in the Australian International Shipping Register. Examples of the types of ships that are not eligible for Maritime Crew visa holders to enter Australia on are: small marine craft, private yachts or superyachts petroleum export tankers that go to both an offshore resource platform and an Australian port on the same international journey fishing vessels, trawlers and cable laying vessels research vessels that are not owned and operated by a foreign government. Meet our character requirement You must meet our character requirement Pay your debts to the Australian Government If you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back. Not had a refused application or cancelled visa We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply See if you hold a Maritime Crew visa that is still valid with the Maritime Crew visa online status enquiry page Ensure you apply for the visa well ahead of your travel. We may require further information from you and time to assess that information. Do not travel to Australia without a valid visa. Ensure that you enter Australia on a Maritime Crew visa eligible ship, which is a ship that: is transporting commercial cargo between Australia and international ports is carrying paying passengers is owned and operated by a foreign government to do scientific research has been approved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade has been imported or entered for home consumption under specific sections of Australia’s Customs Act 1901 and is registered on the Australian International Shipping Register. Examples of the types of ships that are not eligible for Maritime Crew visa holders to enter Australia on are: small marine craft, private yachts or superyachts petroleum export tankers that go to both an offshore resource platform and an Australian port on the same international journey fishing vessels and trawlers operating in Australia’s Exclusive Economic Zone research vessels that are not owned and operated by a foreign government. Show steps Check your passport If you plan to get a new passport, you should do so before applying for your visa. Your visa is linked to the passport number you use in your application. You and your family members need valid passports before we will grant this visa. A seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply using your national passport. See how If your previous Maritime crew visa is still valid you should not apply for another one unless it is going to expire before you are going to enter Australia or during your voyage in Australia as a member of crew of a non-military ship. You must not arrive or be in Australia without a visa. and you want to fly to Australia to join a ship, you will need another visa to enter Australia. You could apply for a Transit visa (subclass 771), or another visa that lets you enter Australia by air. You can hold a Maritime Crew visa at the same time as you hold another visa. Your Maritime Crew visa will be the visa in effect while you are signed on to a non-military ship. If you sign off your ship in Australia and you don't hold another visa to stay in Australia, you have five days to depart or apply for another visa to stay in Australia, or your Maritime Crew visa will cease. To find an appropriate other visa, use the Visa finder See how Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents You will be able to check ImmiAccount for what documents we need from you before you submit your application. You should submit the required identity, employment and education/qualification documentation with your application in ImmiAccount . If you do not provide these documents at time of your application, the decision may be delayed. If you are applying as a partner or dependant of a crew member, we need you to submit identity documents and other documents to prove you are a family member. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or do not provide true information Identity documents Provide: colour copies of the pages of your current passport showing your: photo personal details passport issue and expiry dates A seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply and provide evidence of your national passport. copy of National Identity Card (both sides) if you have one Also provide: proof of change of name if you have had one Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Character documents We will tell you if and when you need to get police certificates Provide any military service record or discharge papers, if applicable. Employment documents Provide: documentary proof that you are employed on, or will be employed on, a non-military ship that will be in Australia a statement from the vessel’s local shipping/handling agent. The statement must state: your name the name of the company employing you the name of the ship you will join the date you arrive in Australia the port and date you expect to join the ship See how Education/Qualification documents Provide evidence of your highest recognised qualification that relates to your employment as a crew member. This should be a copy of an educational certificate such as a Degree or Diploma. Partner documents Provide: identity documents character documents documents about other relationships, if applicable Provide either: your current marriage certificate or enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply Documents that prove your de facto relationship include: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Dependants under 18 documents For every dependent under 18 years old who is applying with you, provide: identity documents proof of your relationship with them, like a birth or marriage certificate copies of the adoption paper, if applicable. character documents, if applicable See how Parental responsibility documents For every dependent under 18 years old who is applying with you, you must get consent from anyone who: has a legal right to decide where the dependant lives and is not coming to Australia with the dependant They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to visit Australia on this visa Include a document with the signature and photo of the person who completed the form or declaration, such as a: passport driver’s licence If the child is not staying with a relative or legal guardian while in Australia, provide Form 1257 Undertaking declaration (211KB PDF) . The person they are staying with must sign the form. Dependants 18 or older documents To include your child who is over 18 in your visa application, they must be: over 18 years of age but not yet turned 23, and dependent on you or your partner, or over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner Provide: identity documents documents about their other relationships, if applicable character documents You must also provide proof the child is dependent on you: proof of your relationship with the dependent such as a birth certificate or adoption papers a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of financial dependency such as bank statements, money transfers and rent receipts if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application. See how For online applications See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Attach Attach a document only once, even if you are using it to show more than one thing. Learn more about attaching documents For paper applications See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify Do not certify police certificates. You need to send us the originals. Have a certified copy of all other documents. This includes: non-English documents English translations Keep a copy of your application. See how Send Send us: original police certificates certified copies of all other documents as much information as possible to help us decide on your application each document only once, even if you are using it to show more than one thing all documents with your application, if you can See how Step 3 Apply for the visa You must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or do not provide true information Apply online Apply in ImmiAccount Attach documents Submit family applications together You must complete an application for each person travelling to Australia, including children. Each person holds their own visa. See how Apply on paper If you can't apply online, complete the following form: Form 1273 Application for a Maritime Crew (Temporary) visa (285KB PDF) Send the completed form by post or courier to the address specified on the form. Mark the envelope 'Attention: Maritime Global Processing Centre'. See how Step 4 After you apply We will let you know when we have received your application. Show steps Status updates We can’t give updates on applications within the standard processing time. If you applied online, you can check if we need more information from you in ImmiAccount Wait for us to contact you if you applied on paper. See how Send us more information We might also ask you to provide more information. If we need more information from you we will let you know by messaging you through ImmiAccount. See how Stay lawful If you are in Australia, make sure you stay lawful by holding a valid visa while we process your application. If you are in Australia and your visa is cancelled, you could become unlawful in Australia. Learn more about visa expiry See how Mistakes on your application Let us know as soon as you can. Complete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount if you applied online, or send to the office where you submitted your application. See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions. Keep a copy of the decision. If we refuse your visa, we will tell you: why we refused the visa if you have a right to a review of the decision When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia Check your travel documents You must have: a valid passport or other acceptable travel document the passport you used in your application if entering Australia by air, a valid visa to enter Australia as well as this visa. A seafarer's identity document is not acceptable. If you hold both a seafarer's passport and a national passport, you should use your national passport. When you hold this visa: you can enter or leave Australia by sea as crew member of a Maritime Crew visa eligible ship as many times as you like during the validity of your visa you can sign off your ship and have five days (or a period specified by the Department of Home Affairs) to join another Maritime Crew visa eligible ship or to leave Australia only perform work in Australia that meets the usual operational duties of a crew member of your Maritime Crew visa eligible ship only fly to Australia if you hold another valid Australian visa. To find an appropriate other visa, use the Visa finder Check that any ship that you will be on in Australia is a Maritime Crew visa eligible ship. In Australia What you must do on your visa You must follow all visa conditions and Australian laws. Staying longer You cannot apply for a Maritime Crew visa while you are in Australia. You must hold a valid visa for the whole time that you are in Australia. If a change in plans means that you will not be able to leave Australia until after your current visa expires, you should apply for another visa before your visa expires. Explore your visa options If you cannot leave Australia within 5 days of signing off your ship, a small extension can be given in limited circumstances. It is important that you contact us while your Maritime Crew visa is still valid to ask for an extension. See your visa expiry, conditions and work and study entitlements in VEVO Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working Maritime Crew visa holders can only work as the crew member of a Maritime Crew visa eligible ship. To see your conditions for work, use VEVO For information on your workplace rights and entitlements, see the Australian Maritime Safety Authority's regulations and standards Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. After you leave International Movement Record To prove you have been to Australia, request your international movement records",
  "main_content": "===== main placeholder ==========================================\nSubclass 988\n\n# Maritime Crew visa\n\nMaritime Crew visa\n\nThis visa allows foreign crew on a Maritime Crew visa eligible ship to enter Australia by sea when on an international voyage. It is also for the partner or dependent child of a foreign crew member of an eligible ship, when on the same ship.\n\nThis visa allows foreign crew on a Maritime Crew visa eligible ship to enter Australia by sea when on an international voyage. It is also for the partner or dependent child of a foreign crew member of an eligible ship, when on the same ship.\n\nThis visa allows foreign crew on a Maritime Crew visa eligible ship to enter Australia by sea when on an international voyage. It is also for the partner or dependent child of a foreign crew member of an eligible ship, when on the same ship.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nYou can stay in Australia as long as you are a crew member of a Maritime Crew Visa (MCV) eligible ship that is in Australia.\n\nYou can stay in Australia as long as you are a crew member of a Maritime Crew Visa (MCV) eligible ship that is in Australia.\n\n#### Cost\n\nCost\n\nFree\n\nFree\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can...\n\nWith this visa, you can...\n- arrive and depart Australia by sea as a crew member of an MCV eligible ship\narrive and depart Australia by sea as a crew member of an MCV eligible ship\n- stay in Australia for as long as you are signed on as a crew member of an MCV eligible ship\nstay in Australia for as long as you are signed on as a crew member of an MCV eligible ship\n- sign off your ship to join another MCV eligible ship, or to leave Australia\nsign off your ship to join another MCV eligible ship, or to leave Australia\n- only perform work in Australia that meets the normal operational duties of a crew member of your ship\nonly perform work in Australia that meets the normal operational duties of a crew member of your ship\n- only arrive by sea - if you want to fly to Australia, you will need to hold another valid visa.\nonly arrive by sea - if you want to fly to Australia, you will need to hold another valid visa.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must:\n\nYou must:\n- be outside Australia when you apply\nbe outside Australia when you apply\n- comply with Australia's health and quarantine requirements\ncomply with Australia's health and quarantine requirements\n- be a crew member, or have a current offer to be a crew member, on an MCV eligible ship, such as a cargo or passenger ship on an international voyage to Australia\nbe a crew member, or have a current offer to be a crew member, on an MCV eligible ship, such as a cargo or passenger ship on an international voyage to Australia\n- not be a crew member, or seeking to join, on an ineligible ship including private sector research vessels, most fishing vessels, yachts or superyachts\nnot be a crew member, or seeking to join, on an ineligible ship including private sector research vessels, most fishing vessels, yachts or superyachts\n- not be an Australian citizen or the holder of a permanent Australian visa.\nnot be an Australian citizen or the holder of a permanent Australian visa.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\n\nApplyCheck your Maritime visa status\n\nApply\nCheck your Maritime visa status\nAbout this visa\nWith this visa you can\nWhich ships you can work on in Australia\nApply from\nHow long you can stay\nStay longer\nInclude family\nTravel\nCost\nProcessing times\nYour obligations\nHealth insurance\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- arrive and depart Australia by sea as a crew member of an MCV eligible ship\narrive and depart Australia by sea as a crew member of an MCV eligible ship\n- stay in Australia for as long as you are signed on as a crew member of an MCV eligible ship\nstay in Australia for as long as you are signed on as a crew member of an MCV eligible ship\n- sign off your ship in Australia to leave Australia, or to join another MCV eligible ship\nsign off your ship in Australia to leave Australia, or to join another MCV eligible ship\n- only perform work in Australia as a crew member that meets the normal operational duties of your MCV eligible ship.\nonly perform work in Australia as a crew member that meets the normal operational duties of your MCV eligible ship.\n\nWith this visa you cannot:\n\nWith this visa you cannot:\n- enter Australia by air only holding this visa. To fly to Australia, you will also need another visa to enter\nenter Australia by air only holding this visa. To fly to Australia, you will also need another visa to enter\n- enter Australia by sea on a type of ship that is not specified as eligible for an MCV\nenter Australia by sea on a type of ship that is not specified as eligible for an MCV\n- stay as a visitor or tourist, or permanently. You can hold a Visitor visa at the same time as you hold an MCV to visit or sightsee Australia while you are not working as a crew member on a ship\nstay as a visitor or tourist, or permanently. You can hold a Visitor visa at the same time as you hold an MCV to visit or sightsee Australia while you are not working as a crew member on a ship\n- work in Australia, in port or at sea, doing work that is not directly related to the operation of the ship as a member of crew\nwork in Australia, in port or at sea, doing work that is not directly related to the operation of the ship as a member of crew\n- bypass Australia’s health and quarantine requirements.\nbypass Australia’s health and quarantine requirements.\n\nFor more information on visa options, seeExplore visa options.\n\nFor more information on visa options, see\nExplore visa options\n.\n\n## Which ships you can work on in Australia\n\nWhich ships you can work on in Australia\n\nShips thatdomeet the eligibility for a Maritime Crew Visa include:\n\nShips that\ndo\nmeet the eligibility for a Maritime Crew Visa include:\n- cargo ships carrying goods between Australia and overseas ports\ncargo ships carrying goods between Australia and overseas ports\n- international cruise ships with paying passengers\ninternational cruise ships with paying passengers\n- foreign government owned and operated research ships\nforeign government owned and operated research ships\n- ships granted Public Vessel Status by Australia’s Department of Foreign Affairs and Trade\nships granted Public Vessel Status by Australia’s Department of Foreign Affairs and Trade\n- ships that have been entered for home consumption or imported under specific sections of Australia’sCustoms Act 1901andthat have been registered on theAustralian International Shipping Register(this does not include registration on the AustralianGeneralShipping Register).\nships that have been entered for home consumption or imported under specific sections of Australia’s\nCustoms Act 1901\nand\nthat have been registered on the\nAustralian International Shipping Register\n(this does not include registration on the Australian\nGeneral\nShipping Register).\n\nShips that arenoteligible include:\n\nShips that are\nnot\neligible include:\n- small marine crafts, yachts and superyachts\nsmall marine crafts, yachts and superyachts\n- petroleum export tankers that go to both an offshore resource activity areaandan Australian port on the same international journey\npetroleum export tankers that go to both an offshore resource activity area\nand\nan Australian port on the same international journey\n- trawlers and cable laying vessels\ntrawlers and cable laying vessels\n- most fishing vessels\nmost fishing vessels\n- research vessels that are not owned and operated by a foreign government.\nresearch vessels that are not owned and operated by a foreign government.\n\n## Apply from\n\nApply from\n\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\n\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\n\nYou must not travel to Australia without a visa.\n\nYou must not travel to Australia without a visa.\n\n## How long you can stay\n\nHow long you can stay\n\nMaritime Crew visas last for three years unless they are ceased for one of the following reasons:\n\nMaritime Crew visas last for three years unless they are ceased for one of the following reasons:\n- you try to enter Australia, or you are working in Australia, on a ship that is not a MCV eligible ship\nyou try to enter Australia, or you are working in Australia, on a ship that is not a MCV eligible ship\n- while in Australia, you do work that is not related to the normal operational duties of the ship\nwhile in Australia, you do work that is not related to the normal operational duties of the ship\n- you arrive in Australia by air and do not sign on to your ship within five days of arrival or before any other visa you hold ceases, whichever is longer\nyou arrive in Australia by air and do not sign on to your ship within five days of arrival or before any other visa you hold ceases, whichever is longer\n- you sign off your ship, and you do not:leave Australiahold another type of visa orsign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nyou sign off your ship, and you do not:\n- leave Australia\nleave Australia\n- hold another type of visa or\nhold another type of visa or\n- sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nsign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\n- your ship has been imported or brought into Australia for sale and:was not registered on the Australian International Shipping Register, orit was registered but that registration has ceased, andyou do not leave Australia, hold another suitable visa, or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nyour ship has been imported or brought into Australia for sale and:\n- was not registered on the Australian International Shipping Register, or\nwas not registered on the Australian International Shipping Register, or\n- it was registered but that registration has ceased, and\nit was registered but that registration has ceased, and\n- you do not leave Australia, hold another suitable visa, or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\nyou do not leave Australia, hold another suitable visa, or sign on to another MCV eligible ship within five days (or a period specified by the Department of Home Affairs)\n- you leave a vessel after arriving in Australia without being immigration-cleared\nyou leave a vessel after arriving in Australia without being immigration-cleared\n- you hold another visa and the other visa is cancelled for a reason other than on character grounds\nyou hold another visa and the other visa is cancelled for a reason other than on character grounds\n- we determined that it is undesirable for you to continue to hold a Maritime Crew visa.\nwe determined that it is undesirable for you to continue to hold a Maritime Crew visa.\n\nWhile the visa is valid you can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want.\n\nWhile the visa is valid you can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want.\n\nIf you want to enter Australia by air to join a ship, and you hold a Maritime Crew visa, you will need another visa to enter.\n\nIf you want to enter Australia by air to join a ship, and you hold a Maritime Crew visa, you will need another visa to enter.\n\nFor more information on visa options, seeExplore visa options.\n\nFor more information on visa options, see\nExplore visa options\n.\n\n## Stay longer\n\nStay longer\n\nYou cannot apply for a new Maritime Crew visa while you are in Australia. You must apply for another visa. You need to do this before your current visa ceases.\n\nYou cannot apply for a new Maritime Crew visa while you are in Australia. You must apply for another visa. You need to do this before your current visa ceases.\n\nFor more information on visa options, seeExplore visa options.\n\nFor more information on visa options, see\nExplore visa options\n.\n\n## Include family\n\nInclude family\n\nMembers of the family unitcan apply for Maritime Crew visas if they are travelling on the same ship as you with permission from the vessel master. They must lodge separate application forms.\n\nMembers of the family unit\ncan apply for Maritime Crew visas if they are travelling on the same ship as you with permission from the vessel master. They must lodge separate application forms.\n\nThe Maritime Crew visa held by members of your family unit will cease if:\n\nThe Maritime Crew visa held by members of your family unit will cease if:\n- your Maritime Crew visa ceases\nyour Maritime Crew visa ceases\n- they enter Australia on a ship without you and don't hold a valid visa other than the Maritime Crew visa\nthey enter Australia on a ship without you and don't hold a valid visa other than the Maritime Crew visa\n- they stop travelling with you and do not leave Australia or get another visa.\nthey stop travelling with you and do not leave Australia or get another visa.\n\nFamily members are not permitted to work in Australia on a Maritime Crew visa.\n\nFamily members are not permitted to work in Australia on a Maritime Crew visa.\n\n## Travel\n\nTravel\n\nYou can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want while the visa is valid.\n\nYou can enter Australia by sea as a member of a Maritime Crew visa eligible ship as many times as you want while the visa is valid.\n\nYou cannot fly into Australia only holding a Maritime Crew visa.\n\nYou cannot fly into Australia only holding a Maritime Crew visa.\n\n## Cost\n\nCost\n\nFree\n\nFree\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n## Your obligations\n\nYour obligations\n\nYou and members of your family unit must meet all visa conditions and obey Australian laws.\n\nYou and members of your family unit must meet all visa conditions and obey Australian laws.\n\nLearn more aboutconditions for this visa.\n\nLearn more about\nconditions for this visa\n.\n\n## Health insurance\n\nHealth insurance\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors\n.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Be outside Australia\n\nBe outside Australia\n\nYou must be outside Australia when you apply for this visa.\n\nYou must be outside Australia when you apply for this visa.\n\n## Be a crew member on a Maritime Crew visa eligible ship\n\nBe a crew member on a Maritime Crew visa eligible ship\n\nYou must be an articled crew member on a Maritime Crew visa eligible ship that is taking an international voyage to Australia.\n\nYou must be an articled crew member on a Maritime Crew visa eligible ship that is taking an international voyage to Australia.\nDetails\n\n### Articled crew members\n\nArticled crew members\n\nThis includes:\n\nThis includes:\n- people under contract or subcontract, involved in the usual day to day routine maintenance or duties of a ship while it is at sea\npeople under contract or subcontract, involved in the usual day to day routine maintenance or duties of a ship while it is at sea\n- people doing scientific research on a research ship owned by a foreign government.\npeople doing scientific research on a research ship owned by a foreign government.\n\nIt does not include those who only work on a ship while it is in port or dry dock unless they are travelling with the ship.\n\nIt does not include those who only work on a ship while it is in port or dry dock unless they are travelling with the ship.\n\n### Maritime Crew visa eligible ship\n\nMaritime Crew visa eligible ship\n\nTo be eligible for crew to enter Australia on a Maritime Crew visa, the ship must meet one of the following activities:\n\nTo be eligible for crew to enter Australia on a Maritime Crew visa, the ship must meet one of the following activities:\n- used for the commercial trading of cargo between Australia and international ports\nused for the commercial trading of cargo between Australia and international ports\n- used for carrying paying passengers\nused for carrying paying passengers\n- owned and operated by a foreign government to do scientific research\nowned and operated by a foreign government to do scientific research\n- approved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade\napproved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade\n- has been imported or entered for home consumption under specific sections of Australia’sCustoms Act 1901and is registered in the Australian International Shipping Register.\nhas been imported or entered for home consumption under specific sections of Australia’s\nCustoms Act 1901\nand is registered in the Australian International Shipping Register.\n\nExamples of the types of ships that arenoteligible for Maritime Crew visa holders to enter Australia on are:\n\nExamples of the types of ships that are\nnot\neligible for Maritime Crew visa holders to enter Australia on are:\n- small marine craft, private yachts or superyachts\nsmall marine craft, private yachts or superyachts\n- petroleum export tankers that go to both an offshore resource platform and an Australian port on the same international journey\npetroleum export tankers that go to both an offshore resource platform and an Australian port on the same international journey\n- fishing vessels, trawlers and cable laying vessels\nfishing vessels, trawlers and cable laying vessels\n- research vessels that are not owned and operated by a foreign government.\nresearch vessels that are not owned and operated by a foreign government.\n\n## Meet our character requirement\n\nMeet our character requirement\n\nYou must meet ourcharacter requirement.\n\nYou must meet our\ncharacter requirement\n.\n\n## Pay your debts to the Australian Government\n\nPay your debts to the Australian Government\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\n## Not had a refused application or cancelled visa\n\nNot had a refused application or cancelled visa\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeCan I go to Australia.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nSee if you hold a Maritime Crew visa that is still valid with theMaritime Crew visa online status enquiry page.\n\nSee if you hold a Maritime Crew visa that is still valid with the\nMaritime Crew visa online status enquiry page\n.\n\nEnsure you apply for the visa well ahead of your travel. We may require further information from you and time to assess that information.\n\nEnsure you apply for the visa well ahead of your travel. We may require further information from you and time to assess that information.\n\nDo not travel to Australia without a valid visa.\n\nDo not travel to Australia without a valid visa.\n\nEnsure that you enter Australia on a Maritime Crew visa eligible ship, which is a ship that:\n\nEnsure that you enter Australia on a Maritime Crew visa eligible ship, which is a ship that:\n- is transporting commercial cargo between Australia and international ports\nis transporting commercial cargo between Australia and international ports\n- is carrying paying passengers\nis carrying paying passengers\n- is owned and operated by a foreign government to do scientific research\nis owned and operated by a foreign government to do scientific research\n- has been approved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade\nhas been approved for 'Public Vessel Status' by the Australian Department of Foreign Affairs and Trade\n- has been imported or entered for home consumption under specific sections of Australia’sCustoms Act 1901and is registered on the Australian International Shipping Register.\nhas been imported or entered for home consumption under specific sections of Australia’s\nCustoms Act 1901\nand is registered on the Australian International Shipping Register.\n\nExamples of the types of ships that arenoteligible for Maritime Crew visa holders to enter Australia on are:\n\nExamples of the types of ships that are\nnot\neligible for Maritime Crew visa holders to enter Australia on are:\n- small marine craft, private yachts or superyachts\nsmall marine craft, private yachts or superyachts\n- petroleum export tankers that go to both an offshore resource platformandan Australian port on the same international journey\npetroleum export tankers that go to both an offshore resource platform\nand\nan Australian port on the same international journey\n- fishing vessels and trawlers operating in Australia’s Exclusive Economic Zone\nfishing vessels and trawlers operating in Australia’s Exclusive Economic Zone\n- research vessels that are not owned and operated by a foreign government.\nresearch vessels that are not owned and operated by a foreign government.\nShow\n                    steps\n\n#### Check your passport\n\nCheck your passport\n\nIf you plan to get a new passport, you should do so before applying for your visa. Your visa is linked to the passport number you use in your application.\n\nIf you plan to get a new passport, you should do so before applying for your visa. Your visa is linked to the passport number you use in your application.\n\nYou and your family members need valid passports before we will grant this visa.\n\nYou and your family members need valid passports before we will grant this visa.\n\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply using your national passport.\n\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply using your national passport.\nSee how\n\n#### If your previous Maritime crew visa is still valid\n\nIf your previous Maritime crew visa is still valid\n- you should not apply for another one unless it is going to expire before you are going to enter Australia or during your voyage in Australia as a member of crew of a non-military ship. You must not arrive or be in Australia without a visa.\nyou should not apply for another one unless it is going to expire before you are going to enter Australia or during your voyage in Australia as a member of crew of a non-military ship. You must not arrive or be in Australia without a visa.\n- and you want to fly to Australia to join a ship, you will need another visa to enter Australia. You could apply for a Transit visa (subclass 771), or another visa that lets you enter Australia by air.\nand you want to fly to Australia to join a ship, you will need another visa to enter Australia. You could apply for a Transit visa (subclass 771), or another visa that lets you enter Australia by air.\n- You can hold a Maritime Crew visa at the same time as you hold another visa. Your Maritime Crew visa will be the visa in effect while you are signed on to a non-military ship. If you sign off your ship in Australia and you don't hold another visa to stay in Australia, you have five days to depart or apply for another visa to stay in Australia, or your Maritime Crew visa will cease.\nYou can hold a Maritime Crew visa at the same time as you hold another visa. Your Maritime Crew visa will be the visa in effect while you are signed on to a non-military ship. If you sign off your ship in Australia and you don't hold another visa to stay in Australia, you have five days to depart or apply for another visa to stay in Australia, or your Maritime Crew visa will cease.\n\nTo find an appropriate other visa, use theVisa finder.\n\nTo find an appropriate other visa, use the\nVisa finder\n.\nSee how\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou will be able to checkImmiAccountfor what documents we need from you before you submit your application.\n\nYou will be able to check\nImmiAccount\nfor what documents we need from you before you submit your application.\n\nYou should submit the required identity, employment and education/qualification documentation with your application inImmiAccount. If you do not provide these documents at time of your application, the decision may be delayed.\n\nYou should submit the required identity, employment and education/qualification documentation with your application in\nImmiAccount\n. If you do not provide these documents at time of your application, the decision may be delayed.\n\nIf you are applying as a partner or dependant of a crew member, we need you to submit identity documents and other documents to prove you are a family member.\n\nIf you are applying as a partner or dependant of a crew member, we need you to submit identity documents and other documents to prove you are a family member.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. Seewhat happens if you can't prove your identity or do not provide true information.\n\nProvide accurate information. See\nwhat happens if you can't prove your identity or do not provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide:\n\nProvide:\n- colour copies of the pages of your current passport showing your:photopersonal detailspassport issue and expiry dates\ncolour copies of the pages of your current passport showing your:\n- photo\nphoto\n- personal details\npersonal details\n- passport issue and expiry dates\npassport issue and expiry dates\n\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply and provide evidence of your national passport.\n\nA seafarer's identity document is not acceptable with the exception of Chinese, Russian and Vietnamese seafarer passports. If you hold both a seafarer's passport and a national passport, you should apply and provide evidence of your national passport.\n- copy of National Identity Card (both sides) if you have one\ncopy of National Identity Card (both sides) if you have one\n\nAlso provide:\n\nAlso provide:\n- proof of change of name if you have had one\nproof of change of name if you have had one\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe will tell you if and when you need to getpolice certificates.\n\nWe will tell you if and when you need to get\npolice certificates\n.\n\nProvide any military service record or discharge papers, if applicable.\n\nProvide any military service record or discharge papers, if applicable.\n\n#### Employment documents\n\nEmployment documents\n\nProvide:\n\nProvide:\n- documentary proof that you are employed on, or will be employed on, a non-military ship that will be in Australia\ndocumentary proof that you are employed on, or will be employed on, a non-military ship that will be in Australia\n- a statement from the vessel’s local shipping/handling agent. The statement must state:your namethe name of the company employing youthe name of the ship you will jointhe date you arrive in Australiathe port and date you expect to join the ship\na statement from the vessel’s local shipping/handling agent. The statement must state:\n- your name\nyour name\n- the name of the company employing you\nthe name of the company employing you\n- the name of the ship you will join\nthe name of the ship you will join\n- the date you arrive in Australia\nthe date you arrive in Australia\n- the port and date you expect to join the ship\nthe port and date you expect to join the ship\nSee how\n\n#### Education/Qualification documents\n\nEducation/Qualification documents\n\nProvide evidence of your highest recognised qualification that relates to your employment as a crew member.\n\nProvide evidence of your highest recognised qualification that relates to your employment as a crew member.\n\nThis should be a copy of an educational certificate such as a Degree or Diploma.\n\nThis should be a copy of an educational certificate such as a Degree or Diploma.\n\n#### Partner documents\n\nPartner documents\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nProvide either:\n\nProvide either:\n- your current marriage certificate or\nyour current marriage certificate or\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nDocuments that prove your de facto relationship include:\n\nDocuments that prove your de facto relationship include:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependent under 18 years old who is applying with you, provide:\n\nFor every dependent under 18 years old who is applying with you, provide:\n- identity documents\nidentity documents\n- proof of your relationship with them, like a birth or marriage certificate\nproof of your relationship with them, like a birth or marriage certificate\n- copies of the adoption paper, if applicable.\ncopies of the adoption paper, if applicable.\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nFor every dependent under 18 years old who is applying with you, you must get consent from anyone who:\n\nFor every dependent under 18 years old who is applying with you, you must get consent from anyone who:\n- has a legal right to decide where the dependant lives and\nhas a legal right to decide where the dependant lives and\n- is not coming to Australia with the dependant\nis not coming to Australia with the dependant\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to visit Australia on this visa\na statutory declaration giving their consent for the child to visit Australia on this visa\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n- passport\npassport\n- driver’s licence\ndriver’s licence\n\nIf the child is not staying with a relative or legal guardian while in Australia, provideForm 1257 Undertaking declaration (211KB PDF). The person they are staying with must sign the form.\n\nIf the child is not staying with a relative or legal guardian while in Australia, provide\nForm 1257 Undertaking declaration (211KB PDF)\n. The person they are staying with must sign the form.\n\n#### Dependants 18 or older documents\n\nDependants 18 or older documents\n\nTo include your child who is over 18 in your visa application, they must be:\n\nTo include your child who is over 18 in your visa application, they must be:\n- over 18 years of age but not yet turned 23, and dependent on you or your partner, or\nover 18 years of age but not yet turned 23, and dependent on you or your partner, or\n- over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\nover 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n\nYou must also provide proof the child is dependent on you:\n\nYou must also provide proof the child is dependent on you:\n- proof of your relationship with the dependent such as a birth certificate or adoption papers\nproof of your relationship with the dependent such as a birth certificate or adoption papers\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of financial dependency such as bank statements, money transfers and rent receipts\nproof of financial dependency such as bank statements, money transfers and rent receipts\n- if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nif the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccountif you applied online, or send with your paper application.\n\nUpload your written notification or your forms to\nImmiAccount\nif you applied online, or send with your paper application.\nSee how\n\n#### For online applications\n\nFor online applications\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\n#### Attach\n\nAttach\n\nAttach a document only once, even if you are using it to show more than one thing.\n\nAttach a document only once, even if you are using it to show more than one thing.\n\nLearn more aboutattaching documents.\n\nLearn more about\nattaching documents\n.\n\n#### For paper applications\n\nFor paper applications\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nDo not certify police certificates. You need to send us the originals.\n\nDo not certify police certificates. You need to send us the originals.\n\nHave acertified copyof all other documents. This includes:\n\nHave a\ncertified copy\nof all other documents. This includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\n\nKeep a copy of your application.\n\nKeep a copy of your application.\nSee how\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much information as possible to help us decide on your application\nas much information as possible to help us decide on your application\n- each document only once, even if you are using it to show more than one thing\neach document only once, even if you are using it to show more than one thing\n- all documents with your application, if you can\nall documents with your application, if you can\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\n\nYou must be outside Australia when you apply. You can be inside or outside Australia when your visa is decided.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. Seewhat happens if you can't prove your identity or do not provide true information.\n\nProvide accurate information. See\nwhat happens if you can't prove your identity or do not provide true information\n.\n\n#### Apply online\n\nApply online\n1. Apply inImmiAccount\nApply in\nImmiAccount\n2. Attach documents\nAttach documents\n3. Submit family applications together\nSubmit family applications together\n\nYou must complete an application for each person travelling to Australia, including children. Each person holds their own visa.\n\nYou must complete an application for each person travelling to Australia, including children. Each person holds their own visa.\nSee how\n\n#### Apply on paper\n\nApply on paper\n\nIf you can't apply online, complete the following form:\n\nIf you can't apply online, complete the following form:\n- Form 1273 Application for a Maritime Crew (Temporary) visa (285KB PDF)\nForm 1273 Application for a Maritime Crew (Temporary) visa (285KB PDF)\n\nSend the completed form by post or courier to the address specified on the form. Mark the envelope 'Attention: Maritime Global Processing Centre'.\n\nSend the completed form by post or courier to the address specified on the form. Mark the envelope 'Attention: Maritime Global Processing Centre'.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application.\n\nWe will let you know when we have received your application.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe can’t give updates on applications within the standard processing time.\n\nWe can’t give updates on applications within the standard processing time.\n\nIf you applied online, you can check if we need more information from you inImmiAccount.\n\nIf you applied online, you can check if we need more information from you in\nImmiAccount\n.\n\nWait for us to contact you if you applied on paper.\n\nWait for us to contact you if you applied on paper.\nSee how\n\n#### Send us more information\n\nSend us more information\n\nWe might also ask you to provide more information.  If we need more information from you we will let you know by messaging you through ImmiAccount.\n\nWe might also ask you to provide more information.  If we need more information from you we will let you know by messaging you through ImmiAccount.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you are in Australia and your visa is cancelled, you could become unlawful in Australia.\n\nIf you are in Australia and your visa is cancelled, you could become unlawful in Australia.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can.\n\nLet us know as soon as you can.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)and attach it inImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\nand attach it in\nImmiAccount\n.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccountif you applied online, or send to the office where you submitted your application.\n\nUpload your written notification or your forms to\nImmiAccount\nif you applied online, or send to the office where you submitted your application.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions.\nyour visa conditions.\n\nKeep a copy of the decision.\n\nKeep a copy of the decision.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- if you have a right to a review of the decision\nif you have a right to a review of the decision\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid passport or other acceptable travel document\na valid passport or other acceptable travel document\n- the passport you used in your application\nthe passport you used in your application\n- if entering Australia by air, a valid visa to enter Australia as well as this visa.\nif entering Australia by air, a valid visa to enter Australia as well as this visa.\n\nA seafarer's identity document is not acceptable. If you hold both a seafarer's passport and a national passport, you should use your national passport.\n\nA seafarer's identity document is not acceptable. If you hold both a seafarer's passport and a national passport, you should use your national passport.\n\nWhen you hold this visa:\n\nWhen you hold this visa:\n- you can enter or leave Australia by sea as crew member of a Maritime Crew visa eligible ship as many times as you like during the validity of your visa\nyou can enter or leave Australia by sea as crew member of a Maritime Crew visa eligible ship as many times as you like during the validity of your visa\n- you can sign off your ship and have five days (or a period specified by the Department of Home Affairs) to join another Maritime Crew visa eligible ship or to leave Australia\nyou can sign off your ship and have five days (or a period specified by the Department of Home Affairs) to join another Maritime Crew visa eligible ship or to leave Australia\n- only perform work in Australia that meets the usual operational duties of a crew member of your Maritime Crew visa eligible ship\nonly perform work in Australia that meets the usual operational duties of a crew member of your Maritime Crew visa eligible ship\n- only fly to Australia if you hold another valid Australian visa.\nonly fly to Australia if you hold another valid Australian visa.\n\nTo find an appropriate other visa, use theVisa finder.\n\nTo find an appropriate other visa, use the\nVisa finder\n.\n\n#### Check that any ship that you will be on in Australia is a Maritime Crew visa eligible ship.\n\nCheck that any ship that you will be on in Australia is a Maritime Crew visa eligible ship.\n\n## In Australia\n\nIn Australia\n\n### What you must do on your visa\n\nWhat you must do on your visa\n\nYou must follow all visa conditions and Australian laws.\n\nYou must follow all visa conditions and Australian laws.\n\n### Staying longer\n\nStaying longer\n\nYou cannot apply for a Maritime Crew visa while you are in Australia.\n\nYou cannot apply for a Maritime Crew visa while you are in Australia.\n\nYou must hold a valid visa for the whole time that you are in Australia. If a change in plans means that you will not be able to leave Australia until after your current visa expires, you should apply for another visa before your visa expires.\n\nYou must hold a valid visa for the whole time that you are in Australia. If a change in plans means that you will not be able to leave Australia until after your current visa expires, you should apply for another visa before your visa expires.\n\nExplore your visa options\n\nExplore your visa options\n\nIf you cannot leave Australia within 5 days of signing off your ship, a small extension can be given in limited circumstances. It is important that you contact us while your Maritime Crew visa is still valid to ask for an extension.\n\nIf you cannot leave Australia within 5 days of signing off your ship, a small extension can be given in limited circumstances. It is important that you contact us while your Maritime Crew visa is still valid to ask for an extension.\n\nSee your visa expiry, conditions and work and study entitlements inVEVO.\n\nSee your visa expiry, conditions and work and study entitlements in\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nMaritime Crew visa holders can only work as the crew member of a Maritime Crew visa eligible ship.\n\nMaritime Crew visa holders can only work as the crew member of a Maritime Crew visa eligible ship.\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\nFor information on your workplace rights and entitlements, see theAustralian Maritime Safety Authority's regulations and standards.\n\nFor information on your workplace rights and entitlements, see the\nAustralian Maritime Safety Authority's regulations and standards\n.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n### After you leave\n\nAfter you leave\n\n#### International Movement Record\n\nInternational Movement Record\n\nTo prove you have been to Australia,request your international movement records.\n\nTo prove you have been to Australia,\nrequest your international movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#aboutVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/maritime-crew-988#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:20:34.328875",
  "metadata": {}
}