{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124",
  "title": "Distinguished Talent visa",
  "raw_text": "===== main placeholder ========================================== Subclass 124 Distinguished Talent visa This is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview This visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see Global Talent visa (subclass 858) . ​ Stay Permanently Cost From AUD4,110.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can work and study in Australia stay in Australia permanently sponsor eligible relatives for permanent residence in Australia if eligible, apply for Australian citizenship See all conditions Check your eligibility You must be outside Australia when this visa is granted have an internationally recognised record of exceptional and outstanding achievement in one of the following areas (and still be prominent in the area): a profession a sport the arts academia and research be nominated by an Australian citizen, Australian permanent resident, eligible New Zealand citizen , or Australian organisation with a national reputation in relation to your area of talent About this visa This visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see Global Talent visa (subclass 858) . ​ With this visa, you can Apply from How long you can stay Include family Cost Processing times Your obligations Travel Visa label With this visa, you can stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, apply for Australian citizen Newly arrived residents may have to wait before they can access certain Australian Government payments and benefits Apply from You can be in or outside Australia when you apply for the visa but not in immigration clearance . You must be outside Australia for your visa to be granted. If you are currently in Australia and hold an eligible visa you may need to consider your eligibility for the Distinguished Talent visa (subclass 858) How long you can stay This is a permanent visa. It lets you stay in Australia permanently. You become a permanent resident on the day we grant the visa. Include family You can include members of the family unit when you apply. You can also add family to your application at any time before we decide on your application. If you are under 18 years old, you can include: a parent members of the family unit of that parent Family members who apply for the visa must meet our health and character requirements. Cost The visa costs AUD4,110.00 for the main applicant. There is an additional charge for each family member who applies for the visa with you. To work out what your visa will cost use the Visa pricing estimator . The estimator does not take into account the second instalment or other costs. We can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. You might have to pay an extra fee for any applicant 18 years old or older who has less than functional English . This charge is called the second instalment. We will tell you when to pay the second instalment. The second instalment charge is AUD4,890. The Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks police certificates and biometrics Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. We assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including: whether you have lodged a complete application, including all necessary supporting documents how quickly you respond to any requests for additional information how long it takes to perform required checks on the supporting information provided how long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements how many places are available in the migration program Your obligations You and your family members must obey all Australian laws. We expect that you will contribute to Australia in your field of expertise. Travel You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility This visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see Global Talent visa (subclass 858) . ​ Be of benefit to the Australian community Details Your contribution may be: economic social cultural, or to raise Australia's academic, artistic or sports standing internationally You must contribute to the nation as a whole. Have the ability to establish yourself in Australia Details You must be able to find work in your field in Australia, or become independently established in your field in Australia. You can't include income from work outside your field. Even if this is only part of your overall income. Be internationally recognised with a record of achievement Details You must be internationally recognised with a record of achievement in: a profession a sport the arts, or academia and research Your achievements must be exceptional and outstanding. This means you: are currently prominent in your field have superior abilities to others in your field are acclaimed as exceptional in any country where your field is practised have a record of sustained achievement that is unlikely to diminish in the future You must also participate in a field that: is recognised and accepted in Australia has international standing You must have been prominent in this field in the past 2 years. Be nominated Details You must be nominated to apply for this visa. Your nominator must also meet our criteria. Your nominator must be an Australian citizen, permanent resident eligible New Zealand citizen or an Australian organisation with a national reputation in the same field as you. Where appropriate, the nomination should come from the peak Australian body. Be this age Details You can be any age to apply for this visa. If you are under 18 years old or you are aged 55 years or older when you apply, you must be of exceptional benefit to the Australian community. Have functional English Details Applicants aged 18 or over must have functional English or you will need to pay an extra charge, called the second instalment to be granted this visa. Meet our health requirement Details You and any family members who apply for the visa with you must meet our health requirement Family members not accompanying you to Australia may also need to meet our health requirement Meet our character requirement Details You and family members aged 16 years and over who apply for the visa with you must meet our character requirement Family members not accompanying you to Australia must also meet our character requirement Have paid back your debt to the Australian government Details If you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back. Sign the Australian values statement Details If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia booklet and confirm you will respect the Australian way of life and obey Australian laws when you sign an Australian Values Statement Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step This visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see Global Talent visa (subclass 858) . ​ Step 1 Before you apply Before you apply for this visa, you need an eligible individual or organisation to nominate you. Show steps Organise health exams You might need to have health examinations. You can complete them before you apply or you can wait until after you apply. Find out the examinations you need and how to arrange them. Get help with your application You don’t have to use a migration agent to apply for any visa. But if you want to, see how to find a registered migration agent Anyone can help you fill out forms or give you general help with your application. But you must let us know if you want someone to: receive your correspondence provide immigration assistance and act for you See how Step 2 Gather your documents You will need to provide documents to support the claims you make in your application and show you meet the other visa criteria. This includes evidence of your achievements in an eligible field. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Identity documents Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by Relationship documents If you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations. See how Record of achievement documents You must prove your achievements in an eligible field. Provide: relevant qualifications and awards, particularly from internationally recognised organisations supporting statements from government, professional, scientific, cultural, sporting or other relevant bodies documentary evidence which demonstrate an exceptional and outstanding record of achievement that positions you amongst the very best in your field The evidence supplied to support your record of achievement must also demonstrate prominence in the field within the 2 years immediately before applying. It should include: a reference from a person or organisation qualified to assess your claims profiles of your achievements in any media, such as magazines, newspapers or TV programs If you are younger than 18 or older than 55, you must prove you would be of exceptional benefit to the Australian community. See how Nominator documents Provide a completed Form 1000 Nomination for Distinguished Talent (538KB PDF) and relevant supporting documents a statement by your nominator that supports your claims Ability to establish yourself in Australia You must prove you are able to work or support yourself in your field of achievement. Provide: a statement detailing your knowledge of opportunities in Australia in your field information provided by your nominator letters from organisations or other relevant bodies in Australia that show future employment opportunities or possible business opportunities qualifications or experience you have gained during previous residence in Australia your employment or business background You can't include income from work outside your field. Even if this is only part of your overall income. See how Character documents We will tell you if and when you need to get a police certificate. If requested you will need to: provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. also: an overseas police certificate from every country , including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 military service records or discharge papers if you served in the armed forces of any country Complete and provide the following forms: Form 80 Personal particulars for assessment including character assessment (596KB PDF) Form 1221 Additional personal particulars information (331KB PDF) See how Functional English documents Provide proof you have at least functional English All applicants aged 18 years and older at the time of application who can't provide evidence of having at least functional English must pay a second instalment of the visa application charge If you and any family member applying with you have less than functional English, provide a statement indicating your intention to pay the second visa application charge for each person with less than functional English. We will advise you when to pay this. See how Partner documents We need to see evidence of your partner 's identity and relationship with you. Provide: identity documents and photos character documents marriage certificate, if applicable documents about other relationships, if applicable For de facto relationship provide either: evidence that your relationship is registered by an Australian State or Territory enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply For both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Dependants under 18 documents For every dependant 18 years old or younger who is applying with you, provide: copies of birth certificates or the family book showing the names of both parents of all your dependent children copies of the adoption paper, if applicable. Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) statutory declaration giving their consent for the child to visit Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable Note: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa. See how Dependants over 18 documents To include your child who is over 18 in your visa application, they must be: over 18 years of age but not yet turned 23, and dependent on you or your partner, or over 23 years of age, nable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner Provide: identity documents documents about their other relationships, if applicable character documents If your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability. Proof of dependency You must demonstrate that the child is dependent on you, by providing: proof of your relationship with the dependant such as a birth certificate or adoption papers a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide: proof they live with you their tax records proof they are currently studying proof of payments made by you to them or on their behalf Note: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956a Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice, use Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF) act for you but not provide immigration assistance, let us know in writing what they can do on your behalf (such as submit or withdraw an application for you). Send your written notification with your paper application See more about getting help with your application See how Prepare your documents See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Photographs Provide 2 recent photographs (45mm x 35mm) of each person included in the application. Photos should have: head and shoulders only a white background See how Keep Keep a copy of your completed application. Step 3 Apply for the visa This visa is closed to new applications. Step 4 After you apply We will let you know when we have received your application and documents. There are other things you need to know and might need to do. Show steps Status updates We do not give updates on applications. See if we have asked for more information in your ImmiAccount or wait for us to contact you. Travel after you apply If you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision. If you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check VEVO See what to do if you visa is expiring or has expired If you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa See how Biometrics We will let you know if you need to provide biometrics Health exams If you did not have health examinations before you applied, we will let you know if you need them. Attach more information If you did not send us all documents when you applied, attach them in ImmiAccount or send the documents to the office where you sent your application. We might also ask you to provide more information. We are not obliged to do so and may make a decision on your application without requesting more documents. Stay lawful If you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application. Pay the second instalment If you need to pay a second instalment , pay it when we send you the invoice. Do not ask for the invoice. Add family members You can add members of the family unit to your application after you apply but before we decide on your visa. Complete Form 1436 - Adding an additional applicant after lodgement (481KB PDF) and attach it to your ImmiAccount or send to the address you sent your application. If you are under 18 years of age members of the family unit can include: a parent a member of the family unit of that parent. Newborn child Find out what to do if your child is born after you apply See how Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answer(s) (168KB PDF) and attach it to your ImmiAccount or send to the address you sent your application. See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956a Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF) act for you - let us know in writing by uploading your advice in ImmiAccount or send us notice in writing to the address you sent your application. See more about withdrawing your nomination See how Tell us if things change Tell us if things change after you lodge your application but before we have made a decision. Things you need to let us know about include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome You can be in or outside Australia when we decide your visa application but you must be outside of Australia if our decision is to grant you a visa. We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of the decision. If we refuse your visa, we will tell you: why we refused the visa whether you have a right to a review of the decision We will not refund the application charge if we refuse your application. When you have this visa This visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see Global Talent visa (subclass 858) . ​ Coming to Australia In Australia Leaving Australia Coming to Australia Before you leave Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the Border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card . You will get the card on board. Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you can do when you have this visa stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, apply for Australian citizen Newly arrived residents may have to wait before they can access certain Australian Government payments and benefits Your visa will come with conditions attached to it. To see your conditions use VEVO See how long you can stay This is a permanent visa. It lets you stay in Australia permanently. For citizenship purposes, your permanent residence starts on the day: we grant the visa if you are in Australia you enter Australia on this visa if you are outside Australia What you must do on this visa You and your family members must obey all Australian laws. Travelling on your visa You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them: you have a Distinguished Talent visa (subclass 124) you do not want a Special Category visa (subclass 444) If you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working We expect that you will use this visa to contribute to Australia in your field of expertise. You are protected by Australian workplace law. See your workplace rights and entitlements Bringing family As an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, your permanent residency starts on the day you entered Australia on this visa. Leaving Australia Before you leave Check your travel documents Check the travel validity of your Distinguished Talent (subclass 124) visa in VEVO See what you can and must do if your visa has expired or is about to expire At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave To prove you have been to Australia To get proof of your travel in and out of Australia request your international movement records",
  "main_content": "===== main placeholder ==========================================\nSubclass 124\n\n# Distinguished Talent visa\n\nDistinguished Talent visa\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field.\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field.\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible field.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa seeGlobal Talent visa (subclass 858).  ​\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see\nGlobal Talent visa (subclass 858)\n.  ​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD4,110.00\n\nFromAUD4,110.00\n\nFrom\nAUD4,110.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- work and study in Australia\nwork and study in Australia\n- stay in Australia permanently\nstay in Australia permanently\n- sponsor eligible relatives for permanent residence in Australia\nsponsor eligible relatives for permanent residence in Australia\n- if eligible, apply forAustralian citizenship\nif eligible, apply for\nAustralian citizenship\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be outside Australia when this visa is granted\nbe outside Australia when this visa is granted\n- have an internationally recognised record of exceptional and outstanding achievement in one of the following areas (and still be prominent in the area):a professiona sportthe artsacademia and research\nhave an internationally recognised record of exceptional and outstanding achievement in one of the following areas (and still be prominent in the area):\n- a profession\na profession\n- a sport\na sport\n- the arts\nthe arts\n- academia and research\nacademia and research\n- be nominated by an Australian citizen, Australian permanent resident,eligible New Zealand citizen, or Australian organisation with a national reputation in relation to your area of talent\nbe nominated by an Australian citizen, Australian permanent resident,\neligible New Zealand citizen\n, or Australian organisation with a national reputation in relation to your area of talent\nAbout this visa\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa seeGlobal Talent visa (subclass 858).  ​\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see\nGlobal Talent visa (subclass 858)\n.  ​\nWith this visa, you can\nApply from\nHow long you can stay\nInclude family\nCost\nProcessing times\nYour obligations\nTravel\nVisa label\n\n## With this visa, you can\n\nWith this visa, you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible, apply forAustralian citizen\nif eligible, apply for\nAustralian citizen\n\nNewly arrived residents may have towait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may have to\nwait before they can access certain Australian Government payments and benefits\n.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa but not inimmigration clearance. You must be outside Australia for your visa to be granted.\n\nYou can be in or outside Australia when you apply for the visa but not in\nimmigration clearance\n. You must be outside Australia for your visa to be granted.\n\nIf you are currently in Australia and hold an eligible visa you may need to consider your eligibility for theDistinguished Talent visa (subclass 858).\n\nIf you are currently in Australia and hold an eligible visa you may need to consider your eligibility for the\nDistinguished Talent visa (subclass 858)\n.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nYou become a permanent resident on the day we grant the visa.\n\nYou become a permanent resident on the day we grant the visa.\n\n## Include family\n\nInclude family\n\nYou can includemembers of the family unitwhen you apply. You can also add family to your application at any time before we decide on your application.\n\nYou can include\nmembers of the family unit\nwhen you apply. You can also add family to your application at any time before we decide on your application.\n\nIf you are under 18 years old, you can include:\n\nIf you are under 18 years old, you can include:\n- a parent\na parent\n- members of the family unitof that parent\nmembers of the family unit\nof that parent\n\nFamily members who apply for the visa must meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa must meet our\nhealth\nand\ncharacter\nrequirements.\n\n## Cost\n\nCost\n\nThe visa costsAUD4,110.00for the main applicant.\n\nThe visa costs\nAUD4,110.00\nfor the main applicant.\n\nThere is an additional charge for each family member who applies for the visa with you.\n\nThere is an additional charge for each family member who applies for the visa with you.\n\nTo work out what your visa will cost use theVisa pricing estimator. The estimator does not take into account the second instalment or other costs.\n\nTo work out what your visa will cost use the\nVisa pricing estimator\n. The estimator does not take into account the second instalment or other costs.\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nYou might have to pay an extra fee for any applicant 18 years old or older who has less thanfunctional English. This charge is called the second instalment. We will tell you when to pay the second instalment.\n\nYou might have to pay an extra fee for any applicant 18 years old or older who has less than\nfunctional English\n. This charge is called the second instalment. We will tell you when to pay the second instalment.\n\nThe second instalment charge is AUD4,890.\n\nThe second instalment charge is AUD4,890.\n\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs forhealth checks,police certificatesandbiometrics.\n\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for\nhealth checks\n,\npolice certificates\nand\nbiometrics\n.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n- whether you have lodged a complete application, including all necessary supporting documents\nwhether you have lodged a complete application, including all necessary supporting documents\n- how quickly you respond to any requests for additional information\nhow quickly you respond to any requests for additional information\n- how long it takes to perform required checks on the supporting information provided\nhow long it takes to perform required checks on the supporting information provided\n- how long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\n- how many places are available in the migration program\nhow many places are available in the migration program\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\nWe expect that you will contribute to Australia in your field of expertise.\n\nWe expect that you will contribute to Australia in your field of expertise.\n\n## Travel\n\nTravel\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need aResident Return (RRV) visa (subclass 155 or 157)to re-enter Australia as a permanent resident. To see when the 5 years ends, useVEVO.\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a\nResident Return (RRV) visa (subclass 155 or 157)\nto re-enter Australia as a permanent resident. To see when the 5 years ends, use\nVEVO\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa seeGlobal Talent visa (subclass 858).  ​\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see\nGlobal Talent visa (subclass 858)\n.  ​\n\n## Be of benefit to the Australian community\n\nBe of benefit to the Australian community\nDetails\n\nYour contribution may be:\n\nYour contribution may be:\n- economic\neconomic\n- social\nsocial\n- cultural, or\ncultural, or\n- to raise Australia's academic, artistic or sports standing internationally\nto raise Australia's academic, artistic or sports standing internationally\n\nYou must contribute to the nation as a whole.\n\nYou must contribute to the nation as a whole.\n\n## Have the ability to establish yourself in Australia\n\nHave the ability to establish yourself in Australia\nDetails\n\nYou must be able to find work in your field in Australia, or become independently established in your field in Australia.\n\nYou must be able to find work in your field in Australia, or become independently established in your field in Australia.\n\nYou can't include income from work outside your field. Even if this is only part of your overall income.\n\nYou can't include income from work outside your field. Even if this is only part of your overall income.\n\n## Be internationally recognised with a record of achievement\n\nBe internationally recognised with a record of achievement\nDetails\n\nYou must be internationally recognised with a record of achievement in:\n\nYou must be internationally recognised with a record of achievement in:\n- a profession\na profession\n- a sport\na sport\n- the arts, or\nthe arts, or\n- academia and research\nacademia and research\n\nYour achievements must be exceptional and outstanding. This means you:\n\nYour achievements must be exceptional and outstanding. This means you:\n- are currently prominent in your field\nare currently prominent in your field\n- have superior abilities to others in your field\nhave superior abilities to others in your field\n- are acclaimed as exceptional in any country where your field is practised\nare acclaimed as exceptional in any country where your field is practised\n- have a record of sustained achievement that is unlikely to diminish in the future\nhave a record of sustained achievement that is unlikely to diminish in the future\n\nYou must also participate in a field that:\n\nYou must also participate in a field that:\n- is recognised and accepted in Australia\nis recognised and accepted in Australia\n- has international standing\nhas international standing\n\nYou must have been prominent in this field in the past 2 years.\n\nYou must have been prominent in this field in the past 2 years.\n\n## Be nominated\n\nBe nominated\nDetails\n\nYou must be nominated to apply for this visa. Your nominator must also meet our criteria.\n\nYou must be nominated to apply for this visa. Your nominator must also meet our criteria.\n\nYour nominator must be an Australian citizen,permanent resident,eligible New Zealand citizenor an Australian organisation with a national reputation in the same field as you. Where appropriate, the nomination should come from the peak Australian body.\n\nYour nominator must be an Australian citizen,\npermanent resident\n,\neligible New Zealand citizen\nor an Australian organisation with a national reputation in the same field as you. Where appropriate, the nomination should come from the peak Australian body.\n\n## Be this age\n\nBe this age\nDetails\n\nYou can be any age to apply for this visa.\n\nYou can be any age to apply for this visa.\n\nIf you are under 18 years old or you are aged 55 years or older when you apply, you must be of exceptional benefit to the Australian community.\n\nIf you are under 18 years old or you are aged 55 years or older when you apply, you must be of exceptional benefit to the Australian community.\n\n## Have functional English\n\nHave functional English\nDetails\n\nApplicants aged 18 or over must havefunctional Englishor you will need to pay an extra charge, called the second instalment to be granted this visa.\n\nApplicants aged 18 or over must have\nfunctional English\nor you will need to pay an extra charge, called the second instalment to be granted this visa.\n\n## Meet our health requirement\n\nMeet our health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\nFamily members not accompanying you to Australia may also need to meet ourhealth requirement.\n\nFamily members not accompanying you to Australia may also need to meet our\nhealth requirement\n.\n\n## Meet our character requirement\n\nMeet our character requirement\nDetails\n\nYou and family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirement\n.\n\nFamily members not accompanying you to Australia must also meet ourcharacter requirement.\n\nFamily members not accompanying you to Australia must also meet our\ncharacter requirement\n.\n\n## Have paid back your debt to the Australian government\n\nHave paid back your debt to the Australian government\nDetails\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must:\n\nIf you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australia bookletand\nhave read, or had explained to you, the\nLife in Australia booklet\nand\n- confirm you will respect the Australian way of life and obey Australian laws when you sign anAustralian Values Statement\nconfirm you will respect the Australian way of life and obey Australian laws when you sign an\nAustralian Values Statement\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia seeCan I go to Australia.\n\nIf applying for a visa from outside Australia see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa seeGlobal Talent visa (subclass 858).  ​\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see\nGlobal Talent visa (subclass 858)\n.  ​\n\nStep 1\n\nStep 1\nBefore you apply\n\nBefore you apply for this visa, you need an eligible individual or organisation to nominate you.\n\nBefore you apply for this visa, you need an eligible individual or organisation to nominate you.\nShow\n                    steps\n\n#### Organise health exams\n\nOrganise health exams\n\nYou might need to have health examinations. You can complete them before you apply or you can wait until after you apply.\n\nYou might need to have health examinations. You can complete them before you apply or you can wait until after you apply.\n\nFind out theexaminationsyou need and how to arrange them.\n\nFind out the\nexaminations\nyou need and how to arrange them.\n\n#### Get help with your application\n\nGet help with your application\n\nYou don’t have to use a migration agent to apply for any visa. But if you want to, see how to find aregistered migration agent.\n\nYou don’t have to use a migration agent to apply for any visa. But if you want to, see how to find a\nregistered migration agent\n.\n\nAnyone can help you fill out forms or give you general help with your application. But you must let us know if you want someone to:\n\nAnyone can help you fill out forms or give you general help with your application. But you must let us know if you want someone to:\n- receive your correspondence\nreceive your correspondence\n- provide immigration assistance andact for you\nprovide immigration assistance and\nact for you\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou will need to provide documents to support the claims you make in your application and show you meet the other visa criteria.  This includes evidence of your achievements in an eligible field.\n\nYou will need to provide documents to support the claims you make in your application and show you meet the other visa criteria.  This includes evidence of your achievements in an eligible field.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.Also provide:\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\n\n### Relationship documents\n\nRelationship documents\n\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\n\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\nSee how\n\n#### Record of achievement documents\n\nRecord of achievement documents\n\nYou must prove your achievements in an eligible field.\n\nYou must prove your achievements in an eligible field.\n\nProvide:\n\nProvide:\n- relevant qualifications and awards, particularly from internationally recognised organisations\nrelevant qualifications and awards, particularly from internationally recognised organisations\n- supporting statements from government, professional, scientific, cultural, sporting or other relevant bodies\nsupporting statements from government, professional, scientific, cultural, sporting or other relevant bodies\n- documentary evidence which demonstrate an exceptional and outstanding record of achievement that positions you amongst the very best in your field\ndocumentary evidence which demonstrate an exceptional and outstanding record of achievement that positions you amongst the very best in your field\n\nThe evidence supplied to support your record of achievement must also demonstrate prominence in the field within the 2 years immediately before applying. It should include:\n\nThe evidence supplied to support your record of achievement must also demonstrate prominence in the field within the 2 years immediately before applying. It should include:\n- a reference from a person or organisation qualified to assess your claims\na reference from a person or organisation qualified to assess your claims\n- profiles of your achievements in any media, such as magazines, newspapers or TV programs\nprofiles of your achievements in any media, such as magazines, newspapers or TV programs\n\nIf you are younger than 18 or older than 55, you must prove you would be of exceptional benefit to the Australian community.\n\nIf you are younger than 18 or older than 55, you must prove you would be of exceptional benefit to the Australian community.\nSee how\n\n#### Nominator documents\n\nNominator documents\n\nProvide\n\nProvide\n- a completedForm 1000 Nomination for Distinguished Talent (538KB PDF)and relevant supporting documents\na completed\nForm 1000 Nomination for Distinguished Talent (538KB PDF)\nand relevant supporting documents\n- a statement by your nominator that supports your claims\na statement by your nominator that supports your claims\n\n#### Ability to establish yourself in Australia\n\nAbility to establish yourself in Australia\n\nYou must prove you are able to work or support yourself in your field of achievement.\n\nYou must prove you are able to work or support yourself in your field of achievement.\n\nProvide:\n\nProvide:\n- a statement detailing your knowledge of opportunities in Australia in your field\na statement detailing your knowledge of opportunities in Australia in your field\n- information provided by your nominator\ninformation provided by your nominator\n- letters from organisations or other relevant bodies in Australia that show future employment opportunities or possible business opportunities\nletters from organisations or other relevant bodies in Australia that show future employment opportunities or possible business opportunities\n- qualifications or experience you have gained during previous residence in Australia\nqualifications or experience you have gained during previous residence in Australia\n- your employment or business background\nyour employment or business background\n\nYou can't include income from work outside your field. Even if this is only part of your overall income.\n\nYou can't include income from work outside your field. Even if this is only part of your overall income.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe will tell you if and when you need to get a police certificate.\n\nWe will tell you if and when you need to get a police certificate.\n\nIf requested you will need to:\n\nIf requested you will need to:\n- provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\nprovide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n- also:an overseas police certificate from everycountry, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16military service records or discharge papers if you served in the armed forces of any country\nalso:\n- an overseas police certificate from everycountry, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\nan overseas police certificate from every\ncountry\n, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\n- military service records or discharge papers if you served in the armed forces of any country\nmilitary service records or discharge papers if you served in the armed forces of any country\n\nComplete and provide the following forms:\n\nComplete and provide the following forms:\n- Form 80 Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n- Form 1221 Additional personal particulars information (331KB PDF)\nForm 1221 Additional personal particulars information (331KB PDF)\nSee how\n\n#### Functional English documents\n\nFunctional English documents\n\nProvide proof you have at leastfunctional English.\n\nProvide proof you have at least\nfunctional English\n.\n\nAll applicants aged 18 years and older at the time of application who can't provide evidence of having at least functional English must pay asecond instalment of the visa application charge.\n\nAll applicants aged 18 years and older at the time of application who can't provide evidence of having at least functional English must pay a\nsecond instalment of the visa application charge\n.\n\nIf you and any family member applying with you have less than functional English, provide a statement indicating your intention to pay the second visa application charge for each person with less than functional English.\n\nIf you and any family member applying with you have less than functional English, provide a statement indicating your intention to pay the second visa application charge for each person with less than functional English.\n\nWe will advise you when to pay this.\n\nWe will advise you when to pay this.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nWe need to see evidence of yourpartner's identity and relationship with you.\n\nWe need to see evidence of your\npartner\n's identity and relationship with you.\n\nProvide:\n\nProvide:\n- identity documents and photos\nidentity documents and photos\n- character documents\ncharacter documents\n- marriage certificate, if applicable\nmarriage certificate, if applicable\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nForde factorelationship provide either:\n\nFor\nde facto\nrelationship provide either:\n- evidence that your relationship is registered by an Australian State or Territory\nevidence that your relationship is registered by an Australian State or Territory\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n- copies of birth certificates or the family book showing the names of both parents of all your dependent children\ncopies of birth certificates or the family book showing the names of both parents of all your dependent children\n- copies of the adoption paper, if applicable.\ncopies of the adoption paper, if applicable.\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- statutory declarationgiving their consent for the child to visit Australia on this visa\nstatutory declaration\ngiving their consent for the child to visit Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\n\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\n\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nSee how\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nTo include your child who is over 18 in your visa application, they must be:\n\nTo include your child who is over 18 in your visa application, they must be:\n- over 18 years of age but not yet turned 23, and dependent on you or your partner, or\nover 18 years of age but not yet turned 23, and dependent on you or your partner, or\n- over 23 years of age, nable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\nover 23 years of age, nable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\n\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\n\n#### Proof of dependency\n\nProof of dependency\n\nYou must demonstrate that the child is dependent on you, by providing:\n\nYou must demonstrate that the child is dependent on you, by providing:\n- proof of your relationship with the dependant such as a birth certificate or adoption papers\nproof of your relationship with the dependant such as a birth certificate or adoption papers\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nif the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could provide:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are currently studying\nproof they are currently studying\n- proof of payments made by you to them or on their behalf\nproof of payments made by you to them or on their behalf\n\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\n\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice, useForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\nprovide immigration advice, use\nForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\n- act for you but not provide immigration assistance, let us know in writing what they can do on your behalf (such as submit or withdraw an application for you). Send your written notification with your paper application\nact for you but not provide immigration assistance, let us know in writing what they can do on your behalf (such as submit or withdraw an application for you). Send your written notification with your paper application\n\nSee more aboutgetting help with your application.\n\nSee more about\ngetting help with your application\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide 2 recent photographs (45mm x 35mm) of each person included in the application.\n\nProvide 2 recent photographs (45mm x 35mm) of each person included in the application.\n\nPhotos should have:\n\nPhotos should have:\n- head and shoulders only\nhead and shoulders only\n- a white background\na white background\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\nStep 3\n\nStep 3\nApply for the visa\n\nThis visa is closed to new applications.\n\nThis visa is closed to new applications.\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents.\n\nWe will let you know when we have received your application and documents.\n\nThere are other things you need to know and might need to do.\n\nThere are other things you need to know and might need to do.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe do not give updates on applications.\n\nWe do not give updates on applications.\n\nSee if we have asked for more information in yourImmiAccountor wait for us to contact you.\n\nSee if we have asked for more information in your\nImmiAccount\nor wait for us to contact you.\n\n#### Travel after you apply\n\nTravel after you apply\n\nIf you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nIf you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nIf you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, checkVEVO.\n\nIf you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check\nVEVO\n.\n\nSeewhat to do if you visa is expiring or has expired.\n\nSee\nwhat to do if you visa is expiring or has expired\n.\n\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa\n\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe will let you know if you need to providebiometrics.\n\nWe will let you know if you need to provide\nbiometrics\n.\n\n#### Health exams\n\nHealth exams\n\nIf you did not havehealthexaminations before you applied, we will let you know if you need them.\n\nIf you did not have\nhealth\nexaminations before you applied, we will let you know if you need them.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not send us all documents when you applied, attach them in ImmiAccount or send the documents to the office where you sent your application.\n\nIf you did not send us all documents when you applied, attach them in ImmiAccount or send the documents to the office where you sent your application.\n\nWe might also ask you to provide more information. We are not obliged to do so and may make a decision on your application without requesting more documents.\n\nWe might also ask you to provide more information. We are not obliged to do so and may make a decision on your application without requesting more documents.\n\n#### Stay lawful\n\nStay lawful\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application.\n\nIf you travel to Australia on a different visa and that visa ends, you can't get a bridging visa to stay in Australia. This is because you must be outside Australia when we make a decision on your application.\n\n#### Pay the second instalment\n\nPay the second instalment\n\nIf you need to pay asecond instalment, pay it when we send you the invoice.\n\nIf you need to pay a\nsecond instalment\n, pay it when we send you the invoice.\n\nDo not ask for the invoice.\n\nDo not ask for the invoice.\n\n#### Add family members\n\nAdd family members\n\nYou can addmembers of the family unitto your application after you apply but before we decide on your visa.\n\nYou can add\nmembers of the family unit\nto your application after you apply but before we decide on your visa.\n\nCompleteForm 1436 - Adding an additional applicant after lodgement (481KB PDF)and attach it to your ImmiAccount or send to the address you sent your application.\n\nComplete\nForm 1436 - Adding an additional applicant after lodgement (481KB PDF)\nand attach it to your ImmiAccount or send to the address you sent your application.\n\nIf you are under 18 years of age members of the family unit can include:\n\nIf you are under 18 years of age members of the family unit can include:\n- a parent\na parent\n- a member of the family unit of that parent.\na member of the family unit of that parent.\n\n#### Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answer(s) (168KB PDF)and attach it to your ImmiAccount or send to the address you sent your application.\n\nComplete\nForm 1023 Notification of incorrect answer(s) (168KB PDF)\nand attach it to your ImmiAccount or send to the address you sent your application.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\nprovide immigration advice - complete\nForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\n- act for you - let us know in writing by uploading your advice in ImmiAccount or send us notice in writing to the address you sent your application.\nact for you - let us know in writing by uploading your advice in ImmiAccount or send us notice in writing to the address you sent your application.\n\nSee more aboutwithdrawing your nomination.\n\nSee more about\nwithdrawing your nomination\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nTell us if things change after you lodge your application but before we have made a decision.\n\nTell us if things change after you lodge your application but before we have made a decision.\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia when we decide your visa application but you must be outside of Australia if our decision is to grant you a visa. We will let you know our decision in writing.\n\nYou can be in or outside Australia when we decide your visa application but you must be outside of Australia if our decision is to grant you a visa. We will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of the decision.\n\nKeep a copy of the decision.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision\nwhether you have a right to a review of the decision\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa seeGlobal Talent visa (subclass 858).  ​\n\nThis visa is closed to new applications. To apply for the Distinguished Tale​​nt visa see\nGlobal Talent visa (subclass 858)\n.  ​\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the Border\n\nAt the Border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card. You will get the card on board.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n. You will get the card on board.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible, apply forAustralian citizen\nif eligible, apply for\nAustralian citizen\n\nNewly arrived residents may have towait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may have to\nwait before they can access certain Australian Government payments and benefits\n.\n\nYour visa will come with conditions attached to it. To see your conditions useVEVO.\n\nYour visa will come with conditions attached to it. To see your conditions use\nVEVO\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nFor citizenship purposes, your permanent residence starts on the day:\n\nFor citizenship purposes, your permanent residence starts on the day:\n- we grant the visa if you are in Australia\nwe grant the visa if you are in Australia\n- you enter Australia on this visa if you are outside Australia\nyou enter Australia on this visa if you are outside Australia\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need aResident Return (RRV) visa (subclass 155 or 157)to re-enter Australia as a permanent resident. To see when the 5 years ends, useVEVO.\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a\nResident Return (RRV) visa (subclass 155 or 157)\nto re-enter Australia as a permanent resident. To see when the 5 years ends, use\nVEVO\n.\n\n### New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n- you have a Distinguished Talent visa (subclass 124)\nyou have a Distinguished Talent visa (subclass 124)\n- you do not want a Special Category visa (subclass 444)\nyou do not want a Special Category visa (subclass 444)\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship.\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nWe expect that you will use this visa to contribute to Australia in your field of expertise.\n\nWe expect that you will use this visa to contribute to Australia in your field of expertise.\n\nYou are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nYou are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\n### Bringing family\n\nBringing family\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\n\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nCheck the travel validity of your Distinguished Talent (subclass 124) visa inVEVO.\n\nCheck the travel validity of your Distinguished Talent (subclass 124) visa in\nVEVO\n.\n\nSeewhat you can and must do if your visa has expired or is about to expire.\n\nSee\nwhat you can and must do if your visa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### To prove you have been to Australia\n\nTo prove you have been to Australia\n\nTo get proof of your travel in and out of Australiarequest your international movement records.\n\nTo get proof of your travel in and out of Australia\nrequest your international movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-858",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124?bk=aboutVisa-index-3#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124?bk=aboutVisa-index-4#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-124#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:26:45.743749",
  "metadata": {}
}