{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-short-stay-visa-subclass-456",
  "title": "Business (Short Stay) visa (subclass 456)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Business (Short Stay) visa (subclass 456) Page Content The Business (Short Stay) visa (subclass 456) closed to new applications from 23 March 2013. The work entitlements on this visa have been replaced by the Temporary Work (Short Stay Activity) visa (subclass 400) . From 19 November 2016, this visa was replaced by the Temporary Work (Short Stay Specialise) visa (subclass 400). Business people intending to travel to Australia for a short business visit (for example, going to a conference, negotiation or meeting) but not intending to work in Australia, can apply for the Business Visitor stream of the Visitor visa (subclass 600) Visa holders Details How long your visa lasts Details We told you how long your visa lasts when you were sent the Notification of Grant letter. You cannot apply to extend your visa. What this visa lets you do Details This visa allows you to visit Australia for short-term business purposes, including business-related meetings, seminars, conventions, conferences or networking. The visa allows you to enter Australia for: a maximum of three months, if you have been granted a visa for a single visit a maximum of three months per visit, if you have been granted a visa for more than one visit. Work is usually not allowed. However, you might be able to do some work — for example, if the work is highly specialised and non-ongoing (usually less than six weeks for the life of the visa). If your visa was granted with a ‘No further stay’ condition, you cannot apply for any other visa (except for a Protection visa) while you are in Australia. Your obligations Details You and your family must: comply with all visa conditions and Australian laws not do formal study or training in Australia that leads to a primary, secondary or higher education qualification. Work in Australia You must not: work in Australia except under very limited circumstances do work in Australia that can be done by an Australian citizen or an Australian permanent citizen perform activities other than those stated in your visa application. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Business (Short Stay) visa (subclass 456)\n\nBusiness (Short Stay) visa (subclass 456)\nPage Content\n\nThe Business (Short Stay) visa (subclass 456) closed to new applications from 23 March 2013. The work entitlements on this visa have been replaced by theTemporary Work (Short Stay Activity) visa (subclass 400). From 19 November 2016, this visa was replaced by the Temporary Work (Short Stay Specialise) visa (subclass 400).\n\nThe Business (Short Stay) visa (subclass 456) closed to new applications from 23 March 2013. The work entitlements on this visa have been replaced by the\nTemporary Work (Short Stay Activity) visa (subclass 400)\n. From 19 November 2016, this visa was replaced by the Temporary Work (Short Stay Specialise) visa (subclass 400).\n\nBusiness people intending to travel to Australia for a short business visit (for example, going to a conference, negotiation or meeting) but not intending to work in Australia, can apply for theBusiness Visitor stream of the Visitor visa (subclass 600).\n\nBusiness people intending to travel to Australia for a short business visit (for example, going to a conference, negotiation or meeting) but not intending to work in Australia, can apply for the\nBusiness Visitor stream of the Visitor visa (subclass 600)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nWe told you how long your visa lasts when you were sent the Notification of Grant letter. You cannot apply to extend your visa.\n\nWe told you how long your visa lasts when you were sent the Notification of Grant letter. You cannot apply to extend your visa.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to visit Australia for short-term business purposes, including business-related meetings, seminars, conventions, conferences or networking.\n\nThis visa allows you to visit Australia for short-term business purposes, including business-related meetings, seminars, conventions, conferences or networking.\n\nThe visa allows you to enter Australia for:\n\nThe visa allows you to enter Australia for:\n- a maximum of three months, if you have been granted a visa for a single visit\na maximum of three months, if you have been granted a visa for a single visit\n- a maximum of three months per visit, if you have been granted a visa for more than one visit.\na maximum of three months per visit, if you have been granted a visa for more than one visit.\n\nWork is usually not allowed. However, you might be able to do some work — for example, if the work is highly specialised and non-ongoing (usually less than six weeks for the life of the visa).\n\nWork is usually not allowed. However, you might be able to do some work — for example, if the work is highly specialised and non-ongoing (usually less than six weeks for the life of the visa).\n\nIf your visa was granted with a ‘No further stay’ condition, you cannot apply for any other visa (except for a Protection visa) while you are in Australia.\n\nIf your visa was granted with a ‘No further stay’ condition, you cannot apply for any other visa (except for a Protection visa) while you are in Australia.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must:\n\nYou and your family must:\n- comply with all visa conditions and Australian laws\ncomply with all visa conditions and Australian laws\n- not do formal study or training in Australia that leads to a primary, secondary or higher education qualification.\nnot do formal study or training in Australia that leads to a primary, secondary or higher education qualification.\n\n#### Work in Australia\n\nWork in Australia\n\nYou must not:\n\nYou must not:\n- work in Australia except under very limited circumstances\nwork in Australia except under very limited circumstances\n- do work in Australia that can be done by an Australian citizen or an Australian permanent citizen\ndo work in Australia that can be done by an Australian citizen or an Australian permanent citizen\n- perform activities other than those stated in your visa application.\nperform activities other than those stated in your visa application.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-short-stay-visa-subclass-456#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-short-stay-visa-subclass-456#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:25:53.282903",
  "metadata": {}
}