{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/government-agreement-visa-subclass-406",
  "title": "Government Agreement visa (subclass 406)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Government Agreement visa (subclass 406) Page Content ​​The Government Agreement visa (subclass 406) closed to new applications on 24 November 2012. You cannot apply for this visa. You might be able to apply for the Temporary Work (International Relations) visa (subclass 403) Visa Holders Details This information is for people who have already been granted a Government Agreement visa (subclass 406). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This visa allows you to enter Australia either: under the terms of a bilateral agreement between Australia and another country to direct the operations of one of the following organisations: the British Council the Alliance Française the Goethe-Institut the Italian Cultural Institute. You can: enter Australia at any time do the work or activity specified in the relevant government agreement direct the operations of a listed company, if applicable bring your family with you to Australia enter and leave Australia while your visa is valid. Your obligations Details You and your family must comply with all visa conditions and Australian laws. During your stay in Australia, you and your family must: maintain adequate health insurance continue to meet the requirements of the visa you have been granted meet Australian taxation obligations if you work in Australia. While you are in Australia you must: not stop working or stop doing the activity that was listed in your visa application not work in a position or engage in an activity that is inconsistent with the reason for which your visa was granted only work for the employer listed in your application not work for yourself. Any member of your family who was included in your visa application must: continue to be part of your family unit enter Australia at the same time, or after you leave Australia at the same time, or before you. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Government Agreement visa (subclass 406)\n\nGovernment Agreement visa (subclass 406)\nPage Content\n\n​​The Government Agreement visa (subclass 406) closed to new applications on 24 November 2012. You cannot apply for this visa.\n\n​​The Government Agreement visa (subclass 406) closed to new applications on 24 November 2012. You cannot apply for this visa.\n\nYou might be able to apply for theTemporary Work (International Relations) visa (subclass 403).\n\nYou might be able to apply for the\nTemporary Work (International Relations) visa (subclass 403)\n.\n\n## Visa Holders\n\nVisa Holders\nDetails\n\nThis information is for people who have already been granted a Government Agreement visa (subclass 406). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Government Agreement visa (subclass 406). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to enter Australia either:\n\nThis visa allows you to enter Australia either:\n- under the terms of a bilateral agreement between Australia and another country\nunder the terms of a bilateral agreement between Australia and another country\n- to direct the operations of one of the following organisations:the British Councilthe Alliance Françaisethe Goethe-Institutthe Italian Cultural Institute.\nto direct the operations of one of the following organisations:\n- the British Council\nthe British Council\n- the Alliance Française\nthe Alliance Française\n- the Goethe-Institut\nthe Goethe-Institut\n- the Italian Cultural Institute.\nthe Italian Cultural Institute.\n\nYou can:\n\nYou can:\n- enter Australia at any time\nenter Australia at any time\n- do the work or activity specified in the relevant government agreement\ndo the work or activity specified in the relevant government agreement\n- direct the operations of a listed company, if applicable\ndirect the operations of a listed company, if applicable\n- bring your family with you to Australia\nbring your family with you to Australia\n- enter and leave Australia while your visa is valid.\nenter and leave Australia while your visa is valid.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia, you and your family must:\n\nDuring your stay in Australia, you and your family must:\n- maintainadequate health insurance\nmaintain\nadequate health insurance\n- continue to meet the requirements of the visa you have been granted\ncontinue to meet the requirements of the visa you have been granted\n- meet Australian taxation obligations if you work in Australia.\nmeet Australian taxation obligations if you work in Australia.\n\nWhile you are in Australia you must:\n\nWhile you are in Australia you must:\n- not stop working or stop doing the activity that was listed in your visa application\nnot stop working or stop doing the activity that was listed in your visa application\n- not work in a position or engage in an activity that is inconsistent with the reason for which your visa was granted\nnot work in a position or engage in an activity that is inconsistent with the reason for which your visa was granted\n- only work for the employer listed in your application\nonly work for the employer listed in your application\n- not work for yourself.\nnot work for yourself.\n\nAny member of your family who was included in your visa application must:\n\nAny member of your family who was included in your visa application must:\n- continue to be part of your family unit\ncontinue to be part of your family unit\n- enter Australia at the same time, or after you\nenter Australia at the same time, or after you\n- leave Australia at the same time, or before you.\nleave Australia at the same time, or before you.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/government-agreement-visa-subclass-406#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/government-agreement-visa-subclass-406#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:29:26.966345",
  "metadata": {}
}