{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-graduate-replacement-stream-visa-subclass-485",
  "title": "Temporary Graduate (Replacement stream) visa (subclass 485)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Temporary Graduate (Replacement stream) visa (subclass 485) Page Content ​You can no longer apply for a Temporary Graduate (Replacement stream) visa (subclass 485) as a primary applicant. It was closed to new applications from 1 July 2024. Visa holders Details This information is for people who have already been granted a Temporary Graduate (Replacement stream) visa (subclass 485), or for people who applied for the visa on or before 30 June 2024 and for which a decision has not yet been made. It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details If you already hold a Temporary Graduate (Replacement stream) visa (subclass 485), it will be valid until the expiry date you were given when your visa was granted. What this visa lets you do Details With this visa, you can: live, study and work in Australia temporarily have eligible dependant family members apply to join you in Australia Your obligations Details You and your family must comply with all visa conditions and Australian laws. During your stay in Australia, you must: maintain adequate health insurance while you are in Australia continue to meet the requirements of the visa stream under which you were granted the visa leave Australia when your visa ends (unless you are granted another visa) Family members Details If your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as a subsequent entrant from in or outside Australia while your visa remains valid. When your visa ends, your family must leave Australia with you. Your family must: intend to remain members of your family unit. maintain adequate health insurance while they are in Australia. Your family can live, travel, work and study in Australia while their visa is valid We will tell you if there are any other conditions they must comply with when you are granted the visa. Report changes in circumstances Details Tell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family. For further information, visit Changes in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Temporary Graduate (Replacement stream) visa (subclass 485)\n\nTemporary Graduate (Replacement stream) visa (subclass 485)\nPage Content\n\n​You can no longer apply for a Temporary Graduate (Replacement stream) visa (subclass 485) as a primary applicant. It was closed to new applications from 1 July 2024.\n\n​You can no longer apply for a Temporary Graduate (Replacement stream) visa (subclass 485) as a primary applicant. It was closed to new applications from 1 July 2024.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Temporary Graduate (Replacement stream) visa (subclass 485), or for people who applied for the visa on or before 30 June 2024 and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Temporary Graduate (Replacement stream) visa (subclass 485), or for people who applied for the visa on or before 30 June 2024 and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n## How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you already hold a Temporary Graduate (Replacement stream) visa (subclass 485), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already hold a Temporary Graduate (Replacement stream) visa (subclass 485), it will be valid until the expiry date you were given when your visa was granted.\n\n## What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nWith this visa, you can:\n\nWith this visa, you can:\n- live, study and work in Australia temporarily\nlive, study and work in Australia temporarily\n- have eligible dependant family members apply to join you in Australia\nhave eligible dependant family members apply to join you in Australia\n\n## Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia, you must:\n\nDuring your stay in Australia, you must:\n- maintain adequate health insurance while you are in Australia\nmaintain adequate health insurance while you are in Australia\n- continue to meet the requirements of the visa stream under which you were granted the visa\ncontinue to meet the requirements of the visa stream under which you were granted the visa\n- leave Australia when your visa ends (unless you are granted another visa)\nleave Australia when your visa ends (unless you are granted another visa)\n\n## Family members\n\nFamily members\nDetails\n\nIf your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as a subsequent entrant from in or outside Australia while your visa remains valid.\n\nIf your dependant family members did not apply to accompany you when you were first granted this visa, they can apply as a subsequent entrant from in or outside Australia while your visa remains valid.\n\nWhen your visa ends, your family must leave Australia with you.\n\nWhen your visa ends, your family must leave Australia with you.\n\nYour family must:\n\nYour family must:\n- intend to remain members of your family unit.\nintend to remain members of your family unit.\n- maintainadequate health insurancewhile they are in Australia.\nmaintain\nadequate health insurance\nwhile they are in Australia.\n- Your family can live, travel, work and study in Australia while their visa is valid\nYour family can live, travel, work and study in Australia while their visa is valid\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\nWe will tell you if there are any other conditions they must comply with when you are granted the visa.\n\n## Report changes in circumstances\n\nReport changes in circumstances\nDetails\n\nTell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family.\n\nTell us if your circumstances change. This includes a new residential address, a new passport, or a pregnancy, birth or death in your family.\n\nFor further information, visitChanges in your situation.\n\nFor further information, visit\nChanges in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-graduate-replacement-stream-visa-subclass-485#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-graduate-replacement-stream-visa-subclass-485#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:25:20.292983",
  "metadata": {}
}