{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858",
  "title": "National Innovation visa",
  "raw_text": "===== main placeholder ========================================== Subclass 858 National Innovation visa This is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible area. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview The Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels. Stay Permanently Cost From AUD4,985.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can stay in Australia permanently work and study in Australia enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, apply for Australian citizenship Newly arrived residents may need to wait before they can access certain Australian Government payments and benefits. See all conditions Check your eligibility You must be invited to apply for this visa and lodge your visa application within 60 days of invitation. For information on Expression of Interest, see National Innovation visa either be in or outside Australia but not in immigration clearance when you apply and when we grant this visa have an internationally recognised record of exceptional and outstanding achievement in one of the following areas: a profession a sport the arts academia and research. have a nominator with a national reputation in your area of talent who is one of the following: an Australian citizen an Australian permanent resident an eligible New Zealand citizen an Australian organisation. Help with your visa If you need help with your visa, before you pay someone, read information on Who can help with your visa application About this visa The Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels. National Innovation visa With this visa you can Apply from How long you can stay Include family Cost Processing times Your obligations Travel Visa label National Innovation visa The National Innovation visa (NIV) (subclass 858) is a permanent visa for exceptionally talented migrants from across the world. These migrants will help create jobs and drive productivity growth in key sectors of the Australian economy. The NIV seeks established and emerging leaders with high-calibre talent and skills who can make significant contributions that will benefit Australia’s future prosperity. This includes: global researchers entrepreneurs innovative investors athletes and creatives. We process NIV visa applications in line with Ministerial Direction 112. This Ministerial Direction contains the processing order for NIV applications, and indicators of exceptional and outstanding talent. The Department must invite you before you can apply for this visa. To have us consider you for an invitation you must submit an Expression of Interest (EOI) If successful, we will email you a unique reference and identifier to use when you apply for a subclass 858 visa. For more information on the NIV invitation process, including EOI requirements, see National Innovation visa Applicants can apply for the National Innovation visa (subclass 858) online. To apply, go to ImmiAccount With this visa you can stay in Australia permanently work and study in Australia attend free English language classes through the Adult Migrant English Program , if eligible enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, become an Australian citizen Newly arrived residents may need to wait before they can access certain Australian Government payments and benefits Apply from You must either be in or outside Australia but not in immigration clearance, when you apply and when this visa is decided. How long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. You become a permanent resident on the day we grant the visa. For citizenship purposes, your permanent residence starts on the day: we grant the visa, if you are in Australia you enter Australia with this visa, if you are outside Australia. Include family You may include members of the family unit when you apply. You can also add members of your family to your application at any time before we make a decision. If you are under 18 years old, you can only include your parents and members of the family unit of that parent. Family members who apply for the visa must meet our health and character requirements. This is regardless of whether they are accompanying you to Australia. For more information on health requirements, see Meeting our health requirement For more information on character requirements, see Character requirements for visas If you have not included your partner or dependent children in your application, tell us the reason why. Cost For the cost of the visa for the main applicant, see Fees and charges for visas There is an extra charge for each family member who applies for the visa with you. We cannot process your application if you do not pay the correct visa application charge. You may have to pay an extra fee for any applicant aged 18 years or older who has less than functional English. This charge is called the second instalment. We will tell you when to pay the second instalment. Find out more about functional English requirements For more information on the second instalment charge, see Fees and charges for visas To work out what your visa will cost, you can use the Visa Pricing Estimator The estimator does not take into account the second instalment or other costs. This includes health checks, police certificates and biometrics. For information on the cost of health checks, refer to Your health examinations For information on the cost of biometrics, refer to biometrics Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. We assess applications on a case-by-case basis. Actual processing times can vary due to circumstances including: if you have lodged a complete application, including all required supporting documents how quickly you respond to requests for additional information how long it takes to perform required checks on supporting information how long it takes to receive extra information from external agencies, in relation to health, character, and national security requirements how many places are available in the migration program how your application is aligned with the order of consideration set out in Ministerial Direction no. 112 and processing priorities for skilled visa applications Your obligations You and your family members must obey all Australian laws. We expect that you will contribute to Australia in your area of expertise. Travel You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need a Resident Return (RRV) visa (subclass 155 or 157) To see when the 5 years ends, use VEVO Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility The Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels. Have this visa Details If you are outside Australia when you apply, you do not need to hold a specific visa to apply for this visa. However, if you are in Australia when you apply, you must hold one of the following: substantive visa Bridging visa A – BVA - (subclass 010) Bridging visa B – BVB – (subclass 020) Bridging visa C – BVC – (subclass 030) If you currently hold, or your last substantive visa held was one of the following, you must have held that visa for at least 3 years when you apply: Skilled Work Regional (Provisional) (subclass 491) or Skilled Employer Sponsored Regional (Provisional) (subclass 494) Be invited to apply Details You can only apply for this visa if we invite you. See before you apply Be nominated on a Form 1000 at time of application Details When you apply, you must provide a completed Nomination for National Innovation visa (Form 1000). (538KB PDF) You must have your internationally recognised record of exceptional and outstanding achievement attested by a nominator who has a national reputation in the same area as you, and is one of the following: an Australian citizen an Australian permanent resident an eligible New Zealand citizen an Australian organisation. You must answer all relevant questions on the Form 1000 in accordance with the instructions on the form. Your nominator must sign your form. Have an internationally recognised record of exceptional and outstanding achievement Details You must have an internationally recognised record of exceptional and outstanding achievement in one of the following areas: a profession a sport the arts academia and research. This means that you: have superior abilities and achievements to others in your area are acclaimed as exceptional in any country where your area is practised have a record of sustained achievement unlikely to diminish in the near future. You must also participate in an area that is recognised and accepted in Australia and has international standing. Be still prominent Details This means that you continue to be active in your area by having recent exceptional achievements. Be an asset to the Australian community Details Your contribution may be: economic social cultural to raise Australia's academic, artistic or sports standing internationally. You must contribute to the nation as a whole. Have the ability to establish yourself in Australia Details You must demonstrate that: you would be able to find work or become independently established, in your area of expertise in Australia without difficulty. Be this age Details You can be any age to apply for this visa. If you are under 18 years old, or are 55 years or older when you apply, you must be of exceptional benefit to the Australian community. The exceptional benefit to the Australian community should be: ongoing sustained and realised shortly after migration. The exceptional benefit may include: making exceptional contributions to the Australian economy creating employment opportunities for a large number of Australian residents driving research development and innovation in sectors of national importance enhancing Australia's global standard in an important area. Have functional English Details Applicants aged 18 years and older at the time of application, must provide evidence of having at least functional English If you do not have at least functional English, you must pay a second instalment of the visa application charge If you would prefer to pay the second instalment instead of showing evidence of functional English, you must tell us via your ImmiAccount Meet our health requirement Details You and any family members who apply for the visa with you must meet our health requirement Family members not coming with you to Australia may also need to meet our health requirement Meet our character requirement Details You and family members aged 16 years and over who apply for the visa with you must meet our character requirement Family members not coming with you to Australia must also meet our character requirement Have paid back any debt to the Australian government Details You or any family members (including those who do not apply for the visa with you) cannot owe the Australian government money. You must pay any outstanding Australian government debt, or have a payment arrangement in place before we can grant you a visa. Sign the Australian values statement Details If you are 18 years of age or older, you must have read, or had explained to you, the Life in Australia booklet . You must also confirm you will respect the Australian way of life and obey Australian laws when you sign an Australian Values Statement Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we decide your application. This means you might not be eligible for this visa if you have had a visa cancelled or refused. If you have had a visa cancelled or an application refused, in some circumstances you may still apply for a permanent visa. See Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step The Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels. Step 1 Before you apply Show steps Find a Nominator Your nominator is a person or organisation who is willing and able to attest to your achievements. They must completing a Form 1000 - Nomination for National Innovation visa (538KB PDF) You must attach the completed Form 1000 to your visa application when you apply. For more information, see Nominator Documents under Step 2. See how Submit an Expression of Interest To have us consider you for an invitation to apply for this visa, submit an Expression of Interest (EOI) If we invite you, your invitation will contain a unique reference and identifier to use when you apply for a visa. You must apply within 60 days of the invitation. We will not accept applications lodged without an invitation or outside of the specified timeframe. See how Get help with your application Only some people can help you apply. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. Learn more about authorised recipients. See how Step 2 Gather your documents You must include documents to support the claims you make in your application and show you meet the visa criteria. Documents you provide in your visa application must show the achievements claimed in your EOI. These achievements granted your invitation to apply for this visa. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Identity documents Include the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also include: a national identity card, if you have one proof of change of name, if relevant. Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have used or been known as. Relationship documents If you are or have been married, widowed, divorced or permanently separated, you must provide proof. This can include: divorce documents death certificates separation documents or statutory declarations. If you have not included your partner or dependent children in this application, tell us the reason why. For example, if they already hold Australian citizenship or are a permanent resident. See how Record of achievement documents You must provide evidence that your achievements place you among the best in your area of expertise. Examples of evidence include, but are not limited to: prestigious awards and prizes from internationally recognised organisations including: Nobel Prize Breakthrough Prizes L’oreal-UNESCO Award for Women in Science Turing Award ACM Prize in Computing top of field level sports or arts awards and honours, for example: Olympic Gold medal Pulitzer Prize Booker Prize Laureus World Sportsman Sportswoman of the year a national level research grant in Australia or an equivalent from other countries a research-based PhD from a top global university recent publications in top ranked journals a high h-index recent keynote appearance/s at a high-profile international conference past or current connections with Commonwealth, State or Territory based innovation hubs relevant international patents for cutting edge products/technological advancements a demonstrated track record of supporting successful innovative ventures leading internationally reputed companies to their Initial Public Offering success at major national or international sporting competitions a sustained record of well-recognised work, and receipt of honours, accolades and major commissioned works in the arts current earnings or an offer of employment with earnings at or above the Fair Work High Income Threshold , in your area of achievement professional designations, such as Academic Level D or E professors or lead research fellows online business, personal or academic webpages supporting statements from government, professional, scientific, cultural, sporting or other peak bodies memberships or key appointments at industry advisory boards or committees international media coverage of your achievements. The evidence you supply to support your record of achievement must also show recent prominence in your area of expertise. If you are under 18 years old, or 55 years or older when you apply, you must provide evidence you would be of exceptional benefit to the Australian community. Examples of evidence could include: a statement regarding your professional plans upon settling in Australia an employment offer for a senior leadership position in Australia service agreements or business contracts with prominent Australian organisations pitch-deck or business plan to establish a highly innovative organisation that would fill an industry gap, and/or create employment opportunities for a large number of Australian residents grants associated with planned research in Australia membership or appointment to industry advisory boards or regulatory authorities in Australia if under 18, evidence of your capacity to support yourself in your area of expertise without parental or family financial support. See how Nominator documents You must attach a completed Nomination for National Innovation visa (Form 1000) when you apply. You must also provide evidence that your nominator has: a national reputation in the same area as you (if your nominator is a person) Australian citizenship, Australian permanent residency in Australia, or eligible New Zealand citizen status in Australia (if your nominator is an Australian organisation) proof that the signatory of Form 1000 is authorised to represent the organisation. We will not process your visa application if you do not attach a completed Nomination for National Innovation visa (Form 1000) when you apply. View the Nomination for National Innovation visa (Form 1000) (538KB PDF) See how Ability to establish yourself in Australia You must prove you can work or support yourself in your area of achievement. You should give us: a statement detailing your knowledge of opportunities in Australia in your area of achievement information provided by your nominator letters from organisations or other relevant bodies in Australia that show future employment or possible business opportunities qualifications or experience you have gained during previous residence in Australia your employment or business background You cannot include income from work outside your field. See how Character documents You and any family members above 16 years of age who apply for the visa with you must meet our character requirement. Evidence of character we require include: an Australian police certificate if you have spent 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police an overseas police certificate from every country , including your home country, where you spent 12 months or more in the last 10 years since you turned 16 military service records or discharge papers, if you served in the armed forces of any country. Some countries require a letter from the Department to issue police certificates. The Department will provide these letters after you have made an application. You may be required to complete and provide the following forms: Form 80 Personal particulars for assessment including character assessment (596KB PDF) Form 1221 Additional personal particulars information (331KB PDF) If there are delays getting your character documents, upload evidence showing your attempts to get them to your ImmiAccount. See how Functional English documents Give proof you have at least functional English Applicants aged 18 years and older at the time of application must provide evidence of functional English. If you do not have at least functional English you must pay a second instalment of the visa application charge You must provide a statement showing your intention to pay the second visa application charge for each person with less than functional English. We will tell you when to make this payment. See how Partner documents We need to see evidence of your partner 's identity and relationship with you. To show this, provide: identity documents and photos character documents marriage certificate, if applicable documents about other relationships, if applicable. For de facto relationships, include either: evidence that your relationship is registered by an Australian State or Territory enough documents to prove you have been in a de facto relationship for at least 12 months before you apply. For both married and de facto applicants you must give evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you. See how Dependants under 18 documents For every dependant 18 years old or younger who is applying with you, include: copies of birth certificates or the family book showing the names of both parents of any dependent children copies of adoption papers, if applicable. Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child. They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) statutory declaration giving their consent for the child to visit Australia on this visa. Or, you can show us either: an Australian court order that allows your child to migrate to Australia that the laws of your home country allow them to migrate. Include: an identity document showing the signature and photo of the person who completed the form or declaration. Such evidence could be a passport or driver’s licence adoption papers or other court documents, if applicable. Note: If your child is likely to turn 18 while your application is processing, you must give evidence they are dependent on you. See the section 'Dependants over 18 documents' below for more information. A child who turns 18 while your application is processing and who is not dependent on you cannot satisfy the criteria for this visa. See how Dependants over 18 documents To include your child who is over 18 in your visa application, they must have turned either: 18 years of age but not yet turned 23, and dependent on you or your partner 23 years of age, and unable to earn a living to support themselves because of physical or cognitive limitations and dependent on you or your partner. To show this provide: identity documents documents about their other relationships, if applicable character documents. If your child is likely to turn 23 while your application is processing, you must show evidence they are dependent on you because of disability. Proof of dependency You must show that the child is dependent on you by providing: proof of your relationship with the dependant such as a birth certificate or adoption papers if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also include a report from a qualified medical practitioner. This must state they are dependent on you or your partner because of the total or partial loss of their bodily or mental functions a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) You must also prove this person has been financially dependent on you for at least 12 months before you apply. You could include: proof they live with you their tax records proof they are studying proof of payments made by you to them or on their behalf. Note: A child who turns 23 while your application is processing and who does not meet these requirements cannot satisfy the criteria for this visa. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating. These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photographs must be clear. If a document is more than one page, save it all as one file. See how Photographs Provide a digital photograph of each person you include when you apply. Photographs should have: head and shoulders only a white background. See how Keep Keep a copy of your completed application. Step 3 Apply for the visa You can apply for this visa online. Show steps Give accurate information Give accurate information in your application. See what happens if you can't prove your identity or don't provide true information Apply online Create an account or sign in to ImmiAccount Pay the application charge . We will not process your application until you have paid the charge. Attach supporting documents to your application. Submit your application. Note the transaction reference number (TRN). Step 4 After you apply We will tell you when we receive your application. Show steps Health exams You and any family members who apply for the visa with you must meet our health requirement. If you did not complete health examinations before you apply, wait for a request from the Department before you complete health examinations. Learn more about health requirements. Biometrics We will let you know if you need to give biometrics Attach more information If you did not send us all documents when you applied, attach them in ImmiAccount We might also ask you to submit more information. We are not obliged to do so and may decide your application without requesting more documents. Status updates We do not give updates on applications. You should wait for us to contact you. Check if we have asked for more information in your ImmiAccount Travel after you apply You don't have to tell us if you want to travel outside Australia while we process your application. To be granted this visa, you must either be in Australia or outside Australia, but not in immigration clearance, when we make a decision. If you leave Australia, make sure you have a valid visa to return. To see if you can return on your visa, check VEVO See how Stay lawful If you apply for the visa while in Australia, make sure you stay lawful. You must hold a valid visa while we process your application. When you applied for this visa, we may have granted you a Bridging visa. If your visa expires before we decide your application, that bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your new visa application. Do not ask us to cancel your current visa. If we cancel your visa, you: will be in Australia as an unlawful non-citizen and may not be eligible for a Bridging visa A. Learn more about visa expiry See how Add family members You can add members of the family unit to your application after you apply, but before we decide on your visa. Visit ImmiAccount and attach a completed Form 1436 - Adding an additional applicant after lodgement (481KB PDF) If you are under 18 years of age, you can only include members of the family unit when you apply. Your members of the family can include: a parent a member of the family unit of that parent. Newborn child Find out what to do if your child is born after you apply See how Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Visit ImmiAccount and attach a completed Form 1023 Notification of incorrect answer(s) (168KB PDF) See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information, see Who can help you with your application See how Tell us if things change Tell us if things change after you lodge your application but before we have made a decision. Things you need to let us know about include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application. See what to do when your situation changes See how Step 5 Visa outcome You can be in or outside Australia, but not in immigration clearance, when we decide your visa application. We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of the decision. If we refuse your visa, we will tell you: why we refused the visa whether you have a right to a review of the decision. We will not refund the application charge if we refuse your application. When you have this visa The Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels. Coming to Australia In Australia Leaving Australia Coming to Australia Before you leave Check your travel documents You must have a valid: visa to enter Australia passport or other travel document. At the Border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card . You will get the card on board your flight. Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you can do when you have this visa stay in Australia permanently work and study in Australia attend free English language classes provided by the Adult Migrant English Program , if you are eligible enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, apply for Australian citizenship Newly arrived residents may have to wait before they can access certain Australian Government payments and benefits Your visa will come with conditions attached to it. To see your conditions use VEVO See how long you can stay This is a permanent visa. It lets you stay in Australia permanently. For citizenship purposes, your permanent residence starts on the day: we grant the visa if you are in Australia you enter Australia on this visa if you are outside Australia. What you must do on this visa You and your family members must obey all Australian laws. Travelling on your visa You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need a Resident Return (RRV) visa (subclass 155 or 157) To see when the 5 years ends, use VEVO Find more information about being a Permanent Resident New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them you: have a National Innovation visa (subclass 858) do not want a Special Category visa (subclass 444) If you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might reduce your eligibility for Australian citizenship. Proving you have a visa To prove you have a visa and to show your visa conditions to someone, use VEVO Working We expect that you will use this visa to contribute to Australia in your field of expertise. You are protected by Australian workplace law. See your workplace rights and entitlements Bringing family As an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, your permanent residency starts on the day you entered Australia on this visa. Leaving Australia Before you leave Check your travel documents Check the travel validity of your National Innovation (subclass 858) visa in VEVO See what you can and must do if your visa has expired or is about to expire At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave To prove you have been to Australia To get proof of your travel in and out of Australia request your international movement records",
  "main_content": "===== main placeholder ==========================================\nSubclass 858\n\n# National Innovation visa\n\nNational Innovation visa\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible area.\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible area.\n\nThis is a permanent visa for people who have an internationally recognised record of exceptional and outstanding achievement in an eligible area.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.​\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD4,985.00\n\nFromAUD4,985.00\n\nFrom\nAUD4,985.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public health care scheme, Medicare\nenrol in Australia's public health care scheme, Medicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nNewly arrived residents may need to wait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may need to wait before they can access certain Australian Government payments and benefits.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be invited to apply for this visa and lodge your visa application within 60 days of invitation. For information on Expression of Interest, seeNational Innovation visa.\nbe invited to apply for this visa and lodge your visa application within 60 days of invitation. For information on Expression of Interest, see\nNational Innovation visa\n.\n- either be in or outside Australia but not in immigration clearance when you apply and when we grant this visa\neither be in or outside Australia but not in immigration clearance when you apply and when we grant this visa\n- have an internationally recognised record of exceptional and outstanding achievement in one of the following areas:a professiona sportthe artsacademia and research.\nhave an internationally recognised record of exceptional and outstanding achievement in one of the following areas:\n- a profession\na profession\n- a sport\na sport\n- the arts\nthe arts\n- academia and research.\nacademia and research.\n- have a nominator with a national reputation in your area of talent who is one of the following:an Australian citizenan Australianpermanent residentaneligible New Zealand citizenan Australian organisation.\nhave a nominator with a national reputation in your area of talent who is one of the following:\n- an Australian citizen\nan Australian citizen\n- an Australianpermanent resident\nan Australian\npermanent resident\n- aneligible New Zealand citizen\nan\neligible New Zealand citizen\n- an Australian organisation.\nan Australian organisation.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you need help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you need help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.​\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n​\nNational Innovation visa\nWith this visa you can\nApply from\nHow long you can stay\nInclude family\nCost\nProcessing times\nYour obligations\nTravel\nVisa label\n\n## National Innovation visa\n\nNational Innovation visa\n\nThe National Innovation visa (NIV) (subclass 858) is a permanent visa for exceptionally talented migrants from across the world. These migrants will help create jobs and drive productivity growth in key sectors of the Australian economy.\n\nThe National Innovation visa (NIV) (subclass 858) is a permanent visa for exceptionally talented migrants from across the world. These migrants will help create jobs and drive productivity growth in key sectors of the Australian economy.\n\nThe NIV seeks established and emerging leaders with high-calibre talent and skills who can make significant contributions that will benefit Australia’s future prosperity.\n\nThe NIV seeks established and emerging leaders with high-calibre talent and skills who can make significant contributions that will benefit Australia’s future prosperity.\n\nThis includes:\n\nThis includes:\n- global researchers\nglobal researchers\n- entrepreneurs\nentrepreneurs\n- innovative investors\ninnovative investors\n- athletes and creatives.\nathletes and creatives.\n\nWe process NIV visa applications in line with Ministerial Direction 112. This Ministerial Direction contains the processing order for NIV applications, and indicators of exceptional and outstanding talent.\n\nWe process NIV visa applications in line with Ministerial Direction 112. This Ministerial Direction contains the processing order for NIV applications, and indicators of exceptional and outstanding talent.\n\nThe Department must invite you before you can apply for this visa. To have us consider you for an invitation you must submit anExpression of Interest (EOI).\n\nThe Department must invite you before you can apply for this visa. To have us consider you for an invitation you must submit an\nExpression of Interest (EOI)\n.\n\nIf successful, we will email you a unique reference and identifier to use when you apply for a subclass 858 visa.\n\nIf successful, we will email you a unique reference and identifier to use when you apply for a subclass 858 visa.\n\nFor more information on the NIV invitation process, including EOI requirements, seeNational Innovation visa.\n\nFor more information on the NIV invitation process, including EOI requirements, see\nNational Innovation visa\n.\n\nApplicants can apply for the National Innovation visa (subclass 858) online. To apply, go toImmiAccount.\n\nApplicants can apply for the National Innovation visa (subclass 858) online. To apply, go to\nImmiAccount\n.\n\n## With this visa you can\n\nWith this visa you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- attend free English language classes through theAdult Migrant English Program, if eligible\nattend free English language classes through the\nAdult Migrant English Program\n, if eligible\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible, become anAustralian citizen.\nif eligible, become an\nAustralian citizen\n.\n\nNewly arrived residents may need towait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may need to\nwait before they can access certain Australian Government payments and benefits\n.\n\n## Apply from\n\nApply from\n\nYou must either be in or outside Australia but not in immigration clearance, when you apply and when this visa is decided.\n\nYou must either be in or outside Australia but not in immigration clearance, when you apply and when this visa is decided.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nYou become a permanent resident on the day we grant the visa.\n\nYou become a permanent resident on the day we grant the visa.\n\nFor citizenship purposes, your permanent residence starts on the day:\n\nFor citizenship purposes, your permanent residence starts on the day:\n- we grant the visa, if you are in Australia\nwe grant the visa, if you are in Australia\n- you enter Australia with this visa, if you are outside Australia.\nyou enter Australia with this visa, if you are outside Australia.\n\n## Include family\n\nInclude family\n\nYou may includemembers of the family unitwhen you apply. You can also add members of your family to your application at any time before we make a decision.\n\nYou may include\nmembers of the family unit\nwhen you apply. You can also add members of your family to your application at any time before we make a decision.\n\nIf you are under 18 years old, you can only include your parents andmembers of the family unitof that parent.\n\nIf you are under 18 years old, you can only include your parents and\nmembers of the family unit\nof that parent.\n\nFamily members who apply for the visa must meet our health and character requirements. This is regardless of whether they are accompanying you to Australia.\n\nFamily members who apply for the visa must meet our health and character requirements. This is regardless of whether they are accompanying you to Australia.\n\nFor more information on health requirements, seeMeeting our health requirement.\n\nFor more information on health requirements, see\nMeeting our health requirement\n.\n\nFor more information on character requirements, seeCharacter requirements for visas.\n\nFor more information on character requirements, see\nCharacter requirements for visas\n.\n\nIf you have not included your partner or dependent children in your application, tell us the reason why.\n\nIf you have not included your partner or dependent children in your application, tell us the reason why.\n\n## Cost\n\nCost\n\nFor the cost of the visa for the main applicant, seeFees and charges for visas.\n\nFor the cost of the visa for the main applicant, see\nFees and charges for visas\n.\n\nThere is an extra charge for each family member who applies for the visa with you.\n\nThere is an extra charge for each family member who applies for the visa with you.\n\nWe cannot process your application if you do not pay the correct visa application charge.\n\nWe cannot process your application if you do not pay the correct visa application charge.\n\nYou may have to pay an extra fee for any applicant aged 18 years or older who has less than functional English. This charge is called the second instalment. We will tell you when to pay the second instalment.\n\nYou may have to pay an extra fee for any applicant aged 18 years or older who has less than functional English. This charge is called the second instalment. We will tell you when to pay the second instalment.\n\nFind out more aboutfunctional English requirements.\n\nFind out more about\nfunctional English requirements\n.\n\nFor more information on the second instalment charge, seeFees and charges for visas.\n\nFor more information on the second instalment charge, see\nFees and charges for visas\n.\n\nTo work out what your visa will cost, you can use theVisa Pricing Estimator.\n\nTo work out what your visa will cost, you can use the\nVisa Pricing Estimator\n.\n\nThe estimator does not take into account the second instalment or other costs. This includes health checks, police certificates and biometrics.\n\nThe estimator does not take into account the second instalment or other costs. This includes health checks, police certificates and biometrics.\n\nFor information on the cost of health checks, refer toYour health examinations.\n\nFor information on the cost of health checks, refer to\nYour health examinations\n.\n\nFor information on the cost of biometrics, refer tobiometrics.\n\nFor information on the cost of biometrics, refer to\nbiometrics\n.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nWe assess applications on a case-by-case basis. Actual processing times can vary due to circumstances including:\n\nWe assess applications on a case-by-case basis. Actual processing times can vary due to circumstances including:\n- if you have lodged a complete application, including all required supporting documents\nif you have lodged a complete application, including all required supporting documents\n- how quickly you respond to requests for additional information\nhow quickly you respond to requests for additional information\n- how long it takes to perform required checks on supporting information\nhow long it takes to perform required checks on supporting information\n- how long it takes to receive extra information from external agencies, in relation to health, character, and national security requirements\nhow long it takes to receive extra information from external agencies, in relation to health, character, and national security requirements\n- how many places are available in the migration program\nhow many places are available in the migration program\n- how your application is aligned with the order of consideration set out in Ministerial Direction no. 112 andprocessing priorities for skilled visa applications.\nhow your application is aligned with the order of consideration set out in Ministerial Direction no. 112 and\nprocessing priorities for skilled visa applications\n.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\nWe expect that you will contribute to Australia in your area of expertise.\n\nWe expect that you will contribute to Australia in your area of expertise.\n\n## Travel\n\nTravel\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need aResident Return (RRV) visa (subclass 155 or 157).\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need a\nResident Return (RRV) visa (subclass 155 or 157)\n.\n\nTo see when the 5 years ends, useVEVO.\n\nTo see when the 5 years ends, use\nVEVO\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.​\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n​\n\n## Have this visa\n\nHave this visa\nDetails\n\nIf you are outside Australia when you apply, you do not need to hold a specific visa to apply for this visa. However, if you are in Australia when you apply, you must hold one of the following:\n\nIf you are outside Australia when you apply, you do not need to hold a specific visa to apply for this visa. However, if you are in Australia when you apply, you must hold one of the following:\n- asubstantive visa\na\nsubstantive visa\n- Bridging visa A – BVA - (subclass 010)\nBridging visa A – BVA - (subclass 010)\n- Bridging visa B – BVB – (subclass 020)\nBridging visa B – BVB – (subclass 020)\n- Bridging visa C – BVC – (subclass 030)\nBridging visa C – BVC – (subclass 030)\n\nIf you currently hold, or your last substantive visa held was one of the following, you must have held that visa for at least 3 years when you apply:\n\nIf you currently hold, or your last substantive visa held was one of the following, you must have held that visa for at least 3 years when you apply:\n- Skilled Work Regional (Provisional) (subclass 491)or\nSkilled Work Regional (Provisional) (subclass 491)\nor\n- Skilled Employer Sponsored Regional (Provisional) (subclass 494).\nSkilled Employer Sponsored Regional (Provisional) (subclass 494)\n.\n\n## Be invited to apply\n\nBe invited to apply\nDetails\n\nYou can only apply for this visa if we invite you. Seebefore you apply.\n\nYou can only apply for this visa if we invite you. See\nbefore you apply\n.\n\n## Be nominated on a Form 1000 at time of application\n\nBe nominated on a Form 1000 at time of application\nDetails\n\nWhen you apply, you must provide a completedNomination for National Innovation visa (Form 1000). (538KB PDF)\n\nWhen you apply, you must provide a completed\nNomination for National Innovation visa (Form 1000). (538KB PDF)\n\nYou must have your internationally recognised record of exceptional and outstanding achievement attested by a nominator who has a national reputation in the same area as you, and is one of the following:\n\nYou must have your internationally recognised record of exceptional and outstanding achievement attested by a nominator who has a national reputation in the same area as you, and is one of the following:\n- an Australian citizen\nan Australian citizen\n- an Australianpermanent resident\nan Australian\npermanent resident\n- aneligible New Zealand citizen\nan\neligible New Zealand citizen\n- an Australian organisation.\nan Australian organisation.\n\nYou must answer all relevant questions on the Form 1000 in accordance with the instructions on the form. Your nominator must sign your form.\n\nYou must answer all relevant questions on the Form 1000 in accordance with the instructions on the form. Your nominator must sign your form.\n\n## Have an internationally recognised record of exceptional and outstanding achievement\n\nHave an internationally recognised record of exceptional and outstanding achievement\nDetails\n\nYou must have an internationally recognised record of exceptional and outstanding achievement in one of the following areas:\n\nYou must have an internationally recognised record of exceptional and outstanding achievement in one of the following areas:\n- a profession\na profession\n- a sport\na sport\n- the arts\nthe arts\n- academia and research.\nacademia and research.\n\nThis means that you:\n\nThis means that you:\n- have superior abilities and achievements to others in your area\nhave superior abilities and achievements to others in your area\n- are acclaimed as exceptional in any country where your area is practised\nare acclaimed as exceptional in any country where your area is practised\n- have a record of sustained achievement unlikely to diminish in the near future.\nhave a record of sustained achievement unlikely to diminish in the near future.\n\nYou must also participate in an area that is recognised and accepted in Australia and has international standing.\n\nYou must also participate in an area that is recognised and accepted in Australia and has international standing.\n\n## Be still prominent\n\nBe still prominent\nDetails\n\nThis means that you continue to be active in your area by having recent exceptional achievements.\n\nThis means that you continue to be active in your area by having recent exceptional achievements.\n\n## Be an asset to the Australian community\n\nBe an asset to the Australian community\nDetails\n\nYour contribution may be:\n\nYour contribution may be:\n- economic\neconomic\n- social\nsocial\n- cultural\ncultural\n- to raise Australia's academic, artistic or sports standing internationally.\nto raise Australia's academic, artistic or sports standing internationally.\n\nYou must contribute to the nation as a whole.\n\nYou must contribute to the nation as a whole.\n\n## Have the ability to establish yourself in Australia\n\nHave the ability to establish yourself in Australia\nDetails\n\nYou must demonstrate that:\n\nYou must demonstrate that:\n- you would be able to find work or\nyou would be able to find work or\n- become independently established, in your area of expertise in Australia without difficulty.\nbecome independently established, in your area of expertise in Australia without difficulty.\n\n## Be this age\n\nBe this age\nDetails\n\nYou can be any age to apply for this visa.\n\nYou can be any age to apply for this visa.\n\nIf you are under 18 years old, or are 55 years or older when you apply, you must be of exceptional benefit to the Australian community.\n\nIf you are under 18 years old, or are 55 years or older when you apply, you must be of exceptional benefit to the Australian community.\n\nThe exceptional benefit to the Australian community should be:\n\nThe exceptional benefit to the Australian community should be:\n- ongoing\nongoing\n- sustained and\nsustained and\n- realised shortly after migration.\nrealised shortly after migration.\n\nThe exceptional benefit may include:\n\nThe exceptional benefit may include:\n- making exceptional contributions to the Australian economy\nmaking exceptional contributions to the Australian economy\n- creating employment opportunities for a large number of Australian residents\ncreating employment opportunities for a large number of Australian residents\n- driving research development and innovation in sectors of national importance\ndriving research development and innovation in sectors of national importance\n- enhancing Australia's global standard in an important area.\nenhancing Australia's global standard in an important area.\n\n## Have functional English\n\nHave functional English\nDetails\n\nApplicants aged 18 years and older at the time of application, must provide evidence of having at leastfunctional English.\n\nApplicants aged 18 years and older at the time of application, must provide evidence of having at least\nfunctional English\n.\n\nIf you do not have at least functional English, you must pay asecond instalment of the visa application charge.\n\nIf you do not have at least functional English, you must pay a\nsecond instalment of the visa application charge\n.\n\nIf you would prefer to pay the second instalment instead of showing evidence of functional English, you must tell us via yourImmiAccount.\n\nIf you would prefer to pay the second instalment instead of showing evidence of functional English, you must tell us via your\nImmiAccount\n.\n\n## Meet our health requirement\n\nMeet our health requirement\nDetails\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\nFamily members not coming with you to Australia may also need to meet ourhealth requirement.\n\nFamily members not coming with you to Australia may also need to meet our\nhealth requirement\n.\n\n## Meet our character requirement\n\nMeet our character requirement\nDetails\n\nYou and family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirement\n.\n\nFamily members not coming with you to Australia must also meet ourcharacter requirement.\n\nFamily members not coming with you to Australia must also meet our\ncharacter requirement\n.\n\n## Have paid back any debt to the Australian government\n\nHave paid back any debt to the Australian government\nDetails\n\nYou or any family members (including those who do not apply for the visa with you) cannot owe the Australian government money. You must pay any outstanding Australian government debt, or have a payment arrangement in place before we can grant you a visa.\n\nYou or any family members (including those who do not apply for the visa with you) cannot owe the Australian government money. You must pay any outstanding Australian government debt, or have a payment arrangement in place before we can grant you a visa.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must have read, or had explained to you, theLife in Australia booklet. You must also confirm you will respect the Australian way of life and obey Australian laws when you sign anAustralian Values Statement.\n\nIf you are 18 years of age or older, you must have read, or had explained to you, the\nLife in Australia booklet\n. You must also confirm you will respect the Australian way of life and obey Australian laws when you sign an\nAustralian Values Statement\n.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we decide your application. This means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we decide your application. This means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIf you have had a visa cancelled or an application refused, in some circumstances you may still apply for a permanent visa. SeeLimitations on applications in Australia (129KB PDF).\n\nIf you have had a visa cancelled or an application refused, in some circumstances you may still apply for a permanent visa. See\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia seeCan I go to Australia.\n\nIf applying for a visa from outside Australia see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.​\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n​\n\nStep 1\n\nStep 1\nBefore you apply\nShow\n                    steps\n\n#### Find a Nominator\n\nFind a Nominator\n\nYour nominator is a person or organisation who is willing and able to attest to your achievements. They must completing a Form 1000 -Nomination for National Innovation visa (538KB PDF).\n\nYour nominator is a person or organisation who is willing and able to attest to your achievements. They must completing a Form 1000 -\nNomination for National Innovation visa (538KB PDF)\n.\n\nYou must attach the completed Form 1000 to your visa application when you apply.\n\nYou must attach the completed Form 1000 to your visa application when you apply.\n\nFor more information, seeNominator Documentsunder Step 2.\n\nFor more information, see\nNominator Documents\nunder Step 2.\nSee how\n\n#### Submit an Expression of Interest\n\nSubmit an Expression of Interest\n\nTo have us consider you for an invitation to apply for this visa, submit anExpression of Interest (EOI).\n\nTo have us consider you for an invitation to apply for this visa, submit an\nExpression of Interest (EOI)\n.\n\nIf we invite you, your invitation will contain a unique reference and identifier to use when you apply for a visa. You must apply within 60 days of the invitation.\n\nIf we invite you, your invitation will contain a unique reference and identifier to use when you apply for a visa. You must apply within 60 days of the invitation.\n\nWe will not accept applications lodged without an invitation or outside of the specified timeframe.\n\nWe will not accept applications lodged without an invitation or outside of the specified timeframe.\nSee how\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you apply. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you apply. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioneror\na\nlegal practitioner\nor\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter.\n\nLearn more aboutauthorised recipients.\n\nLearn more about\nauthorised recipients.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou must include documents to support the claims you make in your application and show you meet the visa criteria.\n\nYou must include documents to support the claims you make in your application and show you meet the visa criteria.\n\nDocuments you provide in your visa application must show the achievements claimed in your EOI. These achievements granted your invitation to apply for this visa.\n\nDocuments you provide in your visa application must show the achievements claimed in your EOI. These achievements granted your invitation to apply for this visa.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nInclude the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nInclude the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso include:\n\nAlso include:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if relevant.\nproof of change of name, if relevant.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have used or been known as.\ndocuments that show other names you have used or been known as.\n\n### Relationship documents\n\nRelationship documents\n\nIf you are or have been married, widowed, divorced or permanently separated, you must provide proof. This can include:\n\nIf you are or have been married, widowed, divorced or permanently separated, you must provide proof. This can include:\n- divorce documents\ndivorce documents\n- death certificates\ndeath certificates\n- separation documents or\nseparation documents or\n- statutory declarations.\nstatutory declarations.\n\nIf you have not included your partner or dependent children in this application, tell us the reason why. For example, if they already hold Australian citizenship or are a permanent resident.\n\nIf you have not included your partner or dependent children in this application, tell us the reason why. For example, if they already hold Australian citizenship or are a permanent resident.\nSee how\n\n#### Record of achievement documents\n\nRecord of achievement documents\n\nYou must provide evidence that your achievements place you among the best in your area of expertise.\n\nYou must provide evidence that your achievements place you among the best in your area of expertise.\n\nExamples of evidence include, but are not limited to:\n\nExamples of evidence include, but are not limited to:\n- prestigious awards and prizes from internationally recognised organisations including:Nobel PrizeBreakthrough PrizesL’oreal-UNESCO Award for Women in ScienceTuring AwardACM Prize in Computing\nprestigious awards and prizes from internationally recognised organisations including:\n- Nobel Prize\nNobel Prize\n- Breakthrough Prizes\nBreakthrough Prizes\n- L’oreal-UNESCO Award for Women in Science\nL’oreal-UNESCO Award for Women in Science\n- Turing Award\nTuring Award\n- ACM Prize in Computing\nACM Prize in Computing\n- top of field level sports or arts awards and honours, for example:Olympic Gold medalPulitzer PrizeBooker PrizeLaureus World SportsmanSportswoman of the year\ntop of field level sports or arts awards and honours, for example:\n- Olympic Gold medal\nOlympic Gold medal\n- Pulitzer Prize\nPulitzer Prize\n- Booker Prize\nBooker Prize\n- Laureus World Sportsman\nLaureus World Sportsman\n- Sportswoman of the year\nSportswoman of the year\n- a national level research grant in Australia or an equivalent from other countries\na national level research grant in Australia or an equivalent from other countries\n- a research-based PhD from a top global university\na research-based PhD from a top global university\n- recent publications in top ranked journals\nrecent publications in top ranked journals\n- a high h-index\na high h-index\n- recent keynote appearance/s at a high-profile international conference\nrecent keynote appearance/s at a high-profile international conference\n- past or current connections with Commonwealth, State or Territory based innovation hubs\npast or current connections with Commonwealth, State or Territory based innovation hubs\n- relevant international patents for cutting edge products/technological advancements\nrelevant international patents for cutting edge products/technological advancements\n- a demonstrated track record of supporting successful innovative ventures\na demonstrated track record of supporting successful innovative ventures\n- leading internationally reputed companies to their Initial Public Offering\nleading internationally reputed companies to their Initial Public Offering\n- success at major national or international sporting competitions\nsuccess at major national or international sporting competitions\n- a sustained record of well-recognised work, and receipt of honours, accolades and major commissioned works in the arts\na sustained record of well-recognised work, and receipt of honours, accolades and major commissioned works in the arts\n- current earnings or an offer of employment with earnings at or above theFair Work High Income Threshold, in your area of achievement\ncurrent earnings or an offer of employment with earnings at or above the\nFair Work High Income Threshold\n, in your area of achievement\n- professional designations, such as Academic Level D or E professors or lead research fellows\nprofessional designations, such as Academic Level D or E professors or lead research fellows\n- online business, personal or academic webpages\nonline business, personal or academic webpages\n- supporting statements from government, professional, scientific, cultural, sporting or other peak bodies\nsupporting statements from government, professional, scientific, cultural, sporting or other peak bodies\n- memberships or key appointments at industry advisory boards or committees\nmemberships or key appointments at industry advisory boards or committees\n- international media coverage of your achievements.\ninternational media coverage of your achievements.\n\nThe evidence you supply to support your record of achievement must also show recent prominence in your area of expertise.\n\nThe evidence you supply to support your record of achievement must also show recent prominence in your area of expertise.\n\nIf you are under 18 years old, or 55 years or older when you apply, you must provide evidence you would be of exceptional benefit to the Australian community. Examples of evidence could include:\n\nIf you are under 18 years old, or 55 years or older when you apply, you must provide evidence you would be of exceptional benefit to the Australian community. Examples of evidence could include:\n- a statement regarding your professional plans upon settling in Australia\na statement regarding your professional plans upon settling in Australia\n- an employment offer for a senior leadership position in Australia\nan employment offer for a senior leadership position in Australia\n- service agreements or business contracts with prominent Australian organisations\nservice agreements or business contracts with prominent Australian organisations\n- pitch-deck or business plan to establish a highly innovative organisation that would fill an industry gap, and/or create employment opportunities for a large number of Australian residents\npitch-deck or business plan to establish a highly innovative organisation that would fill an industry gap, and/or create employment opportunities for a large number of Australian residents\n- grants associated with planned research in Australia\ngrants associated with planned research in Australia\n- membership or appointment to industry advisory boards or regulatory authorities in Australia\nmembership or appointment to industry advisory boards or regulatory authorities in Australia\n- if under 18, evidence of your capacity to support yourself in your area of expertise without parental or family financial support.\nif under 18, evidence of your capacity to support yourself in your area of expertise without parental or family financial support.\nSee how\n\n#### Nominator documents\n\nNominator documents\n\nYou must attach a completed Nomination for National Innovation visa (Form 1000) when you apply.\n\nYou must attach a completed Nomination for National Innovation visa (Form 1000) when you apply.\n\nYou must also provide evidence that your nominator has:\n\nYou must also provide evidence that your nominator has:\n- a national reputation in the same area as you\na national reputation in the same area as you\n- (if your nominator is a person) Australian citizenship, Australian permanent residency in Australia, oreligible New Zealand citizenstatus in Australia\n(if your nominator is a person) Australian citizenship, Australian permanent residency in Australia, or\neligible New Zealand citizen\nstatus in Australia\n- (if your nominator is an Australian organisation) proof that the signatory of Form 1000 is authorised to represent the organisation.\n(if your nominator is an Australian organisation) proof that the signatory of Form 1000 is authorised to represent the organisation.\n\nWe will not process your visa application if you do not attach a completed Nomination for National Innovation visa (Form 1000) when you apply.\n\nWe will not process your visa application if you do not attach a completed Nomination for National Innovation visa (Form 1000) when you apply.\n\nView theNomination for National Innovation visa (Form 1000) (538KB PDF).\n\nView the\nNomination for National Innovation visa (Form 1000) (538KB PDF)\n.\nSee how\n\n#### Ability to establish yourself in Australia\n\nAbility to establish yourself in Australia\n\nYou must prove you can work or support yourself in your area of achievement.\n\nYou must prove you can work or support yourself in your area of achievement.\n\nYou should give us:\n\nYou should give us:\n- a statement detailing your knowledge of opportunities in Australia in your area of achievement\na statement detailing your knowledge of opportunities in Australia in your area of achievement\n- information provided by your nominator\ninformation provided by your nominator\n- letters from organisations or other relevant bodies in Australia that show future employment or possible business opportunities\nletters from organisations or other relevant bodies in Australia that show future employment or possible business opportunities\n- qualifications or experience you have gained during previous residence in Australia\nqualifications or experience you have gained during previous residence in Australia\n- your employment or business background\nyour employment or business background\n\nYou cannot include income from work outside your field.\n\nYou cannot include income from work outside your field.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nYou and any family members above 16 years of age who apply for the visa with you must meet our character requirement.\n\nYou and any family members above 16 years of age who apply for the visa with you must meet our character requirement.\n\nEvidence of character we require include:\n\nEvidence of character we require include:\n- an Australian police certificate if you have spent 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police\nan Australian police certificate if you have spent 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police\n- an overseas police certificate from everycountry, including your home country, where you spent 12 months or more in the last 10 years since you turned 16\nan overseas police certificate from every\ncountry\n, including your home country, where you spent 12 months or more in the last 10 years since you turned 16\n- military service records or discharge papers, if you served in the armed forces of any country.\nmilitary service records or discharge papers, if you served in the armed forces of any country.\n\nSome countries require a letter from the Department to issue police certificates. The Department will provide these letters after you have made an application.\n\nSome countries require a letter from the Department to issue police certificates. The Department will provide these letters after you have made an application.\n\nYou may be required to complete and provide the following forms:\n\nYou may be required to complete and provide the following forms:\n- Form 80 Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n- Form 1221 Additional personal particulars information (331KB PDF).\nForm 1221 Additional personal particulars information (331KB PDF)\n.\n\nIf there are delays getting your character documents, upload evidence showing your attempts to get them to your ImmiAccount.\n\nIf there are delays getting your character documents, upload evidence showing your attempts to get them to your ImmiAccount.\nSee how\n\n#### Functional English documents\n\nFunctional English documents\n\nGive proof you have at leastfunctional English.\n\nGive proof you have at least\nfunctional English\n.\n\nApplicants aged 18 years and older at the time of application must provide evidence of functional English. If you do not have at least functional English you must pay asecond instalment of the visa application charge.\n\nApplicants aged 18 years and older at the time of application must provide evidence of functional English. If you do not have at least functional English you must pay a\nsecond instalment of the visa application charge\n.\n\nYou must provide a statement showing your intention to pay the second visa application charge for each person with less than functional English.\n\nYou must provide a statement showing your intention to pay the second visa application charge for each person with less than functional English.\n\nWe will tell you when to make this payment.\n\nWe will tell you when to make this payment.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nWe need to see evidence of yourpartner's identity and relationship with you.\n\nWe need to see evidence of your\npartner\n's identity and relationship with you.\n\nTo show this, provide:\n\nTo show this, provide:\n- identity documents and photos\nidentity documents and photos\n- character documents\ncharacter documents\n- marriage certificate, if applicable\nmarriage certificate, if applicable\n- documents about other relationships, if applicable.\ndocuments about other relationships, if applicable.\n\nForde factorelationships, include either:\n\nFor\nde facto\nrelationships, include either:\n- evidence that your relationship is registered by an Australian State or Territory\nevidence that your relationship is registered by an Australian State or Territory\n- enough documents to prove you have been in a de facto relationship for at least 12 months before you apply.\nenough documents to prove you have been in a de facto relationship for at least 12 months before you apply.\n\nFor both married and de facto applicants you must give evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n\nFor both married and de facto applicants you must give evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you.\ndocuments that show your partner has lived at the same address as you.\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant 18 years old or younger who is applying with you, include:\n\nFor every dependant 18 years old or younger who is applying with you, include:\n- copies of birth certificates or the family book showing the names of both parents of any dependent children\ncopies of birth certificates or the family book showing the names of both parents of any dependent children\n- copies of adoption papers, if applicable.\ncopies of adoption papers, if applicable.\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child.\nis not coming to Australia with the child.\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- statutory declarationgiving their consent for the child to visit Australia on this visa.\nstatutory declaration\ngiving their consent for the child to visit Australia on this visa.\n\nOr, you can show us either:\n\nOr, you can show us either:\n- an Australian court order that allows your child to migrate to Australia\nan Australian court order that allows your child to migrate to Australia\n- that the laws of your home country allow them to migrate.\nthat the laws of your home country allow them to migrate.\n\nInclude:\n\nInclude:\n- an identity document showing the signature and photo of the person who completed the form or declaration. Such evidence could be a passport or driver’s licence\nan identity document showing the signature and photo of the person who completed the form or declaration. Such evidence could be a passport or driver’s licence\n- adoption papers or other court documents, if applicable.\nadoption papers or other court documents, if applicable.\n\nNote:If your child is likely to turn 18 while your application is processing, you must give evidence they are dependent on you. See the section 'Dependants over 18 documents' below for more information. A child who turns 18 while your application is processing and who is not dependent on you cannot satisfy the criteria for this visa.\n\nNote:\nIf your child is likely to turn 18 while your application is processing, you must give evidence they are dependent on you. See the section 'Dependants over 18 documents' below for more information. A child who turns 18 while your application is processing and who is not dependent on you cannot satisfy the criteria for this visa.\nSee how\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nTo include your child who is over 18 in your visa application, they must have turned either:\n\nTo include your child who is over 18 in your visa application, they must have turned either:\n- 18 years of age but not yet turned 23, and dependent on you or your partner\n18 years of age but not yet turned 23, and dependent on you or your partner\n- 23 years of age, and unable to earn a living to support themselves because of physical or cognitive limitations and dependent on you or your partner.\n23 years of age, and unable to earn a living to support themselves because of physical or cognitive limitations and dependent on you or your partner.\n\nTo show this provide:\n\nTo show this provide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents.\ncharacter documents.\n\nIf your child is likely to turn 23 while your application is processing, you must show evidence they are dependent on you because of disability.\n\nIf your child is likely to turn 23 while your application is processing, you must show evidence they are dependent on you because of disability.\n\n#### Proof of dependency\n\nProof of dependency\n\nYou must show that the child is dependent on you by providing:\n\nYou must show that the child is dependent on you by providing:\n- proof of your relationship with the dependant such as a birth certificate or adoption papers\nproof of your relationship with the dependant such as a birth certificate or adoption papers\n- if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also include a report from a qualified medical practitioner. This must state they are dependent on you or your partner because of the total or partial loss of their bodily or mental functions\nif the child is aged 23 or is likely to turn 23 while your application is being processed, you must also include a report from a qualified medical practitioner. This must state they are dependent on you or your partner because of the total or partial loss of their bodily or mental functions\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF).\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n.\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could include:\n\nYou must also prove this person has been financially dependent on you for at least 12 months before you apply. You could include:\n- proof they live with you\nproof they live with you\n- their tax records\ntheir tax records\n- proof they are studying\nproof they are studying\n- proof of payments made by you to them or on their behalf.\nproof of payments made by you to them or on their behalf.\n\nNote:A child who turns 23 while your application is processing and who does not meet these requirements cannot satisfy the criteria for this visa.\n\nNote:\nA child who turns 23 while your application is processing and who does not meet these requirements cannot satisfy the criteria for this visa.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating.\nqualifications and experience in the language they are translating.\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote:You do not need to have any documents certified.\n\nNote:\nYou do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photographs must be clear.\n\nThe scans and photographs must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide a digital photograph of each person you include when you apply.\n\nProvide a digital photograph of each person you include when you apply.\n\nPhotographs should have:\n\nPhotographs should have:\n- head and shoulders only\nhead and shoulders only\n- a white background.\na white background.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou can apply for this visa online.\n\nYou can apply for this visa online.\nShow\n                    steps\n\n#### Give accurate information\n\nGive accurate information\n\nGive accurate information in your application. See what happensif you can't prove your identity or don't provide true information\n\nGive accurate information in your application. See what happens\nif you can't prove your identity or don't provide true information\n\n#### Apply online\n\nApply online\n1. Create an account or sign in toImmiAccount.\nCreate an account or sign in to\nImmiAccount\n.\n2. Pay theapplication charge. We will not process your application until you have paid the charge.\nPay the\napplication charge\n. We will not process your application until you have paid the charge.\n3. Attach supporting documentsto your application.\nAttach supporting documents\nto your application.\n4. Submit your application.\nSubmit your application.\n5. Note the transaction reference number (TRN).\nNote the transaction reference number (TRN).\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will tell you when we receive your application.\n\nWe will tell you when we receive your application.\nShow\n                    steps\n\n#### Health exams\n\nHealth exams\n\nYou and any family members who apply for the visa with you must meet our health requirement.\n\nYou and any family members who apply for the visa with you must meet our health requirement.\n\nIf you did not complete health examinations before you apply, wait for a request from the Department before you complete health examinations.\n\nIf you did not complete health examinations before you apply, wait for a request from the Department before you complete health examinations.\n\nLearn more abouthealth requirements.\n\nLearn more about\nhealth requirements.\n\n#### Biometrics\n\nBiometrics\n\nWe will let you know if you need to givebiometrics.\n\nWe will let you know if you need to give\nbiometrics\n.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not send us all documents when you applied, attach them inImmiAccount.\n\nIf you did not send us all documents when you applied, attach them in\nImmiAccount\n.\n\nWe might also ask you to submit more information. We are not obliged to do so and may decide your application without requesting more documents.\n\nWe might also ask you to submit more information. We are not obliged to do so and may decide your application without requesting more documents.\n\n#### Status updates\n\nStatus updates\n\nWe do not give updates on applications. You should wait for us to contact you.\n\nWe do not give updates on applications. You should wait for us to contact you.\n\nCheck if we have asked for more information in yourImmiAccount.\n\nCheck if we have asked for more information in your\nImmiAccount\n.\n\n#### Travel after you apply\n\nTravel after you apply\n\nYou don't have to tell us if you want to travel outside Australia while we process your application. To be granted this visa, you must either be in Australia or outside Australia, but not in immigration clearance, when we make a decision.\n\nYou don't have to tell us if you want to travel outside Australia while we process your application. To be granted this visa, you must either be in Australia or outside Australia, but not in immigration clearance, when we make a decision.\n\nIf you leave Australia, make sure you have a valid visa to return. To see if you can return on your visa, checkVEVO.\n\nIf you leave Australia, make sure you have a valid visa to return. To see if you can return on your visa, check\nVEVO\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you apply for the visa while in Australia, make sure you stay lawful. You must hold a valid visa while we process your application.\n\nIf you apply for the visa while in Australia, make sure you stay lawful. You must hold a valid visa while we process your application.\n\nWhen you applied for this visa, we may have granted you a Bridging visa. If your visa expires before we decide your application, that bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your new visa application.\n\nWhen you applied for this visa, we may have granted you a Bridging visa. If your visa expires before we decide your application, that bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your new visa application.\n\nDo not ask us to cancel your current visa. If we cancel your visa, you:\n\nDo not ask us to cancel your current visa. If we cancel your visa, you:\n- will be in Australia as an unlawful non-citizen and\nwill be in Australia as an unlawful non-citizen and\n- may not be eligible for a Bridging visa A.\nmay not be eligible for a Bridging visa A.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can addmembers of the family unitto your application after you apply, but before we decide on your visa.\n\nYou can add\nmembers of the family unit\nto your application after you apply, but before we decide on your visa.\n\nVisit ImmiAccount and attach a completedForm 1436 - Adding an additional applicant after lodgement (481KB PDF).\n\nVisit ImmiAccount and attach a completed\nForm 1436 - Adding an additional applicant after lodgement (481KB PDF)\n.\n\nIf you are under 18 years of age, you can only include members of the family unit when you apply. Your members of the family can include:\n\nIf you are under 18 years of age, you can only include members of the family unit when you apply. Your members of the family can include:\n- a parent\na parent\n- a member of the family unit of that parent.\na member of the family unit of that parent.\n\n#### Newborn child\n\nNewborn child\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nVisit ImmiAccount and attach a completedForm 1023 Notification of incorrect answer(s) (168KB PDF).\n\nVisit ImmiAccount and attach a completed\nForm 1023 Notification of incorrect answer(s) (168KB PDF)\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information, seeWho can help you with your application.\n\nFor more information, see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nTell us if things change after you lodge your application but before we have made a decision.\n\nTell us if things change after you lodge your application but before we have made a decision.\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nSee what to do when yoursituation changes.\n\nSee what to do when your\nsituation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia, but not in immigration clearance, when we decide your visa application. We will let you know our decision in writing.\n\nYou can be in or outside Australia, but not in immigration clearance, when we decide your visa application. We will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of the decision.\n\nKeep a copy of the decision.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision.\nwhether you have a right to a review of the decision.\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.​\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n\nThe Global Talent visa​ is closed to new applications as of 6 December 2024. The National Innovation visa has replaced the Global Talent visa. We will continue to process on-hand Global Talent visa applications in accordance with processing priorities and annual migration planning levels.\n​\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid:\n\nYou must have a valid:\n- visa to enter Australia\nvisa to enter Australia\n- passport or other travel document.\npassport or other travel document.\n\n### At the Border\n\nAt the Border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card. You will get the card on board your flight.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n. You will get the card on board your flight.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- attend free English language classes provided by theAdult Migrant English Program, if you are eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if you are eligible\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible, apply forAustralian citizenship.\nif eligible, apply for\nAustralian citizenship\n.\n\nNewly arrived residents may have towait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may have to\nwait before they can access certain Australian Government payments and benefits\n.\n\nYour visa will come with conditions attached to it. To see your conditions useVEVO.\n\nYour visa will come with conditions attached to it. To see your conditions use\nVEVO\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nThis is a permanent visa. It lets you stay in Australia permanently.\n\nFor citizenship purposes, your permanent residence starts on the day:\n\nFor citizenship purposes, your permanent residence starts on the day:\n- we grant the visa if you are in Australia\nwe grant the visa if you are in Australia\n- you enter Australia on this visa if you are outside Australia.\nyou enter Australia on this visa if you are outside Australia.\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need aResident Return (RRV) visa (subclass 155 or 157).\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years, to re-enter Australia as a permanent resident you will need a\nResident Return (RRV) visa (subclass 155 or 157)\n.\n\nTo see when the 5 years ends, useVEVO.\n\nTo see when the 5 years ends, use\nVEVO\n.\n\nFind more information about being aPermanent Resident.\n\nFind more information about being a\nPermanent Resident\n.\n\n### New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them you:\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them you:\n- have a National Innovation visa (subclass 858)\nhave a National Innovation visa (subclass 858)\n- do not want a Special Category visa (subclass 444)\ndo not want a Special Category visa (subclass 444)\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might reduce your eligibility for Australian citizenship.\n\nIf you do not tell them, you might be granted the subclass 444 visa. The subclass 444 visa is not a permanent visa. Grant of a subclass 444 visa might reduce your eligibility for Australian citizenship.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and to show your visa conditions to someone, useVEVO.\n\nTo prove you have a visa and to show your visa conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nWe expect that you will use this visa to contribute to Australia in your field of expertise.\n\nWe expect that you will use this visa to contribute to Australia in your field of expertise.\n\nYou are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nYou are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\n### Bringing family\n\nBringing family\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\n\nFor citizenship purposes, your permanent residency starts on the day you entered Australia on this visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nCheck the travel validity of your National Innovation (subclass 858) visa inVEVO.\n\nCheck the travel validity of your National Innovation (subclass 858) visa in\nVEVO\n.\n\nSeewhat you can and must do if your visa has expired or is about to expire.\n\nSee\nwhat you can and must do if your visa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### To prove you have been to Australia\n\nTo prove you have been to Australia\n\nTo get proof of your travel in and out of Australiarequest your international movement records.\n\nTo get proof of your travel in and out of Australia\nrequest your international movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-c-030",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-work-regional-provisional-491",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-employer-sponsored-regional-494",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/global-talent-visa-858#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/global-talent-visa-858#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/distinguished-talent-858?bk=aboutVisa-index-3#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/national-innovation-visa-858#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:12:06.236579",
  "metadata": {}
}