{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
  "title": "Resident Return visa",
  "raw_text": "===== main placeholder ========================================== Subclasses 155 and 157 Resident Return visa If you leave Australia after your travel validity expires, or it expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. This visa allows you to return as a permanent resident. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay Permanently Cost AUD490.00 to apply online AUD570.00 to apply on paper Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can travel in and out of Australia as many times as you want until the travel validity expires have a travel facility up to 5 years depending on your circumstances. See About this visa. See all conditions Check your eligibility You must be either an Australian permanent resident a former Australian permanent resident whose last permanent visa was not cancelled a former Australian citizen who lost or renounced Australian citizenship. Australian citizens are not eligible to apply for an RRV. If you are already in Australia as a permanent visa holder, you do not need to apply for this visa unless you wish to leave and re-enter Australia as a permanent resident. Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application Apply About this visa With this visa you can Cost RRV Refunds How long the travel facility lasts Include family Apply from Processing times Your obligations Travel Visa label With this visa you can travel to and from Australia as a permanent resident until the travel facility of your visa expires If you leave Australia after your permanent visa travel facility has expired, you will not be able to return to Australia as a permanent resident. If you wish to return to Australia as a permanent resident, you must apply for and be granted this visa before your arrival in Australia. If you are already in Australia as a permanent resident, you do not need to apply for this visa if you do not wish to travel. There are no limits on the number of Resident Return visas (RRV) you can apply for. For more information, see Overseas travel as a permanent resident Check the travel facility expiry date of your permanent visa before you apply for an RRV to see if it covers your intended travel period. You can check this on VEVO. Cost AUD490.00 for each applicant if you apply online (you must apply online unless we authorise you to apply on paper). AUD570.00 for each applicant if we authorise you to apply on paper. If you are exempt from paying the Non-internet application charge a repayment will automatically be processed and the payment returned to you. You might also have to pay for other costs including health checks, police certificates and biometrics . We will advise you if this is required. To work out what your visa will cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. RRV Refunds Generally, you will not be given a refund just because: your RRV application was refused you lost the travel facility remaining on your previous visa when your RRV was granted you did not use the travel facility attached to your RRV (regardless of the reason). If you think we made a mistake that caused you to lodge your RRV application in error, let us know. Provide documentary evidence with your request to support your claim. How long the travel facility lasts If you are granted an RRV, the travel facility will vary depending on your circumstances. If you : were present in Australia for a total of at least 2 years in the last 5 years as a permanent visa holder or Australian citizen, then you meet what is known as the ‘residence requirement’ and will be given a 5-year travel facility on your RRV. have not met the ‘residence requirement’ but have demonstrated you have substantial ties with Australia that benefit Australia, then you can only be given a maximum of 12 months travel facility on your RRV. See ‘ eligibility ’ for the requirements. have applied as a member of the family unit of a person who already holds an RRV, or who has lodged a separate application for an RRV and meets the time of application criteria for grant, then you can only be given a maximum of 12 months travel facility on your RRV. have not met any of the above requirements, but have compelling and compassionate reasons for departure , then you can only be given 3 months travel facility on your RRV (subclass 157) if you have not been absent from Australia in the 5 years prior to making an application. It is not possible to carry over the remaining travel facility from any previous visa to the subsequently granted RRV. You will not be able to get a refund for any lost travel facility. You will not be able to request extension of travel facility, regardless of the circumstances (within or outside of your control). It is not possible to postpone the grant of an RRV once all visa requirements are met. If you have already applied for an RRV and find that the travel facility attached to your current permanent visa will cover your intended travel period, you should consider withdrawing your pending RRV application. You should do this in writing as soon as possible. See You want to withdraw a visa application If you hold an RRV, you should always be aware of the expiry date of the travel facility before any travel arrangements are made. You can check this on VEVO We will send you a reminder about the expiry of the travel facility of your RRV (Subclass 155) visa. We will not send you a reminder if you have a pending RRV application. If you need to travel, you should apply for a new RRV before your existing travel facility expires. This will help you avoid delays. For more information about the Travel Facility Expiry Reminder (TFER) and which permanent visa holders receive them, see Overseas travel as a permanent resident If you return to Australia without a permanent visa and a valid travel facility (for example, when holding a visitor visa), this might impact your: entitlements as a permanent resident ability to satisfy the permanent residence requirements when applying for Australian citizenship or another RRV. You do not need to apply for an RRV if: you are in Australia, your travel facility has expired, and you do not wish to travel. Include family You can't include family members in your application. If other family members are also applying for this visa separately at the same time, then you can have all your applications processed together, if you declare them in your application. While you can’t include family members as secondary visa applicants in your application, you should provide information about any immediate family members who are Australian citizens or permanent residents in your application. This is important, if you are trying to show that you have substantial ties of benefit to Australia. Apply from You can be in or outside Australia when you apply for the visa but not in immigration clearance. If we authorise you to apply using a paper form, you must follow the instructions given to you otherwise your application may be invalid. If your application is invalid, it cannot be considered. You cannot apply in person. If you have applied for your visa but have not been granted it and you need to travel urgently see contact us Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Generally, applications that: meet the residence requirements will be processed within 5 working days from lodgement do not meet the residence requirement will take longer to process. For example, this can be 12 weeks from lodgement or more. Your application can also take longer to process if: you do not fill it in correctly you do not include all the documents we need we need more information from you it takes us time to verify your information Your application will not be processed if you do not pay the correct application charge. If necessary, you will be notified and any charges repaid. Your obligations You must obey all Australian laws. Travel You can travel for a specified period from the date your visa is granted. After that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship so you can travel on an Australian passport. See when your existing travel facility ends in VEVO Visa label We will digitally link your visa to your valid travel document. You will not get a label in your passport. Eligibility Be either an Australian permanent resident a former Australian permanent resident whose last permanent visa was not cancelled, or a former Australian citizen who lost or renounced citizenship. Australian citizens are not eligible to apply for an RRV. When an RRV application is lodged, applicants are assessed against the criteria for both subclass 155 and 157 visas. If the requirements for subclass 155 RRV are not met, and the applicant is eligible for a subclass 157 RRV, the maximum travel facility that can be granted with a subclass 157 RRV is 3 months. Even if you hold a temporary visa, you may still be eligible for an RRV if you had been a permanent visa holder or an Australian citizen. If you were an Australian permanent visa holder who returned to Australia on a temporary visa (such as an Electronic Travel Authority), you should consider applying for an RRV as soon as possible if you intend to remain permanently in Australia – see permanent resident and how to stay lawful under After you apply Age requirement There are no age requirements for RRV applicants. Meet our residence or substantial ties requirements Details You must either: have been present in Australia for 2 years in the last 5 years as the holder of a permanent visa (or permanent entry permit), or as an Australian citizen, in which case you will get a 5-year travel facility OR be outside Australia and: not absent for 5 continuous years or more before the date of application (unless you have compelling reasons), and hold a permanent visa or last left Australia as a permanent resident or citizen (but subsequently lost citizenship), and be able to demonstrate substantial ties to Australia that are of benefit to Australia, in which case you can only be given a maximum 12 months travel facility OR be outside Australia and: were an Australian citizen or permanent resident less than 10 years before you applied, and not absent from Australia for periods that total more than 5 years (unless you have compelling reasons) between the date you left Australia as a permanent resident or citizen and the date of application, and be able to demonstrate substantial ties to Australia that are of benefit to Australia, in which case you can only be given a maximum 12 months travel facility OR be in Australia and: be able to demonstrate substantial ties to Australia that are of benefit to Australia, and not been absent for 5 continuous years since grant of your most recent permanent visa or when you stopped being an Australian citizen (unless you have compelling reasons) in which case you can only be given a maximum 12 months travel facility OR be the member of family unit of a person who already holds an RRV or has lodged a separate application for an RRV, and meets the time of application criteria for grant, in which case you can only be given a maximum 12 months travel facility. In calculating the residence requirement relating to the first dot-point above, the: 2-year period is counted as 730 days 5-year period is counted back from the RRV application lodgement date (not from the date of RRV decision) date of arrival and date of departure are both included in the count of days in Australia. Only one day is counted if the applicant arrives and departs on the same day. Only one day is counted if a visa expires and another one is granted on the same day. A part-day spent in Australia by a permanent visa holder is counted as a full day. Have substantial ties Your ties must be both substantial and of benefit to Australia. Your ties can be: business ties cultural ties employment ties personal ties (including family ties) You can see examples of how to demonstrate these ties in Step by step under Gather your documents. Not hold an Authority to Return or Return Endorsement Details You are not eligible for an RRV if you hold a Transitional (permanent) visa because you were issued either an: Authority to Return (issued between 1 March 1976 to 31 August 1979) Return Endorsement (issued between 1 September 1979 and 31 December 1986) If you hold one of these, see Overseas travel as a permanent resident Pacific Engagement visa (subclass 192) - Treaty stream (Tuvalu) Details Pacific Engagement visa (subclass 192) Treaty stream (Tuvalu) holders, have an unlimited travel facility. This means that if you are the holder of a Treaty stream visa, you can travel overseas and re-enter Australia as often as you like provided the visa is not ceased (by the grant of another visa) or cancelled. Therefore, you are not required to apply for a RRV to travel overseas and to re-enter Australia. If you apply for an RRV and the visa is granted, it will cease your Subclass 192 Treaty stream visa. RRVs do not have unlimited travel facilities. You can check your visa details and conditions on VEVO Meet character requirement Details You must meet our character requirement Not have cancellation action against your business skills visa Details You might not be eligible for this visa if you have cancellation action on business grounds for your business skills visa. See the following visas: Class EA subclass 132 visa Class BH subclass 840-846 visas (repealed) Class EB subclass 188 visa Class UR subclass 160-165 visas Class EC subclass 888 visas You might not be eligible for this visa if you are, or were the holder of one of the above visas and have: been granted a subclass 155, 157 or 159 visa cancellation action for your subclass 155, 157 or 159 visa on the same business visa grounds. You may not be eligible for this visa if you are or were a family member of a person affected by the above, and either hold or have held one of the above visa subclasses as a dependant family member. Not have had a visa cancelled or a previous application refused Details We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply Check your current visa status and travel facility prior to applying to determine if an application for a Resident Return visa is necessary. You can check this through VEVO . Note: you may not get a refund after lodging your application – see Cost You should have a valid passport or other travel document before we grant this visa. If you need a new passport, plan to get it before you apply for this visa. If you get a new passport after you apply, tell us your new passport information as soon as possible. See how to tell us your passport has changed. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents You must apply online. Only in exceptional circumstances, such as an ImmiAccount technical issue, will we authorise you to lodge on paper. We might grant you the visa automatically without you needing to provide any documents if: you are an Australian Permanent resident you have resided in Australia for a total of at least 2 years in the 5 years as a permanent visa holder or Australian citizen before lodging your application your name and date of birth have not changed since the granting of your last visa you meet the character requirement Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or don't provide true information See how Identity documents Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Historical documents Provide evidence of your permanent residency with your visa application, particularly if you migrated to Australia before 1990. This could include: the pages of your old expired passport(s), which should include your photo, personal details, passport issue and expiry dates, and evidence of permanent residency wet stamps or printed visa labels any Certificate of Evidence of Resident Status (CERS) issued to you before this product was abolished on 1 June 2016 any separate permanent visa (or permanent entry permit) documentation issued to you overseas before and / or on your arrival in Australia any historical documentation you have received to this effect from the National Archives of Australia (NAA) In addition to the above, you should provide a copy of your current passport. If you migrated to Australia before 1990 and you have no evidence of your permanent residency, you should contact NAA in the first instance and obtain any necessary documentation prior to lodging your application. This includes any international movement records before 1990, and any relevant visa documentation. Failing to do so may result in significant delays in processing your application. See how Substantial ties and compelling reasons for absence documents If you do not meet the residence requirement, you must provide documents that show evidence of your substantial ties, which are of benefit to Australia, and compelling reasons for any absences from Australia of 5 or more continuous years or if you are outside Australia and were an Australian citizen or permanent resident less than 10 years before the application, compelling reasons for any periods of absence that total more than 5 years from the date you last departed Australia Provide a statement that shows your ties are both substantial and of benefit to Australia. There may be delays in processing your application if you do not attach documents to your application showing that your ties are both substantial and of benefit to Australia. Examples of documents you can attach are (but not limited to): Business ties documents company reports defining your role and authority business transactions partnership or joint venture agreements contracts showing your signature business or personal records. Cultural ties documents publications written by you contracts evidence of membership of cultural associations newspaper articles about you programs listing your artistic or cultural performances. Employment ties documents employment contracts a letter of offer from an employer recent official documents such as group certificates and payslips employee identification or security pass. Personal ties documents Substantial personal ties may be of benefit to Australia if the applicant is, or has been, a participating member of the Australian community and economy, and their ties enrich the lives of individual Australian residents and citizens. This may include regarding Australia as home or having an intention to reside in Australia. Proving substantial personal ties to Australia Example situation Example documents You have a history of long-term residence in Australia, spent your formative years in Australia or have spent a significant amount of time in Australia since first being granted a permanent visa. Utility bills, bank statements, travel record, permanent visa decision, school records You have an Australian citizen partner or, in the case of a minor child, Australian citizen parent, who has previously lived in Australia. Copies of birth certificates, marriage or citizenship certificates of partners and children Evidence of continuing relationship with Australian citizen partner You have one or more Australian citizen minor children living in Australia (including at boarding school) where no legal impediment to access exists. School reports, proof of residence of family home You are returning to Australia after living overseas with your family unit, including Australian citizen minor children. Plane tickets, property purchase documents, school enrolments, moving receipts Compelling reasons for absence If you are outside Australia when you apply, and you hold a permanent visa, or last departed Australia as a permanent resident or citizen (but subsequently lost that citizenship) – you must have compelling reasons for any absence(s) from Australia of more than 5 continuous years immediately before the date of your application; you were an Australian citizen or permanent resident less than 10 years before you applied for a RRV – you must have compelling reasons for any absence(s) that amount to 5 years in total between the date you departed Australia as a citizen or permanent resident and the date of application. You are not eligible for an RRV if you are outside Australia when you apply and you were not an Australian citizen or permanent resident in the 10 years immediately before the application unless either of the above applies to you. If you are in Australia when you apply you must have compelling reasons for any absence of more than 5 continuous years since the grant of your most recent permanent visa, or since you ceased to be an Australian citizen. Your reasons should include any elements which you thought were compelling at the time. Although not mandatory, you should indicate how the compelling reasons for your absence link to the entirety of your absence from Australia. This could be done by a statement explaining the circumstances of your absence(s). Attach other documents showing your compelling reasons for absence(s) from Australia to your application, or there may be delays in processing your application. Examples of documents you can attach are (but not limited to): severe illness or death of an overseas family member, work or study commitments by the applicant or the applicant’s partner, the applicant is living overseas in an ongoing relationship with a partner, or has minor children, the applicant or the applicant’s accompanying family members have been receiving complex or lengthy medical treatment, the applicant has been involved in legal proceedings overseas and the timing was beyond the applicant’s control, the applicant has been caught up in a natural disaster, political uprising, pandemic, or other similar event preventing them from travel. It will take us longer to process your application if we need to ask you for more documents. We may still, however, make a decision on your application based on any available information without requesting any additional information from you. As such, it is very important that you read all information on the website, and provide a complete application at the time of lodgement. Documents required because you are a member of the family unit of a person who holds this visa For married couples, provide the marriage certificate. For de facto relationships, provide either: evidence that your relationship is registered by an Australian State or Territory, enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply. For both married and de facto applicants, you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to: joint bank account statements, billing accounts in joint names, joint leases or mortgages, documents that show your partner has lived at the same address as you. For children under 18 years old, provide: copies of birth certificates or the family book showing the names of both parents, copies of the adoption paper, if applicable. See how Character documents We will tell you if and when you need to get a police certificate See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original copies and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited but on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Step 3 Apply for the visa Apply for this visa online in ImmiAccount . You can use ImmiAccount even if you don’t already have an electronic visa record with us. If you cannot apply online due to a technical issue, you can access technical support in ImmiAccount. If technical support does not resolve the issue, we will consider allowing you to submit a paper application. Applying on paper will incur an additional non-internet application charge even with our authorisation. Show steps Apply online Create an account or log in to ImmiAccount Attach documents Have family applications processed together Pay the application fee We will not process your application until you pay the charge. Each family member must have their application charge paid and all relevant documents attached to their application. See how Step 4 After you apply See what you can and must do after you apply. Show steps What will happen after you apply We will let you know when we have received your application and documents. You can track and manage your application using ImmiAccount Status updates We can’t give updates on applications within the standard processing time. You can check if we need more information from you in ImmiAccount . Wait for us to contact you if you applied on paper. See how Travel after you apply Before you leave Australia, make sure you have a valid visa that allows you to return to Australia as a permanent resident. If you are outside Australia when you apply for the visa, and apply on paper, you must be outside Australia when we grant you the visa. If you are in Australia when you apply for the visa, you can be in or outside Australia when we grant you the visa. Learn about visa expiry See how Attach more information If you didn't attach all documents when you applied, attach them as soon as possible in ImmiAccount. If you have a pending paper application, you may still be able to attach your documents in ImmiAccount. This can occur after the application has been imported into ImmiAccount. See Applying online or paper > Start and Manage an application > Import an application Your application may take longer to finalise if we have to ask you to provide more information. See how Mistakes on your application before we decide on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) and attach it in ImmiAccount, if you applied online or you have imported your application into ImmiAccount. See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Attach the forms in ImmiAccount. For more information see Who can help you with your application See how Stay lawful If you are in Australia, make sure you stay lawful by holding a valid visa while we process your application. If you held a substantive visa when you applied for this visa, you may be eligible to apply for an associated Bridging visa A (BVA) . If you are granted a BVA and your current visa expires before we decide this application, the BVA will come into effect. You can stay lawfully in Australia on the BVA while we process your application. If your substantive visa is cancelled or ceases and you do not hold a bridging visa, you will: be in Australia unlawfully not be eligible for a Bridging visa A not be eligible for a Bridging visa B - which allows you to leave and re-enter Australia until this visa application is finalised not be eligible for a Bridging visa C. Learn more about visa expiry See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome You can be in or outside Australia when we make a decision. We will let you know about your visa application in writing. We will tell you: your visa grant number the date your visa starts your visa conditions Keep a copy of the decision with you when in Australia. We will notify you in writing if we refuse your visa and explain why we have refused it and whether you have a right to a review of the decision. The visa application charge (VAC) will not be refunded to you just because we refused your visa application. When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia Before you leave Check your travel documents You must have: a valid visa to enter Australia, a valid passport or other travel document. At the border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them that you have a permanent visa and that you do not want a temporary Special Category visa (subclass 444) . If you do not tell them, you might be granted the subclass 444 visa which might affect your eligibility for an RRV and Australian citizenship in the future. In Australia What you can do when you have this visa stay in Australia, work and study in Australia, enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia, travel to and from Australia while your visa is valid, apply for Australian citizenship, if eligible. To see your specific conditions and work entitlements, use VEVO What you must do on this visa You must obey all Australian laws. Tell us if things change Things you need to let us know about include: changes to your phone number, email, name, residential or postal address while your application is being processed if you want to withdraw your application if you are issued with a new passport (we will then link your RRV to your new passport) Tell us if there is a change in your situation Travelling on this visa From the date we grant your visa, you can travel for a specified period of time. This depends on the reason we granted you the RRV. For information on the travel validity, see How long this visa lasts After that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship and travel on an Australian passport. To see when your travel facility ends, use VEVO Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working You are protected by Australian workplace law. See your workplace rights and entitlements Bringing a family member As an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, your permanent residency starts either: on the day we grant the visa, if you were in Australia on the day you entered Australia on this visa, if you were outside Australia when we granted it Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your visa is still valid Check your conditions and the expiry of your RRV in VEVO See what to do if your visa has expired or is about to expire At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate",
  "main_content": "===== main placeholder ==========================================\nSubclasses 155 and 157\n\n# Resident Return visa\n\nResident Return visa\n\nIf you leave Australia after your travel validity expires, or it expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. This visa allows you to return as a permanent resident.\n\nIf you leave Australia after your travel validity expires, or it expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. This visa allows you to return as a permanent resident.\n\nIf you leave Australia after your travel validity expires, or it expires when you are outside Australia, you will not be able to return to Australia as a permanent resident. This visa allows you to return as a permanent resident.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nAUD490.00to apply onlineAUD570.00 to apply on paper\n\nAUD490.00to apply online\n\nAUD490.00\nto apply online\n\nAUD570.00 to apply on paper\n\nAUD570.00 to apply on paper\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- travel in and out of Australia as many times as you want until the travel validity expires\ntravel in and out of Australia as many times as you want until the travel validity expires\n- have a travel facility up to 5 years depending on your circumstances. See About this visa.\nhave a travel facility up to 5 years depending on your circumstances. See About this visa.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must be either\n\nYou must be either\n- an Australianpermanent resident\nan Australian\npermanent resident\n- a former Australian permanent resident whose last permanent visa was not cancelled\na former Australian permanent resident whose last permanent visa was not cancelled\n- a former Australian citizen who lost or renounced Australian citizenship. Australian citizens are not eligible to apply for an RRV.\na former Australian citizen who lost or renounced Australian citizenship. Australian citizens are not eligible to apply for an RRV.\n\nIf you are already in Australia as a permanent visa holder, you do not need to apply for this visa unless you wish to leave and re-enter Australia as a permanent resident.\n\nIf you are already in Australia as a permanent visa holder, you do not need to apply for this visa unless you wish to leave and re-enter Australia as a permanent resident.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\n\nApply\n\nApply\nAbout this visa\nWith this visa you can\nCost\nRRV Refunds\nHow long the travel facility lasts\nInclude family\nApply from\nProcessing times\nYour obligations\nTravel\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- travel to and from Australia as a permanent resident until the travel facility of your visa expires\ntravel to and from Australia as a permanent resident until the travel facility of your visa expires\n\nIf you leave Australia after your permanent visa travel facility has expired, you will not be able to return to Australia as a permanent resident. If you wish to return to Australia as a permanent resident, you must apply for and be granted this visa before your arrival in Australia.\n\nIf you leave Australia after your permanent visa travel facility has expired, you will not be able to return to Australia as a permanent resident. If you wish to return to Australia as a permanent resident, you must apply for and be granted this visa before your arrival in Australia.\n\nIf you are already in Australia as a permanent resident, you do not need to apply for this visa if you do not wish to travel.\n\nIf you are already in Australia as a permanent resident, you do not need to apply for this visa if you do not wish to travel.\n\nThere are no limits on the number of Resident Return visas (RRV) you can apply for.\n\nThere are no limits on the number of Resident Return visas (RRV) you can apply for.\n\nFor more information, seeOverseas travel as a permanent resident.\n\nFor more information, see\nOverseas travel as a permanent resident\n.\n\nCheck the travel facility expiry date of your permanent visa before you apply for an RRV to see if it covers your intended travel period. You can check this on VEVO.\n\nCheck the travel facility expiry date of your permanent visa before you apply for an RRV to see if it covers your intended travel period. You can check this on VEVO.\n\n## Cost\n\nCost\n\nAUD490.00for each applicant if you apply online (you must apply online unless we authorise you to apply on paper).\n\nAUD490.00\nfor each applicant if you apply online (you must apply online unless we authorise you to apply on paper).\n\nAUD570.00 for each applicant if we authorise you to apply on paper. If you are exempt from paying theNon-internet application chargea repayment will automatically be processed and the payment returned to you.\n\nAUD570.00 for each applicant if we authorise you to apply on paper. If you are exempt from paying the\nNon-internet application charge\na repayment will automatically be processed and the payment returned to you.\n\nYou might also have to pay for other costs including health checks, police certificates andbiometrics. We will advise you if this is required.\n\nYou might also have to pay for other costs including health checks, police certificates and\nbiometrics\n. We will advise you if this is required.\n\nTo work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## RRV Refunds\n\nRRV Refunds\n\nGenerally, you will not be given a refund just because:\n\nGenerally, you will not be given a refund just because:\n- your RRV application was refused\nyour RRV application was refused\n- you lost the travel facility remaining on your previous visa when your RRV was granted\nyou lost the travel facility remaining on your previous visa when your RRV was granted\n- you did not use the travel facility attached to your RRV (regardless of the reason).\nyou did not use the travel facility attached to your RRV (regardless of the reason).\n\nIf you think we made a mistake that caused you to lodge your RRV application in error, let us know. Provide documentary evidence with your request to support your claim.\n\nIf you think we made a mistake that caused you to lodge your RRV application in error, let us know. Provide documentary evidence with your request to support your claim.\n\n## How long the travel facility lasts\n\nHow long the travel facility lasts\n\nIf you are granted an RRV, the travel facility will vary depending on your circumstances.\n\nIf you are granted an RRV, the travel facility will vary depending on your circumstances.\n\nIf you :\n\nIf you :\n- were present in Australia for a total of at least 2 years in the last 5 years as a permanent visa holder or Australian citizen,then you meet what is known as the ‘residence requirement’ and will be given a 5-year travel facility on your RRV.\nwere present in Australia for a total of at least 2 years in the last 5 years as a permanent visa holder or Australian citizen,\nthen you meet what is known as the ‘residence requirement’ and will be given a 5-year travel facility on your RRV.\n- have not met the ‘residence requirement’ but have demonstrated you have substantial ties with Australia that benefit Australia,then you can only be given a maximum of 12 months travel facility on your RRV. See ‘eligibility’ for the requirements.\nhave not met the ‘residence requirement’ but have demonstrated you have substantial ties with Australia that benefit Australia,\nthen you can only be given a maximum of 12 months travel facility on your RRV. See ‘\neligibility\n’ for the requirements.\n- have applied as a member of the family unit of a person who already holds an RRV, or who has lodged a separate application for an RRV and meets the time of application criteria for grant,then you can only be given a maximum of 12 months travel facility on your RRV.\nhave applied as a member of the family unit of a person who already holds an RRV, or who has lodged a separate application for an RRV and meets the time of application criteria for grant,\nthen you can only be given a maximum of 12 months travel facility on your RRV.\n- have not met any of the above requirements, but have compelling and compassionate reasons for departure, then you can only be given 3 months travel facility on your RRV (subclass 157) if you have not been absent from Australia in the 5 years prior to making an application.\nhave not met any of the above requirements, but have compelling and compassionate reasons for departure\n, then you can only be given 3 months travel facility on your RRV (subclass 157) if you have not been absent from Australia in the 5 years prior to making an application.\n\nIt is not possible to carry over the remaining travel facility from any previous visa to the subsequently granted RRV. You will not be able to get a refund for any lost travel facility.\n\nIt is not possible to carry over the remaining travel facility from any previous visa to the subsequently granted RRV. You will not be able to get a refund for any lost travel facility.\n\nYou will not be able to request extension of travel facility, regardless of the circumstances (within or outside of your control).\n\nYou will not be able to request extension of travel facility, regardless of the circumstances (within or outside of your control).\n\nIt is not possible to postpone the grant of an RRV once all visa requirements are met.\n\nIt is not possible to postpone the grant of an RRV once all visa requirements are met.\n\nIf you have already applied for an RRV and find that the travel facility attached to your current permanent visa will cover your intended travel period, you should consider withdrawing your pending RRV application. You should do this in writing as soon as possible. SeeYou want to withdraw a visa application.\n\nIf you have already applied for an RRV and find that the travel facility attached to your current permanent visa will cover your intended travel period, you should consider withdrawing your pending RRV application. You should do this in writing as soon as possible. See\nYou want to withdraw a visa application\n.\n\nIf you hold an RRV, you should always be aware of the expiry date of the travel facility before any travel arrangements are made. You can check this onVEVO.\n\nIf you hold an RRV, you should always be aware of the expiry date of the travel facility before any travel arrangements are made. You can check this on\nVEVO\n.\n\nWe will send you a reminder about the expiry of the travel facility of your RRV (Subclass 155) visa. We will not send you a reminder if you have a pending RRV application. If you need to travel, you should apply for a new RRV before your existing travel facility expires. This will help you avoid delays. For more information about the Travel Facility Expiry Reminder (TFER) and which permanent visa holders receive them, seeOverseas travel as a permanent resident.\n\nWe will send you a reminder about the expiry of the travel facility of your RRV (Subclass 155) visa. We will not send you a reminder if you have a pending RRV application. If you need to travel, you should apply for a new RRV before your existing travel facility expires. This will help you avoid delays. For more information about the Travel Facility Expiry Reminder (TFER) and which permanent visa holders receive them, see\nOverseas travel as a permanent resident\n.\n\nIf you return to Australia without a permanent visa and a valid travel facility (for example, when holding a visitor visa), this might impact your:\n\nIf you return to Australia without a permanent visa and a valid travel facility (for example, when holding a visitor visa), this might impact your:\n- entitlements as a permanent resident\nentitlements as a permanent resident\n- ability to satisfy the permanent residence requirements when applying for Australian citizenship or another RRV.\nability to satisfy the permanent residence requirements when applying for Australian citizenship or another RRV.\n\nYou do not need to apply for an RRV if:\n\nYou do not need to apply for an RRV if:\n- you are in Australia,\nyou are in Australia,\n- your travel facility has expired, and\nyour travel facility has expired, and\n- you do not wish to travel.\nyou do not wish to travel.\n\n## Include family\n\nInclude family\n\nYou can't include family members in your application.\n\nYou can't include family members in your application.\n\nIf other family members are also applying for this visa separately at the same time, then you can have all your applications processed together, if you declare them in your application.\n\nIf other family members are also applying for this visa separately at the same time, then you can have all your applications processed together, if you declare them in your application.\n\nWhile you can’t include family members as secondary visa applicants in your application, you should provide information about any immediate family members who are Australian citizens or permanent residents in your application. This is important, if you are trying to show that you have substantial ties of benefit to Australia.\n\nWhile you can’t include family members as secondary visa applicants in your application, you should provide information about any immediate family members who are Australian citizens or permanent residents in your application. This is important, if you are trying to show that you have substantial ties of benefit to Australia.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance. If we authorise you to apply using a paper form, you must follow the instructions given to you otherwise your application may be invalid. If your application is invalid, it cannot be considered. You cannot apply in person.\n\nYou can be in or outside Australia when you apply for the visa but not in immigration clearance. If we authorise you to apply using a paper form, you must follow the instructions given to you otherwise your application may be invalid. If your application is invalid, it cannot be considered. You cannot apply in person.\n\nIf you have applied for your visa but have not been granted it and you need to travel urgently seecontact us.\n\nIf you have applied for your visa but have not been granted it and you need to travel urgently see\ncontact us\n.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nGenerally, applications that:\n\nGenerally, applications that:\n- meet theresidence requirementswill be processed within 5 working days from lodgement\nmeet the\nresidence requirements\nwill be processed within 5 working days from lodgement\n- do not meet the residence requirement will take longer to process. For example, this can be 12 weeks from lodgement or more.\ndo not meet the residence requirement will take longer to process. For example, this can be 12 weeks from lodgement or more.\n\nYour application can also take longer to process if:\n\nYour application can also take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need\nyou do not include all the documents we need\n- we need more information from you\nwe need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n\nYour application will not be processed if you do not pay the correct application charge. If necessary, you will be notified and any charges repaid.\n\nYour application will not be processed if you do not pay the correct application charge. If necessary, you will be notified and any charges repaid.\n\n## Your obligations\n\nYour obligations\n\nYou must obey all Australian laws.\n\nYou must obey all Australian laws.\n\n## Travel\n\nTravel\n\nYou can travel for a specified period from the date your visa is granted.\n\nYou can travel for a specified period from the date your visa is granted.\n\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship so you can travel on an Australian passport.\n\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship so you can travel on an Australian passport.\n\nSee when your existing travel facility ends inVEVO.\n\nSee when your existing travel facility ends in\nVEVO\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your valid travel document. You will not get a label in your passport.\n\nWe will digitally link your visa to your valid travel document. You will not get a label in your passport.\nEligibility\n\n## Be either\n\nBe either\n- an Australianpermanent resident\nan Australian\npermanent resident\n- a former Australian permanent resident whose last permanent visa was not cancelled, or\na former Australian permanent resident whose last permanent visa was not cancelled, or\n- a former Australian citizen who lost or renounced citizenship.\na former Australian citizen who lost or renounced citizenship.\n\nAustralian citizens are not eligible to apply for an RRV.\n\nAustralian citizens are not eligible to apply for an RRV.\n\nWhen an RRV application is lodged, applicants are assessed against the criteria for both subclass 155 and 157 visas. If the requirements for subclass 155 RRV are not met, and the applicant is eligible for a subclass 157 RRV, the maximum travel facility that can be granted with a subclass 157 RRV is 3 months.\n\nWhen an RRV application is lodged, applicants are assessed against the criteria for both subclass 155 and 157 visas. If the requirements for subclass 155 RRV are not met, and the applicant is eligible for a subclass 157 RRV, the maximum travel facility that can be granted with a subclass 157 RRV is 3 months.\n\nEven if you hold a temporary visa, you may still be eligible for an RRV if you had been a permanent visa holder or an Australian citizen.\n\nEven if you hold a temporary visa, you may still be eligible for an RRV if you had been a permanent visa holder or an Australian citizen.\n\nIf you were an Australian permanent visa holder who returned to Australia on a temporary visa (such as an Electronic Travel Authority), you should consider applying for an RRV as soon as possible if you intend to remain permanently in Australia – seepermanent residentand how tostay lawfulunderAfter you apply.\n\nIf you were an Australian permanent visa holder who returned to Australia on a temporary visa (such as an Electronic Travel Authority), you should consider applying for an RRV as soon as possible if you intend to remain permanently in Australia – see\npermanent resident\nand how to\nstay lawful\nunder\nAfter you apply\n.\n\n## Age requirement\n\nAge requirement\n\nThere are no age requirements for RRV applicants.\n\nThere are no age requirements for RRV applicants.\n\n## Meet our residence or substantial ties requirements\n\nMeet our residence or substantial ties requirements\nDetails\n\nYou must either:\n\nYou must either:\n- have been present in Australia for 2 years in the last 5 years as the holder of a permanent visa (or permanent entry permit), or as an Australian citizen, in which case you will get a 5-year travel facility\nhave been present in Australia for 2 years in the last 5 years as the holder of a permanent visa (or permanent entry permit), or as an Australian citizen, in which case you will get a 5-year travel facility\n\nOR\n\nOR\n- be outside Australia and:not absent for 5 continuous years or more before the date of application (unless you have compelling reasons), andhold a permanent visa or last left Australia as a permanent resident or citizen (but subsequently lost citizenship), andbe able to demonstrate substantial ties to Australia that are of benefit to Australia,\nbe outside Australia and:\n- not absent for 5 continuous years or more before the date of application (unless you have compelling reasons), and\nnot absent for 5 continuous years or more before the date of application (unless you have compelling reasons), and\n- hold a permanent visa or last left Australia as a permanent resident or citizen (but subsequently lost citizenship), and\nhold a permanent visa or last left Australia as a permanent resident or citizen (but subsequently lost citizenship), and\n- be able to demonstrate substantial ties to Australia that are of benefit to Australia,\nbe able to demonstrate substantial ties to Australia that are of benefit to Australia,\n\nin which case you can only be given a maximum 12 months travel facility\n\nin which case you can only be given a maximum 12 months travel facility\n\nOR\n\nOR\n- be outside Australia and:were an Australian citizen or permanent resident less than 10 years before you applied, andnot absent from Australia for periods that total more than 5 years (unless you have compelling reasons) between the date you left Australia as a permanent resident or citizen and the date of application, andbe able to demonstrate substantial ties to Australia that are of benefit to Australia,\nbe outside Australia and:\n- were an Australian citizen or permanent resident less than 10 years before you applied, and\nwere an Australian citizen or permanent resident less than 10 years before you applied, and\n- not absent from Australia for periods that total more than 5 years (unless you have compelling reasons) between the date you left Australia as a permanent resident or citizen and the date of application, and\nnot absent from Australia for periods that total more than 5 years (unless you have compelling reasons) between the date you left Australia as a permanent resident or citizen and the date of application, and\n- be able to demonstrate substantial ties to Australia that are of benefit to Australia,\nbe able to demonstrate substantial ties to Australia that are of benefit to Australia,\n\nin which case you can only be given a maximum 12 months travel facility\n\nin which case you can only be given a maximum 12 months travel facility\n\nOR\n\nOR\n- be in Australia and:be able to demonstrate substantial ties to Australia that are of benefit to Australia, andnot been absent for 5 continuous years since grant of your most recent permanent visa or when you stopped being an Australian citizen (unless you have compelling reasons)\nbe in Australia and:\n- be able to demonstrate substantial ties to Australia that are of benefit to Australia, and\nbe able to demonstrate substantial ties to Australia that are of benefit to Australia, and\n- not been absent for 5 continuous years since grant of your most recent permanent visa or when you stopped being an Australian citizen (unless you have compelling reasons)\nnot been absent for 5 continuous years since grant of your most recent permanent visa or when you stopped being an Australian citizen (unless you have compelling reasons)\n\nin which case you can only be given a maximum 12 months travel facility\n\nin which case you can only be given a maximum 12 months travel facility\n\nOR\n\nOR\n- be the member of family unit of a person who already holds an RRV or has lodged a separate application for an RRV, and meets the time of application criteria for grant, in which case you can only be given a maximum 12 months travel facility.\nbe the member of family unit of a person who already holds an RRV or has lodged a separate application for an RRV, and meets the time of application criteria for grant, in which case you can only be given a maximum 12 months travel facility.\n\nIn calculating the residence requirement relating to the first dot-point above, the:\n\nIn calculating the residence requirement relating to the first dot-point above, the:\n- 2-year period is counted as 730 days\n2-year period is counted as 730 days\n- 5-year period is counted back from the RRV application lodgement date (not from the date of RRV decision)\n5-year period is counted back from the RRV application lodgement date (not from the date of RRV decision)\n- date of arrival and date of departure are both included in the count of days in Australia. Only one day is counted if the applicant arrives and departs on the same day. Only one day is counted if a visa expires and another one is granted on the same day. A part-day spent in Australia by a permanent visa holder is counted as a full day.\ndate of arrival and date of departure are both included in the count of days in Australia. Only one day is counted if the applicant arrives and departs on the same day. Only one day is counted if a visa expires and another one is granted on the same day. A part-day spent in Australia by a permanent visa holder is counted as a full day.\n\n### Have substantial ties\n\nHave substantial ties\n\nYour ties must be both substantial and of benefit to Australia. Your ties can be:\n\nYour ties must be both substantial and of benefit to Australia. Your ties can be:\n- business ties\nbusiness ties\n- cultural ties\ncultural ties\n- employment ties\nemployment ties\n- personal ties (including family ties)\npersonal ties (including family ties)\n\nYou can see examples of how to demonstrate these ties in Step by step under Gather your documents.\n\nYou can see examples of how to demonstrate these ties in Step by step under Gather your documents.\n\n## Not hold an Authority to Return or Return Endorsement\n\nNot hold an Authority to Return or Return Endorsement\nDetails\n\nYou are not eligible for an RRV if you hold a Transitional (permanent) visa because you were issued either an:\n\nYou are not eligible for an RRV if you hold a Transitional (permanent) visa because you were issued either an:\n- Authority to Return (issued between 1 March 1976 to 31 August 1979)\nAuthority to Return (issued between 1 March 1976 to 31 August 1979)\n- Return Endorsement (issued between 1 September 1979 and 31 December 1986)\nReturn Endorsement (issued between 1 September 1979 and 31 December 1986)\n\nIf you hold one of these, seeOverseas travel as a permanent resident.\n\nIf you hold one of these, see\nOverseas travel as a permanent resident\n.\n\n## Pacific Engagement visa (subclass 192) - Treaty stream (Tuvalu)\n\nPacific Engagement visa (subclass 192) - Treaty stream (Tuvalu)\nDetails\n\nPacific Engagement visa (subclass 192) Treaty stream (Tuvalu) holders, have an unlimited travel facility. This means that if you are the holder of a Treaty stream visa, you can travel overseas and re-enter Australia as often as you like provided the visa is not ceased (by the grant of another visa) or cancelled. Therefore, youare notrequired to apply for a RRV to travel overseas and to re-enter Australia.\n\nPacific Engagement visa (subclass 192) Treaty stream (Tuvalu) holders, have an unlimited travel facility. This means that if you are the holder of a Treaty stream visa, you can travel overseas and re-enter Australia as often as you like provided the visa is not ceased (by the grant of another visa) or cancelled. Therefore, you\nare not\nrequired to apply for a RRV to travel overseas and to re-enter Australia.\n\nIf you apply for an RRV and the visa is granted, it will cease your Subclass 192 Treaty stream visa. RRVs do not have unlimited travel facilities.\n\nIf you apply for an RRV and the visa is granted, it will cease your Subclass 192 Treaty stream visa. RRVs do not have unlimited travel facilities.\n\nYou can check your visa details and conditions onVEVO.\n\nYou can check your visa details and conditions on\nVEVO\n.\n\n## Meet character requirement\n\nMeet character requirement\nDetails\n\nYou must meet ourcharacter requirement.\n\nYou must meet our\ncharacter requirement\n.\n\n## Not have cancellation action against your business skills visa\n\nNot have cancellation action against your business skills visa\nDetails\n\nYou might not be eligible for this visa if you have cancellation action on business grounds for your business skills visa. See the following visas:\n\nYou might not be eligible for this visa if you have cancellation action on business grounds for your business skills visa. See the following visas:\n- Class EA subclass 132 visa\nClass EA subclass 132 visa\n- Class BH subclass 840-846 visas (repealed)\nClass BH subclass 840-846 visas (repealed)\n- Class EB subclass 188 visa\nClass EB subclass 188 visa\n- Class UR subclass 160-165 visas\nClass UR subclass 160-165 visas\n- Class EC subclass 888 visas\nClass EC subclass 888 visas\n\nYou might not be eligible for this visa if you are, or were the holder of one of the above visas and have:\n\nYou might not be eligible for this visa if you are, or were the holder of one of the above visas and have:\n- been granted a subclass 155, 157 or 159 visa\nbeen granted a subclass 155, 157 or 159 visa\n- cancellation action for your subclass 155, 157 or 159 visa on the same business visa grounds.\ncancellation action for your subclass 155, 157 or 159 visa on the same business visa grounds.\n\nYou may not be eligible for this visa if you are or were a family member of a person affected by the above, and either hold or have held one of the above visa subclasses as a dependant family member.\n\nYou may not be eligible for this visa if you are or were a family member of a person affected by the above, and either hold or have held one of the above visa subclasses as a dependant family member.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck your current visa status and travel facility prior to applying to determine if an application for a Resident Return visa is necessary. You can check this throughVEVO. Note: you may not get a refund after lodging your application – seeCost.\n\nCheck your current visa status and travel facility prior to applying to determine if an application for a Resident Return visa is necessary. You can check this through\nVEVO\n. Note: you may not get a refund after lodging your application – see\nCost\n.\n\nYou should have a valid passport or other travel document before we grant this visa.\n\nYou should have a valid passport or other travel document before we grant this visa.\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\nIf you need a new passport, plan to get it before you apply for this visa.\n\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how totell us your passport has changed.\n\nIf you get a new passport after you apply, tell us your new passport information as soon as possible. See how to\ntell us your passport has changed.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou must apply online. Only in exceptional circumstances, such as an ImmiAccount technical issue, will we authorise you to lodge on paper. We might grant you the visa automatically without you needing to provide any documents if:\n\nYou must apply online. Only in exceptional circumstances, such as an ImmiAccount technical issue, will we authorise you to lodge on paper. We might grant you the visa automatically without you needing to provide any documents if:\n- you are an AustralianPermanent resident\nyou are an Australian\nPermanent resident\n- you have resided in Australia for a total of at least 2 years in the 5 years as a permanent visa holder or Australian citizen before lodging your application\nyou have resided in Australia for a total of at least 2 years in the 5 years as a permanent visa holder or Australian citizen before lodging your application\n- your name and date of birth have not changed since the granting of your last visa\nyour name and date of birth have not changed since the granting of your last visa\n- you meet the character requirement\nyou meet the character requirement\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens ifyou can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens if\nyou can't prove your identity or don't provide true information\n.\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Historical documents\n\nHistorical documents\n\nProvide evidence of your permanent residency with your visa application, particularly if you migrated to Australia before 1990. This could include:\n\nProvide evidence of your permanent residency with your visa application, particularly if you migrated to Australia before 1990. This could include:\n- the pages of your old expired passport(s), which should include your photo, personal details, passport issue and expiry dates, and evidence of permanent residency wet stamps or printed visa labels\nthe pages of your old expired passport(s), which should include your photo, personal details, passport issue and expiry dates, and evidence of permanent residency wet stamps or printed visa labels\n- anyCertificate of Evidence of Resident Status (CERS)issued to you before this product was abolished on 1 June 2016\nany\nCertificate of Evidence of Resident Status (CERS)\nissued to you before this product was abolished on 1 June 2016\n- any separate permanent visa (or permanent entry permit) documentation issued to you overseas before and / or on your arrival in Australia\nany separate permanent visa (or permanent entry permit) documentation issued to you overseas before and / or on your arrival in Australia\n- any historical documentation you have received to this effect from theNational Archives of Australia (NAA).\nany historical documentation you have received to this effect from the\nNational Archives of Australia (NAA)\n.\n\nIn addition to the above, you should provide a copy of your current passport.\n\nIn addition to the above, you should provide a copy of your current passport.\n\nIf you migrated to Australia before 1990 and you have no evidence of your permanent residency, you should contactNAAin the first instance and obtain any necessary documentation prior to lodging your application. This includes any international movement records before 1990, and any relevant visa documentation. Failing to do so may result in significant delays in processing your application.\n\nIf you migrated to Australia before 1990 and you have no evidence of your permanent residency, you should contact\nNAA\nin the first instance and obtain any necessary documentation prior to lodging your application. This includes any international movement records before 1990, and any relevant visa documentation. Failing to do so may result in significant delays in processing your application.\nSee how\n\n#### Substantial ties and compelling reasons for absence documents\n\nSubstantial ties and compelling reasons for absence documents\n\nIf you do not meet the residence requirement, you must provide documents that show evidence of your substantial ties, which are of benefit to Australia, and\n\nIf you do not meet the residence requirement, you must provide documents that show evidence of your substantial ties, which are of benefit to Australia, and\n- compelling reasons for any absences from Australia of 5 or more continuous years or\ncompelling reasons for any absences from Australia of 5 or more continuous years or\n- if you are outside Australia and were an Australian citizen or permanent resident less than 10 years before the application, compelling reasons for any periods of absence that total more than 5 years from the date you last departed Australia\nif you are outside Australia and were an Australian citizen or permanent resident less than 10 years before the application, compelling reasons for any periods of absence that total more than 5 years from the date you last departed Australia\n\nProvide a statement that shows your ties are both substantial and of benefit to Australia. There may be delays in processing your application if you do not attach documents to your application showing that your ties are both substantial and of benefit to Australia.\n\nProvide a statement that shows your ties are both substantial and of benefit to Australia. There may be delays in processing your application if you do not attach documents to your application showing that your ties are both substantial and of benefit to Australia.\n\nExamples of documents you can attach are (but not limited to):\n\nExamples of documents you can attach are (but not limited to):\n\n#### Business ties documents\n\nBusiness ties documents\n- company reports defining your role and authority\ncompany reports defining your role and authority\n- business transactions\nbusiness transactions\n- partnership or joint venture agreements\npartnership or joint venture agreements\n- contracts showing your signature\ncontracts showing your signature\n- business or personal records.\nbusiness or personal records.\n\n#### Cultural ties documents\n\nCultural ties documents\n- publications written by you\npublications written by you\n- contracts\ncontracts\n- evidence of membership of cultural associations\nevidence of membership of cultural associations\n- newspaper articles about you\nnewspaper articles about you\n- programs listing your artistic or cultural performances.\nprograms listing your artistic or cultural performances.\n\n#### Employment ties documents\n\nEmployment ties documents\n- employment contracts\nemployment contracts\n- a letter of offer from an employer\na letter of offer from an employer\n- recent official documents such as group certificates and payslips\nrecent official documents such as group certificates and payslips\n- employee identification or security pass.\nemployee identification or security pass.\n\n#### Personal ties documents\n\nPersonal ties documents\n\nSubstantial personal ties may be of benefit to Australia if the applicant is, or has been, a participating member of the Australian community and economy, and their ties enrich the lives of individual Australian residents and citizens. This may include regarding Australia as home or having an intention to reside in Australia.\n\nSubstantial personal ties may be of benefit to Australia if the applicant is, or has been, a participating member of the Australian community and economy, and their ties enrich the lives of individual Australian residents and citizens. This may include regarding Australia as home or having an intention to reside in Australia.\n\nExample situation | Example documents\nYou have a history of long-term residence in Australia, spent your formative years in Australia or have spent a significant amount of time in Australia since first being granted a permanent visa. | Utility bills, bank statements, travel record, permanent visa decision, school records\nYou have an Australian citizen partner or, in the case of a minor child, Australian citizen parent, who has previously lived in Australia. | Copies of birth certificates, marriage or citizenship certificates of partners and childrenEvidence of continuing relationship with Australian citizen partner\nYou have one or more Australian citizen minor children living in Australia (including at boarding school) where no legal impediment to access exists. | School reports, proof of residence of family home\nYou are returning to Australia after living overseas with your family unit, including Australian citizen minor children. | Plane tickets, property purchase documents, school enrolments, moving receipts\n\nProving substantial personal ties to Australia\nExample situation\nExample documents\nYou have a history of long-term residence in Australia, spent your formative years in Australia or have spent a significant amount of time in Australia since first being granted a permanent visa.\nUtility bills, bank statements, travel record, permanent visa decision, school records\nYou have an Australian citizen partner or, in the case of a minor child, Australian citizen parent, who has previously lived in Australia.\n\nCopies of birth certificates, marriage or citizenship certificates of partners and children\n\nCopies of birth certificates, marriage or citizenship certificates of partners and children\n\nEvidence of continuing relationship with Australian citizen partner\n\nEvidence of continuing relationship with Australian citizen partner\nYou have one or more Australian citizen minor children living in Australia (including at boarding school) where no legal impediment to access exists.\nSchool reports, proof of residence of family home\nYou are returning to Australia after living overseas with your family unit, including Australian citizen minor children.\nPlane tickets, property purchase documents, school enrolments, moving receipts\n\n#### Compelling reasons for absence\n\nCompelling reasons for absence\n\nIf you are outside Australia when you apply, and\n\nIf you are outside Australia when you apply, and\n- you hold a permanent visa, or last departed Australia as a permanent resident or citizen (but subsequently lost that citizenship) – you must have compelling reasons for any absence(s) from Australia of more than 5 continuous years immediately before the date of your application;\nyou hold a permanent visa, or last departed Australia as a permanent resident or citizen (but subsequently lost that citizenship) – you must have compelling reasons for any absence(s) from Australia of more than 5 continuous years immediately before the date of your application;\n- you were an Australian citizen or permanent resident less than 10 years before you applied for a RRV – you must have compelling reasons for any absence(s) that amount to 5 years in total between the date you departed Australia as a citizen or permanent resident and the date of application.\nyou were an Australian citizen or permanent resident less than 10 years before you applied for a RRV – you must have compelling reasons for any absence(s) that amount to 5 years in total between the date you departed Australia as a citizen or permanent resident and the date of application.\n\nYou are not eligible for an RRV if you are outside Australia when you apply and you were not an Australian citizen or permanent resident in the 10 years immediately before the application unless either of the above applies to you.\n\nYou are not eligible for an RRV if you are outside Australia when you apply and you were not an Australian citizen or permanent resident in the 10 years immediately before the application unless either of the above applies to you.\n\nIf you are in Australia when you apply\n\nIf you are in Australia when you apply\n- you must have compelling reasons for any absence of more than 5 continuous years since the grant of your most recent permanent visa, or since you ceased to be an Australian citizen.\nyou must have compelling reasons for any absence of more than 5 continuous years since the grant of your most recent permanent visa, or since you ceased to be an Australian citizen.\n\nYour reasons should include any elements which you thought were compelling at the time. Although not mandatory, you should indicate how the compelling reasons for your absence link to the entirety of your absence from Australia. This could be done by a statement explaining the circumstances of your absence(s). Attach other documents showing your compelling reasons for absence(s) from Australia to your application, or there may be delays in processing your application. Examples of documents you can attach are (but not limited to):\n\nYour reasons should include any elements which you thought were compelling at the time. Although not mandatory, you should indicate how the compelling reasons for your absence link to the entirety of your absence from Australia. This could be done by a statement explaining the circumstances of your absence(s). Attach other documents showing your compelling reasons for absence(s) from Australia to your application, or there may be delays in processing your application. Examples of documents you can attach are (but not limited to):\n- severe illness or death of an overseas family member,\nsevere illness or death of an overseas family member,\n- work or study commitments by the applicant or the applicant’s partner,\nwork or study commitments by the applicant or the applicant’s partner,\n- the applicant is living overseas in an ongoing relationship with a partner, or has minor children,\nthe applicant is living overseas in an ongoing relationship with a partner, or has minor children,\n- the applicant or the applicant’s accompanying family members have been receiving complex or lengthy medical treatment,\nthe applicant or the applicant’s accompanying family members have been receiving complex or lengthy medical treatment,\n- the applicant has been involved in legal proceedings overseas and the timing was beyond the applicant’s control,\nthe applicant has been involved in legal proceedings overseas and the timing was beyond the applicant’s control,\n- the applicant has been caught up in a natural disaster, political uprising, pandemic, or other similar event preventing them from travel.\nthe applicant has been caught up in a natural disaster, political uprising, pandemic, or other similar event preventing them from travel.\n\nIt will take us longer to process your application if we need to ask you for more documents. We may still, however, make a decision on your application based on any available information without requesting any additional information from you. As such, it is very important that you read all information on the website, and provide a complete application at the time of lodgement.\n\nIt will take us longer to process your application if we need to ask you for more documents. We may still, however, make a decision on your application based on any available information without requesting any additional information from you. As such, it is very important that you read all information on the website, and provide a complete application at the time of lodgement.\n\n#### Documents required because you are a member of the family unit of a person who holds this visa\n\nDocuments required because you are a member of the family unit of a person who holds this visa\n\nFor married couples, provide the marriage certificate.\n\nFor married couples, provide the marriage certificate.\n\nFor de facto relationships, provide either:\n\nFor de facto relationships, provide either:\n- evidence that your relationship is registered by an Australian State or Territory,\nevidence that your relationship is registered by an Australian State or Territory,\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply.\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply.\n\nFor both married and de facto applicants, you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n\nFor both married and de facto applicants, you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n- joint bank account statements,\njoint bank account statements,\n- billing accounts in joint names,\nbilling accounts in joint names,\n- joint leases or mortgages,\njoint leases or mortgages,\n- documents that show your partner has lived at the same address as you.\ndocuments that show your partner has lived at the same address as you.\n\nFor children under 18 years old, provide:\n\nFor children under 18 years old, provide:\n- copies of birth certificates or the family book showing the names of both parents,\ncopies of birth certificates or the family book showing the names of both parents,\n- copies of the adoption paper, if applicable.\ncopies of the adoption paper, if applicable.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe will tell you if and when you need to get apolice certificate.\n\nWe will tell you if and when you need to get a\npolice certificate\n.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original copies and translated documents in your application.\n\nProvide original copies and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited but on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited but on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nApply for this visa online inImmiAccount. You can use ImmiAccount even if you don’t already have an electronic visa record with us. If you cannot apply online due to a technical issue, you can access technical support in ImmiAccount. If technical support does not resolve the issue, we will consider allowing you to submit a paper application. Applying on paper will incur an additional non-internet application charge even with our authorisation.\n\nApply for this visa online in\nImmiAccount\n. You can use ImmiAccount even if you don’t already have an electronic visa record with us. If you cannot apply online due to a technical issue, you can access technical support in ImmiAccount. If technical support does not resolve the issue, we will consider allowing you to submit a paper application. Applying on paper will incur an additional non-internet application charge even with our authorisation.\nShow\n                    steps\n\n#### Apply online\n\nApply online\n1. Create an account or log in toImmiAccount\nCreate an account or log in to\nImmiAccount\n2. Attach documents\nAttach documents\n3. Have family applications processed together\nHave family applications processed together\n4. Pay the application fee\nPay the application fee\n\nWe will not process your application until you pay the charge.\n\nWe will not process your application until you pay the charge.\n\nEach family member must have their application charge paid and all relevant documents attached to their application.\n\nEach family member must have their application charge paid and all relevant documents attached to their application.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nSee what you can and must do after you apply.\n\nSee what you can and must do after you apply.\nShow\n                    steps\n\n#### What will happen after you apply\n\nWhat will happen after you apply\n\nWe will let you know when we have received your application and documents.\n\nWe will let you know when we have received your application and documents.\n\nYou can track and manage your application usingImmiAccount.\n\nYou can track and manage your application using\nImmiAccount\n.\n\n#### Status updates\n\nStatus updates\n\nWe can’t give updates on applications within the standard processing time.\n\nWe can’t give updates on applications within the standard processing time.\n\nYou can check if we need more information from you inImmiAccount. Wait for us to contact you if you applied on paper.\n\nYou can check if we need more information from you in\nImmiAccount\n. Wait for us to contact you if you applied on paper.\nSee how\n\n#### Travel after you apply\n\nTravel after you apply\n\nBefore you leave Australia, make sure you have a valid visa that allows you to return to Australia as a permanent resident.\n\nBefore you leave Australia, make sure you have a valid visa that allows you to return to Australia as a permanent resident.\n\nIf you areoutside Australiawhen you apply for the visa, and apply on paper, you must be outside Australia when we grant you the visa.\n\nIf you are\noutside Australia\nwhen you apply for the visa, and apply on paper, you must be outside Australia when we grant you the visa.\n\nIf you arein Australiawhen you apply for the visa, you can be in or outside Australia when we grant you the visa.\n\nIf you are\nin Australia\nwhen you apply for the visa, you can be in or outside Australia when we grant you the visa.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Attach more information\n\nAttach more information\n\nIf you didn't attach all documents when you applied, attach them as soon as possible in ImmiAccount.\n\nIf you didn't attach all documents when you applied, attach them as soon as possible in ImmiAccount.\n\nIf you have a pending paper application, you may still be able to attach your documents in ImmiAccount. This can occur after the application has been imported into ImmiAccount. See Applying online or paper > Start and Manage an application >Import an application.\n\nIf you have a pending paper application, you may still be able to attach your documents in ImmiAccount. This can occur after the application has been imported into ImmiAccount. See Applying online or paper > Start and Manage an application >\nImport an application\n.\n\nYour application may take longer to finalise if we have to ask you to provide more information.\n\nYour application may take longer to finalise if we have to ask you to provide more information.\nSee how\n\n#### Mistakes on your application before we decide on your application\n\nMistakes on your application before we decide on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)and attach it in ImmiAccount, if you applied online or you have imported your application into ImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\nand attach it in ImmiAccount, if you applied online or you have imported your application into ImmiAccount.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nAttach the forms in ImmiAccount.\n\nAttach the forms in ImmiAccount.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you are in Australia, make sure you stay lawful by holding a valid visa while we process your application.\n\nIf you held a substantive visa when you applied for this visa, you may be eligible to apply for an associatedBridging visa A (BVA). If you are granted a BVA and your current visa expires before we decide this application, the BVA will come into effect. You can stay lawfully in Australia on the BVA while we process your application.\n\nIf you held a substantive visa when you applied for this visa, you may be eligible to apply for an associated\nBridging visa A (BVA)\n. If you are granted a BVA and your current visa expires before we decide this application, the BVA will come into effect. You can stay lawfully in Australia on the BVA while we process your application.\n\nIf your substantive visa is cancelled or ceases and you do not hold a bridging visa, you will:\n\nIf your substantive visa is cancelled or ceases and you do not hold a bridging visa, you will:\n- be in Australia unlawfully\nbe in Australia unlawfully\n- not be eligible for a Bridging visa A\nnot be eligible for a Bridging visa A\n- not be eligible for a Bridging visa B - which allows you to leave and re-enter Australia until this visa application is finalised\nnot be eligible for a Bridging visa B - which allows you to leave and re-enter Australia until this visa application is finalised\n- not be eligible for a Bridging visa C.\nnot be eligible for a Bridging visa C.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how to tell us if yoursituation changes.\n\nSee how to tell us if your\nsituation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia when we make a decision.\n\nYou can be in or outside Australia when we make a decision.\n\nWe will let you know about your visa application in writing. We will tell you:\n\nWe will let you know about your visa application in writing. We will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of the decision with you when in Australia.\n\nKeep a copy of the decision with you when in Australia.\n\nWe will notify you in writing if we refuse your visa and explain why we have refused it and whether you have a right to a review of the decision.\n\nWe will notify you in writing if we refuse your visa and explain why we have refused it and whether you have a right to a review of the decision.\n\nThe visa application charge (VAC) will not be refunded to you just because we refused your visa application.\n\nThe visa application charge (VAC) will not be refunded to you just because we refused your visa application.\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia,\na valid visa to enter Australia,\n- a valid passport or other travel document.\na valid passport or other travel document.\n\n### At the border\n\nAt the border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n#### New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them that you have a permanent visa and that you do not want a temporarySpecial Category visa (subclass 444). If you do not tell them, you might be granted the subclass 444 visa which might affect your eligibility for an RRV and Australian citizenship in the future.\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them that you have a permanent visa and that you do not want a temporary\nSpecial Category visa (subclass 444)\n. If you do not tell them, you might be granted the subclass 444 visa which might affect your eligibility for an RRV and Australian citizenship in the future.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- stay in Australia,\nstay in Australia,\n- work and study in Australia,\nwork and study in Australia,\n- enrol in Australia's public health care scheme,Medicare,\nenrol in Australia's public health care scheme,\nMedicare\n,\n- sponsor your relatives to come to Australia,\nsponsor your relatives to come to Australia,\n- travel to and from Australia while your visa is valid,\ntravel to and from Australia while your visa is valid,\n- apply for Australian citizenship, if eligible.\napply for Australian citizenship, if eligible.\n\nTo see your specific conditions and work entitlements, useVEVO.\n\nTo see your specific conditions and work entitlements, use\nVEVO\n.\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou must obey all Australian laws.\n\nYou must obey all Australian laws.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, name, residential or postal address while your application is being processed\nchanges to your phone number, email, name, residential or postal address while your application is being processed\n- if you want to withdraw your application\nif you want to withdraw your application\n- if you are issued with a new passport (we will then link your RRV to your new passport)\nif you are issued with a new passport (we will then link your RRV to your new passport)\n\nTell us if there is achange in your situation.\n\nTell us if there is a\nchange in your situation\n.\n\n### Travelling on this visa\n\nTravelling on this visa\n\nFrom the date we grant your visa, you can travel for a specified period of time. This depends on the reason we granted you the RRV. For information on the travel validity, seeHow long this visa lasts.\n\nFrom the date we grant your visa, you can travel for a specified period of time. This depends on the reason we granted you the RRV. For information on the travel validity, see\nHow long this visa lasts\n.\n\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship and travel on an Australian passport.\n\nAfter that period, you will need another RRV visa to re-enter Australia as a permanent resident. Alternatively, you may wish to consider your eligibility for Australian Citizenship and travel on an Australian passport.\n\nTo see when your travel facility ends, useVEVO.\n\nTo see when your travel facility ends, use\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nYou are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nYou are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\n### Bringing a family member\n\nBringing a family member\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family members to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, your permanent residency starts either:\n\nFor citizenship purposes, your permanent residency starts either:\n- on the day we grant the visa, if you were in Australia\non the day we grant the visa, if you were in Australia\n- on the day you entered Australia on this visa, if you were outside Australia when we granted it\non the day you entered Australia on this visa, if you were outside Australia when we granted it\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your visa is still valid\n\nEnsure your visa is still valid\n\nCheck your conditions and the expiry of your RRV inVEVO.\n\nCheck your conditions and the expiry of your RRV in\nVEVO\n.\n\nSee what to do if yourvisa has expired or is about to expire.\n\nSee what to do if your\nvisa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:21:08.203428",
  "metadata": {}
}