{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#Overview",
  "title": "Resolution of Status",
  "raw_text": "===== main placeholder ========================================== Subclass 851 Resolution of Status This visa allows for the permanent resolution of status for certain visa holders, including TPV and SHEV holders who arrived in Australia before 14 February 2023. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Free visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the RoS visa fact sheet .​​ The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam. T​o apply for a RoS, you must apply before your TPV or SHEV expires. If your visa expires, you will become unlawful and may lose access to government services.​ Stay Permanently Cost Nil Processing times Processing times for this visa are unavailable. With this visa, you can... live, work and study in Australia permanently access benefits from Services Australia and Medicare access short-term counselling for torture and trauma if required sponsor eligible family members for permanent residence through the family visa stream travel to and from Australia for 5 years if eligible, become an Australian citizen if eligible, attend English language classes for free See all conditions Check your eligibility You must be in Australia at time of application lodgement be in Australia at time of visa grant meet the visa requirements including health, character and security Note: Persons with any concerns regarding their eligibility to apply for a RoS visa can contact specialist community legal service providers (listed in the Factsheet ). They can also contact the Department’s Status Resolution Service for assistance. Apply About this visa Free visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the RoS visa fact sheet .​​ The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam. T​o apply for a RoS, you must apply before your TPV or SHEV expires. If your visa expires, you will become unlawful and may lose access to government services.​ Overview With this visa, you can: Requirements Converted TPV or SHEV applications Current TPV and SHEV holders (with no application before the Department) Extending your TPV or SHEV If you are currently unlawful How long can you stay Including family members Cost Apply from Processing times Your obligations Travel Fact sheet Visa label Overview The Australian Government has fulfilled its election commitment to make Temporary Protection visa (TPV) and Safe Haven Enterprise visa (SHEV) holders eligible to apply for a permanent Resolution of Status (RoS) visa. Providing permanent residence to TPV and SHEV holders empowers them to move forward with their lives. Permanent residency will enable TPV/SHEV holders to: gain secure employment grow businesses study more easily sponsor eligible family members to Australia eventually become an Australian citizen. Anyone who has submitted a TPV or SHEV application before 14 February 2023 that has not been finally determined, has had the existing application automatically converted to a RoS visa application. This includes subsequent TPV or SHEV applications. Current TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa online via ImmiAccount. They must apply before their current TPV or SHEV ceases to remain lawful. We are committed to supporting the transition to a Resolution of Status visa for those who held or have applied for a TPV or SHEV before 14 February 2023. The Department continues to actively process all RoS visa applications. If you have any concerns about your eligibility to apply for a RoS visa, you can contact specialist community legal service providers (listed in the Factsheet below). If you need assistance, you can also contact the Department’s Status Resolution Service for assistance. With this visa, you can: live, work and study in Australia permanently access government services such as Medicare and Centrelink services access short-term counselling for torture and trauma sponsor eligible family members for permanent residence through the family visa stream of the Migration Program travel to and from Australia for 5 years if eligible, become an Australian citizen if eligible, attend English language classes for free Requirements All applicants need to meet health, character and security requirements. Any applicants aged 18 or over must sign the Australian Values Statement. You may be asked to provide additional identity information, or to clarify information in relation to your identity. In some cases this may require an interview. The Department will contact you if additional information is required. Converted TPV or SHEV applications If you applied for an initial TPV or SHEV before 14 February 2023 you do not need to apply for a RoS visa. If we find that you meet the criteria for the TPV or SHEV, the Department will convert your application to an application for a RoS visa. The Department will notify you if you have been granted a RoS visa. You do not need to apply for a RoS visa if you hold a TPV or SHEV and have applied for a subsequent TPV or SHEV before 14 February 2023. The Department has converted your application to an application for a RoS visa. The Department will notify you if we have granted you a RoS visa. Current TPV and SHEV holders (with no application before the Department) Current TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa. You must apply before your current TPV or SHEV ceases to remain lawful. You must apply for a RoS visa online via ImmiAccount Online applications for a RoS visa include the notification of an application bar lift (as unauthorised maritime arrivals are otherwise subject to the application bar in section 46A of the Migration Act 1958 ). For assistance with ImmiAccount technical issues see Technical help . If you are still unable to lodge your application you can contact our Global Service Centre, or the legal service provider in your state or territory for free assistance. For a list of providers see the RoS visa factsheet (200KB PDF) There are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues). Extending your TPV or SHEV We will extend the TPV/SHEV of current TPV or SHEV holders who make a valid application for a RoS visa until we have made a decision on the RoS visa. To ensure that your TPV or SHEV is extended and that you remain lawful, you must apply for a RoS visa before your TPV or SHEV ceases. If you are currently unlawful If you are currently an unlawful non-citizen because your TPV or SHEV expired before 14 February 2023, note that an application for a RoS visa is also an application for a bridging visa. For current TPV or SHEV holders, you must apply for a RoS visa before your TPV or SHEV ceases. How long can you stay This is a permanent visa. It lets you stay in Australia indefinitely. You become an Australian permanent resident on the day we grant your visa. For Australian citizenship purposes, your permanent residence starts on the day we grant your visa. Including family members Family members may apply together on the same application form. Each applicant must meet the requirements in their own right for the grant of the visa. Newborn child If a child is born after you submit your application and before we make a decision on your application, we will include the child in that application. You must tell us as soon as possible by completing Form 1022 Notification of change of circumstances (172KB PDF) . You must also provide a clear colour copy of the child's original birth certificate, and attach both of these documents in ImmiAccount or send them via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter. If a child is born in Australia, they are automatically granted the same visa their parents hold at the time of the child’s birth. If either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child will be an Australian citizen by birth. In such cases an Australian citizenship certificate should be obtained and attached in ImmiAccount. For more details see: Get a citizenship certificate Cost There is no cost. Apply from You must be in Australia when you apply for the visa. Processing times The Department continues to actively process all RoS visa applications. Some cases are more complex than others and the department may need to request additional information from applicants, including in relation to identity. It is important that applicants cooperate with this process to allow applications to be processed as quickly as possible. Information regarding the processing of the RoS visa caseload is available in the Unauthorised Maritime Arrival legacy caseload reports available at Humanitarian program statistics Your obligations You and your family members must obey all Australian laws. Travel There are no travel restrictions on the Resolution of Status visa. You can travel to and from Australia for 5 years from the date we grant the visa. To re-enter Australia after 5 years you will need a Resident Return visa (RRV) If you want to travel outside Australia after we grant the visa and you do not have a current passport, you should first contact any Australian Passport Office of the Department of Foreign Affairs and Trade to apply for a travel document. Fact sheet A fact sheet with useful information about the Resolution of Status visa process is available below in the following languages: Arabic (560KB PDF) Burmese (357KB PDF) Dari (554KB PDF) English (200KB PDF) Farsi (207KB PDF) Pashto (546KB PDF) Rohingya (122KB PDF) Tamil (344KB PDF) Visa label We will digitally link your visa to your travel document or ImmiCard . You will not get a label in your travel document. Irregular travel to Australia The Government remains committed to Operation Sovereign Borders. Australia’s border protection policies have not and will not change. Any person who attempts to travel to Australia irregularly will not settle permanently here. Anyone who attempts to travel to Australia by voyage without a valid visa will be turned back to their point of departure, returned to their home country or transferred to another country. Australia's tough border protection policies are designed to protect Australia's borders, combat people smuggling and deter people from attempting dangerous boat voyages across the open ocean. The Government’s policy on transitory persons remains unchanged. Transitory persons will not settle in Australia. We encourage them to engage in third country migration options including: Resettlement in the United States or New Zealand or private sponsorship in Canada Assisted Voluntary Return (AVR) home or to another country in which they have right of entry. Eligibility Free visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the RoS visa fact sheet .​​ The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam. T​o apply for a RoS, you must apply before your TPV or SHEV expires. If your visa expires, you will become unlawful and may lose access to government services.​ Meet the visa requirements Details To make a valid application for a Resolution of Status visa, you must be a holder (or former holder, and your visa was not cancelled) of one of the below visas: Temporary Protection visa (subclass 785) – and you first arrived in Australia before 14 February 2023 Safe Haven Enterprise visa (subclass 790) – and you first arrived in Australia before 14 February 2023 From 14 February 2023, TPV and SHEV holders who held their TPV or SHEV before this date are eligible to apply for a RoS visa. You can apply online via ImmiAccount People who have submitted a TPV or SHEV application prior to 14 February 2023 that has not been finally determined, will have their existing application automatically converted to a RoS visa application. This includes any subsequent TPV or SHEV application. If you currently hold a bridging visa and you made a valid application for a TPV or SHEV before 14 February 2023, the Department will convert your TPV or SHEV application to a Resolution of Status visa application. You must satisfy the requirements for the grant of a TPV or SHEV. Not be barred from lodging a Resolution of Status (RoS) visa application Details You cannot make a valid RoS visa application while you are subject to an application bar. This includes the section 46A bar for Unauthorised Maritime Arrivals. The online application form for a RoS visa includes the notification of a section 46A application bar lift. You must make your application online via ImmiAccount , unless the Department has authorised you to lodge a paper application form and notified you in writing of an application bar lift. There are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues). If you are experiencing difficulties lodging online, you should refer to the Technical help . You may also contact the legal service provider in your state or territory for free assistance. For a list of providers see the RoS visa factsheet (200KB PDF) Not previously had your most recent TPV or SHEV refused or cancelled Details If we cancelled your most recent TPV or SHEV, or your TPV or SHEV application was refused and finally determined, you cannot make a valid application for a Resolution of Status visa. We expect that people found not to engage protection obligations and, whose application has been finally determined by any merits and judicial review processes, will depart Australia. We may provide these people assistance to depart. If you have new, credible protection claims relating to changes in your country of origin or personal circumstances, you may request Ministerial Intervention The Minister will not consider protection claims that have already been considered in a Protection visa application or by the Tribunal. Requests will only be considered where a person is making genuine and compelling claims that require consideration when these claims could not be raised in their initial protection visa application. If the Minister does not intervene in your case, the Minister expects you to leave Australia when your current visa expires. Meet our identity requirements Details You may be asked to provide documents as evidence of your identity, nationality or citizenship to support your application. We may also ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before. If you are invited to provide identity information and you do not provide this within the timeframe provided, you will be provided with an opportunity to explain why you could not provide the information, and the steps that you took to obtain the information. If you do not make a genuine attempt to establish your identity, the department may consider refusing your application. If the department requests identity information from you and, following your response, has substantial concerns with a previous finding in relation to your identity, we will assess whether you meet at least one of the following criteria before granting your visa: You would satisfy the criteria for the grant of a protection visa (including engaging Australia’s protection obligations). There is a compelling or compassionate reason for you to be granted a RoS visa (this could include, for example, family circumstances, health needs or a positive contribution to Australian society). You are a member of the same family unit as a person who holds a RoS visa. Meet our security requirements Details As part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a Resolution of Status visa. Meet our health requirements Details You may need to undergo health examinations . This will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV. These examinations will be conducted by Bupa Medical Visa Services after you have lodged your visa application if required, we will give you a health identifier (HAP ID) and information about how to arrange your health examinations Meet our character requirements Details You must meet certain character requirements Sign the Australian values statement Details If you are 18 years of age or older, you must have read, or had explained to you, the booklet, Life in Australia You must also confirm you will respect the Australian way of life and obey Australian laws when you sign or accept the Australian Values Statement Meet all these criteria? Check how to apply in our step by step guide. Step by step Free visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the RoS visa fact sheet .​​ The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam. T​o apply for a RoS, you must apply before your TPV or SHEV expires. If your visa expires, you will become unlawful and may lose access to government services.​ Step 1 Before you apply Check that you are eligible and check when your current TPV or SHEV ceases. You can prepare and submit your application yourself or, if you need help, you can get someone to act on your behalf. You should start this process well before your TPV or SHEV ceases. If you do not apply before your current visa ceases you will become unlawful and may lose access to Government services. For more information see Eligibility Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be one of the following: Registered migration agent Legal practitioner Exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. For more information see Receiving Documents You can get free legal assistance to apply for a RoS visa. While not mandatory, we encourage TPV/SHEV holders who are applying for a RoS visa to contact the specialist legal service provider in their state for free support. State / Territory Service Provider Website Australian Capital Territory (ACT) Legal Aid ACT www.legalaidact.org.au New South Wales (NSW) Refugee Advice and Casework Service (RACS) Immigration Advice and Rights Centre (IARC) on referral from RACS NSW www.racs.org.au www.iarc.org.au Northern Territory (NT) Northern Territory Legal Aid Commission www.legalaid.nt.gov.au Queensland (QLD) Refugee and Immigration Legal Service (RAILS) www.rails.org.au South Australia (SA) Legal Services Commission of SA www.lsc.sa.gov.au Tasmania (TAS) Tasmanian Refugee Legal Service www.trls.org.au Victoria (VIC) Refugee Legal www.refugeelegal.org.au Western Australia (WA) Circle Green Community Legal www.circlegreen.org.au There is no visa application charge for the RoS visa. If you are using the services of a migration agent, ensure they are registered with the Office of Migration Agents Regulatory Authority (OMARA) . Only registered migration agents and legal practitioners can charge for immigration assistance. Note: The Department of Home Affairs does not charge a fee to fast-track a visa. If you get offered this service, it is a scam. See how Step 2 Gather your documents You need to provide documents to support your application for this visa. In many cases, we can make a decision using the information you provide when you lodge your application. In some cases, we may request additional information (for example, in relation to your identity). Show steps Provide accurate information It is in your interest to provide as much information as possible in your application and that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application. See how Identity documents Where the department has invited you to provide further information concerning your identity you must provide original and translated documents of your identity, nationality and citizenship Such as: all pages of your current or expired passports (including biodata page) your birth certificate your national identity card your driver's licence proof of change of name, if applicable any other documents that support your identity, nationality or citizenship. Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by. These documents are to be attached in ImmiAccount. If you cannot provide these documents, you will be provided with the opportunity to explain why and demonstrate the reasonable steps you have taken to obtain the requested information. If you do not provide this information, or you provide a bogus document or false or misleading information in relation to your identity your application may be refused. See how Access documents I previously provided to the Department It is not necessary for you to provide us with the claims, information or documents you already provided as part of your previous TPV or SHEV application. Therefore, you do not need to ask for copies of these documents from us. If you still want to access your documents held by us, you can request them under the Privacy Act 1988 See how Character documents If requested by the Department, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age. You do not need to do this if you have provided this information with your TPV or SHEV application. Do not arrange for police certificates until we ask you to. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or forms. To upload documents see ImmiAccount See how Prepare your documents See how Translate Have all non-English documents translated into English. You do not need to have any documents certified. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters For online applications See how Scan or photograph Scan or photograph all relevant identity documents including any passports (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. Ensure that you save photos under the name of the person in the photo. Clearly label all other files in English. Learn more about accepted document size and formats See how Attach Attach: identity documents not previously provided to the Department or when requested by the Department) each document only once (even if you are using it to show more than one thing) Learn more about attaching documents See how Keep Keep a copy of your completed application. See how Step 3 Apply for the visa Show steps Completing your application If your migration agent completes your application form, you must read and understand all the information included in the form before signing it. This also includes signing any statutory declaration you make. The form asks for basic information about you and any other applicant on the form (including name, address, date of birth and contact details). It also asks some questions in relation to character and travel history. It is important that you complete the form in full, including completing the Australian Values Statement and declaration. See how Apply online in ImmiAccount RoS visa applications should be lodged online through ImmiAccount . There are a number of benefits to lodging online. You can: check the status of your application continue a saved application attach documents to an application update personal details access a copy of your application at any time. To apply online, follow these steps: Log in or create an ImmiAccount Attach documents (if required) Note the Transaction reference number The online form will guide you to answer the questions we need from you. It has helpful information included if you need support. When you finish your online application, you will come to a page that will prompt you to attach documents. You can save your application at any page and go back to it when you are ready. Once you have submitted your application online, you can check the status of your application through ImmiAccount. If you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount at technical help If you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see the RoS visa factsheet (200KB PDF) . You can also contact our Global Service Centre on 131 881. See how Apply on paper If you can't submit your application for a Resolution of Status visa online due to a verified system issue with ImmiAccount, the Department may authorise you to submit a paper application. If you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount at technical help If you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see the RoS visa factsheet (200KB PDF) . You can also contact our Global Service Centre on 131 881. Note: If you have already been provided with a paper application form and notification of an application bar lift, you can still apply for a RoS visa online via ImmiAccount See how Communicating by email The online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post. If you have already applied and you want us to communicate with you by email but you did not select this option in your application, complete Form 1193 Communicating by email with the Department (127KB PDF) See how Step 4 After you apply We will tell you when we have received your application by sending you an acknowledgement letter. Show steps Status updates We can’t give updates on the processing status of an application. You can check if we need more information from you in ImmiAccount You must wait for us to contact you if you applied on a paper application form. See how Health examinations We may require you to undergo health examinations . These will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV. See how Get support If you have submitted a valid application, you might be able to get financial or other assistance from the Status Resolution Support Services (SRSS) program See how Enrol in Medicare service centre To access public healthcare, enrol in Medicare. Take your 'Acknowledgement' letter and supporting documents to a Medicare service centre Provide more information You can provide more information to us, in writing, at any time until we make a decision on your application. If you did not provide all relevant documents when you applied, attach them as soon as possible in ImmiAccount . You may also provide them via email using the address provided in your visa application acknowledgement letter. We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. We will give you the chance to comment if we receive information from another person that could result in, or be part of, a decision to refuse your visa. See how Add family members to your application See how Newborn child If you have a baby after you submit your application and before we make a decision on your application, we can include that child in the application. For this to occur you must tell us as soon as possible by: completing Form 1022 Notification of change of circumstances (172KB PDF) providing a clear colour copy of child's original birth certificate and attaching these documents in ImmiAccount or send via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter. If your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth. If either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child might be an Australian citizen by birth. See the requirements for evidence of Australian citizenship See how Mistakes on your application Tell us as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) See how Help with your application Tell us if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) If you applied online upload your written notification or your forms to ImmiAccount . You can also send it to the office where you submitted your application. See how Tell us if things change Things you need to tell us about after you have applied include: changes to your name, phone number, email, address or passport changes to your marital or de facto status you are pregnant or you become pregnant the birth of a child a death in your family (if the family member is an applicant for a RoS visa) if you want to withdraw your application See how to tell us if your situation changes See how Travel for TPV SHEV visa holders TPV SHEV visa holders who have made a valid application for another TPV, SHEV or RoS (including a converted RoS) will remain holding their current visa indefinitely until a final decision is made on the subsequent application. TPV SHEV visa holders can continue travelling overseas, for more information refer to Requesting Permission to Travel A RoS applicant must be in Australia for the grant of the visa. If you are overseas when your RoS visa is ready to be granted you will be contacted and asked to return to Australia within 28 days. If you do not return your RoS visa application may be refused. See how Step 5 Visa outcome We will tell you our decision in writing. Show steps If we grant your visa If we grant your visa, we will send you a visa grant notification letter. Your letter will tell you: your visa grant number when we granted your visa information about a range of topics including: ImmiCards living in Australia translating and Interpreting Service (TIS) client service information torture and trauma counselling services other government services. You should keep a copy of this letter in a safe place for your reference. See how If we refuse your visa application If we refuse your visa application, we will send you a letter to tell you: why we refused your visa application your review rights and your review rights with the Administrative Review Tribunal (ART) the time limit for lodging an application for review. See how When you have this visa Free visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the RoS visa fact sheet .​​ The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam. T​o apply for a RoS, you must apply before your TPV or SHEV expires. If your visa expires, you will become unlawful and may lose access to government services.​ What you can do when you have this visa What you must do on this visa Tell us if things change Proving you have a visa Visa details Work and study Bringing family Becoming an Australian citizen Get support Leaving Australia What you can do when you have this visa live, work and study in Australia permanently access government services such as Medicare and Centrelink services access short-term counselling for torture and trauma if required sponsor eligible family members for permanent residence through the family visa stream of the Migration Program travel to and from Australia for 5 years if eligible become an Australian citizen attend English language classes for free if you are eligible What you must do on this visa You and your family members must obey all Australian laws. Tell us if things change Things you need to let us know about when you have this visa: changes to your name, phone number, email, address or passport changes to your marital or de facto status the birth of a child a death in your family (if the family member is an applicant for a RoS visa) See what to do if your situation changes Proving you have a visa ImmiCard You and your eligible family members can obtain an ImmiCard An ImmiCard is an official, secure immigration credential. It contains a photograph and personal details such as: family name given names date of birth gender. ImmiCards also have a unique number linked to biometric and visa details in our system. Visa details To prove you have a visa and to show your visa conditions to someone, use VEVO Work and study With this visa, you can work and study. You are protected by Australian workplace law. For more information on your workplace rights and entitlements see Visa holders and migrant workers Bringing family As an Australian permanent resident, you may be able to sponsor eligible family to come to Australia through the family visa stream of the Migration Program. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you may be eligible for Australian citizenship. Find out more about becoming an Australian citizen . For citizenship purposes, your permanent residency starts on the day we grant your visa. Get support Australian government services You may be able to access a range of services offered by the Australian Government such as: benefits from Services Australia job matching Medicare National Disability Insurance Scheme short-term counselling for torture or trauma where required. Services Australia delivers a range of social and health-related payments and services. For more information about the range of available services and your eligibility to access them go to Services Australia Australian Taxation Office To receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to the Australian Taxation Office Information pack on domestic and family violence, sexual assault and forced marriage The Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage. The family safety pack also includes important information about essential services and emergency contacts in Australia. Leaving Australia You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia as a permanent resident. Before you leave Check your travel documents Check the travel component of your visa is still valid in VEVO Contact any Australian Passport Office of the Department of Foreign Affairs and Trade to apply for an Australian travel document Travel facility and Resident Return visa When you hold a permanent Resolution of Status visa, you can travel to and from Australia for 5 years from the date we grant the visa. This means you can leave and re-enter Australia as many times as you like in the 5 years from the date we granted the visa, as long as your visa is in effect. After 5 years your travel facility expires. You will need to apply for and be granted a Resident Return (RRV) visa (subclass 155) or (subclass 157) to re-enter Australia as a permanent resident. If you leave Australia after the travel facility of your Resolution of Status visa has expired, or if it expires when you are overseas, you will need to apply for, and be granted, an RRV before you can return to Australia as a permanent resident. For more information on the travel facility on your permanent visa and advice on when to apply for a Resident Return visa, see Overseas travel as a permanent resident",
  "main_content": "===== main placeholder ==========================================\nSubclass 851\n\n# Resolution of Status\n\nResolution of Status\n\nThis visa allows for the permanent resolution of status for certain visa holders, including TPV and SHEV holders who arrived in Australia before 14 February 2023.\n\nThis visa allows for the permanent resolution of status for certain visa holders, including TPV and SHEV holders who arrived in Australia before 14 February 2023.\n\nThis visa allows for the permanent resolution of status for certain visa holders, including TPV and SHEV holders who arrived in Australia before 14 February 2023.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.T​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the\nRoS visa fact sheet\n.​​\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nNil\n\nNil\n\nNil\n\n#### Processing times\n\nProcessing times\n\nProcessing times for this visa are unavailable.\n\nProcessing times for this visa are unavailable.\n\n#### With this visa, you can...\n\nWith this visa, you can...\n- live, work and study in Australia permanently\nlive, work and study in Australia permanently\n- access benefits fromServices AustraliaandMedicare\naccess benefits from\nServices Australia\nand\nMedicare\n- accessshort-term counselling for torture and traumaif required\naccess\nshort-term counselling for torture and trauma\nif required\n- sponsor eligible family members for permanent residence through the family visa stream\nsponsor eligible family members for permanent residence through the family visa stream\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible,become an Australian citizen\nif eligible,\nbecome an Australian citizen\n- if eligible, attendEnglish language classes for free.\nif eligible, attend\nEnglish language classes for free\n.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be in Australia at time of application lodgement\nbe in Australia at time of application lodgement\n- be in Australia at time of visa grant\nbe in Australia at time of visa grant\n- meet the visa requirements including health, character and security\nmeet the visa requirements including health, character and security\n\nNote: Persons with any concerns regarding their eligibility to apply for a RoS visa can contact specialist community legal service providers (listed in theFactsheet). They can also contact the Department’sStatus Resolution Servicefor assistance.\n\nNote: Persons with any concerns regarding their eligibility to apply for a RoS visa can contact specialist community legal service providers (listed in the\nFactsheet\n). They can also contact the Department’s\nStatus Resolution Service\nfor assistance.\n\nApply\n\nApply\nAbout this visa\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.T​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the\nRoS visa fact sheet\n.​​\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\nOverview\nWith this visa, you can:\nRequirements\nConverted TPV or SHEV applications\nCurrent TPV and SHEV holders (with no application before the Department)\nExtending your TPV or SHEV\nIf you are currently unlawful\nHow long can you stay\nIncluding family members\nCost\nApply from\nProcessing times\nYour obligations\nTravel\nFact sheet\nVisa label\n\n## Overview\n\nOverview\n\nThe Australian Government has fulfilled its election commitment to make Temporary Protection visa (TPV) and Safe Haven Enterprise visa (SHEV) holders eligible to apply for a permanent Resolution of Status (RoS) visa.\n\nThe Australian Government has fulfilled its election commitment to make Temporary Protection visa (TPV) and Safe Haven Enterprise visa (SHEV) holders eligible to apply for a permanent Resolution of Status (RoS) visa.\n\nProviding permanent residence to TPV and SHEV holders empowers them to move forward with their lives. Permanent residency will enable TPV/SHEV holders to:\n\nProviding permanent residence to TPV and SHEV holders empowers them to move forward with their lives. Permanent residency will enable TPV/SHEV holders to:\n- gain secure employment\ngain secure employment\n- grow businesses\ngrow businesses\n- study more easily\nstudy more easily\n- sponsor eligible family members to Australia\nsponsor eligible family members to Australia\n- eventually become an Australian citizen.\neventually become an Australian citizen.\n\nAnyone who has submitted a TPV or SHEV application before 14 February 2023 that has not been finally determined, has had the existing application automatically converted to a RoS visa application. This includes subsequent TPV or SHEV applications.\n\nAnyone who has submitted a TPV or SHEV application before 14 February 2023 that has not been finally determined, has had the existing application automatically converted to a RoS visa application. This includes subsequent TPV or SHEV applications.\n\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa online via ImmiAccount. They must apply before their current TPV or SHEV ceases to remain lawful.\n\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa online via ImmiAccount. They must apply before their current TPV or SHEV ceases to remain lawful.\n\nWe are committed to supporting the transition to a Resolution of Status visa for those who held or have applied for a TPV or SHEV before 14 February 2023. The Department continues to actively process all RoS visa applications.\n\nWe are committed to supporting the transition to a Resolution of Status visa for those who held or have applied for a TPV or SHEV before 14 February 2023. The Department continues to actively process all RoS visa applications.\n\nIf you have any concerns about your eligibility to apply for a RoS visa, you can contact specialist community legal service providers (listed in the Factsheet below). If you need assistance, you can also contact the Department’sStatus Resolution Servicefor assistance.\n\nIf you have any concerns about your eligibility to apply for a RoS visa, you can contact specialist community legal service providers (listed in the Factsheet below). If you need assistance, you can also contact the Department’s\nStatus Resolution Service\nfor assistance.\n\n## With this visa, you can:\n\nWith this visa, you can:\n- live, work and study in Australia permanently\nlive, work and study in Australia permanently\n- access government services such asMedicareandCentrelinkservices\naccess government services such as\nMedicare\nand\nCentrelink\nservices\n- accessshort-term counselling for torture and trauma\naccess\nshort-term counselling for torture and trauma\n- sponsor eligible family members for permanent residence through the family visa stream of the Migration Program\nsponsor eligible family members for permanent residence through the family visa stream of the Migration Program\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible,become an Australian citizen\nif eligible,\nbecome an Australian citizen\n- if eligible, attendEnglish language classes for free.\nif eligible, attend\nEnglish language classes for free\n.\n\n## Requirements\n\nRequirements\n\nAll applicants need to meet health, character and security requirements. Any applicants aged 18 or over must sign the Australian Values Statement.\n\nAll applicants need to meet health, character and security requirements. Any applicants aged 18 or over must sign the Australian Values Statement.\n\nYou may be asked to provide additional identity information, or to clarify information in relation to your identity. In some cases this may require an interview. The Department will contact you if additional information is required.\n\nYou may be asked to provide additional identity information, or to clarify information in relation to your identity. In some cases this may require an interview. The Department will contact you if additional information is required.\n\n## Converted TPV or SHEV applications\n\nConverted TPV or SHEV applications\n\nIf you applied for an initial TPV or SHEV before 14 February 2023 you donotneed to apply for a RoS visa. If we find that you meet the criteria for the TPV or SHEV, the Department will convert your application to an application for a RoS visa. The Department will notify you if you have been granted a RoS visa.\n\nIf you applied for an initial TPV or SHEV before 14 February 2023 you do\nnot\nneed to apply for a RoS visa. If we find that you meet the criteria for the TPV or SHEV, the Department will convert your application to an application for a RoS visa. The Department will notify you if you have been granted a RoS visa.\n\nYou do not need to apply for a RoS visa if you hold a TPV or SHEV and have applied for a subsequent TPV or SHEV before 14 February 2023. The Department has converted your application to an application for a RoS visa. The Department will notify you if we have granted you a RoS visa.\n\nYou do not need to apply for a RoS visa if you hold a TPV or SHEV and have applied for a subsequent TPV or SHEV before 14 February 2023. The Department has converted your application to an application for a RoS visa. The Department will notify you if we have granted you a RoS visa.\n\n## Current TPV and SHEV holders (with no application before the Department)\n\nCurrent TPV and SHEV holders (with no application before the Department)\n\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa.You must apply before your current TPV or SHEV ceases to remain lawful.\n\nCurrent TPV and SHEV holders who had not submitted a subsequent TPV or SHEV application before 14 February 2023 can apply for a RoS visa.\nYou must apply before your current TPV or SHEV ceases to remain lawful.\n\nYou must apply for a RoS visa online viaImmiAccount.\n\nYou must apply for a RoS visa online via\nImmiAccount\n.\n\nOnline applications for a RoS visa include the notification of an application bar lift (as unauthorised maritime arrivals are otherwise subject to the application bar in section 46A of theMigration Act 1958).\n\nOnline applications for a RoS visa include the notification of an application bar lift (as unauthorised maritime arrivals are otherwise subject to the application bar in section 46A of the\nMigration Act 1958\n).\n\nFor assistance with ImmiAccount technical issues seeTechnical help. If you are still unable to lodge your application you can contact our Global Service Centre, or the legal service provider in your state or territory for free assistance. For a list of providers see theRoS visa factsheet (200KB PDF).\n\nFor assistance with ImmiAccount technical issues see\nTechnical help\n. If you are still unable to lodge your application you can contact our Global Service Centre, or the legal service provider in your state or territory for free assistance. For a list of providers see the\nRoS visa factsheet (200KB PDF)\n.\n\nThere are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues).\n\nThere are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues).\n\n## Extending your TPV or SHEV\n\nExtending your TPV or SHEV\n\nWe will extend the TPV/SHEV of current TPV or SHEV holders who make a valid application for a RoS visa until we have made a decision on the RoS visa. To ensure that your TPV or SHEV is extended and that you remain lawful, you must apply for a RoS visa before your TPV or SHEV ceases.\n\nWe will extend the TPV/SHEV of current TPV or SHEV holders who make a valid application for a RoS visa until we have made a decision on the RoS visa. To ensure that your TPV or SHEV is extended and that you remain lawful, you must apply for a RoS visa before your TPV or SHEV ceases.\n\n## If you are currently unlawful\n\nIf you are currently unlawful\n\nIf you are currently an unlawful non-citizen because your TPV or SHEV expired before 14 February 2023, note that an application for a RoS visa is also an application for a bridging visa.\n\nIf you are currently an unlawful non-citizen because your TPV or SHEV expired before 14 February 2023, note that an application for a RoS visa is also an application for a bridging visa.\n\nFor current TPV or SHEV holders, you must apply for a RoS visa before your TPV or SHEV ceases.\n\nFor current TPV or SHEV holders, you must apply for a RoS visa before your TPV or SHEV ceases.\n\n## How long can you stay\n\nHow long can you stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nYou become an Australian permanent resident on the day we grant your visa.\n\nYou become an Australian permanent resident on the day we grant your visa.\n\nFor Australian citizenship purposes, your permanent residence starts on the day we grant your visa.\n\nFor Australian citizenship purposes, your permanent residence starts on the day we grant your visa.\n\n## Including family members\n\nIncluding family members\n\nFamily members may apply together on the same application form. Each applicant must meet the requirements in their own right for the grant of the visa.\n\nFamily members may apply together on the same application form. Each applicant must meet the requirements in their own right for the grant of the visa.\n\n### Newborn child\n\nNewborn child\n\nIf a child is born after you submit your application and before we make a decision on your application, we will include the child in that application. You must tell us as soon as possible by completingForm 1022 Notification of change of circumstances (172KB PDF). You must also provide a clear colour copy of the child's original birth certificate, and attach both of these documents in ImmiAccount or send them via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter.\n\nIf a child is born after you submit your application and before we make a decision on your application, we will include the child in that application. You must tell us as soon as possible by completing\nForm 1022 Notification of change of circumstances (172KB PDF)\n. You must also provide a clear colour copy of the child's original birth certificate, and attach both of these documents in ImmiAccount or send them via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter.\n\nIf a child is born in Australia, they are automatically granted the same visa their parents hold at the time of the child’s birth.\n\nIf a child is born in Australia, they are automatically granted the same visa their parents hold at the time of the child’s birth.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child will be an Australian citizen by birth. In such cases an Australian citizenship certificate should be obtained and attached in ImmiAccount. For more details see:Get a citizenship certificate.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child will be an Australian citizen by birth. In such cases an Australian citizenship certificate should be obtained and attached in ImmiAccount. For more details see:\nGet a citizenship certificate\n.\n\n## Cost\n\nCost\n\nThere is no cost.\n\nThere is no cost.\n\n## Apply from\n\nApply from\n\nYou must be in Australia when you apply for the visa.\n\nYou must be in Australia when you apply for the visa.\n\n## Processing times\n\nProcessing times\n\nThe Department continues to actively process all RoS visa applications.\n\nThe Department continues to actively process all RoS visa applications.\n\nSome cases are more complex than others and the department may need to request additional information from applicants, including in relation to identity. It is important that applicants cooperate with this process to allow applications to be processed as quickly as possible.\n\nSome cases are more complex than others and the department may need to request additional information from applicants, including in relation to identity. It is important that applicants cooperate with this process to allow applications to be processed as quickly as possible.\n\nInformation regarding the processing of the RoS visa caseload is available in the Unauthorised Maritime Arrival legacy caseload reports available atHumanitarian program statistics.\n\nInformation regarding the processing of the RoS visa caseload is available in the Unauthorised Maritime Arrival legacy caseload reports available at\nHumanitarian program statistics\n.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n## Travel\n\nTravel\n\nThere are no travel restrictions on the Resolution of Status visa.\n\nThere are no travel restrictions on the Resolution of Status visa.\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. To re-enter Australia after 5 years you will need aResident Return visa (RRV).\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. To re-enter Australia after 5 years you will need a\nResident Return visa (RRV)\n.\n\nIf you want to travel outside Australia after we grant the visa and you do not have a current passport, you should first contact anyAustralian Passport Officeof the Department of Foreign Affairs and Trade to apply for a travel document.\n\nIf you want to travel outside Australia after we grant the visa and you do not have a current passport, you should first contact any\nAustralian Passport Office\nof the Department of Foreign Affairs and Trade to apply for a travel document.\n\n## Fact sheet\n\nFact sheet\n\nA fact sheet with useful information about the Resolution of Status visa process is available below in the following languages:\n\nA fact sheet with useful information about the Resolution of Status visa process is available below in the following languages:\n- Arabic (560KB PDF)\nArabic (560KB PDF)\n- Burmese (357KB PDF)\nBurmese (357KB PDF)\n- Dari (554KB PDF)\nDari (554KB PDF)\n- English (200KB PDF)\nEnglish (200KB PDF)\n- Farsi (207KB PDF)\nFarsi (207KB PDF)\n- Pashto (546KB PDF)\nPashto (546KB PDF)\n- Rohingya (122KB PDF)\nRohingya (122KB PDF)\n- Tamil (344KB PDF)\nTamil (344KB PDF)\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your travel document orImmiCard. You will not get a label in your travel document.\n\nWe will digitally link your visa to your travel document or\nImmiCard\n. You will not get a label in your travel document.\n\n### Irregular travel to Australia\n\nIrregular travel to Australia\n\nThe Government remains committed to Operation Sovereign Borders. Australia’s border protection policies have not and will not change. Any person who attempts to travel to Australia irregularly will not settle permanently here.\n\nThe Government remains committed to Operation Sovereign Borders. Australia’s border protection policies have not and will not change. Any person who attempts to travel to Australia irregularly will not settle permanently here.\n\nAnyone who attempts to travel to Australia by voyage without a valid visa will be turned back to their point of departure, returned to their home country or transferred to another country.\n\nAnyone who attempts to travel to Australia by voyage without a valid visa will be turned back to their point of departure, returned to their home country or transferred to another country.\n\nAustralia's tough border protection policies are designed to protect Australia's borders, combat people smuggling and deter people from attempting dangerous boat voyages across the open ocean.\n\nAustralia's tough border protection policies are designed to protect Australia's borders, combat people smuggling and deter people from attempting dangerous boat voyages across the open ocean.\n\nThe Government’s policy on transitory persons remains unchanged. Transitory persons will not settle in Australia. We encourage them to engage in third country migration options including:\n\nThe Government’s policy on transitory persons remains unchanged. Transitory persons will not settle in Australia. We encourage them to engage in third country migration options including:\n- Resettlement in the United States or New Zealand or private sponsorship in Canada\nResettlement in the United States or New Zealand or private sponsorship in Canada\n- Assisted Voluntary Return (AVR) home or to another country in which they have right of entry.\nAssisted Voluntary Return (AVR) home or to another country in which they have right of entry.\nEligibility\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.T​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the\nRoS visa fact sheet\n.​​\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\n## Meet the visa requirements\n\nMeet the visa requirements\nDetails\n\nTo make a valid application for a Resolution of Status visa, you must be a holder (or former holder, and your visa was not cancelled) of one of the below visas:\n\nTo make a valid application for a Resolution of Status visa, you must be a holder (or former holder, and your visa was not cancelled) of one of the below visas:\n- Temporary Protection visa (subclass 785) – and you first arrived in Australia before 14 February 2023\nTemporary Protection visa (subclass 785) – and you first arrived in Australia before 14 February 2023\n- Safe Haven Enterprise visa (subclass 790) – and you first arrived in Australia before 14 February 2023\nSafe Haven Enterprise visa (subclass 790) – and you first arrived in Australia before 14 February 2023\n\nFrom 14 February 2023, TPV and SHEV holders who held their TPV or SHEV before this date are eligible to apply for a RoS visa. You can apply online viaImmiAccount.\n\nFrom 14 February 2023, TPV and SHEV holders who held their TPV or SHEV before this date are eligible to apply for a RoS visa. You can apply online via\nImmiAccount\n.\n\nPeople who have submitted a TPV or SHEV application prior to 14 February 2023 that has not been finally determined, will have their existing application automatically converted to a RoS visa application. This includes any subsequent TPV or SHEV application.\n\nPeople who have submitted a TPV or SHEV application prior to 14 February 2023 that has not been finally determined, will have their existing application automatically converted to a RoS visa application. This includes any subsequent TPV or SHEV application.\n\nIf you currently hold a bridging visa and you made a valid application for a TPV or SHEV before 14 February 2023, the Department will convert your TPV or SHEV application to a Resolution of Status visa application. You must satisfy the requirements for the grant of a TPV or SHEV.\n\nIf you currently hold a bridging visa and you made a valid application for a TPV or SHEV before 14 February 2023, the Department will convert your TPV or SHEV application to a Resolution of Status visa application. You must satisfy the requirements for the grant of a TPV or SHEV.\n\n## Not be barred from lodging a Resolution of Status (RoS) visa application\n\nNot be barred from lodging a Resolution of Status (RoS) visa application\nDetails\n\nYou cannot make a valid RoS visa application while you are subject to an application bar. This includes the section 46A bar for Unauthorised Maritime Arrivals.\n\nYou cannot make a valid RoS visa application while you are subject to an application bar. This includes the section 46A bar for Unauthorised Maritime Arrivals.\n\nThe online application form for a RoS visa includes the notification of a section 46A application bar lift. You must make your application online viaImmiAccount, unless the Department has authorised you to lodge a paper application form and notified you in writing of an application bar lift.\n\nThe online application form for a RoS visa includes the notification of a section 46A application bar lift. You must make your application online via\nImmiAccount\n, unless the Department has authorised you to lodge a paper application form and notified you in writing of an application bar lift.\n\nThere are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues). If you are experiencing difficulties lodging online, you should refer to theTechnical help. You may also contact the legal service provider in your state or territory for free assistance. For a list of providers see the RoS visafactsheet (200KB PDF).\n\nThere are limited circumstances where we will authorise applicants to lodge a RoS visa application using the paper application form (including verified ImmiAccount systems issues). If you are experiencing difficulties lodging online, you should refer to the\nTechnical help\n. You may also contact the legal service provider in your state or territory for free assistance. For a list of providers see the RoS visa\nfactsheet (200KB PDF)\n.\n\n## Not previously had your most recent TPV or SHEV refused or cancelled\n\nNot previously had your most recent TPV or SHEV refused or cancelled\nDetails\n\nIf we cancelled your most recent TPV or SHEV, or your TPV or SHEV application was refused and finally determined, you cannot make a valid application for a Resolution of Status visa.\n\nIf we cancelled your most recent TPV or SHEV, or your TPV or SHEV application was refused and finally determined, you cannot make a valid application for a Resolution of Status visa.\n\nWe expect that people found not to engage protection obligations and, whose application has been finally determined by any merits and judicial review processes, will depart Australia. We may provide these people assistance to depart.\n\nWe expect that people found not to engage protection obligations and, whose application has been finally determined by any merits and judicial review processes, will depart Australia. We may provide these people assistance to depart.\n\nIf you have new, credible protection claims relating to changes in your country of origin or personal circumstances, you may requestMinisterial Intervention.\n\nIf you have new, credible protection claims relating to changes in your country of origin or personal circumstances, you may request\nMinisterial Intervention\n.\n\nThe Minister will not consider protection claims that have already been considered in a Protection visa application or by the Tribunal. Requests will only be considered where a person is making genuine and compelling claims that require consideration when these claims could not be raised in their initial protection visa application. If the Minister does not intervene in your case, the Minister expects you to leave Australia when your current visa expires.\n\nThe Minister will not consider protection claims that have already been considered in a Protection visa application or by the Tribunal. Requests will only be considered where a person is making genuine and compelling claims that require consideration when these claims could not be raised in their initial protection visa application. If the Minister does not intervene in your case, the Minister expects you to leave Australia when your current visa expires.\n\n## Meet our identity requirements\n\nMeet our identity requirements\nDetails\n\nYou may be asked to provide documents asevidence of your identity, nationality or citizenshipto support your application.\n\nYou may be asked to provide documents as\nevidence of your identity, nationality or citizenship\nto support your application.\n\nWe may also ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before.\n\nWe may also ask you to provide biometrics (a scan of your fingerprints and a digital photograph of your face) as part of your application, if you have not provided them to us before.\n\nIf you are invited to provide identity information and you do not provide this within the timeframe provided, you will be provided with an opportunity to explain why you could not provide the information, and the steps that you took to obtain the information. If you do not make a genuine attempt to establish your identity, the department may consider refusing your application.\n\nIf you are invited to provide identity information and you do not provide this within the timeframe provided, you will be provided with an opportunity to explain why you could not provide the information, and the steps that you took to obtain the information. If you do not make a genuine attempt to establish your identity, the department may consider refusing your application.\n\nIf the department requests identity information from you and, following your response, has substantial concerns with a previous finding in relation to your identity, we will assess whether you meetat least oneof the following criteria before granting your visa:\n\nIf the department requests identity information from you and, following your response, has substantial concerns with a previous finding in relation to your identity, we will assess whether you meet\nat least one\nof the following criteria before granting your visa:\n- You would satisfy the criteria for the grant of a protection visa (including engaging Australia’s protection obligations).\nYou would satisfy the criteria for the grant of a protection visa (including engaging Australia’s protection obligations).\n- There is a compelling or compassionate reason for you to be granted a RoS visa (this could include, for example, family circumstances, health needs or a positive contribution to Australian society).\nThere is a compelling or compassionate reason for you to be granted a RoS visa (this could include, for example, family circumstances, health needs or a positive contribution to Australian society).\n- You are a member of the same family unit as a person who holds a RoS visa.\nYou are a member of the same family unit as a person who holds a RoS visa.\n\n## Meet our security requirements\n\nMeet our security requirements\nDetails\n\nAs part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a Resolution of Status visa.\n\nAs part of the application process, we will assess whether you meet Australia’s security requirements for the grant of a Resolution of Status visa.\n\n## Meet our health requirements\n\nMeet our health requirements\nDetails\n\nYou may need to undergohealth examinations. This will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV.\n\nYou may need to undergo\nhealth examinations\n. This will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV.\n\nThese examinations will be conducted byBupa Medical Visa Services.\n\nThese examinations will be conducted by\nBupa Medical Visa Services\n.\n\nafter you have lodged your visa application if required, we will give you a health identifier (HAP ID) and information about how toarrange your health examinations.\n\nafter you have lodged your visa application if required, we will give you a health identifier (HAP ID) and information about how to\narrange your health examinations\n.\n\n## Meet our character requirements\n\nMeet our character requirements\nDetails\n\nYou must meet certaincharacter requirements.\n\nYou must meet certain\ncharacter requirements\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must have read, or had explained to you, the booklet,Life in Australia.\n\nIf you are 18 years of age or older, you must have read, or had explained to you, the booklet,\nLife in Australia\n.\n\nYou must also confirm you will respect the Australian way of life and obey Australian laws when you sign or accept theAustralian Values Statement.\n\nYou must also confirm you will respect the Australian way of life and obey Australian laws when you sign or accept the\nAustralian Values Statement\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.T​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the\nRoS visa fact sheet\n.​​\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck that you are eligible and check when your current TPV or SHEV ceases. You can prepare and submit your application yourself or, if you need help, you can get someone to act on your behalf. You should start this process well before your TPV or SHEV ceases. If you do not apply before your current visa ceases you will become unlawful and may lose access to Government services.\n\nCheck that you are eligible and check when your current TPV or SHEV ceases. You can prepare and submit your application yourself or, if you need help, you can get someone to act on your behalf. You should start this process well before your TPV or SHEV ceases. If you do not apply before your current visa ceases you will become unlawful and may lose access to Government services.\n\nFor more information seeEligibility.\n\nFor more information see\nEligibility\n.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be one of the following:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be one of the following:\n- Registered migration agent\nRegistered migration agent\n- Legal practitioner\nLegal practitioner\n- Exempt person\nExempt person\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter. For more information seeReceiving Documents.\n\nYou can appoint anyone to receive documents on your behalf relating to your visa matter. For more information see\nReceiving Documents\n.\n\nYou can get free legal assistance to apply for a RoS visa.\n\nYou can get free legal assistance to apply for a RoS visa.\n\nWhile not mandatory, we encourage TPV/SHEV holders who are applying for a RoS visa to contact the specialist legal service provider in their state for free support.\n\nWhile not mandatory, we encourage TPV/SHEV holders who are applying for a RoS visa to contact the specialist legal service provider in their state for free support.\n\nState / Territory | Service Provider | Website\nAustralian Capital Territory (ACT) | Legal Aid ACT | www.legalaidact.org.au\nNew South Wales (NSW) | Refugee Advice and Casework Service (RACS)Immigration Advice and Rights Centre (IARC) on referral from RACS NSW | www.racs.org.auwww.iarc.org.au\nNorthern Territory (NT) | Northern Territory Legal Aid Commission | www.legalaid.nt.gov.au\nQueensland (QLD) | Refugee and Immigration Legal Service (RAILS) | www.rails.org.au\nSouth Australia (SA) | Legal Services Commission of SA | www.lsc.sa.gov.au\nTasmania (TAS) | Tasmanian Refugee Legal Service | www.trls.org.au\nVictoria (VIC) | Refugee Legal | www.refugeelegal.org.au\nWestern Australia (WA) | Circle Green Community Legal | www.circlegreen.org.au\n\nState / Territory\n\nState / Territory\n\nService Provider\n\nService Provider\n\nWebsite\n\nWebsite\n\nAustralian Capital Territory (ACT)\n\nAustralian Capital Territory (ACT)\n\nLegal Aid ACT\n\nLegal Aid ACT\n\nwww.legalaidact.org.au\n\nwww.legalaidact.org.au\n\nNew South Wales (NSW)\n\nNew South Wales (NSW)\n\nRefugee Advice and Casework Service (RACS)\n\nRefugee Advice and Casework Service (RACS)\n\nImmigration Advice and Rights Centre (IARC) on referral from RACS NSW\n\nImmigration Advice and Rights Centre (IARC) on referral from RACS NSW\n\nwww.racs.org.au\n\nwww.racs.org.au\n\nwww.iarc.org.au\n\nwww.iarc.org.au\n\nNorthern Territory (NT)\n\nNorthern Territory (NT)\n\nNorthern Territory Legal Aid Commission\n\nNorthern Territory Legal Aid Commission\n\nwww.legalaid.nt.gov.au\n\nwww.legalaid.nt.gov.au\n\nQueensland (QLD)\n\nQueensland (QLD)\n\nRefugee and Immigration Legal Service (RAILS)\n\nRefugee and Immigration Legal Service (RAILS)\n\nwww.rails.org.au\n\nwww.rails.org.au\n\nSouth Australia (SA)\n\nSouth Australia (SA)\n\nLegal Services Commission of SA\n\nLegal Services Commission of SA\n\nwww.lsc.sa.gov.au\n\nwww.lsc.sa.gov.au\n\nTasmania (TAS)\n\nTasmania (TAS)\n\nTasmanian Refugee Legal Service\n\nTasmanian Refugee Legal Service\n\nwww.trls.org.au\n\nwww.trls.org.au\n\nVictoria (VIC)\n\nVictoria (VIC)\n\nRefugee Legal\n\nRefugee Legal\n\nwww.refugeelegal.org.au\n\nwww.refugeelegal.org.au\n\nWestern Australia (WA)\n\nWestern Australia (WA)\n\nCircle Green Community Legal\n\nCircle Green Community Legal\n\nwww.circlegreen.org.au\n\nwww.circlegreen.org.au\n\nThere is no visa application charge for the RoS visa. If you are using the services of a migration agent, ensure they are registered with theOffice of Migration Agents Regulatory Authority (OMARA). Only registered migration agents and legal practitioners can charge for immigration assistance.\n\nThere is no visa application charge for the RoS visa. If you are using the services of a migration agent, ensure they are registered with the\nOffice of Migration Agents Regulatory Authority (OMARA)\n. Only registered migration agents and legal practitioners can charge for immigration assistance.\n\nNote:The Department of Home Affairs does not charge a fee to fast-track a visa. If you get offered this service, it is a scam.\n\nNote:\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you get offered this service, it is a scam.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou need to provide documents to support your application for this visa. In many cases, we can make a decision using the information you provide when you lodge your application. In some cases, we may request additional information (for example, in relation to your identity).\n\nYou need to provide documents to support your application for this visa. In many cases, we can make a decision using the information you provide when you lodge your application. In some cases, we may request additional information (for example, in relation to your identity).\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nIt is in your interest to provide as much information as possible in your application and that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application.\n\nIt is in your interest to provide as much information as possible in your application and that your application is truthful and complete. We can make a decision using only the information you provide when you submit your application.\nSee how\n\n#### Identity documents\n\nIdentity documents\n\nWhere the department has invited you to provide further information concerning your identity you must provide original and translated documents of youridentity, nationality and citizenship.\n\nWhere the department has invited you to provide further information concerning your identity you must provide original and translated documents of your\nidentity, nationality and citizenship\n.\n\nSuch as:\n\nSuch as:\n- all pages of your current or expired passports (including biodata page)\nall pages of your current or expired passports (including biodata page)\n- your birth certificate\nyour birth certificate\n- your national identity card\nyour national identity card\n- your driver's licence\nyour driver's licence\n- proof of change of name, if applicable\nproof of change of name, if applicable\n- any other documents that support your identity, nationality or citizenship.\nany other documents that support your identity, nationality or citizenship.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by.\ndocuments that show other names you have been known by.\n\nThese documents are to be attached in ImmiAccount.\n\nThese documents are to be attached in ImmiAccount.\n\nIf you cannot provide these documents, you will be provided with the opportunity to explain why and demonstrate the reasonable steps you have taken to obtain the requested information. If you do not provide this information, or you provide a bogus document or false or misleading information in relation to your identity your application may be refused.\n\nIf you cannot provide these documents, you will be provided with the opportunity to explain why and demonstrate the reasonable steps you have taken to obtain the requested information. If you do not provide this information, or you provide a bogus document or false or misleading information in relation to your identity your application may be refused.\nSee how\n\n#### Access documents I previously provided to the Department\n\nAccess documents I previously provided to the Department\n\nIt is not necessary for you to provide us with the claims, information or documents you already provided as part of your previous TPV or SHEV application. Therefore, you do not need to ask for copies of these documents from us.\n\nIt is not necessary for you to provide us with the claims, information or documents you already provided as part of your previous TPV or SHEV application. Therefore, you do not need to ask for copies of these documents from us.\n\nIf you still want to access your documents held by us, you can request them under thePrivacy Act 1988.\n\nIf you still want to access your documents held by us, you can request them under the\nPrivacy Act 1988\n.\nSee how\n\n#### Character documents\n\nCharacter documents\n\nIf requested by the Department, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age. You do not need to do this if you have provided this information with your TPV or SHEV application.\n\nIf requested by the Department, you must be prepared to provide a police certificate from each country you have lived in for 12 months or more during the past 10 years after you turned 16 years of age. You do not need to do this if you have provided this information with your TPV or SHEV application.\n\nDo not arrange for police certificates until we ask you to.\n\nDo not arrange for police certificates until we ask you to.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or forms. To upload documents seeImmiAccount.\n\nUpload your written notification or forms. To upload documents see\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nYou do not need to have any documents certified.\n\nYou do not need to have any documents certified.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\n#### For online applications\n\nFor online applications\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all relevant identity documents including any passports (English and non-English) in colour.\n\nScan or photograph all relevant identity documents including any passports (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\n\nEnsure that you save photos under the name of the person in the photo. Clearly label all other files in English.\n\nEnsure that you save photos under the name of the person in the photo. Clearly label all other files in English.\n\nLearn more about accepteddocument size and formats.\n\nLearn more about accepted\ndocument size and formats\n.\nSee how\n\n#### Attach\n\nAttach\n\nAttach:\n\nAttach:\n- identity documents not previously provided to the Department or when requested by the Department)\nidentity documents not previously provided to the Department or when requested by the Department)\n- each document only once (even if you are using it to show more than one thing)\neach document only once (even if you are using it to show more than one thing)\n\nLearn more aboutattaching documents.\n\nLearn more about\nattaching documents\n.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\nShow\n                    steps\n\n#### Completing your application\n\nCompleting your application\n\nIf your migration agent completes your application form, you must read and understand all the information included in the form before signing it. This also includes signing any statutory declaration you make.\n\nIf your migration agent completes your application form, you must read and understand all the information included in the form before signing it. This also includes signing any statutory declaration you make.\n\nThe form asks for basic information about you and any other applicant on the form (including name, address, date of birth and contact details). It also asks some questions in relation to character and travel history. It is important that you complete the form in full, including completing the Australian Values Statement and declaration.\n\nThe form asks for basic information about you and any other applicant on the form (including name, address, date of birth and contact details). It also asks some questions in relation to character and travel history. It is important that you complete the form in full, including completing the Australian Values Statement and declaration.\nSee how\n\n#### Apply online in ImmiAccount\n\nApply online in ImmiAccount\n\nRoS visa applications should be lodged online throughImmiAccount. There are a number of benefits to lodging online. You can:\n\nRoS visa applications should be lodged online through\nImmiAccount\n. There are a number of benefits to lodging online. You can:\n- check the status of your application\ncheck the status of your application\n- continue a saved application\ncontinue a saved application\n- attach documents to an application\nattach documents to an application\n- update personal details\nupdate personal details\n- access a copy of your application at any time.\naccess a copy of your application at any time.\n\nTo apply online, follow these steps:\n\nTo apply online, follow these steps:\n1. Log in or create anImmiAccount\nLog in or create an\nImmiAccount\n2. Attach documents (if required)\nAttach documents (if required)\n3. Note the Transaction reference number\nNote the Transaction reference number\n\nThe online form will guide you to answer the questions we need from you. It has helpful information included if you need support.\n\nThe online form will guide you to answer the questions we need from you. It has helpful information included if you need support.\n\nWhen you finish your online application, you will come to a page that will prompt you to attach documents. You can save your application at any page and go back to it when you are ready.\n\nWhen you finish your online application, you will come to a page that will prompt you to attach documents. You can save your application at any page and go back to it when you are ready.\n\nOnce you have submitted your application online, you can check the status of your application through ImmiAccount.\n\nOnce you have submitted your application online, you can check the status of your application through ImmiAccount.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount attechnical help.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount at\ntechnical help\n.\n\nIf you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see theRoS visa factsheet (200KB PDF). You can also contact our Global Service Centre on 131 881.\n\nIf you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see the\nRoS visa factsheet (200KB PDF)\n. You can also contact our Global Service Centre on 131 881.\nSee how\n\n#### Apply on paper\n\nApply on paper\n\nIf you can't submit your application for a Resolution of Status visa online due to a verified system issue with ImmiAccount, the Department may authorise you to submit a paper application.\n\nIf you can't submit your application for a Resolution of Status visa online due to a verified system issue with ImmiAccount, the Department may authorise you to submit a paper application.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount attechnical help.\n\nIf you have difficulties lodging your application online, the ImmiAccount front page provides information about planned and unplanned system outages. You may need to return to ImmiAccount at a later time to complete your application, but you must apply before your current visa ceases. You can find help and support for technical issues with ImmiAccount at\ntechnical help\n.\n\nIf you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see theRoS visa factsheet (200KB PDF). You can also contact our Global Service Centre on 131 881.\n\nIf you still have difficulties lodging your application online, you may seek support from one of the specialist legal service providers available to provide free assistance to RoS applicants. For a list of providers see the\nRoS visa factsheet (200KB PDF)\n. You can also contact our Global Service Centre on 131 881.\n\nNote:If you have already been provided with a paper application form and notification of an application bar lift, you can still apply for a RoS visa online via ImmiAccount\n\nNote:\nIf you have already been provided with a paper application form and notification of an application bar lift, you can still apply for a RoS visa online via ImmiAccount\nSee how\n\n#### Communicating by email\n\nCommunicating by email\n\nThe online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post.\n\nThe online application form asks if you agree to the department communicating with you via email. This is the department’s preferred and fastest method of communication. If you do not agree to email communication, we will send you information by post, which is slower. Your application may take longer to finalise if we need to contact you about it by post.\n\nIf you have already applied and you want us to communicate with you by email but you did not select this option in your application, completeForm 1193 Communicating by email with the Department (127KB PDF).\n\nIf you have already applied and you want us to communicate with you by email but you did not select this option in your application, complete\nForm 1193 Communicating by email with the Department (127KB PDF)\n.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will tell you when we have received your application by sending you an acknowledgement letter.\n\nWe will tell you when we have received your application by sending you an acknowledgement letter.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe can’t give updates on the processing status of an application.\n\nWe can’t give updates on the processing status of an application.\n\nYou can check if we need more information from you inImmiAccount.\n\nYou can check if we need more information from you in\nImmiAccount\n.\n\nYou must wait for us to contact you if you applied on a paper application form.\n\nYou must wait for us to contact you if you applied on a paper application form.\nSee how\n\n#### Health examinations\n\nHealth examinations\n\nWe may require you to undergohealth examinations. These will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV.\n\nWe may require you to undergo\nhealth examinations\n. These will protect your health and the health of the Australian community. We may waive the health requirements if you have already satisfied the health requirements for the grant of a TPV or SHEV.\nSee how\n\n#### Get support\n\nGet support\n\nIf you have submitted a valid application, you might be able to get financial or other assistance from theStatus Resolution Support Services (SRSS) program.\n\nIf you have submitted a valid application, you might be able to get financial or other assistance from the\nStatus Resolution Support Services (SRSS) program\n.\nSee how\n\n#### Enrol in Medicare service centre\n\nEnrol in Medicare service centre\n\nTo access public healthcare, enrol in Medicare. Take your 'Acknowledgement' letter and supporting documents to aMedicare service centre.\n\nTo access public healthcare, enrol in Medicare. Take your 'Acknowledgement' letter and supporting documents to a\nMedicare service centre\n.\n\n#### Provide more information\n\nProvide more information\n\nYou can provide more information to us, in writing, at any time until we make a decision on your application.\n\nYou can provide more information to us, in writing, at any time until we make a decision on your application.\n\nIf you did not provide all relevant documents when you applied, attach them as soon as possible inImmiAccount. You may also provide them via email using the address provided in your visa application acknowledgement letter.\n\nIf you did not provide all relevant documents when you applied, attach them as soon as possible in\nImmiAccount\n. You may also provide them via email using the address provided in your visa application acknowledgement letter.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe will give you the chance to comment if we receive information from another person that could result in, or be part of, a decision to refuse your visa.\n\nWe will give you the chance to comment if we receive information from another person that could result in, or be part of, a decision to refuse your visa.\nSee how\n\n#### Add family members to your application\n\nAdd family members to your application\nSee how\n\n#### Newborn child\n\nNewborn child\n\nIf you have a baby after you submit your application and before we make a decision on your application, we can include that child in the application. For this to occur you must tell us as soon as possible by:\n\nIf you have a baby after you submit your application and before we make a decision on your application, we can include that child in the application. For this to occur you must tell us as soon as possible by:\n- completingForm 1022 Notification of change of circumstances (172KB PDF)\ncompleting\nForm 1022 Notification of change of circumstances (172KB PDF)\n- providing a clear colour copy of child's original birth certificate and\nproviding a clear colour copy of child's original birth certificate and\n- attaching these documents in ImmiAccount or send via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter.\nattaching these documents in ImmiAccount or send via email to the address provided in your RoS visa or subsequent TPV or SHEV application acknowledgement letter.\n\nIf your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth.\n\nIf your child is born in Australia, we automatically grant them the same visa you hold at the time of the child’s birth.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child might be an Australian citizen by birth. See the requirements forevidence of Australian citizenship.\n\nIf either parent is an Australian citizen or Australian permanent resident at the time of the child’s birth, the child might be an Australian citizen by birth. See the requirements for\nevidence of Australian citizenship\n.\nSee how\n\n#### Mistakes on your application\n\nMistakes on your application\n\nTell us as soon as you can if you made a mistake on your application.\n\nTell us as soon as you can if you made a mistake on your application.\n\nComplete Form1023 Notification of incorrect answers (168KB PDF)\n\nComplete Form\n1023 Notification of incorrect answers (168KB PDF)\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nTell us if you no longer want someone to:\n\nTell us if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nIf you applied online upload your written notification or your forms toImmiAccount. You can also send it to the office where you submitted your application.\n\nIf you applied online upload your written notification or your forms to\nImmiAccount\n. You can also send it to the office where you submitted your application.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to tell us about after you have applied include:\n\nThings you need to tell us about after you have applied include:\n- changes to your name, phone number, email, address or passport\nchanges to your name, phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- you are pregnant or you become pregnant\nyou are pregnant or you become pregnant\n- the birth of a child\nthe birth of a child\n- a death in your family (if the family member is an applicant for a RoS visa)\na death in your family (if the family member is an applicant for a RoS visa)\n- if you want to withdraw your application\nif you want to withdraw your application\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\nSee how\n\n#### Travel for TPV SHEV visa holders\n\nTravel for TPV SHEV visa holders\n\nTPV SHEV visa holders who have made a valid application for another TPV, SHEV or RoS (including a converted RoS) will remain holding their current visa indefinitely until a final decision is made on the subsequent application.\n\nTPV SHEV visa holders who have made a valid application for another TPV, SHEV or RoS (including a converted RoS) will remain holding their current visa indefinitely until a final decision is made on the subsequent application.\n\nTPV SHEV visa holders can continue travelling overseas, for more information refer toRequesting Permission to Travel.\n\nTPV SHEV visa holders can continue travelling overseas, for more information refer to\nRequesting Permission to Travel\n.\n\nA RoS applicant must be in Australia for the grant of the visa. If you are overseas when your RoS visa is ready to be granted you will be contacted and asked to return to Australia within 28 days. If you do not return your RoS visa application may be refused.\n\nA RoS applicant must be in Australia for the grant of the visa. If you are overseas when your RoS visa is ready to be granted you will be contacted and asked to return to Australia within 28 days. If you do not return your RoS visa application may be refused.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will tell you our decision in writing.\n\nWe will tell you our decision in writing.\nShow\n                    steps\n\n#### If we grant your visa\n\nIf we grant your visa\n\nIf we grant your visa, we will send you a visa grant notification letter. Your letter will tell you:\n\nIf we grant your visa, we will send you a visa grant notification letter. Your letter will tell you:\n- your visa grant number\nyour visa grant number\n- when we granted your visa\nwhen we granted your visa\n- information about a range of topics including:ImmiCardsliving in Australiatranslating and Interpreting Service (TIS)client service informationtorture and trauma counselling servicesother government services.\ninformation about a range of topics including:\n- ImmiCards\nImmiCards\n- living in Australia\nliving in Australia\n- translating and Interpreting Service (TIS)\ntranslating and Interpreting Service (TIS)\n- client service information\nclient service information\n- torture and trauma counselling services\ntorture and trauma counselling services\n- other government services.\nother government services.\n\nYou should keep a copy of this letter in a safe place for your reference.\n\nYou should keep a copy of this letter in a safe place for your reference.\nSee how\n\n#### If we refuse your visa application\n\nIf we refuse your visa application\n\nIf we refuse your visa application, we will send you a letter to tell you:\n\nIf we refuse your visa application, we will send you a letter to tell you:\n- why we refused your visa application\nwhy we refused your visa application\n- your review rights andyour review rights with the Administrative Review Tribunal (ART)\nyour review rights and\nyour review rights with the Administrative Review Tribunal (ART)\n- the time limit for lodging an application for review.\nthe time limit for lodging an application for review.\nSee how\nWhen you have this visa\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​The Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.T​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see theRoS visa fact sheet.​​\n\nFree visa application assistance is available to people who are eligible to apply for a Resolution of Status (RoS) visa. If you hold a Temporary Protection visa (TPV) or Safe Haven Enterprise visa (SHEV) you can contact the legal service provider in your state or territory. For more information see the\nRoS visa fact sheet\n.​​\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nThe Department of Home Affairs does not charge a fee to fast-track a visa. If you are offered this service, it is a scam.\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\n\nT​o apply for a RoS, you must apply before your TPV or SHEV expires.  If your visa expires, you will become unlawful and may lose access to government services.​\nWhat you can do when you have this visa\nWhat you must do on this visa\nTell us if things change\nProving you have a visa\nVisa details\nWork and study\nBringing family\nBecoming an Australian citizen\nGet support\nLeaving Australia\n\n## What you can do when you have this visa\n\nWhat you can do when you have this visa\n- live, work and study in Australia permanently\nlive, work and study in Australia permanently\n- access government services such asMedicareandCentrelinkservices\naccess government services such as\nMedicare\nand\nCentrelink\nservices\n- accessshort-term counselling for torture and traumaif required\naccess\nshort-term counselling for torture and trauma\nif required\n- sponsor eligible family members for permanent residence through the family visa stream of the Migration Program\nsponsor eligible family members for permanent residence through the family visa stream of the Migration Program\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligiblebecome an Australian citizen\nif eligible\nbecome an Australian citizen\n- attendEnglish language classes for freeif you are eligible\nattend\nEnglish language classes for free\nif you are eligible\n\n## What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\n## Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about when you have this visa:\n\nThings you need to let us know about when you have this visa:\n- changes to your name, phone number, email, address or passport\nchanges to your name, phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- a death in your family (if the family member is an applicant for a RoS visa)\na death in your family (if the family member is an applicant for a RoS visa)\n\nSee what to doif your situation changes.\n\nSee what to do\nif your situation changes\n.\n\n## Proving you have a visa\n\nProving you have a visa\n\n### ImmiCard\n\nImmiCard\n\nYou and your eligible family members can obtain anImmiCard.\n\nYou and your eligible family members can obtain an\nImmiCard\n.\n\nAn ImmiCard is an official, secure immigration credential. It contains a photograph and personal details such as:\n\nAn ImmiCard is an official, secure immigration credential. It contains a photograph and personal details such as:\n- family name\nfamily name\n- given names\ngiven names\n- date of birth\ndate of birth\n- gender.\ngender.\n\nImmiCards also have a unique number linked to biometric and visa details in our system.\n\nImmiCards also have a unique number linked to biometric and visa details in our system.\n\n## Visa details\n\nVisa details\n\nTo prove you have a visa and to show your visa conditions to someone, useVEVO.\n\nTo prove you have a visa and to show your visa conditions to someone, use\nVEVO\n.\n\n## Work and study\n\nWork and study\n\nWith this visa, you can work and study. You are protected by Australian workplace law. For more information on your workplace rights and entitlements seeVisa holders and migrant workers.\n\nWith this visa, you can work and study. You are protected by Australian workplace law. For more information on your workplace rights and entitlements see\nVisa holders and migrant workers\n.\n\n## Bringing family\n\nBringing family\n\nAs an Australian permanent resident, you may be able to sponsor eligible family to come to Australia through the family visa stream of the Migration Program.\n\nAs an Australian permanent resident, you may be able to sponsor eligible family to come to Australia through the family visa stream of the Migration Program.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n## Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you may be eligible for Australian citizenship. Find out more aboutbecoming an Australian citizen. For citizenship purposes, your permanent residency starts on the day we grant your visa.\n\nAfter a certain time, you may be eligible for Australian citizenship. Find out more about\nbecoming an Australian citizen\n. For citizenship purposes, your permanent residency starts on the day we grant your visa.\n\n## Get support\n\nGet support\n\n### Australian government services\n\nAustralian government services\n\nYou may be able to access a range of services offered by the Australian Government such as:\n\nYou may be able to access a range of services offered by the Australian Government such as:\n- benefits fromServices Australia\nbenefits from\nServices Australia\n- job matching\njob matching\n- Medicare\nMedicare\n- National Disability Insurance Scheme\nNational Disability Insurance Scheme\n- short-term counselling for torture or trauma where required.\nshort-term counselling for torture or trauma where required.\n\nServices Australia delivers a range of social and health-related payments and services. For more information about the range of available services and your eligibility to access them go toServices Australia.\n\nServices Australia delivers a range of social and health-related payments and services. For more information about the range of available services and your eligibility to access them go to\nServices Australia\n.\n\n### Australian Taxation Office\n\nAustralian Taxation Office\n\nTo receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to theAustralian Taxation Office.\n\nTo receive an income in Australia, you need a Tax File Number (TFN). Income includes wages or salary from a job, government payments and income from investments. For more information or to apply for a TFN online, go to the\nAustralian Taxation Office\n.\n\n### Information pack on domestic and family violence, sexual assault and forced marriage\n\nInformation pack on domestic and family violence, sexual assault and forced marriage\n\nThe Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage.The family safety packalso includes important information about essential services and emergency contacts in Australia.\n\nThe Australian Government has developed a family safety pack with information on Australia’s laws regarding domestic and family violence, sexual assault and forced marriage.\nThe family safety pack\nalso includes important information about essential services and emergency contacts in Australia.\n\n## Leaving Australia\n\nLeaving Australia\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need aResident Return (RRV) visa (subclass 155) or (subclass 157)to re-enter Australia as a permanent resident.\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a\nResident Return (RRV) visa (subclass 155) or (subclass 157)\nto re-enter Australia as a permanent resident.\n\n### Before you leave\n\nBefore you leave\n\nCheck your travel documents\n\nCheck your travel documents\n\nCheck the travel component of your visa is still valid inVEVO.\n\nCheck the travel component of your visa is still valid in\nVEVO\n.\n\nContact any Australian Passport Office of the Department of Foreign Affairs and Trade toapply for an Australian travel document.\n\nContact any Australian Passport Office of the Department of Foreign Affairs and Trade to\napply for an Australian travel document\n.\n\n### Travel facility and Resident Return visa\n\nTravel facility and Resident Return visa\n\nWhen you hold a permanent Resolution of Status visa, you can travel to and from Australia for 5 years from the date we grant the visa. This means you can leave and re-enter Australia as many times as you like in the 5 years from the date we granted the visa, as long as your visa is in effect.\n\nWhen you hold a permanent Resolution of Status visa, you can travel to and from Australia for 5 years from the date we grant the visa. This means you can leave and re-enter Australia as many times as you like in the 5 years from the date we granted the visa, as long as your visa is in effect.\n\nAfter 5 years your travel facility expires. You will need to apply for and be granted aResident Return (RRV) visa (subclass 155) or (subclass 157)to re-enter Australia as a permanent resident.\n\nAfter 5 years your travel facility expires. You will need to apply for and be granted a\nResident Return (RRV) visa (subclass 155) or (subclass 157)\nto re-enter Australia as a permanent resident.\n\nIf you leave Australia after the travel facility of your Resolution of Status visa has expired, or if it expires when you are overseas, you will need to apply for, and be granted, an RRV before you can return to Australia as a permanent resident.\n\nIf you leave Australia after the travel facility of your Resolution of Status visa has expired, or if it expires when you are overseas, you will need to apply for, and be granted, an RRV before you can return to Australia as a permanent resident.\n\nFor more information on the travel facility on your permanent visa and advice on when to apply for a Resident Return visa, seeOverseas travel as a permanent resident.\n\nFor more information on the travel facility on your permanent visa and advice on when to apply for a Resident Return visa, see\nOverseas travel as a permanent resident\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#About",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-12",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-13",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-14",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#aboutVisa-index-15",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/temporary-protection-785/identity-requirements",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#haveThisVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resolution-of-status-851#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:18:18.603559",
  "metadata": {}
}