{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/guardian-visa-subclass-580",
  "title": "Guardian visa (subclass 580)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Guardian visa (subclass 580) Page Content ​​You can no longer apply for the Student Guardian visa (subclass 580). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 590) Visa holders Details This information is for people who have already been granted a Student Guardian visa (subclass 580) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations. You can use the free Visa Entitlement Verification Online (VEVO) to check your visa details and conditions. How long your visa lasts Details If you already have a Student Guardian visa (subclass 580), it will be valid until the expiry date you were given when your visa was granted. What this visa lets you do Details With this visa you can: stay in Australia for the same length of time as the nominating student, or until the student turns 18 years of age . study in Australia for up to 20 hours per week in an English Language Intensive Course for Overseas Students (ELICOS) if you lodged your application on or after 24 March 2012. study in a course other than ELICOS in Australia for up to three months. You can enter and leave Australia during the term of the visa, but you cannot leave Australia without the nominating student unless you provide us with evidence that: there are compelling compassionate circumstances for doing so; and you have made suitable alternative arrangements for the student’s accommodation, general welfare and support until you return. Obligations Details Alternative arrangements Details Alternative arrangements must be approved by us and the student’s education provider. Discuss your circumstances with the education provider a soon as you know you need to travel. There are two ways you can make alterative welfare arrangements: nominate an alternative student guardian who must be, except in limited circumstances, a parent or relative aged 21 years or over using Form 157N Nomination of a student guardian (291KB PDF) . This form outlines the documentation you need to provide when nominating a student guardian. Send this form, the education provider’s approval (in a letter or email) and the required documentation to us before you leave Australia; or the student’s education provider can take responsibility for their welfare by issuing a Confirmation of Appropriate Accommodation and Welfare (CAAW) letter which will state the start and end dates for approval of welfare arrangements. We will tell you if the alternative welfare arrangements have been approved. If we decide that the welfare arrangements are not suitable, you cannot leave Australia without your nominating student. 'No further stay' or 'further stay restricted' condition Details You must comply with the visa’s ‘no further stay’ condition. This means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances. You must not work while in Australia. If you don’t abide by the conditions of your Guardian visa (subclass 580), your visa might be cancelled, and we could also cancel the nominating student’s visa. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Guardian visa (subclass 580)\n\nGuardian visa (subclass 580)\nPage Content\n\n​​You can no longer apply for the Student Guardian visa (subclass 580). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  aStudent Visa (subclass 590).\n\n​​You can no longer apply for the Student Guardian visa (subclass 580). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  a\nStudent Visa (subclass 590)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Student Guardian visa (subclass 580) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Student Guardian visa (subclass 580) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can use the freeVisa Entitlement Verification Online (VEVO)to check your visa details and conditions.\n\nYou can use the free\nVisa Entitlement Verification Online (VEVO)\nto check your visa details and conditions.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you already have a Student Guardian visa (subclass 580), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already have a Student Guardian visa (subclass 580), it will be valid until the expiry date you were given when your visa was granted.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nWith this visa you can:\n\nWith this visa you can:\n- stay in Australia for the same length of time as the nominating student, or until the student turns 18 years of age .\nstay in Australia for the same length of time as the nominating student, or until the student turns 18 years of age .\n- study in Australia for up to 20 hours per week in an English Language Intensive Course for Overseas Students (ELICOS) if you lodged your application on or after 24 March 2012.\nstudy in Australia for up to 20 hours per week in an English Language Intensive Course for Overseas Students (ELICOS) if you lodged your application on or after 24 March 2012.\n- study in a course other than ELICOS in Australia for up to three months.\nstudy in a course other than ELICOS in Australia for up to three months.\n\nYou can enter and leave Australia during the term of the visa, but you cannot leave Australia without the nominating student unless you provide us with evidence that:\n\nYou can enter and leave Australia during the term of the visa, but you cannot leave Australia without the nominating student unless you provide us with evidence that:\n- there are compelling compassionate circumstances for doing so; and\nthere are compelling compassionate circumstances for doing so; and\n- you have made suitable alternative arrangements for the student’s accommodation, general welfare and support until you return.\nyou have made suitable alternative arrangements for the student’s accommodation, general welfare and support until you return.\n\n## Obligations\n\nObligations\nDetails\n\n### Alternative arrangements\n\nAlternative arrangements\nDetails\n\nAlternative arrangements must be approved by us and the student’s education provider. Discuss your circumstances with the education provider a soon as you know you need to travel.\n\nAlternative arrangements must be approved by us and the student’s education provider. Discuss your circumstances with the education provider a soon as you know you need to travel.\n\nThere are two ways you can make alterative welfare arrangements:\n\nThere are two ways you can make alterative welfare arrangements:\n1. nominate an alternative student guardian who must be, except in limited circumstances, a parent or relative aged 21 years or over usingForm 157N Nomination of a student guardian (291KB PDF). This form outlines the documentation you need to provide when nominating a student guardian. Send this form, the education provider’s approval (in a letter or email) and the required documentation to us before you leave Australia; or\nnominate an alternative student guardian who must be, except in limited circumstances, a parent or relative aged 21 years or over using\nForm 157N Nomination of a student guardian (291KB PDF)\n. This form outlines the documentation you need to provide when nominating a student guardian. Send this form, the education provider’s approval (in a letter or email) and the required documentation to us before you leave Australia; or\n2. the student’s education provider can take responsibility for their welfare by issuing a Confirmation of Appropriate Accommodation and Welfare (CAAW) letter which will state the start and end dates for approval of welfare arrangements.\nthe student’s education provider can take responsibility for their welfare by issuing a Confirmation of Appropriate Accommodation and Welfare (CAAW) letter which will state the start and end dates for approval of welfare arrangements.\n\nWe will tell you if the alternative welfare arrangements have been approved. If we decide that the welfare arrangements are not suitable, you cannot leave Australia without your nominating student.\n\nWe will tell you if the alternative welfare arrangements have been approved. If we decide that the welfare arrangements are not suitable, you cannot leave Australia without your nominating student.\n\n### 'No further stay' or 'further stay restricted' condition\n\n'No further stay' or 'further stay restricted' condition\nDetails\n\nYou must comply with the visa’s ‘no further stay’ condition. This means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\nYou must comply with the visa’s ‘no further stay’ condition. This means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\nYou must not work while in Australia. If you don’t abide by the conditions of your Guardian visa (subclass 580), your visa might be cancelled, and we could also cancel the nominating student’s visa.\n\nYou must not work while in Australia. If you don’t abide by the conditions of your Guardian visa (subclass 580), your visa might be cancelled, and we could also cancel the nominating student’s visa.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/guardian-visa-subclass-580#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/guardian-visa-subclass-580#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:39:47.494466",
  "metadata": {}
}