{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-visa-(subclass-885)",
  "title": "Skilled — Independent visa (subclass 885)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Skilled — Independent visa (subclass 885) Page Content The Skilled – Independent visa (subclass 885) closed to new applications on 1 January 2013. You must be in Australia when the visa is granted. Visa applicants Details This information is for people who have already applied for a Skilled – Independent visa (subclass 885). You cannot lodge a new application for this visa but if no decision has been made on your visa, members of the family unit can lodge a combined application. After you have applied Details After you have lodged your application and documents, we will acknowledge that we have received your information. We will also assign you a case officer who will consider your application and can request an interview, ask for more information and make a decision. Wait for a decision Details Your application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete. If you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a Bridging visa A , you can apply for Bridging visa B to travel outside Australia while you wait for a decision. Health and character requirements Details We will contact you when you need to provide health or character documents. Debts to the Australian Government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Provide more information Details You can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 - Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​ Withdrawing your application Details You can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number. ​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​ Visa decision Details If the visa is granted, we will let you know: when you can use the visa the visa grant number any conditions attached to the visa. Contact information Details ​If information needs to be updated, contact the Adelaide General Skilled Migration (GSM) processing centre .​​ Visa holders Details This information is for people who have already been granted a Skilled – Independent visa (subclass 885). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. What this visa lets you do Details This is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa: stay in Australia indefinitely work and study in Australia enrol in Medicare Australia's scheme for health-related care and expenses apply for Australian citizenship (if you are eligible) sponsor eligible relatives for permanent residence travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia). Your obligations Details You and your family must comply with all visa conditions and Australian laws.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Skilled — Independent visa (subclass 885)\n\nSkilled — Independent visa (subclass 885)\nPage Content\n\n​\n\n​\n\nThe Skilled – Independent visa (subclass 885) closed to new applications on 1 January 2013.\n\nThe Skilled – Independent visa (subclass 885) closed to new applications on 1 January 2013.\n\nYou must be in Australia when the visa is granted.\n\nYou must be in Australia when the visa is granted.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\nThis information is for people who have already applied for a Skilled – Independent visa (subclass 885).\n\nThis information is for people who have already applied for a Skilled – Independent visa (subclass 885).\n\nYou cannot lodge a new application for this visa but if no decision has been made on your visa, members of the family unit can lodge a combined application.\n\nYou cannot lodge a new application for this visa but if no decision has been made on your visa, members of the family unit can lodge a combined application.\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nAfter you have lodged your application and documents, we will acknowledge that we have received your information.\n\nWe will also assign you a case officer who will consider your application and can request an interview, ask for more information and make a decision.\n\nWe will also assign you a case officer who will consider your application and can request an interview, ask for more information and make a decision.\n\n#### Wait for a decision\n\nWait for a decision\nDetails\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including chest x-rays), if you need to provide more information, or if your application is incomplete.\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given aBridging visa A, you can apply forBridging visa Bto travel outside Australia while you wait for a decision.\n\nIf you apply for this visa in Australia, you would be able to get a Bridging visa that allows you to stay in the country lawfully while your application is processed. If you are given a\nBridging visa A\n, you can apply for\nBridging visa B\nto travel outside Australia while you wait for a decision.\n\n#### Health and character requirements\n\nHealth and character requirements\nDetails\n\nWe will contact you when you need to provide health or character documents.\n\nWe will contact you when you need to provide health or character documents.\n\n#### Debts to the Australian Government\n\nDebts to the Australian Government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 - Notification of incorrect answer(s) (168KB PDF)\nForm 1023 - Notification of incorrect answer(s) (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​\n\n#### Withdrawing your application\n\nWithdrawing your application\nDetails\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\nYou can withdraw the application at any time before we make a decision about it. To do this, send us a letter or email to ask for the withdrawal. Your request must include your full name and date of birth. You should also include your file reference number, client ID, or a Transaction Reference Number.\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n​​​All applicants 18 years of age or older, wishing to withdraw, must sign the request for withdrawal.​​​​​​\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf the visa is granted, we will let you know:\n\nIf the visa is granted, we will let you know:\n- when you can use the visa\nwhen you can use the visa\n- the visa grant number\nthe visa grant number\n- any conditions attached to the visa.\nany conditions attached to the visa.\n\n### Contact information\n\nContact information\nDetails\n\n​If information needs to be updated, contact theAdelaide General Skilled Migration (GSM) processing centre.​​\n\n​If information needs to be updated, contact the\nAdelaide General Skilled Migration (GSM) processing centre\n.​​\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Skilled – Independent visa (subclass 885). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Skilled – Independent visa (subclass 885). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n\nThis is a permanent residence visa. It lets you and any member of your family unit who has also been granted this visa:\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol inMedicareAustralia's scheme for health-related care and expenses\nenrol in\nMedicare\nAustralia's scheme for health-related care and expenses\n- apply for Australian citizenship (if you are eligible)\napply for Australian citizenship (if you are eligible)\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- travel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\ntravel to and from Australia for five years from the date the visa is granted (after that time, you will need a resident return visa or another visa to return to Australia).\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-visa-(subclass-885)#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-independent-visa-(subclass-885)#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:33:20.434962",
  "metadata": {}
}