{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-treatment-long-stay-visa-subclass-685",
  "title": "Medical Treatment Long Stay Visa (subclass 685)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Medical Treatment Long Stay Visa (subclass 685) Page Content ​​ The Medical Treatment Long Stay visa (subclass 685) closed to new applications on 23 March 2013. You might be able to get a Medical Treatment visa (subclass 602) If you already have the Medical Treatment Long Stay visa (subclass 685), it will be valid until the expiry date you were given when your visa was granted. Visa holders Details This information is for people who have already been granted a Medical Treatment Long Stay visa (subclass 685) or for people who applied for the visa before it was closed to new applications and for which a decision has not yet been made. It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details The Medical Treatment Long Stay visa (subclass 685) lasts until the date we gave you in the letter telling you were granted the visa. The intent is to give you time to have your medical treatment. Extending your stay Details You can apply for a further visa: if medical treatment will continue beyond your visa’s expiry date for a holiday, sightseeing, to visit friends or relatives or for other purposes. You must apply for and be granted your next visa before your current visa ends. What this visa lets you do Details This visa allows you to: stay in Australia for medical treatment study for up to three months, unless you are younger than 18 years old and your circumstances change while you are in Australia and there are compelling and compassionate circumstances for your need to study or train for more than three months. Your support Details If you already hold this visa, the following people might be able to join you in Australia by applying for a Medical Treatment visa (subclass 602): someone who wants to come with you to give you emotional and other support while you have your treatment. These people can apply for a Medical Treatment visa (subclass 602) using: Form 48ME Application to visit Australia for medical treatment In Australia: Post or fax your application to the Canberra office in Australian Capital Territory - attention Specialist Temporary Entry Centre. You can pay by credit card, debit card, bank cheque or money order made payable to the Department of Home Affairs. Outside Australia: Lodge your application at one of the immigration offices outside Australia Your obligations Details You and your family must comply with all visa conditions and Australian laws. You cannot work in Australia, except under limited circumstances. You can study for up to three months unless exceptions apply. Leave before your visa ends Details You are expected to leave Australia before your visa ends. You might be able to apply for another visa in Australia if you need more medical treatment. Medical Treatment visas are usually granted for a short time only, and you are expected to return to your home country. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Medical Treatment Long Stay Visa (subclass 685)\n\nMedical Treatment Long Stay Visa (subclass 685)\nPage Content\n\n​​\n\n​​\n\nThe Medical Treatment Long Stay visa (subclass 685) closed to new applications on 23 March 2013. You might be able to get aMedical Treatment visa (subclass 602).\n\nThe Medical Treatment Long Stay visa (subclass 685) closed to new applications on 23 March 2013. You might be able to get a\nMedical Treatment visa (subclass 602)\n.\n\nIf you already have the Medical Treatment Long Stay visa (subclass 685), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already have the Medical Treatment Long Stay visa (subclass 685), it will be valid until the expiry date you were given when your visa was granted.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Medical Treatment Long Stay visa (subclass 685) or for people who applied for the visa before it was closed to new applications and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Medical Treatment Long Stay visa (subclass 685) or for people who applied for the visa before it was closed to new applications and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThe Medical Treatment Long Stay visa (subclass 685) lasts until the date we gave you in the letter telling you were granted the visa. The intent is to give you time to have your medical treatment.\n\nThe Medical Treatment Long Stay visa (subclass 685) lasts until the date we gave you in the letter telling you were granted the visa. The intent is to give you time to have your medical treatment.\n\n### Extending your stay\n\nExtending your stay\nDetails\n\nYou can apply for a further visa:\n\nYou can apply for a further visa:\n- if medical treatment will continue beyond your visa’s expiry date\nif medical treatment will continue beyond your visa’s expiry date\n- for a holiday, sightseeing, to visit friends or relatives or for other purposes.\nfor a holiday, sightseeing, to visit friends or relatives or for other purposes.\n\nYou must apply for and be granted your next visa before your current visa ends.\n\nYou must apply for and be granted your next visa before your current visa ends.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to:\n\nThis visa allows you to:\n- stay in Australia for medical treatment\nstay in Australia for medical treatment\n- study for up to three months, unless you are younger than 18 years old and your circumstances change while you are in Australia and there are compelling and compassionate circumstances for your need to study or train for more than three months.\nstudy for up to three months, unless you are younger than 18 years old and your circumstances change while you are in Australia and there are compelling and compassionate circumstances for your need to study or train for more than three months.\n\n### Your support\n\nYour support\nDetails\n\nIf you already hold this visa, the following people might be able to join you in Australia by applying for a Medical Treatment visa (subclass 602):\n\nIf you already hold this visa, the following people might be able to join you in Australia by applying for a Medical Treatment visa (subclass 602):\n- someone who wants to come with you to give you emotional and other support while you have your treatment.\nsomeone who wants to come with you to give you emotional and other support while you have your treatment.\n\nThese people can apply for a Medical Treatment visa (subclass 602) using:\n\nThese people can apply for a Medical Treatment visa (subclass 602) using:\n- Form 48ME Application to visit Australia for medical treatment\nForm 48ME Application to visit Australia for medical treatment\n\nIn Australia:\n\nIn Australia:\n\nPost or fax your application to theCanberra officein Australian Capital Territory - attention Specialist Temporary Entry Centre. You can pay by credit card, debit card, bank cheque or money order made payable to the Department of Home Affairs.\n\nPost or fax your application to the\nCanberra office\nin Australian Capital Territory - attention Specialist Temporary Entry Centre. You can pay by credit card, debit card, bank cheque or money order made payable to the Department of Home Affairs.\n\nOutside Australia:\n\nOutside Australia:\n\nLodge your application at one of theimmigration offices outside Australia.\n\nLodge your application at one of the\nimmigration offices outside Australia\n.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws. You cannot work in Australia, except under limited circumstances. You can study for up to three months unless exceptions apply.\n\nYou and your family must comply with all visa conditions and Australian laws. You cannot work in Australia, except under limited circumstances. You can study for up to three months unless exceptions apply.\n\n#### Leave before your visa ends\n\nLeave before your visa ends\nDetails\n\nYou are expected to leave Australia before your visa ends. You might be able to apply for another visa in Australia if you need more medical treatment. Medical Treatment visas are usually granted for a short time only, and you are expected to return to your home country.\n\nYou are expected to leave Australia before your visa ends. You might be able to apply for another visa in Australia if you need more medical treatment. Medical Treatment visas are usually granted for a short time only, and you are expected to return to your home country.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-treatment-long-stay-visa-subclass-685#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-treatment-long-stay-visa-subclass-685#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:31:12.048643",
  "metadata": {}
}