{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101",
  "title": "Child visa",
  "raw_text": "===== main placeholder ========================================== Subclass 101 Child visa This visa lets a child outside Australia move to Australia to live with their parents. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay Permanently Cost From Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa the child can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible See all conditions Check your eligibility The child must: be a dependent child of a parent who is an Australian citizen, eligible New Zealand citizen or holder of an Australian permanent visa be under 18 years, a full-time student aged over 18 and under 25 and financially dependent on the parent, or over 18 and unable to work due to a disability be single and dependent on the parent be outside Australia when the application is made. The child may be eligible for COVID-19 visa concessions Help with your visa If you are getting help with your visa, before you pay someone, read information on who can help with your visa application About this visa With this visa the child can How long the child can stay Include other children Cost Apply from Processing times The child's obligations Visa label With this visa the child can stay in Australia indefinitely work and study in Australia enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible. Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility: they will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when the child's travel facility ends, use VEVO Adopted children To be granted this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent resident or eligible New Zealand citizen at the time of adoption. A child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an Adoption visa (subclass 102) How long the child can stay This is a permanent visa. It lets the child stay in Australia indefinitely. Include other children If the child has siblings who also want to apply, submit separate applications for each sibling. The child's dependent children can be included on their application when they apply or at any time before we decide the application. Dependent children of the child who apply for the visa must meet our health requirement Family members who are not coming to Australia might also have to meet our health requirement. Cost The visa costs for the main applicant. There is also a charge for each of the child's dependent children who apply for the visa. There might be other costs for health exams police certificates and biometrics To work out what the visa might cost use the Visa Pricing Estimator . The estimator does not take into account the other costs. Apply from The child must be outside Australia when the application is submitted. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. The application might take longer to process if: it is not filled in correctly it does not include all required documents or we need more information it takes us time to verify your information you do not make full payment at the time of initial lodgement. We cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application. You should receive an acknowledgement of your application within approximately one (1) month after lodgement. We will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application. The child's obligations The child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant. The child and their family members must meet all visa conditions and obey Australian laws. See what conditions might be attached to this visa on our visa conditions page Visa label We will digitally link the child's visa to their passport. They will not get a label in their passport. Eligibility Be dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder Details The child must be dependent on a parent who is: Australian citizen Eligible New Zealand citizen Australian permanent visa holder They can be their parent's: biological child adopted child stepchild (only from a former partner) A child does not meet the dependency requirement if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent. Adopted children To be eligible for this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption. A child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an Adoption visa (subclass 102) Stepchildren To be eligible for this visa, a stepchild must: be the child of their step-parent’s former partner be aged under 18. The step-parent must also have either: an Australian parenting order in force that says the child is to live with them and be looked after by them, or guardianship or custody of the child under an Australian law or the law of another country Citizenship by Descent The child may choose to apply for Australian citizenship by descent instead of a visa to travel to Australia, if: the child was born outside Australia one of their parents was an Australian citizen at the time of their child’s birth. Have a sponsor Details The child must be sponsored by an eligible parent or their parent's spouse or de facto partner. We must approve the sponsorship before the visa can be granted. If the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application. If the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances. Learn more about measures for the protection of children Be this age Details The child must be either: under 18 years old, or over 18 and under 25 years and studying full time, or over 18 years with a disability If the child is over 18 and under 25 years and studying full time Details If the child is over 18 and under 25 years old they: must be a full-time student when they apply and when the visa application is decided can't work full time must be financially dependent on their parent more than any other person The child is a full-time student if they are: enrolled in a full-time course that leads to a professional, trade or vocational qualification attending classes The child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained. If the child is over 18 years with a disability Details If the child is 18 years or older with a disability, they: must have totally or partially lost their bodily or mental functions can't work full time Have no partner Details The child can't be or ever have been: married or engaged to be married in a de facto relationship Meet the health requirement Details The child and any dependants who apply for the visa with them must meet our health requirement Dependent children who are not applying for the visa might also need to meet our health requirement. Meet the character requirement Details If the child is aged 16 years or over they must meet our character requirement We might also ask that other family members meet the requirement. Have paid back debt to the Australian Government Details If the child or any member of their family owes the Australian Government money it must be paid back or there must be a formal arrangement to pay it back. Sign the Australian values statement Details Children aged 18 or older must: have read, or had explained to them, the Life in Australia booklet sign the Australian Values Statement confirming they will obey Australian laws and respect the Australian way of life Have consent to migrate to Australia Details We will only grant this visa to a child younger than 18 years if either: the child has the written consent of everyone who can legally decide where they live, or the laws of the child’s home country allow them to leave their home country, or it is consistent with any Australian child order about the child Best interests of the child We might not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply Check the child's passport is valid. Tell us if someone is acting on the child's behalf. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide documents in support of the visa application. Show steps Provide accurate documents Provide accurate information. See what happens if the child's identity can't be established or false information is provided Identity documents Provide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if they have one proof of change of name Documents that prove a change of name include: change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names the child has been known by If the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate. See how Photographs Provide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application. Photographs must be: passport-size (45mm x 35mm) less than 6 months old good quality colour. We don't accept laser copies a full-face view of your head and shoulders taken against a plain light-coloured background The child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face. See how Travel documents Provide a certified copy of the passport or travel document the child will use to enter Australia and any passports the child has held since then. Applicant circumstances documents Depending on the child's situation, we might require other documents. See how Applicants aged 18 to 25 years and studying Provide evidence the child is enrolled as a full-time student and actively participating in a post-secondary course of study. Provide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies. Applicants aged 18 or older with disability Provide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working. Child's relationship to the parent Provide evidence the child is related to the parent, such as: a birth certificate a marriage certificate an adoption certificate a family status certificate or family book, if officially issued and maintained See how Financial documents If the child is over 18 when the application is made, provide evidence they are dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include: bank statements money transfers rent receipts See how Dependants under 18 documents For every dependant under 18 years old who is applying with the child, provide: identity documents travel documents proof of their relationship with the child such as a birth certificate character documents, if applicable See how Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives. They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years a statutory declaration giving their consent for the child to stay Australia on this visa Include an identity document with the signature and photo of the person who completed the form or declaration, such as a: passport driver’s licence Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of the child's home country allow them to leave their home country See how Character documents Children over 16 years must provide police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16. For Australia, we only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. The Australian Federal Police issue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police. For immigration purposes, police certificates are valid for 12 months from the issue date. If anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers. Children over 16 years must complete and provide Form 80 Personal particulars for assessment including character assessment See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person Send written notification or your forms with your paper application. See how Prepare the documents See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating. These details must be in English. See how Certify Have all documents certified . This includes: non-English documents English translations Photographs of the child and any of their dependent children included in the application must also be certified. See how Keep Keep a copy of the completed application. Send Send us: certified copies of all documents as much information as possible to help us decide the application each document only once, even if it is evidence of more than one thing all documents with the application See how Step 3 Apply for the visa You must apply for this visa on paper. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove the child's identity or don't provide true information Apply on paper Complete the following 2 forms and send them together by post (with correct prepaid postage) or by courier to the Child and Other Family Processing Centre in Perth. You must pay the application charge before you post your application . See how to pay We will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge and all the relevant supporting documentation. Form 47CH Application for migration to Australia by a child Form 40CH Sponsorship for a child to migrate to Australia If you submit your application at any other office or in any other way, it will not be a valid application and cannot be considered further. Applications for this visa cannot be submitted in person. The forms must be completed in English. By post (with correct prepaid postage) Department of Home Affairs Child and Other Family Processing Centre Locked Bag 7 NORTHBRIDGE WA 6865 By courier: Department of Home Affairs Child and Other Family Processing Centre Wellington Central 836 Wellington Street WEST PERTH WA 6005 If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After you apply We will let you know when we have received your application and documents. There might be other things you need to do and be aware of after you apply. Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 1 April 2020. See how Status updates We can't provide updates on the progress of the application within global visa processing times . We will tell you if we need anything more. See how Travel Do not arrange for the child to migrate to Australia until we let you know, in writing, that we have granted the visa. See how Health exams We will tell you when to arrange the child’s health examinations See how Biometrics We might ask for biometrics . We will tell you if you need to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount If you can’t use ImmiAccount, or you lodged the application outside of Australia before 1 April 2020, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre online form See how Add family members You can add a child's dependent child to their visa application any time before we make a decision. See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Tell us as soon as you can if you have made a mistake on the application. Complete Form 1023 Notification of incorrect answers If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to the Child and Orphan Relative Visa Processing Centre online form See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre online form For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after the child has applied include: changes to your phone number, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application. See how to tell us if your situation changes See how Step 5 Visa outcome We can grant a visa to any child who is outside Australia and meets the visa grant requirements. This may not apply if you are eligible for a COVID-19 visa concession We will tell you our decision in writing. Keep a copy of the decision. If we grant the child’s visa, we will tell you: the visa grant number the date the visa starts the visa conditions, if applicable the date by which the child must enter Australia, if they are outside Australia when we grant the visa If we refuse the child’s visa, we will tell you: why we refused the visa whether there is a right to a review of the decision We will not refund the application fee if we refuse the application. When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia Before the child travels Check travel documents The child must have: a valid visa to enter Australia a valid passport or other travel document. Arrive before first entry arrival date The child must enter Australia before the date specified in their grant letter. At the border Complete an Incoming Passenger Card All people arriving into Australia must complete the Incoming Passenger Card Use the SmartGate We have an automated process that uses facial recognition technology and your ePassport. Children aged 16 or over might be able to leave the airport using the SmartGate In Australia The child's obligations The child and their family members must meet all visa conditions and obey Australian laws. You can check visa details and conditions in VEVO See how long the child can stay This is a permanent visa. The child can stay in Australia indefinitely. For citizenship purposes, the child's permanent residence starts on the day they enter Australia. Access Australian Government benefits As a newly arrived resident the child might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods from Services Australia Tell us if things change We need to know about: changes to the child's passport the birth of a child change of name See how to let us know if there is a change in the child's situation Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility: they will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when the child's travel facility ends, use VEVO Work and study The child might be able to work or study in Australia from the date we grant this visa. If the child works, they are protected by Australian workplace law. See their workplace rights and entitlements Bring a family member Dependants can't be added to this visa after we have made a decision. To find a visa for a family member, explore visa options Become an Australian citizen After a certain time, the child might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, the child's permanent residence starts the day they entered Australia on this visa. Leaving Australia Before you leave Check the child's travel documents The child must have a valid passport or other travel document to leave Australia. Check if the child needs a Resident Return visa to return to Australia as a permanent resident in VEVO At the border Leave the airport faster We have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using the SmartGate After you leave Prove the child has been to Australia Request the child's international movement records to get proof of their travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 101\n\n# Child visa\n\nChild visa\n\nThis visa lets a child outside Australia move to Australia to live with their parents.\n\nThis visa lets a child outside Australia move to Australia to live with their parents.\n\nThis visa lets a child outside Australia move to Australia to live with their parents.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFrom\n\nFrom\n\nFrom\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible\napply for\nAustralian citizenship\n, if eligible\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### The child must:\n\nThe child must:\n- be a dependent child of a parent who is an Australian citizen, eligible New Zealand citizen or holder of an Australian permanent visa\nbe a dependent child of a parent who is an Australian citizen, eligible New Zealand citizen or holder of an Australian permanent visa\n- be under 18 years, a full-time student aged over 18 and under 25 and financially dependent on the parent, or over 18 and unable to work due to a disability\nbe under 18 years, a full-time student aged over 18 and under 25 and financially dependent on the parent, or over 18 and unable to work due to a disability\n- be single and dependent on the parent\nbe single and dependent on the parent\n- be outside Australia when the application is made.\nbe outside Australia when the application is made.\n\nThe child may be eligible forCOVID-19 visa concessions.\n\nThe child may be eligible for\nCOVID-19 visa concessions\n.\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onwho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nwho can help with your visa application\n.\nAbout this visa\nWith this visa the child can\nHow long the child can stay\nInclude other children\nCost\nApply from\nProcessing times\nThe child's obligations\nVisa label\n\n## With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia\nwork and study in Australia\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible.\napply for\nAustralian citizenship\n, if eligible.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility:\n\nIf the child wants to travel after the initial 5-year travel facility:\n- they will need to apply for and be granted aResident Return (RRV)visa so they can re-enter Australia as a permanent resident\nthey will need to apply for and be granted a\nResident Return (RRV)\nvisa so they can re-enter Australia as a permanent resident\n- they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n### Adopted children\n\nAdopted children\n\nTo be granted this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent resident or eligible New Zealand citizen at the time of adoption.\n\nTo be granted this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent resident or eligible New Zealand citizen at the time of adoption.\n\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for anAdoption visa (subclass 102).\n\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an\nAdoption visa (subclass 102)\n.\n\n## How long the child can stay\n\nHow long the child can stay\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\n## Include other children\n\nInclude other children\n\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\n\nIf the child has siblings who also want to apply, submit separate applications for each sibling.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nDependent children of the child who apply for the visa must meet ourhealth requirement.\n\nDependent children of the child who apply for the visa must meet our\nhealth requirement\n.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\n## Cost\n\nCost\n\nThe visa costsfor the main applicant.\n\nThe visa costs\nfor the main applicant.\n\nThere is also a charge for each of the child's dependent children who apply for the visa.\n\nThere is also a charge for each of the child's dependent children who apply for the visa.\n\nThere might be other costs forhealth exams,police certificatesandbiometrics.\n\nThere might be other costs for\nhealth exams\n,\npolice certificates\nand\nbiometrics\n.\n\nTo work out what the visa might cost use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what the visa might cost use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nThe child must be outside Australia when the application is submitted.\n\nThe child must be outside Australia when the application is submitted.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nThe application might take longer to process if:\n\nThe application might take longer to process if:\n- it is not filled in correctly\nit is not filled in correctly\n- it does not include all required documents or we need more information\nit does not include all required documents or we need more information\n- it takes us time to verify your information\nit takes us time to verify your information\n- you do not make full payment at the time of initial lodgement.\nyou do not make full payment at the time of initial lodgement.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nYou should receive an acknowledgement of your application within approximately one (1) month after lodgement.\n\nYou should receive an acknowledgement of your application within approximately one (1) month after lodgement.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\n## The child's obligations\n\nThe child's obligations\n\nThe child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant.\n\nThe child must enter Australia before the date specified in their grant letter. The first entry date is generally set at 12 months from the date of visa grant.\n\nThe child and their family members must meet all visa conditions and obey Australian laws.\n\nThe child and their family members must meet all visa conditions and obey Australian laws.\n\nSee what conditions might be attached to this visa on ourvisa conditions page.\n\nSee what conditions might be attached to this visa on our\nvisa conditions page\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\n\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\nEligibility\n\n## Be dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder\n\nBe dependent on their parent who is an Australian citizen, eligible New Zealand citizen or Australian permanent visa holder\nDetails\n\nThechildmust be dependent on a parent who is:\n\nThe\nchild\nmust be dependent on a parent who is:\n- Australian citizen\nAustralian citizen\n- Eligible New Zealand citizen\nEligible New Zealand citizen\n- Australian permanent visa holder\nAustralian permanent visa holder\n\nThey can be their parent's:\n\nThey can be their parent's:\n- biological child\nbiological child\n- adopted child\nadopted child\n- stepchild (only from a former partner)\nstepchild (only from a former partner)\n\nA child does not meet the dependency requirement if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent.\n\nA child does not meet the dependency requirement if the stepparent is the current spouse or de facto partner of the child’s biological or adopted parent.\n\n### Adopted children\n\nAdopted children\n\nTo be eligible for this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption.\n\nTo be eligible for this visa, an adopted child must have been adopted before they turned 18 by a parent who was not an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption.\n\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for anAdoption visa (subclass 102).\n\nA child adopted before they turned 18 by a parent who was already an Australian citizen, permanent visa holder or eligible New Zealand citizen at the time of adoption might be eligible for an\nAdoption visa (subclass 102)\n.\n\n### Stepchildren\n\nStepchildren\n\nTo be eligible for this visa, a stepchild must:\n\nTo be eligible for this visa, a stepchild must:\n- be the child of their step-parent’s former partner\nbe the child of their step-parent’s former partner\n- be aged under 18.\nbe aged under 18.\n\nThe step-parent must also have either:\n\nThe step-parent must also have either:\n- an Australian parenting order in force that says the child is to live with them and be looked after by them, or\nan Australian parenting order in force that says the child is to live with them and be looked after by them, or\n- guardianship or custody of the child under an Australian law or the law of another country\nguardianship or custody of the child under an Australian law or the law of another country\n\n### Citizenship by Descent\n\nCitizenship by Descent\n\nThe child may choose to apply forAustralian citizenship by descentinstead of a visa to travel to Australia, if:\n\nThe child may choose to apply for\nAustralian citizenship by descent\ninstead of a visa to travel to Australia, if:\n- the child was born outside Australia\nthe child was born outside Australia\n- one of their parents was an Australian citizen at the time of their child’s birth.\none of their parents was an Australian citizen at the time of their child’s birth.\n\n## Have a sponsor\n\nHave a sponsor\nDetails\n\nThe child must be sponsored by an eligible parent or their parent's spouse or de facto partner.\n\nThe child must be sponsored by an eligible parent or their parent's spouse or de facto partner.\n\nWe must approve the sponsorship before the visa can be granted.\n\nWe must approve the sponsorship before the visa can be granted.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nLearn more aboutmeasures for the protection of children.\n\nLearn more about\nmeasures for the protection of children\n.\n\n## Be this age\n\nBe this age\nDetails\n\nThe child must be either:\n\nThe child must be either:\n- under 18 years old, or\nunder 18 years old, or\n- over 18 and under 25 years and studying full time, or\nover 18 and under 25 years and studying full time, or\n- over 18 years with a disability\nover 18 years with a disability\n\n### If the child is over 18 and under 25 years and studying full time\n\nIf the child is over 18 and under 25 years and studying full time\nDetails\n\nIf the child is over 18 and under 25 years old they:\n\nIf the child is over 18 and under 25 years old they:\n- must be a full-time student when they apply and when the visa application is decided\nmust be a full-time student when they apply and when the visa application is decided\n- can't work full time\ncan't work full time\n- must be financially dependent on their parent more than any other person\nmust be financially dependent on their parent more than any other person\n\nThe child is a full-time student if they are:\n\nThe child is a full-time student if they are:\n- enrolled in a full-time course that leads to a professional, trade or vocational qualification\nenrolled in a full-time course that leads to a professional, trade or vocational qualification\n- attending classes\nattending classes\n\nThe child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained.\n\nThe child should have started study since turning 18 years of age or within 6 months (or a reasonable time) of finishing school. Any gaps of more than 6 months between their final year of school and the start of their further studies must be explained.\n\n### If the child is over 18 years with a disability\n\nIf the child is over 18 years with a disability\nDetails\n\nIf the child is 18 years or older with a disability, they:\n\nIf the child is 18 years or older with a disability, they:\n- must have totally or partially lost their bodily or mental functions\nmust have totally or partially lost their bodily or mental functions\n- can't work full time\ncan't work full time\n\n## Have no partner\n\nHave no partner\nDetails\n\nThe child can't be or ever have been:\n\nThe child can't be or ever have been:\n- married or engaged to be married\nmarried or engaged to be married\n- in a de facto relationship\nin a de facto relationship\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nThe child and any dependants who apply for the visa with them must meet ourhealth requirement.\n\nThe child and any dependants who apply for the visa with them must meet our\nhealth requirement\n.\n\nDependent children who are not applying for the visa might also need to meet our health requirement.\n\nDependent children who are not applying for the visa might also need to meet our health requirement.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nIf the child is aged 16 years or over they must meet ourcharacter requirement.\n\nIf the child is aged 16 years or over they must meet our\ncharacter requirement\n.\n\nWe might also ask that other family members meet the requirement.\n\nWe might also ask that other family members meet the requirement.\n\n## Have paid back debt to the Australian Government\n\nHave paid back debt to the Australian Government\nDetails\n\nIf the child or any member of their family owes the Australian Government money it must be paid back or there must be a formal arrangement to pay it back.\n\nIf the child or any member of their family owes the Australian Government money it must be paid back or there must be a formal arrangement to pay it back.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nChildren aged 18 or older must:\n\nChildren aged 18 or older must:\n- have read, or had explained to them, theLife in Australiabooklet\nhave read, or had explained to them, the\nLife in Australia\nbooklet\n- sign theAustralian Values Statementconfirming they will obey Australian laws and respect the Australian way of life\nsign the\nAustralian Values Statement\nconfirming they will obey Australian laws and respect the Australian way of life\n\n## Have consent to migrate to Australia\n\nHave consent to migrate to Australia\nDetails\n\nWe will only grant this visa to a child younger than 18 years if either:\n\nWe will only grant this visa to a child younger than 18 years if either:\n- the child has the written consent of everyone who can legally decide where they live, or\nthe child has the written consent of everyone who can legally decide where they live, or\n- the laws of the child’s home country allow them to leave their home country, or\nthe laws of the child’s home country allow them to leave their home country, or\n- it is consistent with anyAustralian child orderabout the child\nit is consistent with any\nAustralian child order\nabout the child\n\n## Best interests of the child\n\nBest interests of the child\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide documents in support of the visa application.\n\nProvide documents in support of the visa application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if the child's identity can't be established orfalse information is provided.\n\nProvide accurate information. See what happens if the child's identity can't be established or\nfalse information is provided\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if they have one\na national identity card, if they have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names the child has been known by\ndocuments that show other names the child has been known by\n\nIf the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate.\n\nIf the child was adopted, provide certified copies of the adoption papers or the adoption compliance certificate.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application.\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any dependent child included in the application.\n\nPhotographs must be:\n\nPhotographs must be:\n- passport-size (45mm x 35mm)\npassport-size (45mm x 35mm)\n- less than 6 months old\nless than 6 months old\n- good quality colour. We don't accept laser copies\ngood quality colour. We don't accept laser copies\n- a full-face view of your head and shoulders\na full-face view of your head and shoulders\n- taken against a plain light-coloured background\ntaken against a plain light-coloured background\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\nSee how\n\n#### Travel documents\n\nTravel documents\n\nProvide a certified copy of the passport or travel document the child will use to enter Australia and any passports the child has held since then.\n\nProvide a certified copy of the passport or travel document the child will use to enter Australia and any passports the child has held since then.\n\n#### Applicant circumstances documents\n\nApplicant circumstances documents\n\nDepending on the child's situation, we might require other documents.\n\nDepending on the child's situation, we might require other documents.\nSee how\n\n#### Applicants aged 18 to 25 years and studying\n\nApplicants aged 18 to 25 years and studying\n\nProvide evidence the child is enrolled as a full-time student and actively participating in a post-secondary course of study.\n\nProvide evidence the child is enrolled as a full-time student and actively participating in a post-secondary course of study.\n\nProvide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies.\n\nProvide a statement to explain any gaps longer than 6 months between their final year of secondary school and further studies.\n\n#### Applicants aged 18 or older with disability\n\nApplicants aged 18 or older with disability\n\nProvide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working.\n\nProvide evidence from a qualified medical practitioner the applicant has a total or partial loss of mental or body function that stops them from working.\n\n#### Child's relationship to the parent\n\nChild's relationship to the parent\n\nProvide evidence the child is related to the parent, such as:\n\nProvide evidence the child is related to the parent, such as:\n- a birth certificate\na birth certificate\n- a marriage certificate\na marriage certificate\n- an adoption certificate\nan adoption certificate\n- a family status certificate or family book, if officially issued and maintained\na family status certificate or family book, if officially issued and maintained\nSee how\n\n#### Financial documents\n\nFinancial documents\n\nIf the child is over 18 when the application is made, provide evidence they are dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\n\nIf the child is over 18 when the application is made, provide evidence they are dependent on their parent for basic needs such as food, shelter and clothing, and how long this support has been provided. Evidence could include:\n- bank statements\nbank statements\n- money transfers\nmoney transfers\n- rent receipts\nrent receipts\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant under 18 years old who is applying with the child, provide:\n\nFor every dependant under 18 years old who is applying with the child, provide:\n- identity documents\nidentity documents\n- travel documents\ntravel documents\n- proof of their relationship with the child such as a birth certificate\nproof of their relationship with the child such as a birth certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who has a legal right to decide where the child lives.\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years\n- a statutory declaration giving their consent for the child to stay Australia on this visa\na statutory declaration giving their consent for the child to stay Australia on this visa\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration, such as a:\n- passport\npassport\n- driver’s licence\ndriver’s licence\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of the child's home country allow them to leave their home country\nthat the laws of the child's home country allow them to leave their home country\nSee how\n\n#### Character documents\n\nCharacter documents\n\nChildren over 16 years must provide  police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16.\n\nChildren over 16 years must provide  police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16.\n\nFor Australia, we only accept National Police Certificates applied for underCode 33 – Immigration/Citizenship.TheAustralian Federal Policeissue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\n\nFor Australia, we only accept National Police Certificates applied for under\nCode 33 – Immigration/Citizenship.\nThe\nAustralian Federal Police\nissue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nIf anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers.\n\nIf anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers.\n\nChildren over 16 years must complete and provideForm 80 Personal particulars for assessment including character assessment.\n\nChildren over 16 years must complete and provide\nForm 80 Personal particulars for assessment including character assessment\n.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare the documents\n\nPrepare the documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating.\nqualifications and experience in the language they are translating.\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nHave all documentscertified. This includes:\n\nHave all documents\ncertified\n. This includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\n\nPhotographs of the child and any of their dependent children included in the application must also be certified.\n\nPhotographs of the child and any of their dependent children included in the application must also be certified.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of the completed application.\n\nKeep a copy of the completed application.\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- certified copies of all documents\ncertified copies of all documents\n- as much information as possible to help us decide the application\nas much information as possible to help us decide the application\n- each document only once, even if it is evidence of more than one thing\neach document only once, even if it is evidence of more than one thing\n- all documents with the application\nall documents with the application\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa on paper.\n\nYou must apply for this visa on paper.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove the child's identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove the child's identity or don't provide true information\n.\n\n#### Apply on paper\n\nApply on paper\n\nComplete the following 2 forms and send them together by post (with correct prepaid postage) or by courier to the Child and Other Family Processing Centre in Perth.\n\nComplete the following 2 forms and send them together by post (with correct prepaid postage) or by courier to the Child and Other Family Processing Centre in Perth.\n\nYou must pay the application chargebefore you post your application. Seehow to pay.\n\nYou must pay the application charge\nbefore you post your application\n. See\nhow to pay\n.\n\nWe will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge and all the relevant supporting documentation.\n\nWe will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge and all the relevant supporting documentation.\n- Form 47CH Application for migration to Australia by a child\nForm 47CH Application for migration to Australia by a child\n- Form 40CH Sponsorship for a child to migrate to Australia\nForm 40CH Sponsorship for a child to migrate to Australia\n\nIf you submit your application at any other office or in any other way, it will not be a valid application and cannot be considered further.  Applications for this visa cannot be submitted in person.\n\nIf you submit your application at any other office or in any other way, it will not be a valid application and cannot be considered further.  Applications for this visa cannot be submitted in person.\n\nThe forms must be completed in English.\n\nThe forms must be completed in English.\n\nBy post (with correct prepaid postage):\n\nBy post (with correct prepaid postage)\n:\n\nDepartment of Home AffairsChild and Other Family Processing CentreLocked Bag 7NORTHBRIDGE WA 6865\n\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nLocked Bag 7\nNORTHBRIDGE WA 6865\n\nBy courier:\n\nBy courier:\n\nDepartment of Home AffairsChild and Other Family Processing CentreWellington Central836 Wellington StreetWEST PERTH WA 6005\n\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nWellington Central\n836 Wellington Street\nWEST PERTH WA 6005\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application and documents. There might be other things you need to do and be aware of after you apply.\n\nWe will let you know when we have received your application and documents. There might be other things you need to do and be aware of after you apply.\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 1 April 2020.\n\nYou can import any new and existing applications for this visa made in Australia. You can also import existing applications made outside Australia on or after 1 April 2020.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't provide updates on the progress of the application withinglobal visa processing times. We will tell you if we need anything more.\n\nWe can't provide updates on the progress of the application within\nglobal visa processing times\n. We will tell you if we need anything more.\nSee how\n\n#### Travel\n\nTravel\n\nDo not arrange for the child to migrate to Australia until we let you know, in writing, that we have granted the visa.\n\nDo not arrange for the child to migrate to Australia until we let you know, in writing, that we have granted the visa.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will tell you when to arrange the child’shealth examinations.\n\nWe will tell you when to arrange the child’s\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will tell you if you need to provide them.\n\nWe might ask for\nbiometrics\n. We will tell you if you need to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you can’t use ImmiAccount, or you lodged the application outside of Australiabefore 1 April 2020,to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, or you lodged the application outside of Australia\nbefore 1 April 2020,\nto provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can add a child'sdependent childto their visa application any time before we make a decision.\n\nYou can add a child's\ndependent child\nto their visa application any time before we make a decision.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nTell us as soon as you can if you have made a mistake on the application.\n\nTell us as soon as you can if you have made a mistake on the application.\n\nCompleteForm 1023 Notification of incorrect answers.\n\nComplete\nForm 1023 Notification of incorrect answers\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to the Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to the Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person.\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after the child has applied include:\n\nThings you need to let us know about after the child has applied include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nSee how to tell us ifyour situation changes.\n\nSee how to tell us if\nyour situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe can grant a visa to any child who is outside Australia and meets the visa grant requirements.\n\nWe can grant a visa to any child who is outside Australia and meets the visa grant requirements.\n\nThis may not apply if you are eligible for aCOVID-19 visa concession.\n\nThis may not apply if you are eligible for a\nCOVID-19 visa concession\n.\n\nWe will tell you our decision in writing. Keep a copy of the decision.\n\nWe will tell you our decision in writing. Keep a copy of the decision.\n\nIf we grant the child’s visa, we will tell you:\n\nIf we grant the child’s visa, we will tell you:\n- the visa grant number\nthe visa grant number\n- the date the visa starts\nthe date the visa starts\n- the visa conditions, if applicable\nthe visa conditions, if applicable\n- the date by which the child must enter Australia, if they are outside Australia when we grant the visa\nthe date by which the child must enter Australia, if they are outside Australia when we grant the visa\n\nIf we refuse the child’s visa, we will tell you:\n\nIf we refuse the child’s visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether there is a right to a review of the decision\nwhether there is a right to a review of the decision\n\nWe will not refund the application fee if we refuse the application.\n\nWe will not refund the application fee if we refuse the application.\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\n### Before the child travels\n\nBefore the child travels\n\n#### Check travel documents\n\nCheck travel documents\n\nThe child must have:\n\nThe child must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document.\na valid passport or other travel document.\n\n#### Arrive before first entry arrival date\n\nArrive before first entry arrival date\n\nThe child must enter Australia before the date specified in their grant letter.\n\nThe child must enter Australia before the date specified in their grant letter.\n\n### At the border\n\nAt the border\n\n#### Complete an Incoming Passenger Card\n\nComplete an Incoming Passenger Card\n\nAll people arriving into Australia must complete theIncoming Passenger Card.\n\nAll people arriving into Australia must complete the\nIncoming Passenger Card\n.\n\n#### Use the SmartGate\n\nUse the SmartGate\n\nWe have an automated process that uses facial recognition technology and your ePassport. Children aged 16 or over might be able to leave the airport using theSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. Children aged 16 or over might be able to leave the airport using the\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### The child's obligations\n\nThe child's obligations\n\nThe child and their family members must meet all visa conditions and obey Australian laws.\n\nThe child and their family members must meet all visa conditions and obey Australian laws.\n\nYou can check visa details and conditions inVEVO.\n\nYou can check visa details and conditions in\nVEVO\n.\n\n### See how long the child can stay\n\nSee how long the child can stay\n\nThis is a permanent visa. The child can stay in Australia indefinitely.\n\nThis is a permanent visa. The child can stay in Australia indefinitely.\n\nFor citizenship purposes, the child's permanent residence starts on the day they enter Australia.\n\nFor citizenship purposes, the child's permanent residence starts on the day they enter Australia.\n\n### Access Australian Government benefits\n\nAccess Australian Government benefits\n\nAs a newly arrived resident the child might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods fromServices Australia.\n\nAs a newly arrived resident the child might have to wait to access certain Australian Government payments and benefits. Learn more about newly arrived residents' waiting periods from\nServices Australia\n.\n\n### Tell us if things change\n\nTell us if things change\n\nWe need to know about:\n\nWe need to know about:\n- changes to the child's passport\nchanges to the child's passport\n- the birth of a child\nthe birth of a child\n- change of name\nchange of name\n\nSee how to let us know if there is achange in the child's situation.\n\nSee how to let us know if there is a\nchange in the child's situation\n.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility:\n\nIf the child wants to travel after the initial 5-year travel facility:\n- they will need to apply for and be granted aResident Return (RRV)visa so they can re-enter Australia as a permanent resident\nthey will need to apply for and be granted a\nResident Return (RRV)\nvisa so they can re-enter Australia as a permanent resident\n- they might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\nthey might also want to consider Australian citizenship. If they become an Australian citizen, they don't require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n### Work and study\n\nWork and study\n\nThe child might be able to work or study in Australia from the date we grant this visa. If the child works, they are protected by Australian workplace law.See their workplace rights and entitlements.\n\nThe child might be able to work or study in Australia from the date we grant this visa. If the child works, they are protected by Australian workplace law.\nSee their workplace rights and entitlements\n.\n\n### Bring a family member\n\nBring a family member\n\nDependants can't be added to this visa after we have made a decision.\n\nDependants can't be added to this visa after we have made a decision.\n\nTo find a visa for a family member,explore visa options.\n\nTo find a visa for a family member,\nexplore visa options\n.\n\n### Become an Australian citizen\n\nBecome an Australian citizen\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, the child's permanent residence starts the day they entered Australia on this visa.\n\nFor citizenship purposes, the child's permanent residence starts the day they entered Australia on this visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check the child's travel documents\n\nCheck the child's travel documents\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident inVEVO.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident in\nVEVO\n.\n\n### At the border\n\nAt the border\n\n#### Leave the airport faster\n\nLeave the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using theSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using the\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Prove the child has been to Australia\n\nProve the child has been to Australia\n\nRequest the child's international movement recordsto get proof of their travel in and out of Australia.\n\nRequest the child's international movement records\nto get proof of their travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101/measures-for-the-protection-of-children",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/child-101#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:06:20.285083",
  "metadata": {}
}