{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/tourist-visa-676",
  "title": "Tourist visa (subclass 676)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Tourist visa (subclass 676) Page Content ​​ The Tourist visa (subclass 676) is closed to new applications. You may be eligible to apply for a Visitor visa (subclass 600) This visa allows you either a single or multiple entries to Australia and to stay in Australia for a period of time determined by the Department. Visa holders Details This information is for people who have already been granted a Tourist visa (subclass 676). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details When your visa was granted, we told you how long it lets you stay in Australia. We also told you how many times you can enter Australia on this visa: You might be allowed to enter Australia only once. If so, you will need to apply for a new visa if you want to return to Australia again after you leave. You might be able to travel to and from Australia as many times as you want while your visa is valid, but the time you spend in Australia cannot be more than the period of stay that you have been granted. Your obligations Details You must comply with all visa conditions and Australian laws. Visa conditions Details You must comply with the following visa conditions: Unless you were granted a visa that specifically allows you to work, you must not work while in Australia. You might be able to do some volunteer work, but only if an Australian resident would not otherwise be paid to do the work (you can be reimbused for out-of-pocket expenses such as meals and accommodation). You must not study for more than three months while in Australia. You might also need to maintain adequate health insurance while you are in Australia. Extending your stay Details If you are in Australia and want to extend your stay for tourism purposes, you might be able to apply for a Visitor visa (subclass 600) . If you are able to apply, you should do so at least two weeks before your current visa expires. If your Tourist visa (subclass 676) has a 'No further stay condition', you cannot apply for a Visitor visa(subclass 600). Visitor visa (subclass 600) can be granted if you: substantially complied with the conditions of your previous visa meet all the eligibility criteria for this visa do not have a Condition 8503 ('No further stay') on your visa. If you hold a Visitor visa or a Working Holiday visa, you can only extend your stay in Australia so that the total duration of your stay is 12 months or less, unless there are exceptional circumstances. If you hold a Visitor or Working Holiday visa that lets you stay in Australia for 12 months, contact your nearest Australian visa office before applying for another visa. If you are granted another visa, it will cease any visa or ETA you currently hold and the entitlements attached to it. If a decision has not been made on your application before your original visa expires, you will be able to stay in Australia until the application has been finalised. If you are refused another visa, you must leave Australia before the expiry of your authorised stay period.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Tourist visa (subclass 676)\n\nTourist visa (subclass 676)\nPage Content\n\n​​\n\n​​\n\nThe Tourist visa (subclass 676) is closed to new applications. You may be eligible to apply for aVisitor visa (subclass 600).\n\nThe Tourist visa (subclass 676) is closed to new applications. You may be eligible to apply for a\nVisitor visa (subclass 600)\n.\n\nThis visa allows you either a single or multiple entries to Australia and to stay in Australia for a period of time determined by the Department.\n\nThis visa allows you either a single or multiple entries to Australia and to stay in Australia for a period of time determined by the Department.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Tourist visa (subclass 676). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Tourist visa (subclass 676). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nWhen your visa was granted, we told you how long it lets you stay in Australia.\n\nWhen your visa was granted, we told you how long it lets you stay in Australia.\n\nWe also told you how many times you can enter Australia on this visa:\n\nWe also told you how many times you can enter Australia on this visa:\n- You might be allowed to enter Australia only once. If so, you will need to apply for a new visa if you want to return to Australia again after you leave.\nYou might be allowed to enter Australia only once. If so, you will need to apply for a new visa if you want to return to Australia again after you leave.\n- You might be able to travel to and from Australia as many times as you want while your visa is valid, but the time you spend in Australia cannot be more than the period of stay that you have been granted.\nYou might be able to travel to and from Australia as many times as you want while your visa is valid, but the time you spend in Australia cannot be more than the period of stay that you have been granted.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou must comply with all visa conditions and Australian laws.\n\nYou must comply with all visa conditions and Australian laws.\n\n#### Visa conditions\n\nVisa conditions\nDetails\n\nYou must comply with the following visa conditions:\n\nYou must comply with the following visa conditions:\n- Unless you were granted a visa that specifically allows you to work, you must not work while in Australia. You might be able to do some volunteer work, but only if an Australian resident would not otherwise be paid to do the work (you can be reimbused for out-of-pocket expenses such as meals and accommodation).\nUnless you were granted a visa that specifically allows you to work, you must not work while in Australia. You might be able to do some volunteer work, but only if an Australian resident would not otherwise be paid to do the work (you can be reimbused for out-of-pocket expenses such as meals and accommodation).\n- You must not study for more than three months while in Australia.\nYou must not study for more than three months while in Australia.\n\nYou might also need to maintainadequate health insurancewhile you are in Australia.\n\nYou might also need to maintain\nadequate health insurance\nwhile you are in Australia.\n\n#### Extending your stay\n\nExtending your stay\nDetails\n\nIf you are in Australia and want to extend your stay for tourism purposes, you might be able to apply for aVisitor visa (subclass 600). If you are able to apply, you should do so at least two weeks before your current visa expires. If your Tourist visa (subclass 676) has a 'No further stay condition', you cannot apply for a Visitor visa(subclass 600).\n\nIf you are in Australia and want to extend your stay for tourism purposes, you might be able to apply for a\nVisitor visa (subclass 600)\n. If you are able to apply, you should do so at least two weeks before your current visa expires. If your Tourist visa (subclass 676) has a 'No further stay condition', you cannot apply for a Visitor visa(subclass 600).\n\nAVisitor visa (subclass 600)can be granted if you:\n\nA\nVisitor visa (subclass 600)\ncan be granted if you:\n- substantially complied with the conditions of your previous visa\nsubstantially complied with the conditions of your previous visa\n- meet all the eligibility criteria for this visa\nmeet all the eligibility criteria for this visa\n- do not have a Condition 8503 ('No further stay') on your visa.\ndo not have a Condition 8503 ('No further stay') on your visa.\n\nIf you hold a Visitor visa or a Working Holiday visa, you can only extend your stay in Australia so that the total duration of your stay is 12 months or less, unless there are exceptional circumstances. If you hold a Visitor or Working Holiday visa that lets you stay in Australia for 12 months, contact your nearest Australian visa office before applying for another visa.\n\nIf you hold a Visitor visa or a Working Holiday visa, you can only extend your stay in Australia so that the total duration of your stay is 12 months or less, unless there are exceptional circumstances. If you hold a Visitor or Working Holiday visa that lets you stay in Australia for 12 months, contact your nearest Australian visa office before applying for another visa.\n\nIf you are granted another visa, it will cease any visa or ETA you currently hold and the entitlements attached to it.\n\nIf you are granted another visa, it will cease any visa or ETA you currently hold and the entitlements attached to it.\n\nIf a decision has not been made on your application before your original visa expires, you will be able to stay in Australia until the application has been finalised.\n\nIf a decision has not been made on your application before your original visa expires, you will be able to stay in Australia until the application has been finalised.\n\nIf you are refused another visa, you must leave Australia before the expiry of your authorised stay period.\n\nIf you are refused another visa, you must leave Australia before the expiry of your authorised stay period.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/tourist-visa-676#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/tourist-visa-676#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:36:41.830836",
  "metadata": {}
}