{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/electronic-travel-authority-business-entrant-subclass-956-and-977",
  "title": "Electronic Travel Authority (Business Entrant) (subclass 956 and 977)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Electronic Travel Authority (Business Entrant) (subclass 956 and 977) Page Content The Electronic Travel Authorities (Business Entrant – long validity) (subclass 956) and (Business Entrant – short validity) (subclass 977) closed to new applications on 22 March 2013. You might be able to apply for Electronic Travel Authority (subclass 601) Electronic travel authority holders Details This information is for people who have already been granted: an Electronic Travel Authority (Business Entrant – long validity) (subclass 956) an Electronic Travel Authority (Business Entrant – short validity) (subclass 977) It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your ETA status and entitlements. How long your electronic travel authority lasts Details Electronic Travel Authority (Business Entrant – long validity) subclass 956 Details You can stay in Australia for up to three months on each visit for the life of your passport. Electronic Travel Authority (Business Entrant – short validity) subclass 977 Details You can stay in Australia for up to three months on each visit within either: a 12-month period from the date of grant the life of the passport, if it is less than 12 months. Electronic travel authorities cannot be extended. If you want to extend your stay after arriving in Australia, you will need to apply for a different type of visa at least two weeks before your authority expires. What these ETAs let you do Details These authorities let you visit Australia for short-term business purposes, including: educational or business-related meetings, seminars, conventions, conferences or networking informal studies or training. You cannot work in Australia. If your main reason for coming to Australia is to work, you should apply for a different visa. Your obligations Details You must comply with all electronic travel authority conditions and Australian laws. You must also: be free from tuberculosis when you enter Australia not do work in Australia that an Australian citizen or permanent resident could do not study or train for more than three months not have any criminal convictions for which you were sentenced to a total of 12 months or more in prison, regardless of whether you went to prison or not. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Electronic Travel Authority (Business Entrant) (subclass 956 and 977)\n\nElectronic Travel Authority (Business Entrant) (subclass 956 and 977)\nPage Content\n\n​\n\n​\n\nThe Electronic Travel Authorities (Business Entrant – long validity) (subclass 956) and (Business Entrant – short validity) (subclass 977) closed to new applications on 22 March 2013.\n\nThe Electronic Travel Authorities (Business Entrant – long validity) (subclass 956) and (Business Entrant – short validity) (subclass 977) closed to new applications on 22 March 2013.\n\nYou might be able to apply forElectronic Travel Authority (subclass 601).\n\nYou might be able to apply for\nElectronic Travel Authority (subclass 601)\n.\n\n## Electronic travel authority holders\n\nElectronic travel authority holders\nDetails\n\nThis information is for people who have already been granted:\n\nThis information is for people who have already been granted:\n- an Electronic Travel Authority (Business Entrant – long validity) (subclass 956)\nan Electronic Travel Authority (Business Entrant – long validity) (subclass 956)\n- an Electronic Travel Authority (Business Entrant – short validity) (subclass 977)\nan Electronic Travel Authority (Business Entrant – short validity) (subclass 977)\n\nIt explains your rights and obligations.\n\nIt explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your ETA status and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your ETA status and entitlements.\n\n### How long your electronic travel authority lasts\n\nHow long your electronic travel authority lasts\nDetails\n\n#### Electronic Travel Authority (Business Entrant – long validity) subclass 956\n\nElectronic Travel Authority (Business Entrant – long validity) subclass 956\nDetails\n\nYou can stay in Australia for up to three months on each visit for the life of your passport.\n\nYou can stay in Australia for up to three months on each visit for the life of your passport.\n\n#### Electronic Travel Authority (Business Entrant – short validity) subclass 977\n\nElectronic Travel Authority (Business Entrant – short validity) subclass 977\nDetails\n\nYou can stay in Australia for up to three months on each visit within either:\n\nYou can stay in Australia for up to three months on each visit within either:\n- a 12-month period from the date of grant\na 12-month period from the date of grant\n- the life of the passport, if it is less than 12 months.\nthe life of the passport, if it is less than 12 months.\n\nElectronic travel authorities cannot be extended. If you want to extend your stay after arriving in Australia, you will need to apply for a different type of visa at least two weeks before your authority expires.\n\nElectronic travel authorities cannot be extended. If you want to extend your stay after arriving in Australia, you will need to apply for a different type of visa at least two weeks before your authority expires.\n\n### What these ETAs let you do\n\nWhat these ETAs let you do\nDetails\n\nThese authorities let you visit Australia for short-term business purposes, including:\n\nThese authorities let you visit Australia for short-term business purposes, including:\n- educational or business-related meetings, seminars, conventions, conferences or networking\neducational or business-related meetings, seminars, conventions, conferences or networking\n- informal studies or training.\ninformal studies or training.\n\nYou cannot work in Australia. If your main reason for coming to Australia is to work, you should apply for a different visa.\n\nYou cannot work in Australia. If your main reason for coming to Australia is to work, you should apply for a different visa.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou must comply with all electronic travel authority conditions and Australian laws.\n\nYou must comply with all electronic travel authority conditions and Australian laws.\n\nYou must also:\n\nYou must also:\n- be free from tuberculosis when you enter Australia\nbe free from tuberculosis when you enter Australia\n- not do work in Australia that an Australian citizen or permanent resident could do\nnot do work in Australia that an Australian citizen or permanent resident could do\n- not study or train for more than three months\nnot study or train for more than three months\n- not have any criminal convictions for which you were sentenced to a total of 12 months or more in prison, regardless of whether you went to prison or not.\nnot have any criminal convictions for which you were sentenced to a total of 12 months or more in prison, regardless of whether you went to prison or not.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.​​",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/electronic-travel-authority-business-entrant-subclass-956-and-977#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/electronic-travel-authority-business-entrant-subclass-956-and-977#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:27:40.888895",
  "metadata": {}
}