{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/covid-19-pandemic-event-subclass-408",
  "title": "Temporary Activity visa (subclass 408) - Australian Government endorsed events (COVID-19 Pandemic event)",
  "raw_text": "===== main placeholder ========================================== This visa is closed to new applicants. The COVID-19 Pandemic event visa closed to all applications on 1 February 2024. For more information, see ​ Closure of the Pandemic Event We will continue to assess all applications lodged before 1 February 2024.​​ Temporary Activity visa (subclass 408) - Australian Government endorsed events (COVID-19 Pandemic event) Page Content ​​​​​​​​​​​​​​​The Australian Government introduced the Pandemic Event visa in April 2020 to allow temporary visa holders to remain in Australia lawfully while the border was closed. It also addressed labour shortages in critical sectors in the local economy. Now that Australia’s borders are open and temporary visa holder numbers in Australia have returned to pre-COVID-19 levels, the Pandemic Event visa is no longer required. About this visa Details What this visa lets you do Details This is a temporary visa. It allows you to: remain temporarily in Australia to work travel outside Australia and return while your COVID-19 Pandemic Event visa is in effect. Cost Details From AUD405.00. There is also a charge for each family member added to a lodged application. You may have to pay other costs, such as health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements. Eligibility Details Applications made after 2 September 2023 and before 1 February 2024 Details If you applied on or after 2 September 2023 and before 1 February 2024, you may only be eligible for a COVID-19 Pandemic event visa if one of the following is true: You held a COVID-19 Pandemic event visa that had 28 days or less remaining when you lodged your application. You held a COVID-19 Pandemic event visa that ceased within 28 days of lodging your application When you lodged your application, you must have been working or intending to work in Australia, and provided evidence of your employment or offer of employment. Evidence of employment must confirm: the dates of your employment the sector you were working or intending to work in a description of your position and duties. Evidence could include payslips, a contract, or a letter from your employer. If you applied for a COVID-19 Pandemic event visa on or after 2 September 2023 and before 1 February 2024, and did not hold a COVID-19 Pandemic event visa when you lodged your application, you were not eligible for this visa. This will result in your application being refused, which may have adverse consequences for you. You should: explore visa options to find a different visa more suitable to your circumstances or make arrangements to depart Australia check what you need to do if your visa is expiring or has expired Applications made after 21 February 2022 and before 2 September 2023 Details The COVID-19 Pandemic event visa changes announced by the Government on 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged on or after 21 February 2022, but before 2 September 2023. These applications will continue to be assessed. Applications made before 21 February 2022 Details The COVID-19 Pandemic event visa changes announced by the Government on 2 March 2022 or 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged before 21 February 2022. These applications will continue to be assessed. Be able to support yourself and any dependants Details You must have enough money to support yourself and any dependant family members with you in Australia. Health Details You and any family members who applied for the visa with you must meet our health requirements . This means you may need to undergo a health check. We will contact you if you need to undergo a health check. Character Details You and family members aged 16 years and over who applied for the visa with you must meet our character requirements We might also ask that other family members meet the requirement. We will contact you if you need to undergo character checks. Have adequate health insurance Details You must have adequate health insurance for your stay in Australia. Be a genuine temporary entrant Details You cannot use our temporary visa program to maintain ongoing residence in Australia. We must be satisfied that you have a genuine intention to stay here temporarily. When assessing your application, we will consider your: situation in Australia and in your home country immigration history compliance with visa conditions other relevant matters. Have paid back debt to the Australian government Details You must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted. Visa applicants Details The COVID-19 Pandemic Event visa closed to all applications on 1 February 2024. See what you can and must do if you have lodged a visa application. Status Updates Details You can check the status of your visa application, upload new information or respond to requests for information in your ImmiAccount Your application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete. Travel Details If you leave Australia before we make a decision on your application, make sure you hold a visa that allows you to return to Australia. Check your conditions and the expiry of your current visa in VEVO Learn more about visa expiry Health exams Details If you didn’t have health examinations before you applied, we will let you know if you need them. To learn more, visit Health requirements Health insurance Details It is a mandatory condition of your visa that you maintain adequate health insurance during your stay in Australia. Attach more information Details If you did not attach all documents when you applied, attach them as soon as possible in your ImmiAccount We might also ask you to provide more information. Stay Lawful Details If you are in Australia, make sure you stay lawful by holding a visa that remains in effect while we process your application. If you were in Australia when you applied for this visa, you may be granted a: Bridging visa A (BVA) if you held a substantive visa when you applied Bridging visa C (BVC) if you did not hold a substantive visa when you applied. If your current visa expires before we decide your application, the bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your visa application. You can't re-enter Australia on a BVA or BVC. There is no right of return on these visas and they will cease on departure. Learn more about visa expiry Check what conditions might apply to your bridging visa or the visa you have applied for with our condition checker Newborn children Details If your child was born after you applied for this visa find out what you need to do by visiting You had a child Mistakes on your application Details Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) . Then attach it to your application in ImmiAccount Help with your application Details Let us know if you want, or no longer want, someone to: receive your correspondence - complete Form 956a Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF) act for you - let us know in writing by uploading your advice to your application in ImmiAccount To find out more about appointing or withdrawing a nomination, visit Who can help with your application Tell us if things change Details Things you need to let us know about after you have applied might include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application. You must withdraw your application, if your circumstances have changed since you applied for a COVID-19 Pandemic event visa, and you no longer need this visa. If you do not withdraw your application, this visa may be granted and as a result, any other substantive visa that you may hold will cease at the time we grant your COVID-19 Pandemic event visa. See how to tell us if your situation changes Visa outcome Details The COVID-19 Pandemic event visa can only be granted to primary applicants in Australia. We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable. Keep a copy of the decision. If we refuse your visa, we will tell you: why we refused the visa whether you have a right to a review of the decision. Visa holders Details Workers’ rights Details Temporary visa holders with permission to work in Australia are protected by Australian workplace law. See your workplace rights and entitlements To see your conditions for work, use VEVO Your obligations Details You and your family members must comply with all visa conditions and Australian laws. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation See how long you can stay Details To see how long you can stay and when you must leave, use VEVO Travelling on your visa Details You can travel outside Australia and return multiple times, as long as your COVID-19 Pandemic Event visa is in effect. Time spent outside Australia does not extend the period of stay in Australia. To see your period of stay, use VEVO Proving you have a visa Details To prove you have a visa and to show your visa conditions to someone, use VEVO You can request your international movement records online, for more information visit Requesting travel records If your visa has expired or is about to expire Details You should ensure that you hold a valid visa if you wish to stay in Australia. Becoming unlawful may impact your ability to visit Australia in the future. You may apply for a different visa if eligible, or make arrangements to depart Australia before your visa expires. If you remain in Australia without a visa, you risk being detained and removed. You may also incur a debt to the Australian Government for the cost of your removal. To see if your visa has expired already, use VEVO If your COVID-19 Pandemic event visa has already expired, and you have not applied for a different visa, you: must make arrangements to depart Australia may be barred from re-applying for a different visa in Australia may be subject to a re-entry ban For more information, see your visa is about to expire or has expired If your COVID-19 Pandemic event visa has already expired, you can get help from the Status Resolution Service",
  "main_content": "===== main placeholder ==========================================\n\nThis visa is closed to new applicants.The COVID-19 Pandemic event visa closed to all applications on 1 February 2024. For more information, see ​Closure of the Pandemic Event.We will continue to assess all applications lodged before 1 February 2024.​​\n\nThis visa is closed to new applicants.\n\nThis visa is closed to new applicants.\n\nThe COVID-19 Pandemic event visa closed to all applications on 1 February 2024. For more information, see ​Closure of the Pandemic Event.\n\nThe COVID-19 Pandemic event visa closed to all applications on 1 February 2024. For more information, see ​\nClosure of the Pandemic Event\n.\n\nWe will continue to assess all applications lodged before 1 February 2024.​​\n\nWe will continue to assess all applications lodged before 1 February 2024.​​\n\n# Temporary Activity visa (subclass 408) - Australian Government endorsed events (COVID-19 Pandemic event)\n\nTemporary Activity visa (subclass 408) - Australian Government endorsed events (COVID-19 Pandemic event)\nPage Content\n\n​​​​​​​​​​​​​​​The Australian Government introduced the Pandemic Event visa in April 2020 to allow temporary visa holders to remain in Australia lawfully while the border was closed. It also addressed labour shortages in critical sectors in the local economy.\n\n​​​​​​​​​​​​​​​The Australian Government introduced the Pandemic Event visa in April 2020 to allow temporary visa holders to remain in Australia lawfully while the border was closed. It also addressed labour shortages in critical sectors in the local economy.\n\nNow that Australia’s borders are open and temporary visa holder numbers in Australia have returned to pre-COVID-19 levels, the Pandemic Event visa is no longer required.\n\nNow that Australia’s borders are open and temporary visa holder numbers in Australia have returned to pre-COVID-19 levels, the Pandemic Event visa is no longer required.\n​\n\n## About this visa\n\nAbout this visa\nDetails\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis is a temporary visa. It allows you to:\n\nThis is a temporary visa. It allows you to:\n- remain temporarily in Australia to work\nremain temporarily in Australia to work\n- travel outside Australia and return while your COVID-19 Pandemic Event visa is in effect.\ntravel outside Australia and return while your COVID-19 Pandemic Event visa is in effect.\n\n### Cost\n\nCost\nDetails\n\nFrom AUD405.00.\n\nFrom AUD405.00.\n\nThere is also a charge for each family member added to a lodged application.\n\nThere is also a charge for each family member added to a lodged application.\n\nYou may have to pay other costs, such as health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements.\n\nYou may have to pay other costs, such as health assessments, police certificates, other certificates or tests. You are responsible for making the necessary arrangements.\n\n### Eligibility\n\nEligibility\nDetails\n\n#### Applications made after 2 September 2023 and before 1 February 2024\n\nApplications made after 2 September 2023 and before 1 February 2024\nDetails\n\nIf you applied on or after 2 September 2023 and before 1 February 2024, you may only be eligible for a COVID-19 Pandemic event visa if one of the following is true:\n\nIf you applied on or after 2 September 2023 and before 1 February 2024, you may only be eligible for a COVID-19 Pandemic event visa if one of the following is true:\n- You held a COVID-19 Pandemic event visa that had 28 days or less remaining when you lodged your application.\nYou held a COVID-19 Pandemic event visa that had 28 days or less remaining when you lodged your application.\n- You held a COVID-19 Pandemic event visa that ceased within 28 days of lodging your application\nYou held a COVID-19 Pandemic event visa that ceased within 28 days of lodging your application\n\nWhen you lodged your application, you must have been working or intending to work in Australia, and provided evidence of your employment or offer of employment. Evidence of employment must confirm:\n\nWhen you lodged your application, you must have been working or intending to work in Australia, and provided evidence of your employment or offer of employment. Evidence of employment must confirm:\n- the dates of your employment\nthe dates of your employment\n- the sector you were working or intending to work in\nthe sector you were working or intending to work in\n- a description of your position and duties.\na description of your position and duties.\n\nEvidence could include payslips, a contract, or a letter from your employer.\n\nEvidence could include payslips, a contract, or a letter from your employer.\n\nIf you applied for a COVID-19 Pandemic event visa on or after 2 September 2023 and before 1 February 2024, and did not hold a COVID-19 Pandemic event visa when you lodged your application, you were not eligible for this visa. This will result in your application being refused, which may have adverse consequences for you. You should:\n\nIf you applied for a COVID-19 Pandemic event visa on or after 2 September 2023 and before 1 February 2024, and did not hold a COVID-19 Pandemic event visa when you lodged your application, you were not eligible for this visa. This will result in your application being refused, which may have adverse consequences for you. You should:\n- explore visa options to find a different visa more suitable to your circumstances or make arrangements to depart Australia\nexplore visa options to find a different visa more suitable to your circumstances or make arrangements to depart Australia\n- check what you need to do ifyour visa is expiring or has expired.\ncheck what you need to do if\nyour visa is expiring or has expired\n.\n\n#### Applications made after 21 February 2022 and before 2 September 2023\n\nApplications made after 21 February 2022 and before 2 September 2023\nDetails\n\nThe COVID-19 Pandemic event visa changes announced by the Government on 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged on or after 21 February 2022, but before 2 September 2023.\n\nThe COVID-19 Pandemic event visa changes announced by the Government on 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged on or after 21 February 2022, but before 2 September 2023.\n\nThese applications will continue to be assessed.\n\nThese applications will continue to be assessed.\n\n#### Applications made before 21 February 2022\n\nApplications made before 21 February 2022\nDetails\n\nThe COVID-19 Pandemic event visa changes announced by the Government on 2 March 2022 or 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged before 21 February 2022.\n\nThe COVID-19 Pandemic event visa changes announced by the Government on 2 March 2022 or 2 September 2023 will not affect undecided COVID-19 Pandemic event visa applications lodged before 21 February 2022.\n\nThese applications will continue to be assessed.\n\nThese applications will continue to be assessed.\n\n### Be able to support yourself and any dependants\n\nBe able to support yourself and any dependants\nDetails\n\nYou must have enough money to support yourself and any dependant family members with you in Australia.\n\nYou must have enough money to support yourself and any dependant family members with you in Australia.\n\n### Health\n\nHealth\nDetails\n\nYou and any family members who applied for the visa with you must meet ourhealth requirements. This means you may need to undergo a health check.\n\nYou and any family members who applied for the visa with you must meet our\nhealth requirements\n. This means you may need to undergo a health check.\n\nWe will contact you if you need to undergo a health check.\n\nWe will contact you if you need to undergo a health check.\n\n### Character\n\nCharacter\nDetails\n\nYou and family members aged 16 years and over who applied for the visa with you must meet ourcharacter requirements.\n\nYou and family members aged 16 years and over who applied for the visa with you must meet our\ncharacter requirements\n.\n\nWe might also ask that other family members meet the requirement.\n\nWe might also ask that other family members meet the requirement.\n\nWe will contact you if you need to undergo character checks.\n\nWe will contact you if you need to undergo character checks.\n\n### Have adequate health insurance\n\nHave adequate health insurance\nDetails\n\nYou must have adequate health insurance for your stay in Australia.\n\nYou must have adequate health insurance for your stay in Australia.\n\n### Be a genuine temporary entrant\n\nBe a genuine temporary entrant\nDetails\n\nYou cannot use our temporary visa program to maintain ongoing residence in Australia.\n\nYou cannot use our temporary visa program to maintain ongoing residence in Australia.\n\nWe must be satisfied that you have a genuine intention to stay here temporarily.\n\nWe must be satisfied that you have a genuine intention to stay here temporarily.\n\nWhen assessing your application, we will consider your:\n\nWhen assessing your application, we will consider your:\n- situation in Australia and in your home country\nsituation in Australia and in your home country\n- immigration history\nimmigration history\n- compliance with visa conditions\ncompliance with visa conditions\n- other relevant matters.\nother relevant matters.\n\n### Have paid back debt to the Australian government\n\nHave paid back debt to the Australian government\nDetails\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\nYou must have no outstanding debts to the Australian Government or have arranged to repay any outstanding debts to the Australian Government before this visa can be granted.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\nThe COVID-19 Pandemic Event visa closed to all applications on 1 February 2024.\n\nThe COVID-19 Pandemic Event visa closed to all applications on 1 February 2024.\n\nSee what you can and must do if you have lodged a visa application.\n\nSee what you can and must do if you have lodged a visa application.\n\n### Status Updates\n\nStatus Updates\nDetails\n\nYou can check the status of your visa application, upload new information or respond to requests for information in yourImmiAccount.\n\nYou can check the status of your visa application, upload new information or respond to requests for information in your\nImmiAccount\n.\n\nYour application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete.\n\nYour application could take longer if you need character or health checks (including x-rays), if you need to provide more information, or if your application is incomplete.\n\n### Travel\n\nTravel\nDetails\n\nIf you leave Australia before we make a decision on your application, make sure you hold a visa that allows you to return to Australia.\n\nIf you leave Australia before we make a decision on your application, make sure you hold a visa that allows you to return to Australia.\n\nCheck your conditions and the expiry of your current visa inVEVO.\n\nCheck your conditions and the expiry of your current visa in\nVEVO\n.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\n\n### Health exams\n\nHealth exams\nDetails\n\nIf you didn’t have health examinations before you applied, we will let you know if you need them.\n\nIf you didn’t have health examinations before you applied, we will let you know if you need them.\n\nTo learn more, visitHealth requirements.\n\nTo learn more, visit\nHealth requirements\n.\n\n### Health insurance\n\nHealth insurance\nDetails\n\nIt is a mandatory condition of your visa that you maintain adequate health insurance during your stay in Australia.\n\nIt is a mandatory condition of your visa that you maintain adequate health insurance during your stay in Australia.\n\n### Attach more information\n\nAttach more information\nDetails\n\nIf you did not attach all documents when you applied, attach them as soon as possible in yourImmiAccount.\n\nIf you did not attach all documents when you applied, attach them as soon as possible in your\nImmiAccount\n.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\n### Stay Lawful\n\nStay Lawful\nDetails\n\nIf you are in Australia, make sure you stay lawful by holding a visa that remains in effect while we process your application.\n\nIf you are in Australia, make sure you stay lawful by holding a visa that remains in effect while we process your application.\n\nIf you were in Australia when you applied for this visa, you may be granted a:\n\nIf you were in Australia when you applied for this visa, you may be granted a:\n- Bridging visa A (BVA) if you held a substantive visa when you applied\nBridging visa A (BVA) if you held a substantive visa when you applied\n- Bridging visa C (BVC) if you did not hold a substantive visa when you applied.\nBridging visa C (BVC) if you did not hold a substantive visa when you applied.\n\nIf your current visa expires before we decide your application, the bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your visa application. You can't re-enter Australia on a BVA or BVC. There is no right of return on these visas and they will cease on departure.\n\nIf your current visa expires before we decide your application, the bridging visa will come into effect. You can stay in Australia on the bridging visa while we process your visa application. You can't re-enter Australia on a BVA or BVC. There is no right of return on these visas and they will cease on departure.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\n\nCheck what conditions might apply to your bridging visa or the visa you have applied for with ourcondition checker.\n\nCheck what conditions might apply to your bridging visa or the visa you have applied for with our\ncondition checker\n.\n\n### Newborn children\n\nNewborn children\nDetails\n\nIf your child was born after you applied for this visa find out what you need to do by visitingYou had a child.\n\nIf your child was born after you applied for this visa find out what you need to do by visiting\nYou had a child\n.\n\n### Mistakes on your application\n\nMistakes on your application\nDetails\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF). Then attach it to your application inImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n. Then attach it to your application in\nImmiAccount\n.\n\n### Help with your application\n\nHelp with your application\nDetails\n\nLet us know if you want, or no longer want, someone to:\n\nLet us know if you want, or no longer want, someone to:\n- receive your correspondence - completeForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956a Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\nprovide immigration advice - complete\nForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\n- act for you - let us know in writing by uploading your advice to your application inImmiAccount.\nact for you - let us know in writing by uploading your advice to your application in\nImmiAccount\n.\n\nTo find out more about appointing or withdrawing a nomination, visitWho can help with your application.\n\nTo find out more about appointing or withdrawing a nomination, visit\nWho can help with your application\n.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about after you have applied might include:\n\nThings you need to let us know about after you have applied might include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application.\nyou want to withdraw your application.\n\nYou must withdraw your application, if your circumstances have changed since you applied for a COVID-19 Pandemic event visa, and you no longer need this visa. If you do not withdraw your application, this visa may be granted and as a result, any other substantive visa that you may hold will cease at the time we grant your COVID-19 Pandemic event visa.\n\nYou must withdraw your application, if your circumstances have changed since you applied for a COVID-19 Pandemic event visa, and you no longer need this visa. If you do not withdraw your application, this visa may be granted and as a result, any other substantive visa that you may hold will cease at the time we grant your COVID-19 Pandemic event visa.\n\nSee how to tell us if yoursituation changes.\n\nSee how to tell us if your\nsituation changes\n.\n\n### Visa outcome\n\nVisa outcome\nDetails\n\nThe COVID-19 Pandemic event visa can only be granted to primary applicants in Australia.\n\nThe COVID-19 Pandemic event visa can only be granted to primary applicants in Australia.\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable.\nyour visa conditions, if applicable.\n\nKeep a copy of the decision.\n\nKeep a copy of the decision.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision.\nwhether you have a right to a review of the decision.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### Workers’ rights\n\nWorkers’ rights\nDetails\n\nTemporary visa holders with permission to work in Australia are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nTemporary visa holders with permission to work in Australia are protected by Australian workplace law. See your\nworkplace rights and entitlements\n.\n\nTo see your conditions for work, useVEVO.\n\nTo see your conditions for work, use\nVEVO\n.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family members must comply with all visa conditions and Australian laws.\n\nYou and your family members must comply with all visa conditions and Australian laws.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### See how long you can stay\n\nSee how long you can stay\nDetails\n\nTo see how long you can stay and when you must leave, useVEVO.\n\nTo see how long you can stay and when you must leave, use\nVEVO\n.\n\n### Travelling on your visa\n\nTravelling on your visa\nDetails\n\nYou can travel outside Australia and return multiple times, as long as your COVID-19 Pandemic Event visa is in effect.\n\nYou can travel outside Australia and return multiple times, as long as your COVID-19 Pandemic Event visa is in effect.\n\nTime spent outside Australia does not extend the period of stay in Australia.\n\nTime spent outside Australia does not extend the period of stay in Australia.\n\nTo see your period of stay, useVEVO.\n\nTo see your period of stay, use\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\nDetails\n\nTo prove you have a visa and to show your visa conditions to someone, useVEVO.\n\nTo prove you have a visa and to show your visa conditions to someone, use\nVEVO\n.\n\nYou can request your international movement records online, for more information visitRequesting travel records.\n\nYou can request your international movement records online, for more information visit\nRequesting travel records\n.\n\n### If your visa has expired or is about to expire\n\nIf your visa has expired or is about to expire\nDetails\n\nYou should ensure that you hold a valid visa if you wish to stay in Australia. Becoming unlawful may impact your ability to visit Australia in the future.\n\nYou should ensure that you hold a valid visa if you wish to stay in Australia. Becoming unlawful may impact your ability to visit Australia in the future.\n\nYou may apply for a different visa if eligible, or make arrangements to depart Australia before your visa expires.\n\nYou may apply for a different visa if eligible, or make arrangements to depart Australia before your visa expires.\n\nIf you remain in Australia without a visa, you risk being detained and removed. You may also incur a debt to the Australian Government for the cost of your removal.\n\nIf you remain in Australia without a visa, you risk being detained and removed. You may also incur a debt to the Australian Government for the cost of your removal.\n\nTo see if your visa has expired already, useVEVO.\n\nTo see if your visa has expired already, use\nVEVO\n.\n\nIf your COVID-19 Pandemic event visa has already expired, and you have not applied for a different visa, you:\n\nIf your COVID-19 Pandemic event visa has already expired, and you have not applied for a different visa, you:\n- must make arrangements todepart Australia\nmust make arrangements to\ndepart Australia\n- may be barred from re-applying for a different visa in Australia\nmay be barred from re-applying for a different visa in Australia\n- may be subject to are-entry ban.\nmay be subject to a\nre-entry ban\n.\n\nFor more information, seeyour visa is about to expire or has expired.\n\nFor more information, see\nyour visa is about to expire or has expired\n.\n\nIf your COVID-19 Pandemic event visa has already expired, you can get help from theStatus Resolution Service.\n\nIf your COVID-19 Pandemic event visa has already expired, you can get help from the\nStatus Resolution Service\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/covid-19-pandemic-event-subclass-408#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/covid-19-pandemic-event-subclass-408#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:24:04.814724",
  "metadata": {}
}