{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-owner-subclass-890-visa",
  "title": "Business Owner (subclass 890) visa",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Business Owner (subclass 890) visa Page Content ​​​​​​​​​The Business Owner (subclass 890) visa closed to new applications on 22 March 2025.​ Visa holders Details This is a permanent visa, it lets you stay in Australia indefinitely. It allows you to travel to and from Australia for 5 years from the date we grant the visa. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details This visa lets you stay in Australia indefinitely. It allows you to travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. Use VEVO to see when your travel facility ends. If you want to travel to Australia after the initial 5-year travel facility: you will need to apply for and be granted a Resident Return visa so that you can re-enter Australia as a permanent resident you may want to consider becoming an Australian citizen so you can re-enter Australia as an Australian citizen. If you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship What this visa lets you do Details This visa allows you and your dependent family members who also hold a subclass 890 visa to: stay in Australia permanently work and study in Australia carry out business activity in Australia enrol in Australia’s public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years apply for Australian citizenship, if eligible. Your obligations Details You and your family members must meet all visa conditions and obey Australian laws. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Business Owner (subclass 890) visa\n\nBusiness Owner (subclass 890) visa\nPage Content\n\n​​​​​​​​​The Business Owner (subclass 890) visa closed to new applications on 22 March 2025.​\n\n​​​​​​​​​The Business Owner (subclass 890) visa closed to new applications on 22 March 2025.​\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis is a permanent visa, it lets you stay in Australia indefinitely. It allows you to travel to and from Australia for 5 years from the date we grant the visa.\n\nThis is a permanent visa, it lets you stay in Australia indefinitely. It allows you to travel to and from Australia for 5 years from the date we grant the visa.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis visa lets you stay in Australia indefinitely.\n\nThis visa lets you stay in Australia indefinitely.\n\nIt allows you to travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. UseVEVOto see when your travel facility ends.\n\nIt allows you to travel to and from Australia as many times as you want for 5 years from the date we grant this visa. This is as long as the travel facility on this visa remains valid. Use\nVEVO\nto see when your travel facility ends.\n\nIf you want to travel to Australia after the initial 5-year travel facility:\n\nIf you want to travel to Australia after the initial 5-year travel facility:\n- you will need to apply for and be granted aResident Return visaso that you can re-enter Australia as a permanent resident\nyou will need to apply for and be granted a\nResident Return visa\nso that you can re-enter Australia as a permanent resident\n- you may want to consider becoming an Australian citizen so you can re-enter Australia as an Australian citizen.\nyou may want to consider becoming an Australian citizen so you can re-enter Australia as an Australian citizen.\n\nIf you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times forAustralian citizenship.\n\nIf you become an Australian citizen, you don't require a visa to enter Australia. You will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for\nAustralian citizenship\n.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you and your dependent family members who also hold a subclass 890 visa to:\n\nThis visa allows you and your dependent family members who also hold a subclass 890 visa to:\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- carry out business activity in Australia\ncarry out business activity in Australia\n- enrol in Australia’s public health care scheme,Medicare\nenrol in Australia’s public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- apply for Australian citizenship, if eligible.\napply for Australian citizenship, if eligible.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\nYou and your family members must meet all visa conditions and obey Australian laws.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-owner-subclass-890-visa#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/business-owner-subclass-890-visa#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:22:27.947883",
  "metadata": {}
}