{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
  "title": "Bridging visa A (BVA)",
  "raw_text": "===== main placeholder ========================================== Subclass 010 Bridging visa A (BVA) This temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ Stay Temporarily Cost Free Processing times There are no processing times available for this visa. With this visa, you can: stay lawfully in Australia until your substantive visa application is finally determined , or where granted in association with judicial review, until those proceedings are completed work, if you meet the requirements for work See all conditions Check your eligibility You must: be in Australia when you apply if you meet all the eligibility requirements, be in Australia at time of grant Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ About this visa With this visa you can How long you can stay Stay longer Include family Cost Apply from Your obligations Travel Visa label About this visa This is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for a substantive visa . We will tell you if this happens. Check if you already hold a Bridging visa A (BVA) with VEVO A separate application for a BVA may be necessary where: your substantive visa application did not also constitute an application for a BVA you were granted a BVA or a Bridging visa B (BVB) but this has ceased and you meet the requirements for another BVA you are seeking a further BVA without work restrictions you have applied for judicial review. You can't use a bridging visa while you wait for a citizenship application to be decided. In effect A BVA comes 'in to effect' when: it is granted (if your substantive visa has ceased since applying for the BVA or the BVA is more beneficial than your current bridging visa) your current substantive visa ceases another bridging visa that is more beneficial than your current bridging visa ceases. Visa holders must adhere to the conditions imposed on their visa. Where you are granted a BVA, you will be notified about the conditions that apply. If you hold a substantive visa when your BVA is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVA will apply. The BVA does not support return travel to Australia. Working in Australia You might be allowed to work in Australia depending on the visa conditions that apply to your BVA. Your grant letter will tell you about these conditions. See if you have work restrictions in VEVO. If your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship. We will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA. You cannot be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either: your current BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application, or you have applied for a protection visa. Remaining lawful during judicial review If a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform. With this visa you can stay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete. A BVA will end immediately if the following situations occur: you leave Australia while your BVA is in effect you are granted the substantive visa you applied for you are granted another Bridging visa (such as a BVB) in relation to the same substantive visa application that this BVA is associated with we cancel either your BVA or the substantive visa that you held when you were granted the BVA. How long you can stay In all other situations one of the following outcomes will determine when your BVA ceases: your substantive visa application is refused your merits or judicial review is decided you withdraw your application for the substantive visa, merits review or judicial review a merit review tribunal tells you that it has no jurisdiction to consider your application for review. Once you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO BVA granted on or after 19 November 2016 Your BVA will cease 35 calendar days after: our refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application a determination that your substantive visa application or an application for review by the AAT is invalid you withdraw your substantive visa application or application for review by the AAT. You BVA will cease 28 calendar days after: a judicial review body upholds the decision to refuse your substantive visa application you withdraw a related judicial review application. BVA granted before 19 November 2016 Your BVA will cease 28 days after the date that one of the following happens: we notify you that your substantive visa application is not valid we notify you that your substantive visa application has been refused you withdraw your substantive visa application a merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application a merit review tribunal notifies you that it has no jurisdiction to consider your application for review you withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body a judicial review body upholds the decision to refuse your substantive visa application. Stay longer You can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer. Explore your visa options Include family If you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVA. Check if family members already hold a BVA with VEVO If you apply separately for a BVA, you can include members of the family unit in your BVA application if they are included in your substantive visa application. We will assess each member of the family unit's application and decide which bridging visa they can be granted. Cost Free Apply from You and anyone included in your application must be in Australia when the BVA application is submitted and granted. Your obligations You and anyone included in your application must: comply with all Australian laws comply with the conditions of the current visa comply with the conditions of your Bridging visa A when it comes into effect See the conditions that will and might be applied to a BVA Travel If you leave Australia on this visa when it is in effect you will not be able to return on it. A BVA that is in-effect will cease upon departure from Australia. To see if your BVA is in effect, see VEVO If you want to travel and return to Australia whilst your substantive visa application is being processed, you will need to have been granted a BVB before you leave. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ These are some of the common eligibility criteria: Have had a substantive visa You must hold or have held a substantive visa. Apply in Australia You will need to be in Australia when you apply. Applied for a substantive visa or judicial review You must have made a valid application for a substantive visa that has not been finally determined or you have made an application for judicial review of a decision relating to your substantive visa application, within the prescribed timeframe, and the judicial review proceedings have not been completed. When applying for a review, have applied in the prescribed timeframe You must apply within the prescribed timeframe. Details Administrative Appeals Tribunal You must apply for review within the prescribed timeframe. If you have applied within the prescribed timeframe, you may not need to apply for a further Bridging Visa. Judicial review The timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision. If you have not applied for judicial review within the statutory time limits, this may affect your eligibility to apply for a further Bridging Visa. Age You can be any age to apply for this visa. Meet character requirement You will need to meet the character requirement For all criteria see Schedule 2 in Migration Regulations 1994 Meet all these criteria? Check how to apply in our step by step guide. Step by step ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ Step 1 Before you apply Check if you already hold a BVA with VEVO Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Gather the documents you need for your application. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or do not provide true information Identity documents Provide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Proof of hardship Provide proof to support a change to your visa conditions. Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application. See how Prepare your documents See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than 1 page, save it all as 1 file. See how Step 3 Apply for the visa How you apply for a BVA depends on: how you applied for your substantive visa (online or by paper form) if you have applied for review of a decision about your substantive visa application. You must apply for the BVA in the same way you applied for your substantive visa. If you applied for your substantive visa through ImmiAccount, you must apply for your BVA through ImmiAccount. If you applied for your new substantive visa by paper form, you must submit your BVA application by webform If you have applied for a review of a decision about your substantive visa application, you must submit your BVA application by webform You and anyone included in your application must be in Australia when you lodge the BVA application. Show steps Provide accurate information Provide accurate information. See what happens if you cannot prove your identity or do not provide accurate information Apply through ImmiAccount See how If you applied for your substantive visa through ImmiAccount You must apply for the BVA through ImmiAccount. To apply for a BVA through ImmiAccount: Log in to ImmiAccount Attach documents See how Apply by webform If you applied for your substantive visa by paper form You must complete and submit your BVA application Form 1005 by webform If you have applied for review of a decision on your substantive visa application You must complete and submit your BVA application Form 1005 by webform See how Step 4 After you apply See what you can and must do after you apply. Show steps What will happen after you apply We will tell you when we have received your application and documents. Status updates We do not give updates on application processing times. Wait for us to contact you. Travel If you leave Australia while your BVA is in effect you will not be able to return. A BVA that is in effect will cease upon departure from Australia. To see if your BVA is in effect, see VEVO. If you want to travel and return to Australia whilst your substantive visa application is being processed, you will need to be granted a BVB before you leave. See how Attach more information If you are applying through ImmiAccount and did not attach all documents when you applied, attach them as soon as possible in ImmiAccount If you are applying by webform, you must attach all documents before you submit your BVA application. You cannot attach extra documents after you have submitted your application. We may ask you for more information. You should provide information how we ask you to in the request letter. See how Stay lawful Make sure you stay lawful by holding a valid visa while we process your bridging visa and your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application. See how Including family members If you and your family have made a combined application for a substantive visa in Australia, you might have also applied for a BVA. Check if family members already hold a BVA in VEVO See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Tell us as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) See how Help with your application Tell us if you: want someone to receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) have asked someone to give you immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount if you applied for your substantive visa online. If you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us. For more information see Who can help you with your application See how Tell us if things change Some of the things you need to tell us about after you have applied include: changes to your phone number, email, address or passport the birth of a child if you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome We will let you know in writing our decision about your visa application. You and anyone included in your application must be in Australia when we make a decision. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of the email with you when in Australia. If we refuse your visa, we will tell you: why we refused the visa if you have a right to a review of the decision When you have this visa ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ In Australia Leaving Australia In Australia How long you can stay To see when you must leave after you are notified of an outcome, use VEVO When you have this visa stay lawfully in Australia until we make a decision on your application for a visa or review To see your specific conditions, use VEVO What you must do on this visa (your obligations) comply with all Australian laws including all visa conditions applied to your visa Working If you get a BVA that does not permit work, you can apply for a further Bridging Visa with no conditions if you can demonstrate financial hardship. We will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA. You can't be granted a new BVA that lets you work if: your BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application, and that BVA prevents or restricts you from working in Australia. Travelling If you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, see VEVO . A BVA that is in-effect will cease upon departure from Australia If you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave. Tell us if things change Some of the things you need to let us know about after you have applied include: changes to your phone number, email, address or passport the birth of a child you want to withdraw your application See how to tell us if your situation changes Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Request your international movement records to get proof of your travel in and out of Australia. Leaving Australia Before you leave If you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, see VEVO . A BVA that is in-effect will cease upon departure from Australia If you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave. At the Border We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Proving you have been to Australia Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 010\n\n# Bridging visa A (BVA)\n\nBridging visa A (BVA)\n\nThis temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed.\n\nThis temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed.\n\nThis temporary visa generally allows you to stay in Australia after your current substantive visa ceases and while your new substantive visa application is being processed.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\n#### Stay\n\nStay\n\nTemporarily\n\nTemporarily\n\n#### Cost\n\nCost\n\nFree\n\nFree\n\n#### Processing times\n\nProcessing times\n\nThere are no processing times available for this visa.\n\nThere are no processing times available for this visa.\n\n#### With this visa, you can:\n\nWith this visa, you can:\n- stay lawfully in Australia until yoursubstantive visaapplication isfinally determined, or where granted in association with judicial review, until those proceedings are completed\nstay lawfully in Australia until your\nsubstantive visa\napplication is\nfinally determined\n, or where granted in association with judicial review, until those proceedings are completed\n- work, if you meet the requirements for work\nwork, if you meet the requirements for work\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must:\n\nYou must:\n- be in Australia when you apply\nbe in Australia when you apply\n- if you meet all the eligibility requirements, be in Australia at time of grant\nif you meet all the eligibility requirements, be in Australia at time of grant\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\nAbout this visa\nWith this visa you can\nHow long you can stay\nStay longer\nInclude family\nCost\nApply from\nYour obligations\nTravel\nVisa label\n\n## About this visa\n\nAbout this visa\n\nThis is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for asubstantive visa. We will tell you if this happens. Check if you already hold a Bridging visa A (BVA) withVEVO.\n\nThis is a temporary visa. Nearly all bridging visas are applied for automatically as part of applying for a\nsubstantive visa\n. We will tell you if this happens. Check if you already hold a Bridging visa A (BVA) with\nVEVO\n.\n\nA separate application for a BVA may be necessary where:\n\nA separate application for a BVA may be necessary where:\n- yoursubstantive visaapplication did not also constitute an application for a BVA\nyour\nsubstantive visa\napplication did not also constitute an application for a BVA\n- you were granted a BVA or a Bridging visa B (BVB) but this has ceased and you meet the requirements for another BVA\nyou were granted a BVA or a Bridging visa B (BVB) but this has ceased and you meet the requirements for another BVA\n- you are seeking a further BVA without work restrictions\nyou are seeking a further BVA without work restrictions\n- you have applied for judicial review.\nyou have applied for judicial review.\n\nYou can't use a bridging visa while you wait for a citizenship application to be decided.\n\nYou can't use a bridging visa while you wait for a citizenship application to be decided.\n\n### In effect\n\nIn effect\n\nA BVA comes 'in to effect' when:\n\nA BVA comes 'in to effect' when:\n- it is granted (if yoursubstantive visahas ceased since applying for the BVA or the BVA is more beneficial than your current bridging visa)\nit is granted (if your\nsubstantive visa\nhas ceased since applying for the BVA or the BVA is more beneficial than your current bridging visa)\n- your current substantive visa ceases\nyour current substantive visa ceases\n- another bridging visa that is more beneficial than your current bridging visa ceases.\nanother bridging visa that is more beneficial than your current bridging visa ceases.\n\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVA, you will be notified about the conditions that apply.\n\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVA, you will be notified about the conditions that apply.\n\nIf you hold a substantive visa when your BVA is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVA will apply.\n\nIf you hold a substantive visa when your BVA is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVA will apply.\n\nThe BVA does not support return travel to Australia.\n\nThe BVA does not support return travel to Australia.\n\n### Working in Australia\n\nWorking in Australia\n\nYou might be allowed to work in Australia depending on the visa conditions that apply to your BVA. Your grant letter will tell you about these conditions. See if you have work restrictions inVEVO.\n\nYou might be allowed to work in Australia depending on the visa conditions that apply to your BVA. Your grant letter will tell you about these conditions. See if you have work restrictions in\nVEVO.\n\nIf your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship.\n\nIf your BVA does not let you work, or has restrictions on working, you can apply for another BVA that lets you work. To be considered for a BVA that lets you work, you will usually have to demonstrate that you are in financial hardship.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA.\n\nYou cannot be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either:\n\nYou cannot be granted a new BVA that lets you work if your current BVA prevents or restricts you from working in Australia and either:\n- your current BVA was granted to you because you have applied for judicial review of the decision made on yoursubstantive visaapplication, or\nyour current BVA was granted to you because you have applied for judicial review of the decision made on your\nsubstantive visa\napplication, or\n- you have applied for a protection visa.\nyou have applied for a protection visa.\n\n### Remaining lawful during judicial review\n\nRemaining lawful during judicial review\n\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n\n## With this visa you can\n\nWith this visa you can\n- stay lawfully in Australia until yoursubstantive visaapplication is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\nstay lawfully in Australia until your\nsubstantive visa\napplication is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\n\nA BVA will end immediately if the following situations occur:\n\nA BVA will end immediately if the following situations occur:\n- you leave Australia while your BVA is in effect\nyou leave Australia while your BVA is in effect\n- you are granted the substantive visa you applied for\nyou are granted the substantive visa you applied for\n- you are granted another Bridging visa (such as a BVB) in relation to the same substantive visa application that this BVA is associated with\nyou are granted another Bridging visa (such as a BVB) in relation to the same substantive visa application that this BVA is associated with\n- we cancel either your BVA or the substantive visa that you held when you were granted the BVA.\nwe cancel either your BVA or the substantive visa that you held when you were granted the BVA.\n\n## How long you can stay\n\nHow long you can stay\n\nIn all other situations one of the following outcomes will determine when your BVA ceases:\n\nIn all other situations one of the following outcomes will determine when your BVA ceases:\n- yoursubstantive visaapplication is refused\nyour\nsubstantive visa\napplication is refused\n- your merits or judicial review is decided\nyour merits or judicial review is decided\n- you withdraw your application for the substantive visa, merits review or judicial review\nyou withdraw your application for the substantive visa, merits review or judicial review\n- a merit review tribunal tells you that it has no jurisdiction to consider your application for review.\na merit review tribunal tells you that it has no jurisdiction to consider your application for review.\n\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia inVEVO.\n\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in\nVEVO\n.\n\n### BVA granted on or after 19 November 2016\n\nBVA granted on or after 19 November 2016\n\nYour BVA will cease 35 calendar days after:\n\nYour BVA will cease 35 calendar days after:\n- our refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\nour refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\n- a determination that your substantive visa application or an application for review by the AAT is invalid\na determination that your substantive visa application or an application for review by the AAT is invalid\n- you withdraw your substantive visa application or application for review by the AAT.\nyou withdraw your substantive visa application or application for review by the AAT.\n\nYou BVA will cease 28 calendar days after:\n\nYou BVA will cease 28 calendar days after:\n- a judicial review body upholds the decision to refuse your substantive visa application\na judicial review body upholds the decision to refuse your substantive visa application\n- you withdraw a related judicial review application.\nyou withdraw a related judicial review application.\n\n### BVA granted before 19 November 2016\n\nBVA granted before 19 November 2016\n\nYour BVA will cease 28 days after the date that one of the following happens:\n\nYour BVA will cease 28 days after the date that one of the following happens:\n- we notify you that your substantive visa application is not valid\nwe notify you that your substantive visa application is not valid\n- we notify you that your substantive visa application has been refused\nwe notify you that your substantive visa application has been refused\n- you withdraw your substantive visa application\nyou withdraw your substantive visa application\n- a merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\na merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\n- a merit review tribunal notifies you that it has no jurisdiction to consider your application for review\na merit review tribunal notifies you that it has no jurisdiction to consider your application for review\n- you withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body\nyou withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body\n- a judicial review body upholds the decision to refuse your substantive visa application.\na judicial review body upholds the decision to refuse your substantive visa application.\n\n## Stay longer\n\nStay longer\n\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\n\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\n\nExplore your visa options.\n\nExplore your visa options\n.\n\n## Include family\n\nInclude family\n\nIf you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVA. Check if family members already hold a BVA withVEVO.\n\nIf you and your family have applied together for a substantive visa in Australia, you might have also applied together for a BVA. Check if family members already hold a BVA with\nVEVO\n.\n\nIf you apply separately for a BVA, you can includemembers of the family unitin your BVA application if they are included in yoursubstantive visaapplication.\n\nIf you apply separately for a BVA, you can include\nmembers of the family unit\nin your BVA application if they are included in your\nsubstantive visa\napplication.\n\nWe will assess each member of the family unit's application and decide which bridging visa they can be granted.\n\nWe will assess each member of the family unit's application and decide which bridging visa they can be granted.\n\n## Cost\n\nCost\n\nFree\n\nFree\n\n## Apply from\n\nApply from\n\nYou and anyone included in your application must be in Australia when the BVA application is submitted and granted.\n\nYou and anyone included in your application must be in Australia when the BVA application is submitted and granted.\n\n## Your obligations\n\nYour obligations\n\nYou and anyone included in your application must:\n\nYou and anyone included in your application must:\n- comply with all Australian laws\ncomply with all Australian laws\n- comply with the conditions of the current visa\ncomply with the conditions of the current visa\n- comply with the conditions of your Bridging visa A when it comes into effect\ncomply with the conditions of your Bridging visa A when it comes into effect\n\nSee the conditions that will and might be applied to aBVA.\n\nSee the conditions that will and might be applied to a\nBVA\n.\n\n## Travel\n\nTravel\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. A BVA that is in-effect will cease upon departure from Australia. To see if your BVA is in effect, seeVEVO.\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. A BVA that is in-effect will cease upon departure from Australia. To see if your BVA is in effect, see\nVEVO\n.\n\nIf you want to travel and return to Australia whilst yoursubstantive visaapplication is being processed, you will need to have been granted a BVB before you leave.\n\nIf you want to travel and return to Australia whilst your\nsubstantive visa\napplication is being processed, you will need to have been granted a BVB before you leave.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\nThese are some of the common eligibility criteria:\n\nThese are some of the common eligibility criteria:\n\n## Have had a substantive visa\n\nHave had a substantive visa\n\nYou must hold or have held a substantive visa.\n\nYou must hold or have held a substantive visa.\n\n## Apply in Australia\n\nApply in Australia\n\nYou will need to be in Australia when you apply.\n\nYou will need to be in Australia when you apply.\n\n## Applied for a substantive visa or judicial review\n\nApplied for a substantive visa or judicial review\n\nYou must have made a valid application for a substantive visa that has not been finally determined or you have made an application for judicial review of a decision relating to your substantive visa application, within the prescribed timeframe, and the judicial review proceedings have not been completed.\n\nYou must have made a valid application for a substantive visa that has not been finally determined or you have made an application for judicial review of a decision relating to your substantive visa application, within the prescribed timeframe, and the judicial review proceedings have not been completed.\n\n## When applying for a review, have applied in the prescribed timeframe\n\nWhen applying for a review, have applied in the prescribed timeframe\n\nYou must apply within the prescribed timeframe.\n\nYou must apply within the prescribed timeframe.\nDetails\n\n### Administrative Appeals Tribunal\n\nAdministrative Appeals Tribunal\n\nYou must apply for review within the prescribed timeframe.\n\nYou must apply for review within the prescribed timeframe.\n\nIf you have applied within the prescribed timeframe, you may not need to apply for a further Bridging Visa.\n\nIf you have applied within the prescribed timeframe, you may not need to apply for a further Bridging Visa.\n\n### Judicial review\n\nJudicial review\n\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision.\n\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision.\n\nIf you have not applied for judicial review within the statutory time limits, this may affect your eligibility to apply for a further Bridging Visa.\n\nIf you have not applied for judicial review within the statutory time limits, this may affect your eligibility to apply for a further Bridging Visa.\n\n## Age\n\nAge\n\nYou can be any age to apply for this visa.\n\nYou can be any age to apply for this visa.\n\n## Meet character requirement\n\nMeet character requirement\n\nYou will need to meet thecharacter requirement.\n\nYou will need to meet the\ncharacter requirement\n.\n\nFor all criteria seeSchedule 2 in Migration Regulations 1994\n\nFor all criteria see\nSchedule 2 in Migration Regulations 1994\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck if you already hold a BVA withVEVO.\n\nCheck if you already hold a BVA with\nVEVO\n.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nGather the documents you need for your application.\n\nGather the documents you need for your application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if you can't prove your identity or do notprovide true information.\n\nProvide accurate information. See what happens if you can't prove your identity or do not\nprovide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Proof of hardship\n\nProof of hardship\n\nProvide proof to support a change to your visa conditions.\n\nProvide proof to support a change to your visa conditions.\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccountif you applied online, or send with your paper application.\n\nUpload your written notification or your forms to\nImmiAccount\nif you applied online, or send with your paper application.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than 1 page, save it all as 1 file.\n\nIf a document is more than 1 page, save it all as 1 file.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nHow you apply for a BVA depends on:\n\nHow you apply for a BVA depends on:\n- how you applied for yoursubstantive visa(online or by paper form)\nhow you applied for your\nsubstantive visa\n(online or by paper form)\n- if you have applied for review of a decision about your substantive visa application.\nif you have applied for review of a decision about your substantive visa application.\n\nYou must apply for the BVA in the same way you applied for your substantive visa.\n\nYou must apply for the BVA in the same way you applied for your substantive visa.\n\nIf you applied for your substantive visa through ImmiAccount, you must apply for your BVA through ImmiAccount.\n\nIf you applied for your substantive visa through ImmiAccount, you must apply for your BVA through ImmiAccount.\n\nIf you applied for your new substantive visa by paper form, you must submit your BVA application bywebform.\n\nIf you applied for your new substantive visa by paper form, you must submit your BVA application by\nwebform\n.\n\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVA application bywebform.\n\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVA application by\nwebform\n.\n\nYou and anyone included in your application must be in Australia when you lodge the BVA application.\n\nYou and anyone included in your application must be in Australia when you lodge the BVA application.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens if you cannot prove your identity or do notprovide accurate information.\n\nProvide accurate information. See what happens if you cannot prove your identity or do not\nprovide accurate information\n.\n\n#### Apply through ImmiAccount\n\nApply through ImmiAccount\nSee how\n\n#### If you applied for your substantive visa through ImmiAccount\n\nIf you applied for your substantive visa through ImmiAccount\n\nYou must apply for the BVA through ImmiAccount.\n\nYou must apply for the BVA through ImmiAccount.\n\nTo apply for a BVA through ImmiAccount:\n\nTo apply for a BVA through ImmiAccount:\n1. Log in toImmiAccount\nLog in to\nImmiAccount\n2. Attach documents.\nAttach documents\n.\nSee how\n\n#### Apply by webform\n\nApply by webform\n\nIf you applied for your substantive visa by paper form\n\nIf you applied for your substantive visa by paper form\n\nYou must complete and submit your BVA application Form 1005 bywebform.\n\nYou must complete and submit your BVA application Form 1005 by\nwebform\n.\n\nIf you have applied for review of a decision on your substantive visa application\n\nIf you have applied for review of a decision on your substantive visa application\n\nYou must complete and submit your BVA application Form 1005 bywebform.\n\nYou must complete and submit your BVA application Form 1005 by\nwebform\n.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nSee what you can and must do after you apply.\n\nSee what you can and must do after you apply.\nShow\n                    steps\n\n#### What will happen after you apply\n\nWhat will happen after you apply\n\nWe will tell you when we have received your application and documents.\n\nWe will tell you when we have received your application and documents.\n\n#### Status updates\n\nStatus updates\n\nWe do not give updates on application processing times.\n\nWe do not give updates on application processing times.\n\nWait for us to contact you.\n\nWait for us to contact you.\n\n#### Travel\n\nTravel\n\nIf you leave Australia while your BVA is in effect you will not be able to return. A BVA that is in effect will cease upon departure from Australia. To see if your BVA is in effect, seeVEVO.\n\nIf you leave Australia while your BVA is in effect you will not be able to return. A BVA that is in effect will cease upon departure from Australia. To see if your BVA is in effect, see\nVEVO.\n\nIf you want to travel and return to Australia whilst your substantive visa application is being processed, you will need to be granted a BVB before you leave.\n\nIf you want to travel and return to Australia whilst your substantive visa application is being processed, you will need to be granted a BVB before you leave.\nSee how\n\n#### Attach more information\n\nAttach more information\n\nIf you are applying through ImmiAccount and did not attach all documents when you applied, attach them as soon as possible inImmiAccount.\n\nIf you are applying through ImmiAccount and did not attach all documents when you applied, attach them as soon as possible in\nImmiAccount\n.\n\nIf you are applying by webform, you must attach all documents before you submit your BVA application. You cannot attach extra documents after you have submitted your application.\n\nIf you are applying by webform, you must attach all documents before you submit your BVA application. You cannot attach extra documents after you have submitted your application.\n\nWe may ask you for more information. You should provide information how we ask you to in the request letter.\n\nWe may ask you for more information. You should provide information how we ask you to in the request letter.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nMake sure you stay lawful by holding a valid visa while we process your bridging visa and your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\n\nMake sure you stay lawful by holding a valid visa while we process your bridging visa and your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\nSee how\n\n#### Including family members\n\nIncluding family members\n\nIf you and your family have made a combined application for a substantive visa in Australia, you might have also applied for a BVA. Check if family members already hold a BVA inVEVO\n\nIf you and your family have made a combined application for a substantive visa in Australia, you might have also applied for a BVA. Check if family members already hold a BVA in\nVEVO\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to doif your child is born after you apply.\n\nFind out what to do\nif your child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nTell us as soon as you can if you made a mistake on your application.\n\nTell us as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF).\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nTell us if you:\n\nTell us if you:\n- want someone to receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nwant someone to receive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- have asked someone to give you immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\nhave asked someone to give you immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n\nUpload your written notification or your forms toImmiAccountif you applied for your substantive visa online.\n\nUpload your written notification or your forms to\nImmiAccount\nif you applied for your substantive visa online.\n\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\n\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nSome of the things you need to tell us about after you have applied include:\n\nSome of the things you need to tell us about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- the birth of a child\nthe birth of a child\n- if you want to withdraw your application\nif you want to withdraw your application\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know in writing our decision about your visa application.\n\nWe will let you know in writing our decision about your visa application.\n\nYou and anyone included in your application must be in Australia when we make a decision.\n\nYou and anyone included in your application must be in Australia when we make a decision.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of the email with you when in Australia.\n\nKeep a copy of the email with you when in Australia.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- if you have a right to a review of the decision\nif you have a right to a review of the decision\nWhen you have this visa\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\nIn Australia\nLeaving Australia\n\n## In Australia\n\nIn Australia\n\n### How long you can stay\n\nHow long you can stay\n\nTo see when you must leave after you are notified of an outcome, useVEVO.\n\nTo see when you must leave after you are notified of an outcome, use\nVEVO\n.\n\n### When you have this visa\n\nWhen you have this visa\n- stay lawfully in Australia until we make a decision on your application for a visa or review\nstay lawfully in Australia until we make a decision on your application for a visa or review\n\nTo see your specific conditions, useVEVO.\n\nTo see your specific conditions, use\nVEVO\n.\n\n### What you must do on this visa (your obligations)\n\nWhat you must do on this visa (your obligations)\n- comply with all Australian laws including all visa conditions applied to your visa\ncomply with all Australian laws including all visa conditions applied to your visa\n\n### Working\n\nWorking\n\nIf you get a BVA that does not permit work, you can apply for a further Bridging Visa with no conditions if you can demonstrate financial hardship.\n\nIf you get a BVA that does not permit work, you can apply for a further Bridging Visa with no conditions if you can demonstrate financial hardship.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA.\n\nWe will assess your circumstances in relation to your claim that you need to work. If you do not meet the requirements for work, and you are still eligible for a BVA, we will grant you a new BVA with the same work prevention or restriction condition that was on your previous BVA.\n\nYou can't be granted a new BVA that lets you work if:\n\nYou can't be granted a new BVA that lets you work if:\n- your BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application, and\nyour BVA was granted to you because you have applied for judicial review of the decision made on your substantive visa application, and\n- that BVA prevents or restricts you from working in Australia.\nthat BVA prevents or restricts you from working in Australia.\n\n### Travelling\n\nTravelling\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, seeVEVO. A BVA that is in-effect will cease upon departure from Australia\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, see\nVEVO\n. A BVA that is in-effect will cease upon departure from Australia\n\nIf you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave.\n\nIf you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave.\n\n### Tell us if things change\n\nTell us if things change\n\nSome of the things you need to let us know about after you have applied include:\n\nSome of the things you need to let us know about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, seeVEVO.  A BVA that is in-effect will cease upon departure from Australia\n\nIf you leave Australia on this visa when it is in effect you will not be able to return on it. To see if your BVA is in effect, see\nVEVO\n.  A BVA that is in-effect will cease upon departure from Australia\n\nIf you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave.\n\nIf you want to travel and return to Australia whilst your substantive visa remains under consideration, you will need to have been granted a BVB before you leave.\n\nAt the Border\n\nAt the Border\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\nProving you have been to Australia\n\nProving you have been to Australia\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:18:36.968394",
  "metadata": {}
}