{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837",
  "title": "Orphan Relative visa",
  "raw_text": "===== main placeholder ========================================== (Subclass 837) Orphan Relative visa This visa lets a child who is single and already in Australia stay with a relative if their parents are deceased, can't care for them or can't be found. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Stay Permanently Cost From AUD1,980.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa the child can stay in Australia indefinitely work and study in Australia in line with Australian law enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible. See all conditions Check your eligibility The child must be under 18 years of age, single and with no parent to care for them have a relative who is a settled Australian citizen, eligible New Zealand citizen or Australian permanent resident be in Australia but not in immigration clearance when the application is made and when we make a decision Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications With this visa the child can ​How long the child can stay Include other children Cost Apply from Processing times The child's obligations Visa label With this visa the child can stay in Australia indefinitely work and study in Australia in line with Australian law enrol in Australia's public healthcare scheme, Medicare sponsor relatives to come to Australia attend free English language classes provided by the Adult Migrant English Program , if eligible apply for Australian citizenship , if eligible. Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility, they: will need to apply for and be granted a Resident Return (RRV) visa to re-enter Australia as a permanent resident can also consider Australian citizenship. If they become an Australian citizen, they won't require a visa to enter Australia. They will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship To see when the child's travel facility ends, use VEVO ​How long the child can stay This is a permanent visa. It lets the child stay in Australia indefinitely. For citizenship purposes, the child becomes a permanent resident on the day we grant the visa. Include other children If the child has siblings who also want to apply, make a separate application for each sibling. The child's dependent children can be included on their application when they apply or at any time before we decide the application. Dependent children of the child who apply for the visa must meet our health requirement Family members who are not coming to Australia might also have to meet our health requirement. Cost The visa costs AUD1,980.00 for the main applicant. There is also a charge for each of the child's dependent children who apply for the visa. There might also be other costs for health checks police certificates and biometrics Use the Visa Pricing Estimator to work out what your visa will cost. The estimator does not take into account the other costs. Apply from The child must be in Australia when the application is made and when we make a decision. The child can't validly apply for this visa if they are in Australia on another visa with a no further stay condition. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. The application might take longer to process if: it is not filled in correctly it does not include all required documents or we need more information from you it takes us time to verify your information you do not make full payment at the time of initial lodgement. We cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application. You should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement. We will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application. The child's obligations The child and any of their dependent children who are granted the visa must obey all Australian laws. Visa label We will digitally link the child's visa to their passport. They will not get a label in their passport. If we grant the visa, we will send a grant notification letter containing the visa grant number. Use this number to access the digital visa record. Eligibility From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Have a sponsor Details The child must be sponsored by an eligible sibling or step-sibling, grandparent or step-grandparent, aunt, uncle, step-aunt or step-uncle. We must approve the sponsorship before the visa can be granted. If the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application. If the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances. Learn more about measures for the protection of children Be this age Details The child must be under 18 years old when they apply for the visa. Have no parent who can care for them Details We will not grant this visa unless the child has no parent who can care for them. This might be because both of their parents either: are deceased are permanently incapable of caring for the child can't be found. We will not grant this visa if the child's parents are capable of caring for them but don't want to. Have consent to migrate to Australia Details We will only grant this visa to a child younger than 18 years if either: the child has the written consent of everyone who can legally decide where they live the laws of the child’s home country allow them to leave their home country it is consistent with any Australian child order about the child Hold a visa Details The child might not be able to get this visa if: they do not currently hold a substantive visa they have not applied to get an Orphan Relative visa within 12 months of the previous substantive visa ceasing the substantive visa they hold or last held was a subclass 771 Transit visa. Meet the health requirement Details The child and any of their dependent children who apply for the visa with them must meet our health requirement Dependent children who are not applying for the visa might also have to meet our health requirement. Meet the character requirement Details If the child is aged 16 years or older they must meet our character requirement We might also ask that other dependent children who apply for the visa meet the requirement. Have paid back debt to the Australian Government Details If the child owes the Australian Government money it must be paid it back or there must be a formal arrangement to pay it back. Not have had a visa cancelled or a previous application refused Details We will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused. In some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, see Limitations on applications in Australia (129KB PDF) If applying for a visa from outside Australia, see Can I go to Australia If immigration assistance is needed, see Who can help with your visa application Best interests of the child We might not grant this visa if it is not in the best interests of an applicant under 18. Details Meet all these criteria? Check how to apply in our step by step guide. Meet all these criteria? Check how to apply in our step by step guide. Step by step From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications Step 1 Before you apply Check the child's passport is valid. Tell us if someone is acting on the child's behalf. Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Provide documents to support the application. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove the child's identity or don't provide true information Identity documents Provide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if they have one proof of change of name, if applicable. Documents that prove a change of name include: change of name documents from an Australian registry of births, deaths and marriages, or the relevant overseas authority documents that show other names the child has been known by. See how Travel documents Provide a certified copy of the passport or travel document the child used to enter Australia. We also need copies of any passports the child has held since then. See how Photographs Provide 4 recent passport-size photos (45mm x 35mm) of the child and for any other dependant included in the application. Photographs must be: passport-size (45mm x 35mm) less than 6 months old good quality colour. We don't accept laser copies a full-face view of your head and shoulders taken against a plain light-coloured background The child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face. See how Evidence the child has no parents who can care for them You must provide evidence the child has no parents capable of caring for them. Provide: a death certificate or other official document evidence such as a medical report, showing why the child's parents are unable to care for them If the child's parents can't be found, provide evidence of: how long they have been missing what efforts have been made to contact or find them See how Child's relationship to their relative Provide evidence of the child's relationship to the sponsor such as: a birth certificate a marriage certificate an adoption certificate a family status certificate or family book, if officially issued and maintained See how Character documents Children over 16 years must provide police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16. For Australia, we only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. The Australian Federal Police issue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police. For immigration purposes, police certificates are valid for 12 months from the issue date. If anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers. Children over 16 years must complete and provide Form 80 Personal particulars for assessment including character assessment (596KB PDF) See how Documents for dependants under 18 For every dependant under 18 years old who is applying with the child, provide: identity documents proof of the child's relationship with them, like a birth certificate character documents, if applicable See how Parental responsibility documents Any applicant under 18 years of age must get consent to migrate to Australia. This must be from everyone who has a legal right to decide where the child lives. They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving consent for the child to stay in Australia on this visa. Include an identity document with the signature and photo of the person who completed the form or declaration. This could be a: passport driver’s licence. Alternatively, you can show us: an Australian court order that allows the child to migrate to Australia, or that the laws of the child's home country allow them to leave their home country. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Send written notification or your forms with your paper application. See how Prepare the documents See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. See how Certify Do not certify police certificates. Send us the originals. Have all other documents certified . This includes: non-English documents English translations See how Keep Keep a copy of the completed application. Send Send us: original police certificates certified copies of all other documents as much information as possible to help us decide your application each document only once, even if you are using to show more than one thing all documents with your application, if you can Step 3 Apply for the visa You must apply for this visa on paper. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply on paper Complete the following 2 forms and send them together by post or courier to the Child and Other Family Processing Centre in Perth. You must pay the application charge before you post your application . See how to pay We will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge. You must also include all the relevant supporting documentation. Form 47CH Application for migration to Australia by a child (2MB PDF) Form 40CH Sponsorship for a child to migrate to Australia (2MB PDF) We cannot consider your application if you submit it at any other office or in any other way, as it will not be valid. You cannot submit applications for this visa in person. You must complete the forms in English. By post (with correct prepaid postage) Department of Home Affairs Child and Other Family Processing Centre Locked Bag 7 NORTHBRIDGE WA 6865 By courier: Department of Home Affairs Child and Other Family Processing Centre Wellington Central 836 Wellington Street WEST PERTH WA 6005 If any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application. Do not send original documents with your application, only send certified copies . Keep a copy of your completed application for your own records, including any supporting documents. See how Step 4 After applying Show steps Importing your paper application After you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter. Importing your application into ImmiAccount gives you access to online services, making it easier to manage your application. You can use our online services in ImmiAccount to: attach supporting documents to your application view messages update your details view your application status apply for a Bridging Visa (BV) withdraw your application. Follow these steps to import your application: Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use ImmiAccount Once you log in, import your application by entering your: application ID date of birth identity document number (Passport, ImmiCard or Titre de Voyage number). For more information, see Apply and Manage your application in ImmiAccount You can import any new and existing applications for this visa made in Australia. See how Status updates We can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further. See how Travel Tell us if the child wants to travel outside Australia while we process the application. We need to know because if the child made the visa application in Australia, we can't grant the visa if they are outside Australia when we make our decision. If the child leaves Australia, make sure they have a valid visa to return. Learn about visa expiry See how Health exams We will let you know when to arrange the child’s health examinations See how Biometrics We might ask for biometrics . We will let you know if you need to provide them. See how Send more information If you did not include all necessary documents when you applied, provide them as soon as you can. We might also ask you to provide more information. If you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount If you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre online form See how Stay lawful Make sure the child stays lawful by holding a valid visa while we process their application. When the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application. Learn more about visa expiry See how Add family members You can add the child's dependent children to their visa application any time before we make a decision. See how Newborn children Find out what to do if your child is born after you apply Mistakes on the application Let us know as soon as possible. Complete Form 1023 Notification of incorrect answers (168KB PDF) If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre online form See how Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) For more information see Who can help you with your application If you have imported your application into ImmiAccount, you can use it to upload the completed form. If you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre online form See how Tell us if things change Things you need to let us know include: changes to your phone number, address or passport changes to your relationship status the birth of a child you want to withdraw the application. See how to tell us if the situation changes See how Step 5 Visa outcome The child must be in Australia when we make a decision. We will advise of our decision in writing. Keep a copy of the decision. If we grant the child's visa, we will tell you the: visa grant number date the visa starts visa conditions. If we refuse the child's visa we will tell you: why we refused the visa whether there is a right to a review of the decision. We will not refund the application fee if we refuse the application. When you have this visa From 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount. For more information, see Update to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications In Australia Leaving Australia In Australia The child's obligations The child and family members must obey all Australian laws. See how long the child can stay This is a permanent visa. The child can stay in Australia indefinitely. For citizenship purposes, the child's permanent residence starts on the day they were granted the visa. Access Support Services It is important to be aware of your rights and the supports that are available to you in Australia. On this visa, you can stay in Australia permanently and have the rights provided to every Australian resident including being free from abuse and exploitation. See Rights and protections | Attorney-General's Department Your sponsor cannot cancel your visa, withdraw their sponsorship or otherwise influence your residency status in Australia. If you believe you may be a victim of abuse or exploitation, support is available. The following is a list of support services, which can provide help and further information: Kids Helpline - Kids Helpline | Phone Counselling Service | 1800 55 1800 Phone Number (1800 551 800) Lifeline - Lifeline Australia - 13 11 14 - Crisis Support. Suicide Prevention. Phone number (13 11 14) 1800Respect - Home | 1800RESPECT Phone number (1800 737 732) The Salvation Army - Additional Referral Pathway (ARP) . For support if you think you are experiencing exploitation. Phone number (1800 000 277) Life Without Barriers - Forced Marriage Support | Life Without Barriers For support if you feel pressured to get married. Phone number (1800 403 213) MyBlueSky - MBS | Home The Australian Federal Police (AFP) - (AFP) can help keep you safe from exploitation or forced marriage. You don’t have to give your name to make a report to the AFP. Phone number 131 237 (131 AFP). For more information on exploitation and how to get help visit Modern Slavery. Phone Triple Zero (000) if it is an emergency or if you or someone else is not safe. Tell us if things change We need to know about: changes to the child's passport the birth of a child change of name See how to let us know if there is a change in the child's situation Travel to and from Australia for 5 years The child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid. If the child wants to travel after the initial 5-year travel facility they: will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident might also want to consider Australian citizenship. If they become an Australian citizen, they will not require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship. For more information see Resident Return (RRV) To see when the child's travel facility ends, use VEVO Work and study The child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law. For further information refer to the Fair Work Ombudsman’s webpage, Visa holders and migrant workers – workplace rights and entitlements. Bring a family member You cannot add dependants to this visa after we have made a decision. To find out more about what visa a family member could apply for, see explore visa options Become an Australian citizen After a certain time, the child might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, the child's permanent residence starts on the day they are granted the visa. Leaving Australia Before you leave Check the child's travel documents The child must have a valid passport or other travel document to leave Australia. Check if the child needs a Resident Return visa to return to Australia as a permanent resident in VEVO At the border Leave the airport faster We have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using the SmartGate After you leave Prove the child has been to Australia To get proof of your travel in and out of Australia Request your international movement records",
  "main_content": "===== main placeholder ==========================================\n(Subclass 837)\n\n# Orphan Relative visa\n\nOrphan Relative visa\n\nThis visa lets a child who is single and already in Australia stay with a relative if their parents are deceased, can't care for them or can't be found.\n\nThis visa lets a child who is single and already in Australia stay with a relative if their parents are deceased, can't care for them or can't be found.\n\nThis visa lets a child who is single and already in Australia stay with a relative if their parents are deceased, can't care for them or can't be found.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD1,980.00\n\nFromAUD1,980.00\n\nFrom\nAUD1,980.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia in line with Australian law\nwork and study in Australia in line with Australian law\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible.\napply for\nAustralian citizenship\n, if eligible.\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### The child must\n\nThe child must\n- be under 18 years of age, single and with no parent to care for them\nbe under 18 years of age, single and with no parent to care for them\n- have a relative who is asettledAustralian citizen,eligible New Zealand citizenor Australian permanent resident\nhave a relative who is a\nsettled\nAustralian citizen,\neligible New Zealand citizen\nor Australian permanent resident\n- be in Australia but not in immigration clearance when the application is made and when we make a decision\nbe in Australia but not in immigration clearance when the application is made and when we make a decision\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nWith this visa the child can\n​How long the child can stay\nInclude other children\nCost\nApply from\nProcessing times\nThe child's obligations\nVisa label\n\n## With this visa the child can\n\nWith this visa the child can\n- stay in Australia indefinitely\nstay in Australia indefinitely\n- work and study in Australia in line with Australian law\nwork and study in Australia in line with Australian law\n- enrol in Australia's public healthcare scheme,Medicare\nenrol in Australia's public healthcare scheme,\nMedicare\n- sponsor relatives to come to Australia\nsponsor relatives to come to Australia\n- attend free English language classes provided by theAdult Migrant English Program, if eligible\nattend free English language classes provided by the\nAdult Migrant English Program\n, if eligible\n- apply forAustralian citizenship, if eligible.\napply for\nAustralian citizenship\n, if eligible.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility, they:\n\nIf the child wants to travel after the initial 5-year travel facility, they:\n- will need to apply for and be granted aResident Return (RRV)visa to re-enter Australia as a permanent resident\nwill need to apply for and be granted a\nResident Return (RRV)\nvisa to re-enter Australia as a permanent resident\n- can also consider Australian citizenship. If they become an Australian citizen, they won't require a visa to enter Australia. They will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times forAustralian citizenship.\ncan also consider Australian citizenship. If they become an Australian citizen, they won't require a visa to enter Australia. They will need to apply for an Australian passport and use it to leave and re-enter Australia. See more about eligibility requirements and current processing times for\nAustralian citizenship\n.\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n## ​How long the child can stay\n\n​How long the child can stay\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nThis is a permanent visa. It lets the child stay in Australia indefinitely.\n\nFor citizenship purposes, the child becomes a permanent resident on the day we grant the visa.\n\nFor citizenship purposes, the child becomes a permanent resident on the day we grant the visa.\n\n## Include other children\n\nInclude other children\n\nIf the child has siblings who also want to apply, make a separate application for each sibling.\n\nIf the child has siblings who also want to apply, make a separate application for each sibling.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nThe child's dependent children can be included on their application when they apply or at any time before we decide the application.\n\nDependent children of the child who apply for the visa must meet ourhealth requirement.\n\nDependent children of the child who apply for the visa must meet our\nhealth requirement\n.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\nFamily members who are not coming to Australia might also have to meet our health requirement.\n\n## Cost\n\nCost\n\nThe visa costsAUD1,980.00for the main applicant.\n\nThe visa costs\nAUD1,980.00\nfor the main applicant.\n\nThere is also a charge for each of the child's dependent children who apply for the visa.\n\nThere is also a charge for each of the child's dependent children who apply for the visa.\n\nThere might also be other costs forhealth checks,police certificatesandbiometrics.\n\nThere might also be other costs for\nhealth checks\n,\npolice certificates\nand\nbiometrics\n.\n\nUse theVisa Pricing Estimatorto work out what your visa will cost. The estimator does not take into account the other costs.\n\nUse the\nVisa Pricing Estimator\nto work out what your visa will cost. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nThe child must be in Australia when the application is made and when we make a decision.\n\nThe child must be in Australia when the application is made and when we make a decision.\n\nThe child can't validly apply for this visa if they are in Australia on another visa with a no further stay condition.\n\nThe child can't validly apply for this visa if they are in Australia on another visa with a no further stay condition.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nThe application might take longer to process if:\n\nThe application might take longer to process if:\n- it is not filled in correctly\nit is not filled in correctly\n- it does not include all required documents or we need more information from you\nit does not include all required documents or we need more information from you\n- it takes us time to verify your information\nit takes us time to verify your information\n- you do not make full payment at the time of initial lodgement.\nyou do not make full payment at the time of initial lodgement.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nWe cannot process the application if you do not pay the correct visa application charge. If this happens, we will let you know and may return your application.\n\nYou should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement.\n\nYou should receive an acknowledgement of your application (and advice of any associated bridging visa) within approximately one (1) month after lodgement.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\nWe will contact you using your authorised method if we need more information. Otherwise, we will contact you with the outcome of your application.\n\n## The child's obligations\n\nThe child's obligations\n\nThe child and any of their dependent children who are granted the visa must obey all Australian laws.\n\nThe child and any of their dependent children who are granted the visa must obey all Australian laws.\n\n## Visa label\n\nVisa label\n\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\n\nWe will digitally link the child's visa to their passport. They will not get a label in their passport.\n\nIf we grant the visa, we will send a grant notification letter containing the visa grant number. Use this number to access the digital visa record.\n\nIf we grant the visa, we will send a grant notification letter containing the visa grant number. Use this number to access the digital visa record.\nEligibility\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\n## Have a sponsor\n\nHave a sponsor\nDetails\n\nThe child must be sponsored by an eligible sibling or step-sibling, grandparent or step-grandparent, aunt, uncle, step-aunt or step-uncle.\n\nThe child must be sponsored by an eligible sibling or step-sibling, grandparent or step-grandparent, aunt, uncle, step-aunt or step-uncle.\n\nWe must approve the sponsorship before the visa can be granted.\n\nWe must approve the sponsorship before the visa can be granted.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a pending registrable offence charge, we will refuse the sponsorship and visa application.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nIf the sponsor and/or their spouse or de facto partner (if any) have a registrable offence conviction, we can only approve the sponsorship in very limited circumstances.\n\nLearn more aboutmeasures for the protection of children.\n\nLearn more about\nmeasures for the protection of children\n.\n\n## Be this age\n\nBe this age\nDetails\n\nThe child must be under 18 years old when they apply for the visa.\n\nThe child must be under 18 years old when they apply for the visa.\n\n## Have no parent who can care for them\n\nHave no parent who can care for them\nDetails\n\nWe will not grant this visa unless the child has no parent who can care for them. This might be because both of their parents either:\n\nWe will not grant this visa unless the child has no parent who can care for them. This might be because both of their parents either:\n- are deceased\nare deceased\n- are permanently incapable of caring for the child\nare permanently incapable of caring for the child\n- can't be found.\ncan't be found.\n\nWe will not grant this visa if the child's parents are capable of caring for them but don't want to.\n\nWe will not grant this visa if the child's parents are capable of caring for them but don't want to.\n\n## Have consent to migrate to Australia\n\nHave consent to migrate to Australia\nDetails\n\nWe will only grant this visa to a child younger than 18 years if either:\n\nWe will only grant this visa to a child younger than 18 years if either:\n- the child has the written consent of everyone who can legally decide where they live\nthe child has the written consent of everyone who can legally decide where they live\n- the laws of the child’s home country allow them to leave their home country\nthe laws of the child’s home country allow them to leave their home country\n- it is consistent with anyAustralian child orderabout the child\nit is consistent with any\nAustralian child order\nabout the child\n\n## Hold a visa\n\nHold a visa\nDetails\n\nThe child might not be able to get this visa if:\n\nThe child might not be able to get this visa if:\n- they do not currently hold asubstantive visa\nthey do not currently hold a\nsubstantive visa\n- they have not applied to get an Orphan Relative visa within 12 months of the previous substantive visa ceasing\nthey have not applied to get an Orphan Relative visa within 12 months of the previous substantive visa ceasing\n- the substantive visa they hold or last held was a subclass 771 Transit visa.\nthe substantive visa they hold or last held was a subclass 771 Transit visa.\n\n## Meet the health requirement\n\nMeet the health requirement\nDetails\n\nThe child and any of their dependent children who apply for the visa with them must meet ourhealth requirement.\n\nThe child and any of their dependent children who apply for the visa with them must meet our\nhealth requirement\n.\n\nDependent children who are not applying for the visa might also have to meet our health requirement.\n\nDependent children who are not applying for the visa might also have to meet our health requirement.\n\n## Meet the character requirement\n\nMeet the character requirement\nDetails\n\nIf the child is aged 16 years or older they must meet ourcharacter requirement.\n\nIf the child is aged 16 years or older they must meet our\ncharacter requirement\n.\n\nWe might also ask that other dependent children who apply for the visa meet the requirement.\n\nWe might also ask that other dependent children who apply for the visa meet the requirement.\n\n## Have paid back debt to the Australian Government\n\nHave paid back debt to the Australian Government\nDetails\n\nIf the child owes the Australian Government money it must be paid it back or there must be a formal arrangement to pay it back.\n\nIf the child owes the Australian Government money it must be paid it back or there must be a formal arrangement to pay it back.\n\n## Not have had a visa cancelled or a previous application refused\n\nNot have had a visa cancelled or a previous application refused\nDetails\n\nWe will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused.\n\nWe will consider the child’s immigration history when we make a decision on the application, which means the child might not be eligible for this visa if they have had a visa cancelled or refused.\n\nIn some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, seeLimitations on applications in Australia (129KB PDF).\n\nIn some circumstances, the child may still apply for a permanent visa if they have had a visa cancelled or an application refused, see\nLimitations on applications in Australia (129KB PDF)\n.\n\nIf applying for a visa from outside Australia, seeCan I go to Australia.\n\nIf applying for a visa from outside Australia, see\nCan I go to Australia\n.\n\nIf immigration assistance is needed, seeWho can help with your visa application.\n\nIf immigration assistance is needed, see\nWho can help with your visa application\n.\n\n## Best interests of the child\n\nBest interests of the child\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\nDetails\n\nMeet all these criteria? Check how to apply in ourstep by step guide.\n\nMeet all these criteria? Check how to apply in our\nstep by step guide.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\n\nStep 1\n\nStep 1\nBefore you apply\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\n\nCheck the child's passport is valid. Tell us if someone is acting on the child's behalf.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nProvide documents to support the application.\n\nProvide documents to support the application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if you can'tprove the child's identity or don't provide true information.\n\nProvide accurate information. See what happens if you can't\nprove the child's identity or don't provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of the child's current passport showing their photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if they have one\na national identity card, if they have one\n- proof of change of name, if applicable.\nproof of change of name, if applicable.\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- change of name documents from an Australian registry of births, deaths and marriages, or the relevant overseas authority\nchange of name documents from an Australian registry of births, deaths and marriages, or the relevant overseas authority\n- documents that show other names the child has been known by.\ndocuments that show other names the child has been known by.\nSee how\n\n#### Travel documents\n\nTravel documents\n\nProvide a certified copy of the passport or travel document the child used to enter Australia. We also need copies of any passports the child has held since then.\n\nProvide a certified copy of the passport or travel document the child used to enter Australia. We also need copies of any passports the child has held since then.\nSee how\n\n#### Photographs\n\nPhotographs\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any other dependant included in the application.\n\nProvide 4 recent passport-size photos (45mm x 35mm) of the child and for any other dependant included in the application.\n\nPhotographs must be:\n\nPhotographs must be:\n- passport-size (45mm x 35mm)\npassport-size (45mm x 35mm)\n- less than 6 months old\nless than 6 months old\n- good quality colour. We don't accept laser copies\ngood quality colour. We don't accept laser copies\n- a full-face view of your head and shoulders\na full-face view of your head and shoulders\n- taken against a plain light-coloured background\ntaken against a plain light-coloured background\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\n\nThe child can wear untinted prescription glasses. If the child wears a head covering for religious reasons, they can show only their face.\nSee how\n\n#### Evidence the child has no parents who can care for them\n\nEvidence the child has no parents who can care for them\n\nYou must provide evidence the child has no parents capable of caring for them.\n\nYou must provide evidence the child has no parents capable of caring for them.\n\nProvide:\n\nProvide:\n- a death certificate or other official document\na death certificate or other official document\n- evidence such as a medical report, showing why the child's parents are unable to care for them\nevidence such as a medical report, showing why the child's parents are unable to care for them\n\nIf the child's parents can't be found, provide evidence of:\n\nIf the child's parents can't be found, provide evidence of:\n- how long they have been missing\nhow long they have been missing\n- what efforts have been made to contact or find them\nwhat efforts have been made to contact or find them\nSee how\n\n#### Child's relationship to their relative\n\nChild's relationship to their relative\n\nProvide evidence of the child's relationship to the sponsor such as:\n\nProvide evidence of the child's relationship to the sponsor such as:\n- a birth certificate\na birth certificate\n- a marriage certificate\na marriage certificate\n- an adoption certificate\nan adoption certificate\n- a family status certificate or family book, if officially issued and maintained\na family status certificate or family book, if officially issued and maintained\nSee how\n\n#### Character documents\n\nCharacter documents\n\nChildren over 16 years must provide police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16.\n\nChildren over 16 years must provide police certificates from every country they have spent 12 months or more in the last 10 years, since turning 16.\n\nFor Australia, we only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. TheAustralian Federal Policeissue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\n\nFor Australia, we only accept National Police Certificates applied for under Code 33 – Immigration/Citizenship. The\nAustralian Federal Police\nissue these certificates. We don't accept standard disclosure certificates or certificates issued by Australian state or territory police.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nFor immigration purposes, police certificates are valid for 12 months from the issue date.\n\nIf anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers.\n\nIf anyone in the application served in the armed forces of any country, they must provide military service records or discharge papers.\n\nChildren over 16 years must complete and provideForm 80 Personal particulars for assessment including character assessment (596KB PDF).\n\nChildren over 16 years must complete and provide\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n.\nSee how\n\n#### Documents for dependants under 18\n\nDocuments for dependants under 18\n\nFor every dependant under 18 years old who is applying with the child, provide:\n\nFor every dependant under 18 years old who is applying with the child, provide:\n- identity documents\nidentity documents\n- proof of the child's relationship with them, like a birth certificate\nproof of the child's relationship with them, like a birth certificate\n- character documents, if applicable\ncharacter documents, if applicable\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nAny applicant under 18 years of age must get consent to migrate to Australia. This must be from everyone who has a legal right to decide where the child lives.\n\nAny applicant under 18 years of age must get consent to migrate to Australia. This must be from everyone who has a legal right to decide where the child lives.\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving consent for the child to stay in Australia on this visa.\na statutory declaration giving consent for the child to stay in Australia on this visa.\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration. This could be a:\n\nInclude an identity document with the signature and photo of the person who completed the form or declaration. This could be a:\n- passport\npassport\n- driver’s licence.\ndriver’s licence.\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows the child to migrate to Australia, or\nan Australian court order that allows the child to migrate to Australia, or\n- that the laws of the child's home country allow them to leave their home country.\nthat the laws of the child's home country allow them to leave their home country.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nSend written notification or your forms with your paper application.\n\nSend written notification or your forms with your paper application.\nSee how\n\n#### Prepare the documents\n\nPrepare the documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\nSee how\n\n#### Certify\n\nCertify\n\nDo not certify police certificates. Send us the originals.\n\nDo not certify police certificates. Send us the originals.\n\nHave all other documentscertified. This includes:\n\nHave all other documents\ncertified\n. This includes:\n- non-English documents\nnon-English documents\n- English translations\nEnglish translations\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of the completed application.\n\nKeep a copy of the completed application.\n\n#### Send\n\nSend\n\nSend us:\n\nSend us:\n- original police certificates\noriginal police certificates\n- certified copies of all other documents\ncertified copies of all other documents\n- as much information as possible to help us decide your application\nas much information as possible to help us decide your application\n- each document only once, even if you are using to show more than one thing\neach document only once, even if you are using to show more than one thing\n- all documents with your application, if you can\nall documents with your application, if you can\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa on paper.\n\nYou must apply for this visa on paper.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Apply on paper\n\nApply on paper\n\nComplete the following 2 forms and send them together by post or courier to the Child and Other Family Processing Centre in Perth.\n\nComplete the following 2 forms and send them together by post or courier to the Child and Other Family Processing Centre in Perth.\n\nYou must pay the application chargebefore you post your application. Seehow to pay.\n\nYou must pay the application charge\nbefore you post your application\n. See\nhow to pay\n.\n\nWe will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge. You must also include all the relevant supporting documentation.\n\nWe will not process your application until you pay the application charge. Your application should also include evidence of payment of the application charge. You must also include all the relevant supporting documentation.\n- Form 47CH Application for migration to Australia by a child (2MB PDF)\nForm 47CH Application for migration to Australia by a child (2MB PDF)\n- Form 40CH Sponsorship for a child to migrate to Australia (2MB PDF)\nForm 40CH Sponsorship for a child to migrate to Australia (2MB PDF)\n\nWe cannot consider your application if you submit it at any other office or in any other way, as it will not be valid. You cannot submit applications for this visa in person.\n\nWe cannot consider your application if you submit it at any other office or in any other way, as it will not be valid. You cannot submit applications for this visa in person.\n\nYou must complete the forms in English.\n\nYou must complete the forms in English.\n\nBy post (with correct prepaid postage):\n\nBy post (with correct prepaid postage)\n:\n\nDepartment of Home AffairsChild and Other Family Processing CentreLocked Bag 7NORTHBRIDGE WA 6865\n\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nLocked Bag 7\nNORTHBRIDGE WA 6865\n\nBy courier:\n\nBy courier:\n\nDepartment of Home AffairsChild and Other Family Processing CentreWellington Central836 Wellington StreetWEST PERTH WA 6005\n\nDepartment of Home Affairs\nChild and Other Family Processing Centre\nWellington Central\n836 Wellington Street\nWEST PERTH WA 6005\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nIf any of the above steps are incomplete, your application may be invalid. We do not process invalid applications. We will notify you if this is the case, and if requested, return your application.\n\nDo not send original documents with your application, only sendcertified copies. Keep a copy of your completed application for your own records, including any supporting documents.\n\nDo not send original documents with your application, only send\ncertified copies\n. Keep a copy of your completed application for your own records, including any supporting documents.\nSee how\n\nStep 4\n\nStep 4\nAfter applying\nShow\n                    steps\n\n#### Importing your paper application\n\nImporting your paper application\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nAfter you or someone else has submitted your paper application, import it into your ImmiAccount. You can do this after you get your acknowledgement letter.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nImporting your application into ImmiAccount gives you access to online services, making it easier to manage your application.\n\nYou can use our online services in ImmiAccount to:\n\nYou can use our online services in ImmiAccount to:\n- attach supporting documents to your application\nattach supporting documents to your application\n- view messages\nview messages\n- update your details\nupdate your details\n- view your application status\nview your application status\n- apply for a Bridging Visa (BV)\napply for a Bridging Visa (BV)\n- withdraw your application.\nwithdraw your application.\n\nFollow these steps to import your application:\n\nFollow these steps to import your application:\n1. Create a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to useImmiAccount.\nCreate a new ImmiAccount or log into your existing ImmiAccount. Our website has instructions on how to use\nImmiAccount\n.\n2. Once you log in, import your application by entering your:application IDdate of birthidentity document number (Passport, ImmiCard or Titre de Voyage number).\nOnce you log in, import your application by entering your:\n1. application ID\napplication ID\n1. date of birth\ndate of birth\n1. identity document number (Passport, ImmiCard or Titre de Voyage number).\nidentity document number (Passport, ImmiCard or Titre de Voyage number).\n\nFor more information, seeApply and Manage your application in ImmiAccount.\n\nFor more information, see\nApply and Manage your application in ImmiAccount\n.\n\nYou can import any new and existing applications for this visa made in Australia.\n\nYou can import any new and existing applications for this visa made in Australia.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further.\n\nWe can't provide updates on the progress of the child's application within normal processing times. We will let you know if we need anything further.\nSee how\n\n#### Travel\n\nTravel\n\nTell us if the child wants to travel outside Australia while we process the application. We need to know because if the child made the visa application in Australia, we can't grant the visa if they are outside Australia when we make our decision.\n\nTell us if the child wants to travel outside Australia while we process the application. We need to know because if the child made the visa application in Australia, we can't grant the visa if they are outside Australia when we make our decision.\n\nIf the child leaves Australia, make sure they have a valid visa to return.\n\nIf the child leaves Australia, make sure they have a valid visa to return.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know when to arrange the child’shealth examinations.\n\nWe will let you know when to arrange the child’s\nhealth examinations\n.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n. We will let you know if you need to provide them.\nSee how\n\n#### Send more information\n\nSend more information\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nIf you did not include all necessary documents when you applied, provide them as soon as you can.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you have imported your application into ImmiAccount, to provide any additional documents upload them into ImmiAccount\n\nIf you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, to provide any additional documents attach them to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nMake sure the child stays lawful by holding a valid visa while we process their application.\n\nMake sure the child stays lawful by holding a valid visa while we process their application.\n\nWhen the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application.\n\nWhen the visa application was made, the child was granted a bridging visa associated with the application. If their current visa expires before we make a decision, the bridging visa will start. The child can stay in Australia on the bridging visa while we process their new visa application.\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Add family members\n\nAdd family members\n\nYou can add the child's dependent children to their visa application any time before we make a decision.\n\nYou can add the child's dependent children to their visa application any time before we make a decision.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply.\n\nFind out what to do if\nyour child is born after you apply\n.\n\n#### Mistakes on the application\n\nMistakes on the application\n\nLet us know as soon as possible.\n\nLet us know as soon as possible.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF).\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you have imported your application into ImmiAccount, you can use it to upload the completed form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centreonline form.\n\nIf you can’t use ImmiAccount, attach the completed form to a completed Child and Orphan Relative Visa Processing Centre\nonline form\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know include:\n\nThings you need to let us know include:\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child\nthe birth of a child\n- you want to withdraw the application.\nyou want to withdraw the application.\n\nSee how to tell us ifthe situation changes.\n\nSee how to tell us if\nthe situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nThe child must be in Australia when we make a decision.\n\nThe child must be in Australia when we make a decision.\n\nWe will advise of our decision in writing. Keep a copy of the decision.\n\nWe will advise of our decision in writing. Keep a copy of the decision.\n\nIf we grant the child's visa, we will tell you the:\n\nIf we grant the child's visa, we will tell you the:\n- visa grant number\nvisa grant number\n- date the visa starts\ndate the visa starts\n- visa conditions.\nvisa conditions.\n\nIf we refuse the child's visa we will tell you:\n\nIf we refuse the child's visa we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether there is a right to a review of the decision.\nwhether there is a right to a review of the decision.\n\nWe will not refund the application fee if we refuse the application.\n\nWe will not refund the application fee if we refuse the application.\nWhen you have this visa\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.​\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.For more information, seeUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications.\n\nFrom 23 July 2025, applicants for Child visa subclasses 101, 102, 802, 445, 117 and 837 can import their paper application into ImmiAccount. Some existing applications made outside of Australia before 1 April 2020 cannot be imported into ImmiAccount.\nFor more information, see\nUpdate to ImmiAccount — new online services for paper-based Child, Other Family, Former Residents, and New Zealand Citizen Family Relationship visa applications\n.\n​\nIn Australia\nLeaving Australia\n\n## In Australia\n\nIn Australia\n\n### The child's obligations\n\nThe child's obligations\n\nThe child and family members must obey all Australian laws.\n\nThe child and family members must obey all Australian laws.\n\n### See how long the child can stay\n\nSee how long the child can stay\n\nThis is a permanent visa. The child can stay in Australia indefinitely.\n\nThis is a permanent visa. The child can stay in Australia indefinitely.\n\nFor citizenship purposes, the child's permanent residence starts on the day they were granted the visa.\n\nFor citizenship purposes, the child's permanent residence starts on the day they were granted the visa.\n\n### Access Support Services\n\nAccess Support Services\n\nIt is important to be aware of your rights and the supports that are available to you in Australia.\n\nIt is important to be aware of your rights and the supports that are available to you in Australia.\n\nOn this visa, you can stay in Australia permanently and have the rights provided to every Australian resident including being free from abuse and exploitation. SeeRights and protections | Attorney-General's Department.\n\nOn this visa, you can stay in Australia permanently and have the rights provided to every Australian resident including being free from abuse and exploitation. See\nRights and protections | Attorney-General's Department\n.\n\nYour sponsor cannot cancel your visa, withdraw their sponsorship or otherwise influence your residency status in Australia. If you believe you may be a victim of abuse or exploitation, support is available. The following is a list of support services, which can provide help and further information:\n\nYour sponsor cannot cancel your visa, withdraw their sponsorship or otherwise influence your residency status in Australia. If you believe you may be a victim of abuse or exploitation, support is available. The following is a list of support services, which can provide help and further information:\n- Kids Helpline -Kids Helpline | Phone Counselling Service | 1800 55 1800Phone Number (1800 551 800)\nKids Helpline -\nKids Helpline | Phone Counselling Service | 1800 55 1800\nPhone Number (1800 551 800)\n- Lifeline -Lifeline Australia - 13 11 14 - Crisis Support. Suicide Prevention.Phone number (13 11 14)\nLifeline -\nLifeline Australia - 13 11 14 - Crisis Support. Suicide Prevention.\nPhone number (13 11 14)\n- 1800Respect -Home | 1800RESPECTPhone number (1800 737 732)\n1800Respect -\nHome | 1800RESPECT\nPhone number (1800 737 732)\n- The Salvation Army -Additional Referral Pathway (ARP). For support if you think you are experiencing exploitation. Phone number (1800 000 277)\nThe Salvation Army -\nAdditional Referral Pathway (ARP)\n. For support if you think you are experiencing exploitation. Phone number (1800 000 277)\n- Life Without Barriers -Forced Marriage Support | Life Without BarriersFor support if you feel pressured to get married. Phone number (1800 403 213)\nLife Without Barriers -\nForced Marriage Support | Life Without Barriers\nFor support if you feel pressured to get married. Phone number (1800 403 213)\n- MyBlueSky -MBS | Home\nMyBlueSky -\nMBS | Home\n- The Australian Federal Police (AFP) -(AFP)can help keep you safe from exploitation or forced marriage. You don’t have to give your name to make a report to the AFP. Phone number 131 237 (131 AFP).\nThe Australian Federal Police (AFP) -\n(AFP)\ncan help keep you safe from exploitation or forced marriage. You don’t have to give your name to make a report to the AFP. Phone number 131 237 (131 AFP).\n\nFor more information on exploitation and how to get help visitModern Slavery.\n\nFor more information on exploitation and how to get help visit\nModern Slavery.\n\nPhone Triple Zero (000) if it is an emergency or if you or someone else is not safe.\n\nPhone Triple Zero (000) if it is an emergency or if you or someone else is not safe.\n\n### Tell us if things change\n\nTell us if things change\n\nWe need to know about:\n\nWe need to know about:\n- changes to the child's passport\nchanges to the child's passport\n- the birth of a child\nthe birth of a child\n- change of name\nchange of name\n\nSee how to let us know if there is achange in the child's situation.\n\nSee how to let us know if there is a\nchange in the child's situation\n.\n\n### Travel to and from Australia for 5 years\n\nTravel to and from Australia for 5 years\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nThe child can travel to and from Australia as many times as they want for 5 years from the date we grant this visa. This is as long as the travel facility of this visa remains valid.\n\nIf the child wants to travel after the initial 5-year travel facility they:\n\nIf the child wants to travel after the initial 5-year travel facility they:\n- will need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident\nwill need to apply for and be granted a Resident Return (RRV) visa so they can re-enter Australia as a permanent resident\n- might also want to consider Australian citizenship. If they become an Australian citizen, they will not require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship.\nmight also want to consider Australian citizenship. If they become an Australian citizen, they will not require a visa to re-enter Australia. See more about eligibility requirements and current processing times for Australian citizenship.\n\nFor more information seeResident Return (RRV)\n\nFor more information see\nResident Return (RRV)\n\nTo see when the child's travel facility ends, useVEVO.\n\nTo see when the child's travel facility ends, use\nVEVO\n.\n\n### Work and study\n\nWork and study\n\nThe child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law. For further information refer to the Fair Work Ombudsman’s webpage, Visa holders and migrant workers – workplace rights and entitlements.\n\nThe child may be able to work or study in Australia from the date we grant this visa. They are protected by Australian workplace law. For further information refer to the Fair Work Ombudsman’s webpage, Visa holders and migrant workers – workplace rights and entitlements.\n\n### Bring a family member\n\nBring a family member\n\nYou cannot add dependants to this visa after we have made a decision.\n\nYou cannot add dependants to this visa after we have made a decision.\n\nTo find out more about what visa a family member could apply for, seeexplore visa options.\n\nTo find out more about what visa a family member could apply for, see\nexplore visa options\n.\n\n### Become an Australian citizen\n\nBecome an Australian citizen\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, the child might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, the child's permanent residence starts on the day they are granted the visa.\n\nFor citizenship purposes, the child's permanent residence starts on the day they are granted the visa.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check the child's travel documents\n\nCheck the child's travel documents\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nThe child must have a valid passport or other travel document to leave Australia.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident inVEVO.\n\nCheck if the child needs a Resident Return visa to return to Australia as a permanent resident in\nVEVO\n.\n\n### At the border\n\nAt the border\n\n#### Leave the airport faster\n\nLeave the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using theSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. The child might be able to leave the airport faster using the\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Prove the child has been to Australia\n\nProve the child has been to Australia\n\nTo get proof of your travel in and out of AustraliaRequest your international movement records.\n\nTo get proof of your travel in and out of Australia\nRequest your international movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-117/measures-for-the-protection-of-children",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/orphan-relative-837#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:09:09.563379",
  "metadata": {}
}