{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
  "title": "Bridging visa B (BVB)",
  "raw_text": "===== main placeholder ========================================== Subclass 020 Bridging visa B (BVB) You can leave and return to Australia during a specified travel period while your application for a substantive visa is being processed. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ Stay Temporarily Cost AUD190.00 Processing times There are no processing times available for this visa. With this visa, you can stay lawfully in Australia until your substantive visa application is finally determined, or where granted in association with judicial review, until those proceedings are completed leave and return to Australia within the defined travel period while your application for a substantive visa is being processed work, if your BVB permits See all conditions Check your eligibility You must be in Australia when you apply for this visa be the holder of a BVA or a BVB have applied in Australia for a substantive visa that can be granted while you are in Australia if you meet all eligibility requirements, be in Australia at the time of grant Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application About this visa ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ About this visa In effect Working in Australia Remaining lawful during judicial review With this visa you can How long you can stay Stay longer Include family Cost Apply from Your obligations Travel Visa label About this visa This is a temporary visa. The BVB travel facility may be granted with single or multiple travel and will be valid for use until a specified date. If the travel facility has ended or does not have sufficient validity remaining to cover your proposed journey, then you will need to apply for and be granted a new BVB prior to leaving Australia. Check if you already hold a Bridging visa B (BVB) with VEVO A separate application for a BVB may be necessary where you have applied for judicial review. It is not possible to apply to change conditions on your BVB. If you want to change visa conditions, then you will need to consider applying for a Bridging visa A (BVA). You can’t use a bridging visa while you wait for a citizenship application to be decided. In effect A BVB comes into effect when: it is granted (if your substantive visa has ceased since applying for the BVB or where the BVB is more beneficial than your current bridging visa) your current substantive visa ceases. Visa holders must adhere to the conditions imposed on their visa. Where you are granted a BVB, you will be notified about the conditions that apply. If you hold a substantive visa when your BVB is granted, you must continue to comply with the conditions of the substantive visa. When your substantive visa ceases, the conditions of your BVB will apply. Working in Australia You might be allowed to work if the substantive visa you had or the visa you applied for lets you work. Your grant letter will tell you about the conditions that apply to your BVB. If the visa you had, and the visa you applied for have work restrictions you will not be able to work with a BVB. See if you have work restrictions in VEVO If you are the holder of a BVB that does not permit work, and you are seeking to change conditions, you will need to consider applying for a BVA . As part of this process you will need to demonstrate that you are in financial hardship. Remaining lawful during judicial review If a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform. With this visa you can Stay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete. Leave and return to Australia within the defined travel period while your application for a substantive visa is being processed. How long you can stay One of the following outcomes will determine when your BVB ceases: your substantive visa application is refused your merits or judicial review is decided you withdraw your application for the substantive visa, merits review or judicial review a merits review tribunal tells you that it has no jurisdiction to consider your application for review we grant you the substantive visa that the BVB is associated with we cancel your BVB or the substantive visa that you held when you were granted a BVB. Once you have been notified of an outcome you can see exactly how long you can stay in Australia in VEVO BVB granted on or after 19 November 2016 Your BVB will end 35 calendar days after: our refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application a determination that your substantive visa application or an application for review by the AAT is invalid you withdraw your substantive visa application or application for review by the AAT. You BVB will end 28 calendar days after: a judicial review body upholds the decision to refuse your substantive visa application you withdraw a related judicial review application. BVB granted before 19 November 2016 Your BVB will end 28 days after the date that one of the following happens: we notify you that your substantive visa application is not valid we notify you that your substantive visa application has been refused you withdraw your substantive visa application a merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application a merit review tribunal notifies you that it has no jurisdiction to consider your application for review you withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body a judicial review body upholds the decision to refuse your substantive visa application. Stay longer You can’t stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer. Explore your visa options Include family If you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application providing they are members of the family unit . This means you and your family have to complete only one application form and pay one visa application charge. But, each member of the family will have to meet the requirements for a BVB in their own right. Only those family members who have substantial reasons for needing to travel outside Australia should be included in your BVB application. If some of your family members do not need to travel outside Australia, they can stay in Australia on their current bridging visas. Cost AUD190.00 Apply from You and anyone included in your BVB application must be in Australia to make a valid application and to be granted the visa. Your obligations You and anyone included in your application must: comply with all Australian laws comply with the conditions of the current visa comply with the conditions of the your BVB when it comes in to effect You can find your visa conditions in your grant letter or VEVO Working We will let you know which conditions apply to your BVB if we grant the visa. Travel When we grant your BVB, we will tell you when the specified travel period will end. If you hold a BVB where the specified travel period has ended but you need to travel outside Australia again, you will have to apply for another BVB and be granted this visa before leaving Australia. If you are outside Australia when the specified travel period on your BVB ends, the visa will cease. You can't return to Australia with a ceased BVB. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ Have had a substantive visa You must have held a Substantive visa Hold a BVA or a BVB You must already hold a BVA or a BVB. Have applied for substantive visa or judicial review Details You must have made a valid application for a substantive visa and either: that application has not been finally determined, or that application was refused and you have made an application for judicial review (within the prescribed timeframe), and the judicial review proceedings have not been completed. When applying for a review, have applied in the prescribed timeframe Details You must apply for review within the prescribed timeframes. Administrative Appeals Tribunal You must apply for review within the prescribed timeframe. If you have applied within the prescribed timeframe you may not need to apply for a further bridging visa. Judicial review The timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision. If you have not applied for judicial review within the statutory timeframes, this may affect your eligibility to apply for a further bridging visa. Have substantial reasons for wanting to travel You must provide a reason and attach any supporting documents to explain why you need to depart and return to Australia while your substantive visa is being considered or while you are waiting for the outcome of a judicial review. Age You can be any age to apply for this visa. Meet character requirement You must meet the character requirement Meet all these criteria? Check how to apply in our step by step guide. Step by step ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ Step 1 Step 1 - Before you apply Check whether you hold a BVA or BVB in VEVO . Check your passport is valid. You should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel. Show steps Usually, you must have a valid passport for us to grant you this visa. If you plan to get a new passport, you should do so before applying for your visa. If you need to apply for a BVB, you can either apply for the visa online, or by post or courier. How you apply depends on how you applied for your associated substantive visa. If you applied for your substantive visa online in ImmiAccount, you must apply for a BVB in ImmiAccount. If you made an application for merits or judicial review, you must apply on paper. When to apply You should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel. Some visas can only be granted while you are in Australia. If you apply for a BVB too far in advance of your travel, it could be difficult for us to assess whether your substantive visa will be ready for decision. To be granted a BVB, you must be in Australia when the decision is made on the application. If you leave it until the last minute to apply for a BVB you risk not being granted a BVB before you are due to leave Australia. If this happens, you might not hold a visa that allows you to return to Australia. You would then have to apply for and be granted a substantive visa before you could return to Australia and there is no guarantee that you would be granted a visa. Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Step 2 - Gather your documents Gather the documents you need for your application. Show steps Provide accurate documents Provide accurate information. See what happens if you can't prove your identity or do not provide true information Identity documents Provide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Character documents We will tell you if and when you need to get a police certificate Prepare your documents See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. See how Parental responsibility documents You must get consent for any child included on this application to be granted a visa from anyone who: has a legal right to decide where the child lives and is not travelling with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to travel on this visa Include a document with the signature and photo of the person who completed the form or declaration, such as a: passport driver’s licence New step description See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount if you applied online, or send with your paper application. See how Step 3 Step 3 - Apply for the visa How you apply for a BVB depends on: how you applied for your substantive visa (online or by paper form) if you have applied for review of a decision about your substantive visa application. You must apply for the BVB in the same way you applied for your substantive visa. If you applied for your new substantive visa through ImmiAccount, you must apply for your BVB application through ImmiAccount. If you applied for your new substantive visa by paper form, you must submit your BVB application by webform If you have applied for a review of a decision about your substantive visa application, you must submit your BVB application by webform You, and anyone included in your application, must be in Australia when you lodge the BVB application. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or do not provide accurate information Apply through ImmiAccount If you applied for your substantive visa through ImmiAccount and a decision has not yet been made on that application, you must apply for your bridging visa through ImmiAccount To apply for a BVB through ImmiAccount: Log in to ImmiAccount Attach all supporting documents Pay the visa application charge See how Apply by webform If you applied for your substantive visa by paper form You must pay the visa application charge Once you have made a payment, you must complete and submit your BVB application Form 1006 by webform . You need to provide receipt details of your payment on the application form to make a valid BVB application. If you have applied for review of a decision on your substantive visa application If you need a bridging visa to leave and return to Australia during a review process, you must pay the visa application charge. Once you have made a payment, you must complete and submit your BVB application Form 1006 by webform . You need to provide receipt details of your payment on the application form to make a valid BVB application. See how Step 4 Step 4 - After you apply See what you can and must do after you apply. Show steps What will happen after you apply We will tell you when we have received your application and documents. Status updates We do not give updates on application processing times. Wait for us to contact you. Travel To be able to return to Australia if you travel, your BVB must be granted before you leave. A BVB allows you to travel outside Australia until a set date. If you have not returned before that date, your BVB will cease. If this happens, you will need a new visa to return. You, and anyone included in your application, must be in Australia for us to grant the visa. See how Biometrics We might ask for Biometrics (fingerprints and photo). We will tell you if you need to provide them. Attach more information If you did not attach all documents when you applied, attach them as soon as possible in ImmiAccount If you are applying by webform, you must attach all documents before you submit your BVB application. This includes colour copies of your current passport, showing your: photo personal details, and passport issue and expiry dates. We need this for all applicants included in the application. We might also ask you to provide more information. See how Stay lawful Make sure you stay lawful by holding a valid visa while we process your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application. Including family members If you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application. They need to be members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. Each member of the family has to meet the requirements for a BVB in their own right. Only include family members in your BVB application who have substantial reasons for needing to leave Australia. If some family members do not need to leave Australia, they can stay in Australia on their current bridging visas. See how Newborn children Find out what to do if your child is born after you apply Mistakes on your application Tell us as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers. (168KB PDF) Help with your application Tell us if you: want someone to receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) have asked someone to give you immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) If you applied for your substantive visa online, upload your written notification or your forms to ImmiAccount If you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us. For more information see Who can help you with your application See how Tell us if things change Some of the things you need to tell us about after you have applied include: changes to your phone number, email, address or passport the birth of a child, and if you want to withdraw your application. See how to tell us if your situation changes See how Step 5 Step 5 - Visa outcome We will let you know our decision in writing. To be granted a BVB, you must be in Australia when the decision is made on the application. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of this with you when in Australia. If we refuse your visa, we will tell you: why we refused the visa if you have a right to a review of the decision When you have this visa ​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available. Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the online webform ​.​ In Australia In Australia What you can do when you have this visa stay lawfully in Australia until a decision is made on your substantive visa application leave and return to Australia within the defined travel period while your application for a substantive visa is being processed To see your specific conditions, use VEVO What you must do on this visa (your obligations) comply with all Australian laws comply with the conditions of your current visa comply with the conditions of your Bridging visa B (BVB) when it comes into effect Working We will let you know which conditions apply to your BVB if we grant the visa. Tell us if things change Things you need to let us know about include: changes to your phone number, email, address or passport you want to withdraw your application See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\nSubclass 020\n\n# Bridging visa B (BVB)\n\nBridging visa B (BVB)\n\nYou can leave and return to Australia during a specified travel period while your application for a substantive visa is being processed.\n\nYou can leave and return to Australia during a specified travel period while your application for a substantive visa is being processed.\n\nYou can leave and return to Australia during a specified travel period while your application for a substantive visa is being processed.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\n#### Stay\n\nStay\n\nTemporarily\n\nTemporarily\n\n#### Cost\n\nCost\n\nAUD190.00\n\nAUD190.00\n\nAUD190.00\n\n#### Processing times\n\nProcessing times\n\nThere are no processing times available for this visa.\n\nThere are no processing times available for this visa.\n\n#### With this visa, you can\n\nWith this visa, you can\n- stay lawfully in Australia until yoursubstantive visaapplication is finally determined, or where granted in association with judicial review, until those proceedings are completed\nstay lawfully in Australia until your\nsubstantive visa\napplication is finally determined, or where granted in association with judicial review, until those proceedings are completed\n- leave and return to Australia within the defined travel period while your application for a substantive visa is being processed\nleave and return to Australia within the defined travel period while your application for a substantive visa is being processed\n- work, if your BVB permits\nwork, if your BVB permits\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be in Australia when you apply for this visa\nbe in Australia when you apply for this visa\n- be the holder of a BVA or a BVB\nbe the holder of a BVA or a BVB\n- have applied in Australia for a substantive visa that can be granted while you are in Australia\nhave applied in Australia for a substantive visa that can be granted while you are in Australia\n- if you meet all eligibility requirements, be in Australia at the time of grant\nif you meet all eligibility requirements, be in Australia at the time of grant\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\nAbout this visa\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\nAbout this visa\nIn effect\nWorking in Australia\nRemaining lawful during judicial review\nWith this visa you can\nHow long you can stay\nStay longer\nInclude family\nCost\nApply from\nYour obligations\nTravel\nVisa label\n\n## About this visa\n\nAbout this visa\n\nThis is a temporary visa.  The BVB travel facility may be granted with single or multiple travel and will be valid for use until a specified date. If the travel facility has ended or does not have sufficient validity remaining to cover your proposed journey, then you will need to apply for and be granted a new BVB prior to leaving Australia. Check if you already hold a Bridging visa B (BVB) withVEVO.\n\nThis is a temporary visa.  The BVB travel facility may be granted with single or multiple travel and will be valid for use until a specified date. If the travel facility has ended or does not have sufficient validity remaining to cover your proposed journey, then you will need to apply for and be granted a new BVB prior to leaving Australia. Check if you already hold a Bridging visa B (BVB) with\nVEVO\n.\n\nA separate application for a BVB may be necessary where you have applied for judicial review.  It is not possible to apply to change conditions on your BVB.  If you want to change visa conditions, then you will need to consider applying for aBridging visa A(BVA).\n\nA separate application for a BVB may be necessary where you have applied for judicial review.  It is not possible to apply to change conditions on your BVB.  If you want to change visa conditions, then you will need to consider applying for a\nBridging visa A\n(BVA).\n\nYou can’t use a bridging visa while you wait for a citizenship application to be decided.\n\nYou can’t use a bridging visa while you wait for a citizenship application to be decided.\n\n## In effect\n\nIn effect\n\nA BVB comes into effect when:\n\nA BVB comes into effect when:\n- it is granted (ifyour substantive visahas ceased since applying for the BVB or where the BVB is more beneficial than your current bridging visa)\nit is granted (if\nyour substantive visa\nhas ceased since applying for the BVB or where the BVB is more beneficial than your current bridging visa)\n- your current substantive visa ceases.\nyour current substantive visa ceases.\n\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVB, you will be notified about the conditions that apply.\n\nVisa holders must adhere to the conditions imposed on their visa. Where you are granted a BVB, you will be notified about the conditions that apply.\n\nIf you hold a substantive visa when your BVB is granted, you must continue to comply with the conditions of the substantive visa.  When your substantive visa ceases, the conditions of your BVB will apply.\n\nIf you hold a substantive visa when your BVB is granted, you must continue to comply with the conditions of the substantive visa.  When your substantive visa ceases, the conditions of your BVB will apply.\n\n## Working in Australia\n\nWorking in Australia\n\nYou might be allowed to work if the substantive visa you had or the visa you applied for lets you work. Your grant letter will tell you about the conditions that apply to your BVB.If the visa you had, and the visa you applied for have work restrictions you will not be able to work with a BVB. See if you have work restrictions inVEVO.\n\nYou might be allowed to work if the substantive visa you had or the visa you applied for lets you work. Your grant letter will tell you about the conditions that apply to your BVB.\nIf the visa you had, and the visa you applied for have work restrictions you will not be able to work with a BVB. See if you have work restrictions in\nVEVO\n.\n\nIf you are the holder of a BVB that does not permit work, and you are seeking to change conditions, you will need to consider applying for aBVA. As part of this process you will need to demonstrate that you are in financial hardship.\n\nIf you are the holder of a BVB that does not permit work, and you are seeking to change conditions, you will need to consider applying for a\nBVA\n. As part of this process you will need to demonstrate that you are in financial hardship.\n\n## Remaining lawful during judicial review\n\nRemaining lawful during judicial review\n\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n\nIf a merits review tribunal upholds our decision to refuse your substantive visa application and you apply for judicial review, you will need to apply for a bridging visa to maintain your lawful status during the judicial review proceedings. If you have applied for judicial review you can only apply for a bridging visa by webform.\n\n## With this visa you can\n\nWith this visa you can\n- Stay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\nStay lawfully in Australia until your substantive visa application is finally determined, or if granted in association with judicial proceedings, until those proceedings are complete.\n- Leave and return to Australia within the defined travel period while your application for a substantive visa is being processed.\nLeave and return to Australia within the defined travel period while your application for a substantive visa is being processed.\n\n## How long you can stay\n\nHow long you can stay\n\nOne of the following outcomes will determine when your BVB ceases:\n\nOne of the following outcomes will determine when your BVB ceases:\n- your substantive visa application is refused\nyour substantive visa application is refused\n- your merits or judicial review is decided\nyour merits or judicial review is decided\n- you withdraw your application for the substantive visa, merits review or judicial review\nyou withdraw your application for the substantive visa, merits review or judicial review\n- a merits review tribunal tells you that it has no jurisdiction to consider your application for review\na merits review tribunal tells you that it has no jurisdiction to consider your application for review\n- we grant you the substantive visa that the BVB is associated with\nwe grant you the substantive visa that the BVB is associated with\n- we cancel your BVB or the substantive visa that you held when you were granted a BVB.\nwe cancel your BVB or the substantive visa that you held when you were granted a BVB.\n\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia inVEVO.\n\nOnce you have been notified of an outcome you can see exactly how long you can stay in Australia in\nVEVO\n.\n\nBVB granted on or after 19 November 2016Your BVB will end 35 calendar days after:\n\nBVB granted on or after 19 November 2016\nYour BVB will end 35 calendar days after:\n- our refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\nour refusal decision or a decision by the Administrative Appeals Tribunal (AAT) in relation to your associated substantive visa application\n- a determination that your substantive visa application or an application for review by the AAT is invalid\na determination that your substantive visa application or an application for review by the AAT is invalid\n- you withdraw your substantive visa application or application for review by the AAT.\nyou withdraw your substantive visa application or application for review by the AAT.\n\nYou BVB will end 28 calendar days after:\n\nYou BVB will end 28 calendar days after:\n- a judicial review body upholds the decision to refuse your substantive visa application\na judicial review body upholds the decision to refuse your substantive visa application\n- you withdraw a related judicial review application.\nyou withdraw a related judicial review application.\n\nBVB granted before 19 November 2016Your BVB will end 28 days after the date that one of the following happens:\n\nBVB granted before 19 November 2016\nYour BVB will end 28 days after the date that one of the following happens:\n- we notify you that your substantive visa application is not valid\nwe notify you that your substantive visa application is not valid\n- we notify you that your substantive visa application has been refused\nwe notify you that your substantive visa application has been refused\n- you withdraw your substantive visa application\nyou withdraw your substantive visa application\n- a merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\na merits review tribunal notifies you that it has upheld our decision to refuse your substantive visa application\n- a merit review tribunal notifies you that it has no jurisdiction to consider your application for review\na merit review tribunal notifies you that it has no jurisdiction to consider your application for review\n- you withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body\nyou withdraw your application for merits or judicial review from a merits review tribunal or a judicial review body\n- a judicial review body upholds the decision to refuse your substantive visa application.\na judicial review body upholds the decision to refuse your substantive visa application.\n\n## Stay longer\n\nStay longer\n\nYou can’t stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.Explore your visa options.\n\nYou can’t stay in Australia longer by extending this visa. You must apply for a new visa if you wish to stay longer.\nExplore your visa options\n.\n\n## Include family\n\nInclude family\n\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application providing they aremembers of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. But, each member of the family will have to meet the requirements for a BVB in their own right.\n\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application providing they are\nmembers of the family unit\n. This means you and your family have to complete only one application form and pay one visa application charge. But, each member of the family will have to meet the requirements for a BVB in their own right.\n\nOnly those family members who have substantial reasons for needing to travel outside Australia should be included in your BVB application. If some of your family members do not need to travel outside Australia, they can stay in Australia on their current bridging visas.\n\nOnly those family members who have substantial reasons for needing to travel outside Australia should be included in your BVB application. If some of your family members do not need to travel outside Australia, they can stay in Australia on their current bridging visas.\n\n## Cost\n\nCost\n\nAUD190.00\n\nAUD190.00\n\n## Apply from\n\nApply from\n\nYou and anyone included in your BVB application must be in Australia to make a valid application and to be granted the visa.\n\nYou and anyone included in your BVB application must be in Australia to make a valid application and to be granted the visa.\n\n## Your obligations\n\nYour obligations\n\nYou and anyone included in your application must:\n\nYou and anyone included in your application must:\n- comply with all Australian laws\ncomply with all Australian laws\n- comply with the conditions of the current visa\ncomply with the conditions of the current visa\n- comply with the conditions of the your BVB when it comes in to effect\ncomply with the conditions of the your BVB when it comes in to effect\n\nYou can find your visa conditions in your grant letter orVEVO.\n\nYou can find your visa conditions in your grant letter or\nVEVO\n.\n\n### Working\n\nWorking\n\nWe will let you know which conditions apply to your BVB if we grant the visa.\n\nWe will let you know which conditions apply to your BVB if we grant the visa.\n\n## Travel\n\nTravel\n\nWhen we grant your BVB, we will tell you when the specified travel period will end.\n\nWhen we grant your BVB, we will tell you when the specified travel period will end.\n\nIf you hold a BVB where the specified travel period has ended but you need to travel outside Australia again, you will have to apply for another BVB and be granted this visa before leaving Australia.\n\nIf you hold a BVB where the specified travel period has ended but you need to travel outside Australia again, you will have to apply for another BVB and be granted this visa before leaving Australia.\n\nIf you are outside Australia when the specified travel period on your BVB ends, the visa will cease. You can't return to Australia with a ceased BVB.\n\nIf you are outside Australia when the specified travel period on your BVB ends, the visa will cease. You can't return to Australia with a ceased BVB.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\n## Have had a substantive visa\n\nHave had a substantive visa\n\nYou must have held aSubstantive visa.\n\nYou must have held a\nSubstantive visa\n.\n\n## Hold a BVA or a BVB\n\nHold a BVA or a BVB\n\nYou must already hold a BVA or a BVB.\n\nYou must already hold a BVA or a BVB.\n\n## Have applied for substantive visa or judicial review\n\nHave applied for substantive visa or judicial review\nDetails\n\nYou must have made a valid application for a substantive visa and either:\n\nYou must have made a valid application for a substantive visa and either:\n- that application has not been finally determined, or\nthat application has not been finally determined, or\n- that application was refused and you have made an application for judicial review (within the prescribed timeframe), and the judicial review proceedings have not been completed.\nthat application was refused and you have made an application for judicial review (within the prescribed timeframe), and the judicial review proceedings have not been completed.\n\n## When applying for a review, have applied in the prescribed timeframe\n\nWhen applying for a review, have applied in the prescribed timeframe\nDetails\n\nYou must apply for review within the prescribed timeframes.\n\nYou must apply for review within the prescribed timeframes.\n\nAdministrative Appeals Tribunal\n\nAdministrative Appeals Tribunal\n\nYou must apply for review within the prescribed timeframe.\n\nYou must apply for review within the prescribed timeframe.\n\nIf you have applied within the prescribed timeframe you may not need to apply for a further bridging visa.\n\nIf you have applied within the prescribed timeframe you may not need to apply for a further bridging visa.\n\nJudicial review\n\nJudicial review\n\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision.\n\nThe timeframe for applying for judicial review is 35 days from the date of the Tribunal's decision.\n\nIf you have not applied for judicial review within the statutory timeframes, this may affect your eligibility to apply for a further bridging visa.\n\nIf you have not applied for judicial review within the statutory timeframes, this may affect your eligibility to apply for a further bridging visa.\n\n## Have substantial reasons for wanting to travel\n\nHave substantial reasons for wanting to travel\n\nYou must provide a reason and attach any supporting documents to explain why you need to depart and return to Australia while your substantive visa is being considered or while you are waiting for the outcome of a judicial review.\n\nYou must provide a reason and attach any supporting documents to explain why you need to depart and return to Australia while your substantive visa is being considered or while you are waiting for the outcome of a judicial review.\n\n## Age\n\nAge\n\nYou can be any age to apply for this visa.\n\nYou can be any age to apply for this visa.\n\n## Meet character requirement\n\nMeet character requirement\n\nYou must meet thecharacter requirement.\n\nYou must meet the\ncharacter requirement\n.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\n\nStep 1\n\nStep 1\nStep 1 - Before you apply\n\nCheck whether you hold a BVA or BVB inVEVO. Check your passport is valid. You should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\n\nCheck whether you hold a BVA or BVB in\nVEVO\n. Check your passport is valid. You should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\nShow\n                    steps\n\nUsually, you must have a valid passport for us to grant you this visa. If you plan to get a new passport, you should do so before applying for your visa.\n\nUsually, you must have a valid passport for us to grant you this visa. If you plan to get a new passport, you should do so before applying for your visa.\n\nIf you need to apply for a BVB, you can either apply for the visa online, or by post or courier. How you apply depends on how you applied for your associated substantive visa.\n\nIf you need to apply for a BVB, you can either apply for the visa online, or by post or courier. How you apply depends on how you applied for your associated substantive visa.\n\nIf you applied for your substantive visa online in ImmiAccount, you must apply for a BVB in ImmiAccount.\n\nIf you applied for your substantive visa online in ImmiAccount, you must apply for a BVB in ImmiAccount.\n\nIf you made an application for merits or judicial review, you must apply on paper.\n\nIf you made an application for merits or judicial review, you must apply on paper.\n\n#### When to apply\n\nWhen to apply\n\nYou should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\n\nYou should apply for your BVB no more than 3 months, and not less than 2 weeks, before the date on which you want to travel.\n\nSome visas can only be granted while you are in Australia. If you apply for a BVB too far in advance of your travel, it could be difficult for us to assess whether your substantive visa will be ready for decision. To be granted a BVB, you must be in Australia when the decision is made on the application.\n\nSome visas can only be granted while you are in Australia. If you apply for a BVB too far in advance of your travel, it could be difficult for us to assess whether your substantive visa will be ready for decision. To be granted a BVB, you must be in Australia when the decision is made on the application.\n\nIf you leave it until the last minute to apply for a BVB you risk not being granted a BVB before you are due to leave Australia. If this happens, you might not hold a visa that allows you to return to Australia.\n\nIf you leave it until the last minute to apply for a BVB you risk not being granted a BVB before you are due to leave Australia. If this happens, you might not hold a visa that allows you to return to Australia.\n\nYou would then have to apply for and be granted a substantive visa before you could return to Australia and there is no guarantee that you would be granted a visa.\n\nYou would then have to apply for and be granted a substantive visa before you could return to Australia and there is no guarantee that you would be granted a visa.\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nStep 2 - Gather your documents\n\nGather the documents you need for your application.\n\nGather the documents you need for your application.\nShow\n                    steps\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvide accurate information. See what happens if you can't prove your identity or do notprovide true information.\n\nProvide accurate information. See what happens if you can't prove your identity or do not\nprovide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide colour copies of the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Character documents\n\nCharacter documents\n\nWe will tell you if and when you need to get apolice certificate.\n\nWe will tell you if and when you need to get a\npolice certificate\n.\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\nSee how\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any child included on this application to be granted a visa from anyone who:\n\nYou must get consent for any child included on this application to be granted a visa from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not travelling with the child\nis not travelling with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to travel on this visa\na statutory declaration giving their consent for the child to travel on this visa\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n\nInclude a document with the signature and photo of the person who completed the form or declaration, such as a:\n- passport\npassport\n- driver’s licence\ndriver’s licence\n\nNew step description\n\nNew step description\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccountif you applied online, or send with your paper application.\n\nUpload your written notification or your forms to\nImmiAccount\nif you applied online, or send with your paper application.\nSee how\n\nStep 3\n\nStep 3\nStep 3 - Apply for the visa\n\nHow you apply for a BVB depends on:\n\nHow you apply for a BVB depends on:\n- how you applied for yoursubstantive visa(online or by paper form)\nhow you applied for your\nsubstantive visa\n(online or by paper form)\n- if you have applied for review of a decision about your substantive visa application.\nif you have applied for review of a decision about your substantive visa application.\n\nYou must apply for the BVB in the same way you applied for your substantive visa.\n\nYou must apply for the BVB in the same way you applied for your substantive visa.\n\nIf you applied for your new substantive visa through ImmiAccount, you must apply for your BVB application through ImmiAccount.\n\nIf you applied for your new substantive visa through ImmiAccount, you must apply for your BVB application through ImmiAccount.\n\nIf you applied for your new substantive visa by paper form, you must submit your BVB application bywebform.\n\nIf you applied for your new substantive visa by paper form, you must submit your BVB application by\nwebform\n.\n\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVB application bywebform.\n\nIf you have applied for a review of a decision about your substantive visa application, you must submit your BVB application by\nwebform\n.\n\nYou, and anyone included in your application, must be in Australia when you lodge the BVB application.\n\nYou, and anyone included in your application, must be in Australia when you lodge the BVB application.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens if you can't prove your identity or do notprovide accurate information.\n\nProvide accurate information. See what happens if you can't prove your identity or do not\nprovide accurate information\n.\n\n#### Apply through ImmiAccount\n\nApply through ImmiAccount\n\nIf you applied for your substantive visa through ImmiAccount and a decision has not yet been made on that application, you must apply for your bridging visa throughImmiAccount.\n\nIf you applied for your substantive visa through ImmiAccount and a decision has not yet been made on that application, you must apply for your bridging visa through\nImmiAccount\n.\n\nTo apply for a BVB through ImmiAccount:\n\nTo apply for a BVB through ImmiAccount:\n1. Log in toImmiAccount\nLog in to\nImmiAccount\n2. Attach all supporting documents\nAttach all supporting documents\n3. Pay the visa application charge.\nPay the visa application charge\n.\nSee how\n\n#### Apply by webform\n\nApply by webform\n\nIf you applied for your substantive visa by paper form\n\nIf you applied for your substantive visa by paper form\n\nYou mustpay the visa application charge.\n\nYou must\npay the visa application charge\n.\n\nOnce you have made a payment, you must complete and submit your BVB application Form 1006 bywebform. You need to provide receipt details of your payment on the application form to make a valid BVB application.\n\nOnce you have made a payment, you must complete and submit your BVB application Form 1006 by\nwebform\n. You need to provide receipt details of your payment on the application form to make a valid BVB application.\n\nIf you have applied for review of a decision on your substantive visa application\n\nIf you have applied for review of a decision on your substantive visa application\n\nIf you need a bridging visa to leave and return to Australia during a review process, you must pay the visa application charge. Once you have made a payment, you must complete and submit your BVB application Form 1006 bywebform. You need to provide receipt details of your payment on the application form to make a valid BVB application.\n\nIf you need a bridging visa to leave and return to Australia during a review process, you must pay the visa application charge. Once you have made a payment, you must complete and submit your BVB application Form 1006 by\nwebform\n. You need to provide receipt details of your payment on the application form to make a valid BVB application.\nSee how\n\nStep 4\n\nStep 4\nStep 4 - After you apply\n\nSee what you can and must do after you apply.\n\nSee what you can and must do after you apply.\nShow\n                    steps\n\n#### What will happen after you apply\n\nWhat will happen after you apply\n\nWe will tell you when we have received your application and documents.\n\nWe will tell you when we have received your application and documents.\n\n#### Status updates\n\nStatus updates\n\nWe do not give updates on application processing times.\n\nWe do not give updates on application processing times.\n\nWait for us to contact you.\n\nWait for us to contact you.\n\n#### Travel\n\nTravel\n\nTo be able to return to Australia if you travel, your BVB must be granted before you leave.\n\nTo be able to return to Australia if you travel, your BVB must be granted before you leave.\n\nA BVB allows you to travel outside Australia until a set date. If you have not returned before that date, your BVB will cease. If this happens, you will need a new visa to return.\n\nA BVB allows you to travel outside Australia until a set date. If you have not returned before that date, your BVB will cease. If this happens, you will need a new visa to return.\n\nYou, and anyone included in your application, must be in Australia for us to grant the visa.\n\nYou, and anyone included in your application, must be in Australia for us to grant the visa.\nSee how\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forBiometrics(fingerprints and photo). We will tell you if you need to provide them.\n\nWe might ask for\nBiometrics\n(fingerprints and photo). We will tell you if you need to provide them.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not attach all documents when you applied, attach them as soon as possible inImmiAccount.\n\nIf you did not attach all documents when you applied, attach them as soon as possible in\nImmiAccount\n.\n\nIf you are applying by webform, you must attach all documents before you submit your BVB application. This includes colour copies of your current passport, showing your:\n\nIf you are applying by webform, you must attach all documents before you submit your BVB application. This includes colour copies of your current passport, showing your:\n- photo\nphoto\n- personal details, and\npersonal details, and\n- passport issue and expiry dates.\npassport issue and expiry dates.\n\nWe need this for all applicants included in the application.\n\nWe need this for all applicants included in the application.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nMake sure you stay lawful by holding a valid visa while we process your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\n\nMake sure you stay lawful by holding a valid visa while we process your substantive visa application. It is important to submit your application early. This ensures enough time for us to process your bridging visa application.\n\n#### Including family members\n\nIncluding family members\n\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application. They need to be members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. Each member of the family has to meet the requirements for a BVB in their own right.\n\nIf you and your family have applied together for a substantive visa in Australia, you can include them in your BVB application. They need to be members of the family unit. This means you and your family have to complete only one application form and pay one visa application charge. Each member of the family has to meet the requirements for a BVB in their own right.\n\nOnly include family members in your BVB application who have substantial reasons for needing to leave Australia. If some family members do not need to leave Australia, they can stay in Australia on their current bridging visas.\n\nOnly include family members in your BVB application who have substantial reasons for needing to leave Australia. If some family members do not need to leave Australia, they can stay in Australia on their current bridging visas.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to doif your child is born after you apply.\n\nFind out what to do\nif your child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nTell us as soon as you can if you made a mistake on your application.\n\nTell us as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers. (168KB PDF)\n\nComplete\nForm 1023 Notification of incorrect answers. (168KB PDF)\n\n#### Help with your application\n\nHelp with your application\n\nTell us if you:\n\nTell us if you:\n- want someone to receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nwant someone to receive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- have asked someone to give you immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nhave asked someone to give you immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nIf you applied for your substantive visa online, upload your written notification or your forms toImmiAccount.\n\nIf you applied for your substantive visa online, upload your written notification or your forms to\nImmiAccount\n.\n\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\n\nIf you applied for your substantive visa by paper form, send your documents to the office assessing your visa application. You can find this information on the acknowledgement letter under Contact Us.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nSome of the things you need to tell us about after you have applied include:\n\nSome of the things you need to tell us about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- the birth of a child, and\nthe birth of a child, and\n- if you want to withdraw your application.\nif you want to withdraw your application.\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nStep 5 - Visa outcome\n\nWe will let you know our decision in writing.\n\nWe will let you know our decision in writing.\n\nTo be granted a BVB, you must be in Australia when the decision is made on the application.\n\nTo be granted a BVB, you must be in Australia when the decision is made on the application.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of this with you when in Australia.\n\nKeep a copy of this with you when in Australia.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- if you have a right to a review of the decision\nif you have a right to a review of the decision\nWhen you have this visa\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.Applications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\n​​​From 1 August 2022, the option to apply for a Bridging visa A (BVA), B (BVB) and C (BVC) in-person or via a paper form will no longer be available.\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or theonline webform​.​\n\nApplications for a Bridging visa A, B or C mu​​st be made online via ImmiAccount or the\nonline webform\n​.​\nIn Australia\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- stay lawfully in Australia until a decision is made on your substantive visa application\nstay lawfully in Australia until a decision is made on your substantive visa application\n- leave and return to Australia within the defined travel period while your application for a substantive visa is being processed\nleave and return to Australia within the defined travel period while your application for a substantive visa is being processed\n\nTo see your specific conditions, useVEVO.\n\nTo see your specific conditions, use\nVEVO\n.\n\n### What you must do on this visa (your obligations)\n\nWhat you must do on this visa (your obligations)\n- comply with all Australian laws\ncomply with all Australian laws\n- comply with the conditions of your current visa\ncomply with the conditions of your current visa\n- comply with the conditions of your Bridging visa B (BVB) when it comes into effect\ncomply with the conditions of your Bridging visa B (BVB) when it comes into effect\n\n### Working\n\nWorking\n\nWe will let you know which conditions apply to your BVB if we grant the visa.\n\nWe will let you know which conditions apply to your BVB if we grant the visa.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#aboutVisa-index-12",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:18:56.543420",
  "metadata": {}
}