{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-475",
  "title": "Skilled – Regional Sponsored visa (subclass 475)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Skilled – Regional Sponsored visa (subclass 475) Page Content ​​This visa is subject to the Cap and Cease arrangement that took effect on 22 September 2015. Any visa application that was not decided before 22 September 2015 will be taken not to have been made. You can use the visa finder to search for an appropriate visa If you already have this visa, your eligible family members can apply for the Skilled - Regional (Provisional) (subclass 489) visa Visa holders Details How long your visa lasts Details This visa is valid for three years from: the date the visa is granted, if you applied for the visa in Australia the date you enter Australia, if you applied for the visa outside Australia. What this visa lets you do Details This visa lets you: remain in Australia for up to three years in a specified regional area in Australia bring your family with you to work or study in in a specified regional area of Australia become eligible to apply for permanent residency Apply for permanent residency You might be able to apply for permanent residency after you have: lived in a specified regional area of Australia for two years worked for at least 12 months in a specified regional area of Australia. The Skilled – Regional visa (subclass 887) is specifically designed for holders of a provisional skilled visa who want to apply for permanent residency. Your obligations Details You and your family must comply with all visa conditions and Australian laws. If you were nominated for this visa by a state or territory government Details You must live, study and work in regional Australia or a low population growth metropolitan area and comply with any residential conditions specified by the state or territory government in your nomination. If you later apply for a permanent residence Skilled – Regional visa (subclass 887) , you will need to prove that you have spent the specified time in that area. If you were sponsored for this visa by a family member Details You must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area. Meeting these conditions Details If you do not comply with the conditions of your visa, your visa, and your family’s visa, may be cancelled. If your visa is cancelled, you will not be able to apply for a similar visa while you stay in Australia. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane. Sponsors Details This information is for the sponsor of a Skilled -​ Regional Sponsored visa (subclass 475) holder. This visa is closed to new applications. This visa was subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made. For more information on the cap and cease see: Cap and cease ​. You can use Visa Entitlement Verification Online (VEVO for Organisations) to check the visa status and entitlements of people you have sponsored. How long the sponsorship lasts Details Your sponsorship lasts for two years from the time the visa holder first enters Australia. Sponsor obligations Details For two years from the date the visa is granted, you have agreed to: provide adequate accommodation and financial assistance to meet your relative's living needs provide other support, such as child care, to help your relatives attend English language classes give information and​ advice (including information about employment in Australia) to help your relatives settle in Australia.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Skilled – Regional Sponsored visa (subclass 475)\n\nSkilled – Regional Sponsored visa (subclass 475)\nPage Content\n\n​​This visa is subject to the Cap and Cease arrangement that took effect on 22 September 2015.  Any visa application that was not decided before 22 September 2015 will be taken not to have been made.\n\n​​This visa is subject to the Cap and Cease arrangement that took effect on 22 September 2015.  Any visa application that was not decided before 22 September 2015 will be taken not to have been made.\n\nYou can use thevisa finderto search for an appropriate visa\n\nYou can use the\nvisa finder\nto search for an appropriate visa\n\nIf you already have this visa, your eligible family members can apply for theSkilled - Regional (Provisional) (subclass 489) visa.\n\nIf you already have this visa, your eligible family members can apply for the\nSkilled - Regional (Provisional) (subclass 489) visa\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis visa is valid for three years from:\n\nThis visa is valid for three years from:\n- the date the visa is granted, if you applied for the visa in Australia\nthe date the visa is granted, if you applied for the visa in Australia\n- the date you enter Australia, if you applied for the visa outside Australia.\nthe date you enter Australia, if you applied for the visa outside Australia.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa lets you:\n\nThis visa lets you:\n- remain in Australia for up to three years in a specified regional area in Australia\nremain in Australia for up to three years in a specified regional area in Australia\n- bring your family with you to work or study in in a specified regional area of Australia\nbring your family with you to work or study in in a specified regional area of Australia\n- become eligible to apply forpermanent residency.\nbecome eligible to apply for\npermanent residency\n.\n\n#### Apply for permanent residency\n\nApply for permanent residency\n\nYou might be able to apply for permanent residency after you have:\n\nYou might be able to apply for permanent residency after you have:\n- lived in a specified regional area of Australia for two years\nlived in a specified regional area of Australia for two years\n- worked for at least 12 months in a specified regional area of Australia.\nworked for at least 12 months in a specified regional area of Australia.\n\nTheSkilled – Regional visa (subclass 887)is specifically designed for holders of a provisional skilled visa who want to apply for permanent residency.\n\nThe\nSkilled – Regional visa (subclass 887)\nis specifically designed for holders of a provisional skilled visa who want to apply for permanent residency.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\n#### If you were nominated for this visa by a state or territory government\n\nIf you were nominated for this visa by a state or territory government\nDetails\n\nYou must live, study and work inregional Australia or a low population growth metropolitan areaand comply with any residential conditions specified by the state or territory government in your nomination.\n\nYou must live, study and work in\nregional Australia or a low population growth metropolitan area\nand comply with any residential conditions specified by the state or territory government in your nomination.\n\nIf you later apply for a permanent residenceSkilled – Regional visa (subclass 887), you will need to prove that you have spent the specified time in that area.\n\nIf you later apply for a permanent residence\nSkilled – Regional visa (subclass 887)\n, you will need to prove that you have spent the specified time in that area.\n\n#### If you were sponsored for this visa by a family member\n\nIf you were sponsored for this visa by a family member\nDetails\n\nYou must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area.\n\nYou must live, study and work in a designated area. If you plan to apply for permanent residence, you will need to prove that you have spent the specified time in that area.\n\n#### Meeting these conditions\n\nMeeting these conditions\nDetails\n\nIf you do not comply with the conditions of your visa, your visa, and your family’s visa, may be cancelled.\n\nIf you do not comply with the conditions of your visa, your visa, and your family’s visa, may be cancelled.\n\nIf your visa is cancelled, you will not be able to apply for a similar visa while you stay in Australia.\n\nIf your visa is cancelled, you will not be able to apply for a similar visa while you stay in Australia.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\n## Sponsors\n\nSponsors\nDetails\n\nThis information is for the sponsor of a Skilled -​ Regional Sponsored visa (subclass 475) holder.\n\nThis information is for the sponsor of a Skilled -​ Regional Sponsored visa (subclass 475) holder.\n\nThis visa is closed to new applications. This visa was subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made. For more information on the cap and cease see:Cap and cease​.\n\nThis visa is closed to new applications. This visa was subject to the cap and cease arrangement that took place on 22 September 2015. Visa applications that were not decided by 22 September 2015 are taken not to have been made. For more information on the cap and cease see:\nCap and cease\n​.\n\nYou can useVisa Entitlement Verification Online (VEVO for Organisations)to check the visa status and entitlements of people you have sponsored.\n\nYou can use\nVisa Entitlement Verification Online (VEVO for Organisations)\nto check the visa status and entitlements of people you have sponsored.\n\n### How long the sponsorship lasts\n\nHow long the sponsorship lasts\nDetails\n\nYour sponsorship lasts for two years from the time the visa holder first enters Australia.\n\nYour sponsorship lasts for two years from the time the visa holder first enters Australia.\n\n### Sponsor obligations\n\nSponsor obligations\nDetails\n\nFor two years from the date the visa is granted, you have agreed to:\n\nFor two years from the date the visa is granted, you have agreed to:\n- provide adequate accommodation and financial assistance to meet your relative's living needs\nprovide adequate accommodation and financial assistance to meet your relative's living needs\n- provide other support, such as child care, to help your relatives attend English language classes\nprovide other support, such as child care, to help your relatives attend English language classes\n- give information and​ advice (including information about employment in Australia) to help your relatives settle in Australia.\ngive information and​ advice (including information about employment in Australia) to help your relatives settle in Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-475#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/skilled-regional-sponsored-visa-subclass-475#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:33:38.145825",
  "metadata": {}
}