{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/subclass-410",
  "title": "Retirement visa (subclass 410)",
  "raw_text": "===== main placeholder ========================================== This visa is closed to new applicants The Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018. Further details, including eligibility requirements, processing times and visa application charges can be found at Pathway to permanent residence for Retirees Retirement visa (subclass 410) Page Content ​​​​​​​​​​​​​​​​The Retirement visa (subclass 410) is designed for retirees and their partners (if any) who want to spend some of their retirement years in Australia. This visa is not available to new or first-time visa applicants other than partners of existing Retirement visa holders, former Retirement visa holders who have not held another substantive visa since last entering Australia. Former Retirement visa (subclass 410) holders and their partners who have been granted any other substantive visa, including Visitor visas and Electronic Travel Authorities, are not able to reapply for this visa. Since 1 July 2009, Retirement visa holders have been able to apply for a visa which is valid for 10 years from the date of grant and does not have any restrictions on the hours they are able to work. About this visa Details What this visa lets you do Details This visa is a temporary visa. It allows you and your partner to: leave and re-enter Australia at any time work in Australia study in Australia. This is a temporary visa and does not lead to permanent residence in Australia or to Australian citizenship. Before you apply Details Your passport Details Usually, you and your partner need to have valid passports to be granted this visa. If you change your passport after you have been granted this visa you should notify the Department. If you do not provide us with details of any new or additional passport you use to travel to Australia, you will experience delays at the airport and could be denied permission to board your plane Visa validity period Details If you are granted the visa, it will be valid for 10 years from the date of grant. Australian Government benefits Details This visa is specifically designed for self-funded retirees, therefore you are generally not entitled to financial assistance or welfare support from the Australian Government. Medicare benefits Details Generally you are not usually eligible for Medicare benefits on this visa including under Reciprocal Health Care Agreements between Australia and governments of other countries. These are explained on the Services Australia website. Retirement definitions Details The following definitions are provided to help you understand the information on these pages. Rollover - to renew your Retirement visa to allow for a further stay. Partner - your spouse (the person you are married to) or de facto partner (including same-sex partners). Substantive visa - a visa other than any of the following: a bridging visa a criminal justice visa an enforcement visa. Health insurance Details You must maintain adequate health insurance while in Australia. If you do not, any future visa applications may be refused. Cost Details Application charge You need to pay a non-refundable visa application charge when you lodge your visa application. Retirement (Subclass 410): Base application charge — AUD500.00 Additional applicant charge 18 and over — AUD250.00 Additional applicant charge under 18 — AUD125.00 To make a payment, please pay by: credit card bank cheque or money order made payable to the Department of Home Affairs. Please do not pay by cash, travellers' cheques or personal cheque Other costs You might need to pay a charge for: health assessments police checks and certificates other certificates You should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents. Visa applicants Details Compelling and Compassionate On 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Retirement (subclass 410) visa applicants, in Australia, applying for a further subclass 410 visa, but cannot meet certain visa criteria. Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner. After you have lodged your application for a further subclass 410, the Department will give you an opportunity to provide additional information if you cannot meet certain visa criteria. Who could get this visa Details The Retirement visa (subclass 410) is only available to existing Retirement visa (subclass 410) holders and their partners (if any) former Retirement visa (subclass 410) holders and their partners (if any) who have not held another substantive visa since last entering Australia. Health requirements Details You and your partner will not need to have a health examination unless you have travelled for three months or more to a country where there is a high risk of tuberculosis. If tuberculosis is identified, medical treatment (rather than visa refusal) is the likely outcome. For more information see Health Requirements Health insurance Details To be eligible for this visa you must show evidence that you have: maintained health insurance during your previous stay in Australia ongoing adequate health insurance For health insurance to be considered adequate it must: be fully comprehensive provide cover that is at least equivalent to Medicare (including cover of 85 per cent of costs for hospital, emergency and general practitioner services) provide coverage for pharmaceuticals. Just because a health insurance product is considered adequate for the purposes of meeting the visa requirement does not mean that it will be adequate for your personal circumstances. You should ensure that any insurance you obtain takes into account your individual needs. We prefer that your health insurance is with an Australian insurer; however alternative arrangements can be accepted. Alternative arrangements with an overseas insurer will require individual detailed examination of the insurance policy and may result in processing delays. Failure to maintain adequate health insurance may result in the refusal of future visa applications. Character requirements Details You must be of good character to enter and remain in Australia. If you are applying to rollover your Retirement visa, you will need to lodge an up to date Australian Federal Police clearance. You also need to lodge an overseas penal clearance for every country that you have spent at least 12 months in since your last Retirement visa (subclass 410) was granted. We prefer that these clearances are provided with your application unless you are in Australia and your current visa is about to expire. If this is the case, you should lodge your application and evidence that you have applied for any clearances required. Please be aware that this might delay processing of your visa application, however, you will be granted a Bridging visa A (BVA) that allows you to stay in the country lawfully while your application is being processed. For more information see Character Requirements Financial requirements Details You are expected to be self-supporting while in Australia. Sign the Australian Values Statement Details If you are aged 18 years or over, you must declare that you will respect Australian values and obey the laws of Australia. For this visa, the values statement is included in the general declaration section of the application form. When you sign the application form it means you will also be signing the values statement. You will not be required to have read the Life in Australia book For more information see Australian Values - Overview Including family in your application Details Your partner can be included on your application form. You cannot bring any dependent children or other dependent relatives. Cost Details Retirement (Subclass 410): Base application charge — AUD500.00 Additional applicant charge 18 and over — AUD250.00 Additional applicant charge under 18 — AUD125.00 To make a payment, please pay by: credit card bank cheque or money order made payable to the Department of Home Affairs. Please do not pay by cash, travellers' cheques or personal cheque Other costs You might need to pay a charge for: health assessments police checks and certificates other certificates You should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents. How to apply Details This information explains what you need to do to apply for a Retirement visa (subclass 410). You and anyone included in your application can apply for this visa when you are in or outside of Australia: If you apply for this visa in Australia, you must be in Australia when the visa is granted. If you apply for this visa outside Australia, you must be outside Australia when the visa is granted. Prepare your documents Details You need to provide documents to prove the claims you make in the application. The documents are listed in the Document checklist. Some documents could take some time to obtain. You should have them ready when you lodge the application to reduce any delays in processing. For more information see information to help you prepare your application Lodge your application Details You must complete the following application form: Form 1383 Application for a temporary visa for retirees (423KB PDF) If you are required to provide an Australian penal clearance certificate, you will need to complete the AFP National Police Check application form: AFP National Police Checks If you are required to provide a penal clearance certificate (sometimes known as a police certificate) from another country please refer to the following document which provides instructions on obtaining a certificate from an overseas government or law enforcement authority: Character and police certificate requirements​ Lodge your application at the Hobart office in Tasmania. Provide all relevant documents and pay the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs. More information Details There is more information to help you prepare your application , such as certifying and translating documents into English, communicating with us, using a migration agent, authorising another person to receive information from us, and receiving assistance with your application.​​ After you have applied Details After you have lodged your application and documents, we will let you know that we have received your information. Provide more information Details You can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. Report changes in your circumstances Details You should tell us if your circumstances change. You can do so using the following forms: Form 929 Change of address and/or passport details (193KB PDF) Change of address and/or passport details — if you move to a new address or change your passport Form 1022 Notification of changes in circumstances (172KB PDF) Notification of changes in circumstances — if there are other changes in your circumstances. Withdrawing your application Details See: withdrawing your application Visa decision Details If your visa is granted, you will receive a letter from us detailing: advice that you have been granted the Retirement visa (subclass 410) any conditions placed on your visa. If your visa is refused, you will receive a letter advising the reasons for the refusal decision. The letter will also advise you whether you can ask for the decision to be reviewed by the Migration Review Tribunal, and explain how to apply for review. For more information see Migration Review Tribunal Document checklist Details You need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application. Provide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations. Use this checklist to make sure your application is complete. Forms Form 1383 Application for a temporary visa for retirees (423KB PDF) Charges See: Visa pricing estimator Receiving assistance Details If someone gives you advice or lodges your application for you: Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF) (the agent or exempt person completes the form and you must sign it). If you would like someone else to receive correspondence from us on your behalf: Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) (the recipient completes the form and you must sign it). Your identity Details Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia. Evidence of any name change, such as a marriage certificate Two recent passport-sized photographs (45mm x 35mm) of each person included in the application. These photographs should be of the head and shoulders only, against a plain background. Print the name of the person on the back of each photograph. Your relationships Details Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia. If you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names). Your health insurance Details Evidence that you and your partner (if applicable), hold an adequate health insurance package. If you are applying for a further visa, you should also provide evidence that you maintained adequate health insurance while in Australia on a Retirement visa (subclass 410). Visa holders This information is for people who have already been granted a Retirement visa (subclass 410). It explains your rights and obligations. Details What the visa lets you do Details This visa is a temporary visa. It allows you and your partner to: leave and re-enter Australia at any time work in Australia study in Australia. Your obligations Details You and your partner must comply with all visa conditions and Australian laws. A breach of your visa conditions or breaking Australian laws can result in your visa being cancelled. If this happens you will need to leave Australia. Arrival conditions You must enter Australia before the expiry date given to you in your visa grant notification. If you do not arrive before this date, you will need to obtain a new visa before you can travel. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation",
  "main_content": "===== main placeholder ==========================================\n\nThis visa is closed to new applicantsThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.Further details, including eligibility requirements, processing times and visa application charges can be found atPathway to permanent residence for Retirees.\n\nThis visa is closed to new applicants\n\nThis visa is closed to new applicants\n\nThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.Further details, including eligibility requirements, processing times and visa application charges can be found atPathway to permanent residence for Retirees.\n\nThe Pathway to permanent residence for retirement visa holders announced by Government as part of the 2018-19 Budget commenced on 17 November 2018.\nFurther details, including eligibility requirements, processing times and visa application charges can be found at\nPathway to permanent residence for Retirees\n.\n\n# Retirement visa (subclass 410)\n\nRetirement visa (subclass 410)\nPage Content\n\n​​​​​​​​​​​​​​​​The Retirement visa (subclass 410) is designed for retirees and their partners (if any) who want to spend some of their retirement years in Australia.\n\n​​​​​​​​​​​​​​​​The Retirement visa (subclass 410) is designed for retirees and their partners (if any) who want to spend some of their retirement years in Australia.\n\nThis visa is not available to new or first-time visa applicantsother than partners of existing Retirement visa holders, former Retirement visa holders who have not held another substantive visa since last entering Australia.\n\nThis visa is not available to new or first-time visa applicants\nother than partners of existing Retirement visa holders, former Retirement visa holders who have not held another substantive visa since last entering Australia.\n\nFormer Retirement visa (subclass 410) holders and their partners who have been granted any other substantive visa, including Visitor visas and Electronic Travel Authorities, are not able to reapply for this visa.\n\nFormer Retirement visa (subclass 410) holders and their partners who have been granted any other substantive visa, including Visitor visas and Electronic Travel Authorities, are not able to reapply for this visa.\n\nSince 1 July 2009, Retirement visa holders have been able to apply for a visa which is valid for 10 years from the date of grant and does not have any restrictions on the hours they are able to work.\n\nSince 1 July 2009, Retirement visa holders have been able to apply for a visa which is valid for 10 years from the date of grant and does not have any restrictions on the hours they are able to work.\n\n## About this visa\n\nAbout this visa\nDetails\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa is a temporary visa. It allows you and your partner to:\n\nThis visa is a temporary visa. It allows you and your partner to:\n- leave and re-enter Australia at any time\nleave and re-enter Australia at any time\n- work in Australia\nwork in Australia\n- study in Australia.\nstudy in Australia.\n\nThis is a temporary visa and does not lead to permanent residence in Australia or to Australian citizenship.\n\nThis is a temporary visa and does not lead to permanent residence in Australia or to Australian citizenship.\n\n### Before you apply\n\nBefore you apply\nDetails\n\n#### Your passport\n\nYour passport\nDetails\n\nUsually, you and your partner need to have valid passports to be granted this visa. If you change your passport after you have been granted this visa you should notify the Department. If you do not provide us with details of any new or additional passport you use to travel to Australia, you will experience delays at the airport and could be denied permission to board your plane\n\nUsually, you and your partner need to have valid passports to be granted this visa. If you change your passport after you have been granted this visa you should notify the Department. If you do not provide us with details of any new or additional passport you use to travel to Australia, you will experience delays at the airport and could be denied permission to board your plane\n\n#### Visa validity period\n\nVisa validity period\nDetails\n\nIf you are granted the visa, it will be valid for 10 years from the date of grant.\n\nIf you are granted the visa, it will be valid for 10 years from the date of grant.\n\n#### Australian Government benefits\n\nAustralian Government benefits\nDetails\n\nThis visa is specifically designed for self-funded retirees, therefore you are generally not entitled to financial assistance or welfare support from the Australian Government.\n\nThis visa is specifically designed for self-funded retirees, therefore you are generally not entitled to financial assistance or welfare support from the Australian Government.\n\n#### Medicare benefits\n\nMedicare benefits\nDetails\n\nGenerally you are not usually eligible for Medicare benefits on this visa including under Reciprocal Health Care Agreements between Australia and governments of other countries. These are explained on the Services Australia website.\n\nGenerally you are not usually eligible for Medicare benefits on this visa including under Reciprocal Health Care Agreements between Australia and governments of other countries. These are explained on the Services Australia website.\n\n#### Retirement definitions\n\nRetirement definitions\nDetails\n\nThe following definitions are provided to help you understand the information on these pages.\n\nThe following definitions are provided to help you understand the information on these pages.\n- Rollover -  to renew your Retirement visa to allow for a further stay.\nRollover -  to renew your Retirement visa to allow for a further stay.\n- Partner- your spouse (the person you are married to) or de facto partner (including same-sex partners).\nPartner\n- your spouse (the person you are married to) or de facto partner (including same-sex partners).\n- Substantive visa-  a visa other than any of the following:a bridging visaa criminal justice visaan enforcement visa.\nSubstantive visa\n-  a visa other than any of the following:\n- a bridging visa\na bridging visa\n- a criminal justice visa\na criminal justice visa\n- an enforcement visa.\nan enforcement visa.\n\n#### Health insurance\n\nHealth insurance\nDetails\n\nYou must maintainadequate health insurancewhile in Australia. If you do not, any future visa applications may be refused.\n\nYou must maintain\nadequate health insurance\nwhile in Australia. If you do not, any future visa applications may be refused.\n\n#### Cost\n\nCost\nDetails\n\n#### Application charge\n\nApplication charge\n\nYou need to pay a non-refundable visa application charge when you lodge your visa application.\n\nYou need to pay a non-refundable visa application charge when you lodge your visa application.\n\nRetirement (Subclass 410):\n\nRetirement (Subclass 410):\n- Base application charge —AUD500.00\nBase application charge —\nAUD500.00\n- Additional applicant charge 18 and over —AUD250.00\nAdditional applicant charge 18 and over —\nAUD250.00\n- Additional applicant charge under 18 —AUD125.00\nAdditional applicant charge under 18 —\nAUD125.00\n- To make a payment, please pay by:credit cardbank cheque or money order made payable to the Department of Home Affairs.Please do not pay by cash, travellers' cheques or personal cheque\n\nTo make a payment, please pay by:\n\nTo make a payment, please pay by:\n- credit card\ncredit card\n- bank cheque or money order made payable to the Department of Home Affairs.\nbank cheque or money order made payable to the Department of Home Affairs.\n\nPlease do not pay by cash, travellers' cheques or personal cheque\n\nPlease do not pay by cash, travellers' cheques or personal cheque\n\n#### Other costs\n\nOther costs\n\nYou might need to pay a charge for:\n\nYou might need to pay a charge for:\n- health assessments\nhealth assessments\n- police checks and certificates\npolice checks and certificates\n- other certificates\nother certificates\n\nYou should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents.\n\nYou should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents.\n\n## Visa applicants\n\nVisa applicants\nDetails\n\n#### Compelling and Compassionate\n\nCompelling and Compassionate\n\nOn 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Retirement (subclass 410) visa applicants, in Australia, applying for a further subclass 410 visa, but cannot meet certain visa criteria. Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner.\n\nOn 1 July 2017, the Department introduced amendments to the Migration Regulations 1994 to provide alternative requirements for Retirement (subclass 410) visa applicants, in Australia, applying for a further subclass 410 visa, but cannot meet certain visa criteria. Compelling and compassionate circumstances may be considered by the Department in cases where an applicant is suffering from hardship due to ailments associated with ageing or difficulties following the death of a partner.\n\nAfter you have lodged your application for a further subclass 410, the Department will give you an opportunity to provide additional information if you cannot meet certain visa criteria.\n\nAfter you have lodged your application for a further subclass 410, the Department will give you an opportunity to provide additional information if you cannot meet certain visa criteria.\n\n### Who could get this visa\n\nWho could get this visa\nDetails\n\nThe Retirement visa (subclass 410) is only available to\n\nThe Retirement visa (subclass 410) is only available to\n- existing Retirement visa (subclass 410) holders and their partners (if any)\nexisting Retirement visa (subclass 410) holders and their partners (if any)\n- former Retirement visa (subclass 410) holders and their partners (if any) who have not held another substantive visa since last entering Australia.\nformer Retirement visa (subclass 410) holders and their partners (if any) who have not held another substantive visa since last entering Australia.\n\n#### Health requirements\n\nHealth requirements\nDetails\n\nYou and your partner will not need to have a health examination unless you have travelled for three months or more to a country where there is a high risk of tuberculosis.\n\nYou and your partner will not need to have a health examination unless you have travelled for three months or more to a country where there is a high risk of tuberculosis.\n\nIf tuberculosis is identified, medical treatment (rather than visa refusal) is the likely outcome.\n\nIf tuberculosis is identified, medical treatment (rather than visa refusal) is the likely outcome.\n\nFor more information seeHealth Requirements.\n\nFor more information see\nHealth Requirements\n.\n\n#### Health insurance\n\nHealth insurance\nDetails\n\nTo be eligible for this visa you must show evidence that you have:\n\nTo be eligible for this visa you must show evidence that you have:\n- maintained health insurance during your previous stay in Australia\nmaintained health insurance during your previous stay in Australia\n- ongoingadequate health insurance.\nongoing\nadequate health insurance\n.\n\nFor health insurance to be considered adequate it must:\n\nFor health insurance to be considered adequate it must:\n- be fully comprehensive\nbe fully comprehensive\n- provide cover that is at least equivalent to Medicare (including cover of 85 per cent of costs for hospital, emergency and general practitioner services)\nprovide cover that is at least equivalent to Medicare (including cover of 85 per cent of costs for hospital, emergency and general practitioner services)\n- provide coverage for pharmaceuticals.\nprovide coverage for pharmaceuticals.\n\nJust because a health insurance product is considered adequate for the purposes of meeting the visa requirement does not mean that it will be adequate for your personal circumstances. You should ensure that any insurance you obtain takes into account your individual needs.\n\nJust because a health insurance product is considered adequate for the purposes of meeting the visa requirement does not mean that it will be adequate for your personal circumstances. You should ensure that any insurance you obtain takes into account your individual needs.\n\nWe prefer that your health insurance is with an Australian insurer; however alternative arrangements can be accepted. Alternative arrangements with an overseas insurer will require individual detailed examination of the insurance policy and may result in processing delays.\n\nWe prefer that your health insurance is with an Australian insurer; however alternative arrangements can be accepted. Alternative arrangements with an overseas insurer will require individual detailed examination of the insurance policy and may result in processing delays.\n\nFailure to maintainadequate health insurancemay result in the refusal of future visa applications.\n\nFailure to maintain\nadequate health insurance\nmay result in the refusal of future visa applications.\n\n#### Character requirements\n\nCharacter requirements\nDetails\n\nYou must be of good character to enter and remain in Australia. If you are applying to rollover your Retirement visa, you will need to lodge an up to date Australian Federal Police clearance. You also need to lodge an overseas penal clearance for every country that you have spent at least 12 months in since your last Retirement visa (subclass 410) was granted.\n\nYou must be of good character to enter and remain in Australia. If you are applying to rollover your Retirement visa, you will need to lodge an up to date Australian Federal Police clearance. You also need to lodge an overseas penal clearance for every country that you have spent at least 12 months in since your last Retirement visa (subclass 410) was granted.\n\nWe prefer that these clearances are provided with your application unless you are in Australia and your current visa is about to expire. If this is the case, you should lodge your application and evidence that you have applied for any clearances required. Please be aware that this might delay processing of your visa application, however, you will be granted a Bridging visa A (BVA) that allows you to stay in the country lawfully while your application is being processed.\n\nWe prefer that these clearances are provided with your application unless you are in Australia and your current visa is about to expire. If this is the case, you should lodge your application and evidence that you have applied for any clearances required. Please be aware that this might delay processing of your visa application, however, you will be granted a Bridging visa A (BVA) that allows you to stay in the country lawfully while your application is being processed.\n\nFor more information seeCharacter Requirements.\n\nFor more information see\nCharacter Requirements\n.\n\n#### Financial requirements\n\nFinancial requirements\nDetails\n\nYou are expected to be self-supporting while in Australia.\n\nYou are expected to be self-supporting while in Australia.\n\n#### Sign the Australian Values Statement\n\nSign the Australian Values Statement\nDetails\n\nIf you are aged 18 years or over, you must declare that you will respect Australian values and obey the laws of Australia. For this visa, the values statement is included in the general declaration section of the application form. When you sign the application form it means you will also be signing the values statement. You will not be required to have read theLife in Australia book.\n\nIf you are aged 18 years or over, you must declare that you will respect Australian values and obey the laws of Australia. For this visa, the values statement is included in the general declaration section of the application form. When you sign the application form it means you will also be signing the values statement. You will not be required to have read the\nLife in Australia book\n.\n\nFor more information seeAustralian Values - Overview.\n\nFor more information see\nAustralian Values - Overview\n.\n\n### Including family in your application\n\nIncluding family in your application\nDetails\n\nYour partner can be included on your application form. You cannot bring any dependent children or other dependent relatives.\n\nYour partner can be included on your application form. You cannot bring any dependent children or other dependent relatives.\n\n### Cost\n\nCost\nDetails\n\nRetirement (Subclass 410):\n\nRetirement (Subclass 410):\n- Base application charge —AUD500.00\nBase application charge —\nAUD500.00\n- Additional applicant charge 18 and over —AUD250.00\nAdditional applicant charge 18 and over —\nAUD250.00\n- Additional applicant charge under 18 —AUD125.00\nAdditional applicant charge under 18 —\nAUD125.00\n- To make a payment, please pay by:credit cardbank cheque or money order made payable to the Department of Home Affairs.Please do not pay by cash, travellers' cheques or personal cheque\n\nTo make a payment, please pay by:\n\nTo make a payment, please pay by:\n- credit card\ncredit card\n- bank cheque or money order made payable to the Department of Home Affairs.\nbank cheque or money order made payable to the Department of Home Affairs.\n\nPlease do not pay by cash, travellers' cheques or personal cheque\n\nPlease do not pay by cash, travellers' cheques or personal cheque\n\n#### Other costs\n\nOther costs\n\nYou might need to pay a charge for:\n\nYou might need to pay a charge for:\n- health assessments\nhealth assessments\n- police checks and certificates\npolice checks and certificates\n- other certificates\nother certificates\n\nYou should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents.\n\nYou should also be prepared to pay other costs associated with your application, such as the cost of translations of some documents.\n\n### How to apply\n\nHow to apply\nDetails\n\nThis information explains what you need to do to apply for a Retirement visa (subclass 410). You and anyone included in your application can apply for this visa when you are in or outside of Australia:\n\nThis information explains what you need to do to apply for a Retirement visa (subclass 410). You and anyone included in your application can apply for this visa when you are in or outside of Australia:\n- If you apply for this visa in Australia, you must be in Australia when the visa is granted.\nIf you apply for this visa in Australia, you must be in Australia when the visa is granted.\n- If you apply for this visa outside Australia, you must be outside Australia when the visa is granted.\nIf you apply for this visa outside Australia, you must be outside Australia when the visa is granted.\n\n#### Prepare your documents\n\nPrepare your documents\nDetails\n\nYou need to provide documents to prove the claims you make in the application. The documents are listed in the Document checklist.\n\nYou need to provide documents to prove the claims you make in the application. The documents are listed in the Document checklist.\n\nSome documents could take some time to obtain. You should have them ready when you lodge the application to reduce any delays in processing.\n\nSome documents could take some time to obtain. You should have them ready when you lodge the application to reduce any delays in processing.\n\nFor more information see information to help youprepare your application.\n\nFor more information see information to help you\nprepare your application\n.\n\n#### Lodge your application\n\nLodge your application\nDetails\n\nYou must complete the following application form:\n\nYou must complete the following application form:\n- Form 1383 Application for a temporary visa for retirees (423KB PDF)\nForm 1383 Application for a temporary visa for retirees (423KB PDF)\n\nIf you are required to provide an Australian penal clearance certificate, you will need to complete the AFP National Police Check application form:\n\nIf you are required to provide an Australian penal clearance certificate, you will need to complete the AFP National Police Check application form:\n- AFP National Police Checks\nAFP National Police Checks\n\nIf you are required to provide a penal clearance certificate (sometimes known as a police certificate) from another country please refer to the following document which provides instructions on obtaining a certificate from an overseas government or law enforcement authority:\n\nIf you are required to provide a penal clearance certificate (sometimes known as a police certificate) from another country please refer to the following document which provides instructions on obtaining a certificate from an overseas government or law enforcement authority:\n\nCharacter and police certificate requirements​\n\nCharacter and police certificate requirements​\n\nLodge your application at theHobart officein Tasmania. Provide all relevant documents and pay the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs.\n\nLodge your application at the\nHobart office\nin Tasmania. Provide all relevant documents and pay the visa application charge when you apply. You can pay by credit card, bank cheque or money order made payable to the Department of Home Affairs.\n\n#### More information\n\nMore information\nDetails\n\nThere is more information to help youprepare your application, such as certifying and translating documents into English, communicating with us, using a migration agent, authorising another person to receive information from us, and receiving assistance with your application.​​\n\nThere is more information to help you\nprepare your application\n, such as certifying and translating documents into English, communicating with us, using a migration agent, authorising another person to receive information from us, and receiving assistance with your application.​​\n\n### After you have applied\n\nAfter you have applied\nDetails\n\nAfter you have lodged your application and documents, we will let you know that we have received your information.\n\nAfter you have lodged your application and documents, we will let you know that we have received your information.\n\n#### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us, in writing, at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 Notification of incorrect answer(s) (168KB PDF)\nForm 1023 Notification of incorrect answer(s) (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\n#### Report changes in your circumstances\n\nReport changes in your circumstances\nDetails\n\nYou should tell us if your circumstances change. You can do so using the following forms:\n\nYou should tell us if your circumstances change. You can do so using the following forms:\n- Form 929 Change of address and/or passport details (193KB PDF)Change of address and/or passport details— if you move to a new address or change your passport\nForm 929 Change of address and/or passport details (193KB PDF)\nChange of address and/or passport details\n— if you move to a new address or change your passport\n- Form 1022 Notification of changes in circumstances  (172KB PDF)Notification of changes in circumstances— if there are other changes in your circumstances.\nForm 1022 Notification of changes in circumstances  (172KB PDF)\nNotification of changes in circumstances\n— if there are other changes in your circumstances.\n\n#### Withdrawing your application\n\nWithdrawing your application\nDetails\n\nSee:withdrawing your application\n\nSee:\nwithdrawing your application\n\n### Visa decision\n\nVisa decision\nDetails\n\nIf your visa is granted, you will receive a letter from us detailing:\n\nIf your visa is granted, you will receive a letter from us detailing:\n- advice that you have been granted the Retirement visa (subclass 410)\nadvice that you have been granted the Retirement visa (subclass 410)\n- any conditions placed on your visa.\nany conditions placed on your visa.\n\nIf your visa is refused, you will receive a letter advising the reasons for the refusal decision. The letter will also advise you whether you can ask for the decision to be reviewed by the Migration Review Tribunal, and explain how to apply for review.\n\nIf your visa is refused, you will receive a letter advising the reasons for the refusal decision. The letter will also advise you whether you can ask for the decision to be reviewed by the Migration Review Tribunal, and explain how to apply for review.\n\nFor more information seeMigration Review Tribunal.\n\nFor more information see\nMigration Review Tribunal\n.\n\n### Document checklist\n\nDocument checklist\nDetails\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nYou need to provide documents to support your application for this visa. We can make a decision using the information you provide when you lodge your application. It is in your interest to provide as much information as possible with your application.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nProvide certified copies of original documents. Do not include original documents unless we specifically ask for them. Police certificates should be original documents. Documents not in English must be accompanied by accredited English translations.\n\nUse this checklist to make sure your application is complete.\n\nUse this checklist to make sure your application is complete.\n\n#### Forms\n\nForms\n\nForm 1383 Application for a temporary visa for retirees  (423KB PDF)\n\nForm 1383 Application for a temporary visa for retirees  (423KB PDF)\n\n#### Charges\n\nCharges\n\nSee:Visa pricing estimator.\n\nSee:\nVisa pricing estimator\n.\n\n#### Receiving assistance\n\nReceiving assistance\nDetails\n- If someone gives you advice or lodges your application for you:Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)(the agent or exempt person completes the form and you must sign it).\nIf someone gives you advice or lodges your application for you:\n- Form 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)(the agent or exempt person completes the form and you must sign it).\nForm 956 Advice by a migration agent/exempt person of providing immigration assistance (308KB PDF)\n(the agent or exempt person completes the form and you must sign it).\n- If you would like someone else to receive correspondence from us on your behalf:Form 956A Appointment or withdrawal of an authorised recipient  (301KB PDF)(the recipient completes the form and you must sign it).\nIf you would like someone else to receive correspondence from us on your behalf:\n- Form 956A Appointment or withdrawal of an authorised recipient  (301KB PDF)(the recipient completes the form and you must sign it).\nForm 956A Appointment or withdrawal of an authorised recipient  (301KB PDF)\n(the recipient completes the form and you must sign it).\n\n#### Your identity\n\nYour identity\nDetails\n- Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nCertified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\n- Evidence of any name change, such as a marriage certificate\nEvidence of any name change, such as a marriage certificate\n- Two recent passport-sized photographs (45mm x 35mm) of each person included in the application.These photographs should be of the head and shoulders only, against a plain background.Print the name of the person on the back of each photograph.\nTwo recent passport-sized photographs (45mm x 35mm) of each person included in the application.\n- These photographs should be of the head and shoulders only, against a plain background.\nThese photographs should be of the head and shoulders only, against a plain background.\n- Print the name of the person on the back of each photograph.\nPrint the name of the person on the back of each photograph.\n\n#### Your relationships\n\nYour relationships\nDetails\n- Certified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\nCertified copies of marriage certificates or relationship registrations for you and anyone else included in your application, even if they are not joining you in Australia.\n- If you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names).\nIf you are living in a de facto relationship: independent evidence that you have been in the relationship for at least 12 months (for example, joint bank account statements or billing accounts in joint names).\n\n#### Your health insurance\n\nYour health insurance\nDetails\n- Evidence that you and your partner (if applicable), hold an adequate health insurance package. If you are applying for a further visa, you should also provide evidence that you maintainedadequate health insurancewhile in Australia on a Retirement visa (subclass 410).\nEvidence that you and your partner (if applicable), hold an adequate health insurance package. If you are applying for a further visa, you should also provide evidence that you maintained\nadequate health insurance\nwhile in Australia on a Retirement visa (subclass 410).\n\n## Visa holders\n\nVisa holders\n\nThis information is for people who have already been granted a Retirement visa (subclass 410). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Retirement visa (subclass 410). It explains your rights and obligations.\nDetails\n\n### What the visa lets you do\n\nWhat the visa lets you do\nDetails\n\nThis visa is a temporary visa. It allows you and your partner to:\n\nThis visa is a temporary visa. It allows you and your partner to:\n- leave and re-enter Australia at any time\nleave and re-enter Australia at any time\n- work in Australia\nwork in Australia\n- study in Australia.\nstudy in Australia.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your partner must comply with all visa conditions and Australian laws.\n\nYou and your partner must comply with all visa conditions and Australian laws.\n\nA breach of your visa conditions or breaking Australian laws can result in your visa being cancelled. If this happens you will need to leave Australia.\n\nA breach of your visa conditions or breaking Australian laws can result in your visa being cancelled. If this happens you will need to leave Australia.\n\n#### Arrival conditions\n\nArrival conditions\n\nYou must enter Australia before the expiry date given to you in your visa grant notification. If you do not arrive before this date, you will need to obtain a new visa before you can travel.\n\nYou must enter Australia before the expiry date given to you in your visa grant notification. If you do not arrive before this date, you will need to obtain a new visa before you can travel.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/subclass-410#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/subclass-410#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:32:09.452835",
  "metadata": {}
}