{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-skilled-457",
  "title": "Temporary Work (Skilled) visa (subclass 457)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Temporary Work (Skilled) visa (subclass 457) Page Content ​​​​​​​​On 18 April 2017, the Hon Malcolm Turnbull MP, Prime Minister of Australia and the Hon Peter Dutton MP, Minister for Immigration and Border Protection jointly announced that the Temporary Work (Skilled) visa (subclass 457 visa) will be abolished and replaced with the completely new Temporary Skill Shortage (TSS) visa which will support businesses in addressing genuine skill shortages. About this visa Details The Temporary Work (Skilled) visa (subclass 457) allows skilled workers to come to Australia and work for an approved business for up to: 4 years after it is granted – if your occupation is listed on the Medium and Long-term Strategic Skills List (MLTSSL) 2 years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL. To hold this visa you must have been sponsored by an approved business. Legislative instruments​ To maintain flexibility in the Subclass 457 visa program, certain aspects of the program are subject to change from time to time. The aspects of the program that might change are contained in what is known as a legislative instrument. Details Subclass 457 visa eligible occupation Details For nomination applications lodged on or after 17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas. See IMMI 18/004: Specification of Occupations - Subclass 457 visa. For nomination applications lodged before 17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas. See: IMMI 17/060: Specification of Occupations—Subclass 457 Visa For a list of postcodes considered to be regional Australia where a regional caveat applies. See: IMMI 17/059: Regional Certifying Bodies and Regional Postcodes. English language tests, scores and exemptions Details The instrument below lists the tests and scores that are required to demonstrate English language proficiency for subclass 457 visa applicants. It also outlines exempted situations where applicants are not required to demonstrate their English proficiency. See: IMMI 17/057: English Language Requirements for Subclass 457 visas Training Benchmarks The instrument below lists the requirements to meet the required training benchmarks to be eligible for sponsorship under the subclass 457 visa program. See: IMMI 17/045: Specification of Training Benchmarks and Training Requirements Terms and conditions of employment (Market salary rates) Details The instrument below lists the dollar amounts for the Temporary Skilled Migration Income Threshold (TSMIT) and the exemption from the requirement to demonstrate equivalent terms and conditions of employment (market salary rates). See: IMMI 13/028: Temporary Skilled Migration Income Threshold (TSMIT) and market rates exemption level The instrument below specifies the method for determining the terms and conditions of employment (market salary rates) where there is no equivalent Australian worker in that location. See: IMMI 09/113: Specification of method to determine terms and conditions of employment Exemption from the requirement to work directly for the sponsor Details The instrument below lists the occupations where the requirement to work directly for the sponsor is waived. See: IMMI 13/067: Specification of Occupations for Nominations in Relation to Subclass 457 for Positions other than in the Business of the Nominator Labour market testing The instrument below specifies the period in which labour market testing must be undertaken. See: IMMI 13/136: Specified period in which labour market testing must be undertaken The instrument below specifies the occupations which are exempt from labour market testing. See: IMMI 13/137: Specification of occupations exempt from labour market testing The instrument below lists the international trade obligations which are inconsistent with the labour market testing requirement (i.e. where labour market testing is not required). See: IMMI 17/109: Determination of International Trade Obligations relating to Labour Market Testing Visa applicants This visa is now closed to new applications Details Inclu​ding family in your application Details They must also be able to show they have the same levels of financial support as you. Your sponsor must agree in writing to include them as secondary sponsored persons. They can do this by including the details of your family members in the nomination application, or by providing this information in a letter to be attached to your visa application. After you have applied You can track and manage your application using ImmiAccount Provide more information Details You can provide more information to us at any time until a decision is made on the application. If you want to correct information you provided, use: Form 1023 — Notification of incorrect answer(s) (168KB PDF) We could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have. You can provide additional information, including Form 1023, using ImmiAccount If another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information. You might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview. To help us locate your application quickly, include the following with any information you give us: your name and date of birth the transaction reference number we gave you when you lodged your application. Report changes in your situation​ . See more information if you are withdrawing your application Visa holders Details How long your visa lasts Details This visa can be valid for up to: four years after it is granted – if your occupation is listed on the MLTSSL. two years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL. You will need to check the letter you received from us when your visa was granted to confirm the date your visa expires. If you no longer have this letter, you can access VEVO instead. If your sponsor is a start-up business or has traded in Australia for less than 12 months, then the visa will be granted for 18 months. Note: Subclass 457 visas granted under a Labour Agreement will be granted for 4 years unless the agreement specifies a shorter period. What this visa lets you do Details This visa allows you to: work in Australia for an approved sponsor for the life of your visa bring your family to work or study in Australia travel in and out of Australia as often as you want. Your obligations Details If you are granted a subclass 457 visa, there are certain conditions that apply to you depending on whether you are the primary or a secondary visa holder. You must comply with the visa condition or conditions that apply to you. Failure to do so might result in your visa being cancelled. Mandatory visa conditions Details Mandatory Condition 8107 These conditions apply to all primary subclass 457 visa holders. You must: only work in your nominated occupation only work for the sponsor who nominated the position you are working in, (if your sponsor is a standard business sponsor and is an Australian business, you can also work for an associated entity of the sponsor). If you hold a subclass 457 visa or your last substantive visa was a subclass 457 visa and your employment with your sponsor ends, you can stop working or work outside of the above conditions for a limited time: up to 180 days in a single period up to 365 days in total across the period your visa is granted for. These time periods start from 1 July 2024. They do not include any earlier time periods when you stopped working under the condition in place before that date. You must also: start work within 90 days of: arriving in Australia if you were outside Australia when your visa was granted being granted your visa, if you were in Australia at the time your visa was granted. obtain any mandatory licence, registration or membership necessary to perform your occupation in Australia and comply with any provisions within 90 days: after initial arrival in Australia on this visa from date of visa grant if already in Australia. If your visa was granted on or after 1 December 2015 you must also: not engage in work that is inconsistent with your licence, registration or membership let us know in writing as soon as you can if your application for the licence, registration or membership is: refused revoked cancelled or ends. Email: sponsor.notifications@abf.gov.au You are considered to have ceased employment when either you or your employer notifies us of the date you stopped work. If you stop working for your sponsor, you have up to 180 days to: find another employer to sponsor you and have them lodge a new nomination be granted a different visa depart Australia. If more than 180 consecutive days have passed since the date your sponsor advised us you would be ceasing employment on, you could be in breach of Condition 8107 and your visa could be cancelled. If you abandon your employment, or are absent without leave, you could be considered to have ceased employment. If your visa is about to expire and you want to keep working in Australia, you must apply for another visa. If you want to change your employer and/or nominated occupation while you still hold a valid 457 visa you do not need to apply for a new subclass 457 visa. Your sponsor, new or existing, must lodge a new nomination and this must be approved before you commence working for the new sponsor or in the new nominated position. Medical practitioners and general managers Medical practitioners and general managers must work in their nominated occupation but they can work for employers other than their sponsor or an associated entity of their sponsor. The specific occupations that this applies to are listed in Exemption from the requirement to work directly for the sponsor Other visa conditions Details Condition 8501 is mandatory on all primary and secondary visas. You may also have additional conditions imposed on your subclass 457 visa, including: 8502, 8516, 8522, 8525 and 8526. For information on any conditions imposed on your visa, please check the letter you received from us when your visa was granted. If you no longer have this letter, you can access VEVO instead. Report changes Details You must tell us if your circumstances change. This includes a new residential address, a new passport, a pregnancy, birth or death or any changes in the composition of your family. You can use the following forms: Form 929 Change of address and/or passport details (193KB PDF) — if you move to a new address or change your passport Form 1022 Notification of changes in circumstances (172KB PDF) — if there are other changes in your circumstances. You might be able to update your address and passport details using ImmiAccount Children born in Australia Details If your child is born in Australia while you hold a 457 visa, you must notify us in writing. Your child will then hold a subclass 457 visa. You must provide a copy of your child’s Australian birth certificate and the personal details page of their passport. This is particularly important if you are intending to travel outside Australia after the birth of your child. You must email this information to ESPD@homeaffairs.gov.au . General enquiries submitted to this email address will not be responded to. After you arrive in Australia Details Changing employer or occupation Details If you have been granted a subclass 457 visa and you want to change your employer or occupation you are not required to apply for a new visa, however before you start working for a new employer or in a new occupation, you must be nominated by your proposed new employer and have that nomination approved first. The approval of a new nomination only allows you to change your employer or occupation. It does not extend the length of your subclass 457 visa and does not change the conditions attached to it. It is your responsibility to ensure that you have a valid visa to remain in Australia at all times. To check the visa conditions and expiry date of your visa, refer to VEVO Options if you have lost your job If you have been laid off and are currently unemployed, you have up to 180 days to find a new employer or make arrangements to leave Australia. Your employment rights in Australia Details All employees in Australia are covered by the Fair Work Act 2009. This includes you as a subclass 457 visa holders. For more information, see Workplace rights for all visa holders working in Australia . ​​​​​ Sponsors Details How long the sponsorship lasts Details Sponsorships for Australian businesses can be valid for: 18 months — Sponsorship for start-up businesses 6 years — Accredited sponsorships 5 Years — Standard business sponsorships the length of the labour agreement — Labour agreement Sponsorships for Overseas businesses can be valid for: 18 months — Overseas business seeking to establish a business in Australia 5 years — Overseas businesses who have a contractual obligation As of 3 March 2018, all sponsorships approved will be valid for five years. If you have a labour agreement in place, you are an approved sponsor for the term of the agreement. Report changes in your circumstances Details You must tell us if your circumstances change. Use the following forms: Form 929 Change of address and/or passport details (170KB PDF) (193KB PDF) — if you move to a new address or change your passport Form 1022 Notification of changes in circumstances (150KB PDF) (172KB PDF) — if there are other changes in your circumstances. You might be able to update your address details using ImmiAccount The types of changes that must be notified are: a change to your business trading name, your ABN, or other business details a change to your contact or address details corrections to information you provided in your application. Changing your business structure Businesses sometimes decide to change their structure and this can have implications if your business sponsors 457 visa holders. If a change in your business structure results in a new legal entity being created (for example, a sole trader commences operating as a company) then the new entity will need to apply to become a standard business sponsor and new nominations will be required for each of your 457 visa holders. If you do not do this you could be breaching your sponsorship obligations and your workers will not be complying with their visa conditions which might result in their visa being cancelled. Changing your business structure could also have implications for you and your 457 visa holder if you want to sponsor them for a permanent visa in the future. You should read the Employer Nomination Scheme pages for more information Sponsor obligations, monitoring and sanctions Details Sponsor Obligations Details Sponsorship obligations apply to all sponsors of subclass 457 visa holders. They are in place to ensure that overseas skilled workers are protected from exploitation, and that the subclass 457 visa programme is being used to meet genuine skills shortages, and not to undercut local labour wages and conditions. Some obligations apply beyond the term of sponsorship approval. As a sponsor you must: cooperate with inspectors ensure equivalent terms and conditions of employment keep records provide records and information to the Minister tell us when certain events occur ensure the visa holder participates in the nominated occupation, program or activity not recover from, transfer or charge certain costs to another person pay travel costs to enable sponsored people to leave Australia pay costs to remove unlawful non-citizens provide training to Australians and permanent residents not engage in discriminatory recruitment practices. Cooperate with inspectors You must cooperate with inspectors appointed under the Migration Act 1958 (the Act) who are investigating whether: a sponsorship obligation is being, or has been, complied with you have hired an illegal worker there are other circumstances in which we could take administrative action. This obligation: starts on the day the sponsorship is approved or work agreement commences ends five years after the day the approved sponsorship ends or work agreement ceases. Cooperating with inspectors can include (but is not limited to): providing access to premises producing and providing documents within the requested timeframe not preventing or attempting to prevent ,access to a person who has custody of, or access to, a record or documents providing officers with access to interview any person on their premises. Ensure equivalent terms and conditions of employment If you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than those you provide, or would provide to an Australian performing equivalent work in the same location. Further, if you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than the terms and conditions you advised you would be providing to the sponsored person at the time of the nomination. This obligation does not apply to a sponsor if the annual earnings of their sponsored visa holder are equal to, or greater than AUD250,000. If you sponsor someone under a work agreement, you must ensure that the people you sponsor are paid the amount specified in the work agreement. This obligation starts on the day (whichever is the earliest): the person you have sponsored is granted a subclass 457 visa your nomination is approved (if they already hold a subclass 457 visa when your nomination was approved) This obligation ends either: on the day the sponsored visa holder stops working for you, or on the day they are granted a further visa other than another subclass 457 visa, or a bridging visa, a criminal justice visa, or an enforcement visa. If the sponsored visa holder is granted another subclass 457 visa to continue to work for you, this obligation continues. Keep records You must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following: written requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received how the outward travel costs were paid for a sponsored visa holder or their family, how much was paid, for whom they were paid, and when they were paid notifying us of an event required to be reported to us, including the date and method of notification and where the notification was provided tasks performed by the sponsored visa holder in relation to the nominated occupation and where the tasks were performed money paid to the sponsored visa holder (unless the sponsored visa holder earns over AUD250,000) money applied or dealt with in any way on behalf of the sponsored visa holder or as the sponsored visa holder directed (unless the sponsored visa holder earns over AUD250,000) non-monetary benefits provided to the sponsored visa holder , including the agreed value and the time at which, or the period over which, those benefits were provided (unless the sponsored visa holder earns over AUD250,000) if there is an equivalent worker in your workplace, a record of the terms and conditions that apply to the equivalent worker, including the period over which the terms and conditions applied (unless the sponsored visa holder earns over AUD250,000) the written contract of employment each sponsored visa holder is engaged under if you were lawfully operating a business in Australian at the time of your approval as a standard business sponsor or variation of the terms of your approval as a standard business sponsor—how you are complying with the training obligation if you are a party to a work agreement, the records required to be kept under the work agreement. The obligation starts the day the sponsorship is approved or work agreement begins. This obligation ends two years after both of the following: your sponsorship or the work agreement ceases you are no longer sponsoring anyone. Provide records and information to the Minister You must provide records or information, if they are requested by a departmental officer that goes to determining whether: a sponsorship obligation is being or has been complied with, and determining whether other circumstances, in which the Minister might take administrative action, exist or have existed, in the manner and timeframe requested by us. We might ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of Subclass 457 visa holders. You must provide the records or information requested if it is a record or information that: you are required to keep under Commonwealth, state or territory law you have an obligation to keep as a sponsor. This obligation starts to apply on the day the sponsorship is approved or work agreement commences. This obligation ends two years after: your sponsorship or work agreement ceases you no longer have a sponsored visa holder. Tell us when certain events occur You must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring. Examples of events include (but are not limited to): a change to your address or contact details the end or expected ending of a primary sponsored visa holder’s employment, program or activity a change to the duties carried out by the primary sponsored visa holder. This obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences. This obligation ends two years after: your sponsorship or the work agreement ends, and you are no longer sponsoring anyone. Changes or events that all sponsors must notify within 28 calendar days You must notify us within 28 calendar days if: the sponsored visa holder’s employment ends, or is expected to end(the sponsor must tell us if the end date changes) there are changes to the work duties carried out by the sponsored visa holder you are a standard business sponsor and there is a change to the information in the sponsorship application or the application to vary a term of sponsorship approval relating to the training requirement and the sponsor’s address and contact details if you are a party to a work agreement and there is a change to the address and contact details or the training information provided in the work agreement you have paid the return travel costs of a sponsored visa holder or any of their family members in accordance with the obligation to pay return travel costs you have become insolvent within the meaning of subsections 5 (2) and (3) of the Bankruptcy Act 1966 and section 95A of the Corporations Act 2001 your business ceases to exist as a legal entity. If your business is a company A company must also notify us of the following changes or events within 28 calendar days if: a new director is appointed an administrator is appointed for the company under Part 5.3A of the Corporations Act 2001 the company resolves by special resolution to be wound up voluntarily under subsection 491(1) of the Corporations Act 2001 a court has ordered that the company be wound up in insolvency under Part 5.4, or on other grounds under Part 5.4A, of the Corporations Act 2001 a court has appointed an official liquidator to be the provisional liquidator of the company under Part 5.4B of the Corporations Act 2001 a court has approved a compromise or arrangement proposed by the company under Part 5.1 of the Corporations Act 2001 the property of the company becomes subject to a receiver or other controller under Part 5.2 of the Corporations Act 2001 procedures are initiated for the deregistration of the company under Part 5A.1 of the Corporations Act 2001 If you are an individual If you operate your business as an individual, you must also notify us of the following changes or events within 28 calendar days: you enter into a personal insolvency agreement under Part X of the Bankruptcy Act 1966 you enter into a debt agreement under Part IX of the Bankruptcy Act 1966 a sequestration order is made against your estate under Part IV of the Bankruptcy Act 1966 you become a bankrupt by virtue of the presentation of a debtor’s petition under Part IV of the Bankruptcy Act 1966 you present a declaration of intention to present a debtor’s petition under Part IV of the Bankruptcy Act 1966 a composition or scheme of arrangement is presented in relation to you in accordance with Division 6 of Part IV of the Bankruptcy Act 1966. If your business is a partnership You must also notify us of the following changes or events within 28 calendar days: a new partner joins the partnership any of the events listed for an individual or a company occurs. If your business is an unincorporated association An unincorporated association must also notify us within 28 calendar days if: a new member is appointed to the managing committee of the association any of the events listed for an individual or a company occurs. Where to send a notice of an event or change You must send details of these events by email or to one of our state or territory offices listed below. By email (preferred): sponsor.notifications@abf.gov.au By registered post: Australian Capital Territory Sponsor Monitoring GPO Box 717 Canberra ACT 2601 New South Wales Sponsor Monitoring GPO Box 9984 Sydney NSW 2001 Queensland Sponsor Monitoring GPO Box 9984 Brisbane Qld 4001 Northern Territory Sponsor Monitoring GPO Box 864 Darwin NT 0801 South Australia Sponsor Monitoring GPO Box 2399 Adelaide SA 5001 Tasmania Sponsor Monitoring GPO Box 794 Hobart Tas. 7001 Victoria Sponsor Monitoring GPO Box 241 Melbourne Vic. 3001 Western Australia Sponsor Monitoring Locked Bag 7 Northbridge WA 6865 Ensure that the visa holder participates in the nominated occupation, program or activity You must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved. This obligation ends on the day (whichever is the earliest): the sponsored visa holder has a nomination approved for another approved sponsor the sponsored visa holder is granted another substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa the sponsored visa holder has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. If you are a standard business sponsor, you must employ the person you have sponsored under a written contract of employment. They cannot work for another business, and you cannot supply them to another business. If you were lawfully operating a business in Australia at the time you were approved as a standard business sponsor, the person might work for an associated entity. You cannot engage in activities related to the recruitment or hire of the sponsored visa holder to another business unless it is an associated entity and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time the terms of your approval were last varied). The only exception to this rule is if the sponsored visa holder’s occupation is an exempt occupation for the purposes of this obligation. The obligation ends on the day the sponsored visa holder is granted another substantive visa of a different subclass from the one they last held. The obligation continues if the sponsored visa holder is granted another subclass 457 visa to continue to work for you. Not recover, transfer or charge certain costs to another person You must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to: the recruitment of the person you sponsored becoming or being a sponsor or former approved sponsor. This obligation: starts on the day the sponsorship is approved or the work agreement commences ends on the following two events: you cease to be an approved sponsor or party to a work agreement you no longer have a sponsored visa holder. Sponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include: cost of sponsorship and nomination charges migration agent costs associated with the lodgement of sponsorship and nomination applications administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including: recruitment agent fees migration agent fees the cost of job advertising screening of candidates, short listing, interviews and reference checks salaries of recruitment or human resource staff the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position training of new staff responding to queries for prospective candidates, and advising unsuccessful applicants travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia. Pay travel costs to enable sponsored people to leave Australia You must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request on their behalf. The costs will be considered reasonable and necessary if they include all of the following: travel from the sponsored persons usual place of residence in Australia to their place of departure from Australia travel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to economy class air travel or, where that is not available, a reasonable equivalent. Travel costs must be paid within 30 days of receiving the request. You will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again. This obligation starts on the day: the visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved , or your nomination is approved (if the person already held a visa in this subclass when your nomination is approved). This obligation ends on the day (whichever is the earliest): another sponsor has their nomination application for the sponsored person approved the person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa the person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Pay costs to locate and remove an unlawful non-citizen In the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you might be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia. You might be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10,000) less any amount which might have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above). This obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that we might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia. Provide training to Australians and permanent residents If you are a standard business sponsor and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time you had your terms of approval varied). You must contribute to the training of Australians by either: spending an equivalent of at least two per cent of your payroll in payments to an industry training fund that operates in the same or related industry as you spending an equivalent to at least one per cent of your payroll in the provision of training to employees of your business who are Australian citizens or Australian permanent residents. The obligation begins on the day you are approved as a sponsor. You must meet this obligation in each 12 month period within which you employ a sponsored visa holder (including if the sponsored visa holder is not employed by you for the full twelve months). Where your approval as a standard business sponsor is varied, you must meet the training requirement if you employ one or more primary sponsored persons. The obligation ends either: three years after you are approved as a sponsor if you are an accredited sponsor, six years after you are approved as a sponsor. Obligation not to engage in discriminatory recruitment practices If you are a standard business sponsor who lawfully operates a business in Australia, you must not engage in, or have not engaged in, discriminatory recruitment practices that adversely affect Australian citizens, or any other person, based on their visa or citizenship status. You should keep documents on hand that demonstrate that the recruitment process in relation to a subclass 457 holder did not discriminate based on citizenship or visa status. Note: This new obligation was introduced on 19 April 2016. It is not engaged if discrimination in recruitment decisions is evident on other grounds such as sex, gender, race, social group or pregnancy. These issues are outside the remit of us and should be directed to other relevant agencies, such as the Fair Work Ombudsman or the Australian Human Rights Commission. Monitoring of sponsors and visa holders Details You must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions. We monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways: writing to you to ask for information in accordance with the obligation to provide records and information site visits, usually to the sponsored business premises, with or without notice exchanging information with other Commonwealth, state and territory government agencies, including the Fair Work Ombudsman, the Department of Employment and the Australian Taxation Office. Your compliance with the sponsorship obligations might be monitored by Immigrations inspectors, Fair Work Inspectors or Fair Work Building Industry Inspectors who have investigative powers under the Migration Act 1958 . Failure to cooperate with inspectors is a breach of the sponsorship obligations. Subject to legislation passing, the Department will publish information identifying sponsors who have not complied with their sponsorship obligations and any action taken against them. Further information will be available if this occurs. Sanctions for not meeting your sponsor obligations Details If you do not meet your obligations, we could take one or more of the following actions: Administrative you could be barred from sponsoring more people for a specified time you could be barred from applying for approval to be a sponsor, in relation to this visa or another one all of your existing approvals as a sponsor could be cancelled. Enforceable undertaking You could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again. Civil we can issue an infringement notice of up to AUD12,600 for a body corporate and AUD2,520 for an individual for each failure. we can apply to a court for a civil penalty order of up to AUD63,000 for a corporation and AUD12,600 for an individual for each failure. Other circumstances in which administrative action might be taken In addition, you could also have sanctions imposed if: you provide false or misleading information to us or the Administrative Appeals Tribunal you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position. The types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made a work agreement. If you have sponsored someone under a work agreement, we could suspend or terminate it in accordance with the clauses of the particular work agreement. Adverse information for sponsors See: Adverse information Nomination Details Nomination process Details Nomination is the process of identifying a position to be filled by a skilled worker from outside Australia in an approved business. Nomination is required for both standard business sponsors and parties to a labour agreement. The nomination process identifies: the occupation is relevant to the position to be filled the skills and experience required for the position the market salary rate for the position and the salary rate to be paid to the prospective overseas employee the name of the prospective overseas employee where the employee will be working. How long is the nomination valid for? Details An approval of a nomination ceases on the earliest of the following: the day we receive notification in writing of the withdrawal of the nomination by the sponsor 12 months after the day the nomination is approved the day the applicant, or the proposed applicant, for the nominated occupation, is granted a subclass 457 visa if the approval of the nomination is given to a standard business sponsor – three months after the day their approval as a standard business sponsor ceases if the approval of the nomination is given to a standard business sponsor, and their approval as a standard business sponsor is cancelled – the day the approval as a standard business sponsor is cancelled if the approval of the nomination is given to a party to a labour agreement – the day the labour agreement ceases.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Temporary Work (Skilled) visa (subclass 457)\n\nTemporary Work (Skilled) visa (subclass 457)\nPage Content\n\n​​​​​​​​On 18 April 2017, the Hon Malcolm Turnbull MP, Prime Minister of Australia and the Hon Peter Dutton MP, Minister for Immigration and Border Protection jointly announced that the Temporary Work (Skilled) visa (subclass 457 visa) will be abolished and replaced with the completely new Temporary Skill Shortage (TSS) visa which will support businesses in addressing genuine skill shortages.\n\n​​​​​​​​On 18 April 2017, the Hon Malcolm Turnbull MP, Prime Minister of Australia and the Hon Peter Dutton MP, Minister for Immigration and Border Protection jointly announced that the Temporary Work (Skilled) visa (subclass 457 visa) will be abolished and replaced with the completely new Temporary Skill Shortage (TSS) visa which will support businesses in addressing genuine skill shortages.\n\n## About this visa\n\nAbout this visa\nDetails\n\nThe Temporary Work (Skilled) visa (subclass 457) allows skilled workers to come to Australia and work for an approved business for up to:\n\nThe Temporary Work (Skilled) visa (subclass 457) allows skilled workers to come to Australia and work for an approved business for up to:\n- 4 years after it is granted – if your occupation is listed on the Medium and Long-term Strategic Skills List (MLTSSL)\n4 years after it is granted – if your occupation is listed on the Medium and Long-term Strategic Skills List (MLTSSL)\n- 2 years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL.\n2 years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL.\n\nTo hold this visa you must have been sponsored by an approved business.\n\nTo hold this visa you must have been sponsored by an approved business.\n\n### Legislative instruments​\n\nLegislative instruments​\n\nTo maintain flexibility in the Subclass 457 visa program, certain aspects of the program are subject to change from time to time. The aspects of the program that might change are contained in what is known as a legislative instrument.\n\nTo maintain flexibility in the Subclass 457 visa program, certain aspects of the program are subject to change from time to time. The aspects of the program that might change are contained in what is known as a legislative instrument.\nDetails\n\n#### Subclass 457 visa eligible occupation\n\nSubclass 457 visa eligible occupation\nDetails\n\nFor nomination applications lodgedon or after17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas.\n\nFor nomination applications lodged\non or after\n17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas.\n\nSee:IMMI 18/004: Specification of Occupations - Subclass 457 visa..\n\nSee\n:\nIMMI 18/004: Specification of Occupations - Subclass 457 visa.\n.\n\nFor nomination applications lodgedbefore17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas.\n\nFor nomination applications lodged\nbefore\n17 January 2018, the skilled occupations listed in the following legislative instrument are eligible for subclass 457 visas.\n\nSee:IMMI 17/060: Specification of Occupations—Subclass 457 Visa.\n\nSee:\nIMMI 17/060: Specification of Occupations—Subclass 457 Visa\n.\n\nFor a list of postcodes considered to be regional Australia where a regional caveat applies.\n\nFor a list of postcodes considered to be regional Australia where a regional caveat applies.\n\nSee:IMMI 17/059: Regional Certifying Bodies and Regional Postcodes..\n\nSee:\nIMMI 17/059: Regional Certifying Bodies and Regional Postcodes.\n.\n\n#### English language tests, scores and exemptions\n\nEnglish language tests, scores and exemptions\nDetails\n\nThe instrument below lists the tests and scores that are required to demonstrate English language proficiency for subclass 457 visa applicants. It also outlines exempted situations where applicants are not required to demonstrate their English proficiency.\n\nThe instrument below lists the tests and scores that are required to demonstrate English language proficiency for subclass 457 visa applicants. It also outlines exempted situations where applicants are not required to demonstrate their English proficiency.\n\nSee:IMMI 17/057: English Language Requirements for Subclass 457 visas.\n\nSee:\nIMMI 17/057: English Language Requirements for Subclass 457 visas\n.\n\nTraining Benchmarks\n\nTraining Benchmarks\n\nThe instrument below lists the requirements to meet the required training benchmarks to be eligible for sponsorship under the subclass 457 visa program.\n\nThe instrument below lists the requirements to meet the required training benchmarks to be eligible for sponsorship under the subclass 457 visa program.\n\nSee:IMMI 17/045: Specification of Training Benchmarks and Training Requirements.\n\nSee:\nIMMI 17/045: Specification of Training Benchmarks and Training Requirements\n.\n\n#### Terms and conditions of employment (Market salary rates)\n\nTerms and conditions of employment (Market salary rates)\nDetails\n\nThe instrument below lists the dollar amounts for the Temporary Skilled Migration Income Threshold (TSMIT) and the exemption from the requirement to demonstrate equivalent terms and conditions of employment (market salary rates).\n\nThe instrument below lists the dollar amounts for the Temporary Skilled Migration Income Threshold (TSMIT) and the exemption from the requirement to demonstrate equivalent terms and conditions of employment (market salary rates).\n\nSee:IMMI 13/028: Temporary Skilled Migration Income Threshold (TSMIT) and market rates exemption level.\n\nSee:\nIMMI 13/028: Temporary Skilled Migration Income Threshold (TSMIT) and market rates exemption level\n.\n\nThe instrument below specifies the method for determining the terms and conditions of employment (market salary rates) where there is no equivalent Australian worker in that location.\n\nThe instrument below specifies the method for determining the terms and conditions of employment (market salary rates) where there is no equivalent Australian worker in that location.\n\nSee:IMMI 09/113: Specification of method to determine terms and conditions of employment.\n\nSee:\nIMMI 09/113: Specification of method to determine terms and conditions of employment\n.\n\n#### Exemption from the requirement to work directly for the sponsor\n\nExemption from the requirement to work directly for the sponsor\nDetails\n\nThe instrument below lists the occupations where the requirement to work directly for the sponsor is waived.\n\nThe instrument below lists the occupations where the requirement to work directly for the sponsor is waived.\n\nSee:IMMI 13/067: Specification of Occupations for Nominations in Relation to Subclass 457 for Positions other than in the Business of the Nominator.\n\nSee:\nIMMI 13/067: Specification of Occupations for Nominations in Relation to Subclass 457 for Positions other than in the Business of the Nominator\n.\n\nLabour market testing\n\nLabour market testing\n\nThe instrument below specifies the period in which labour market testing must be undertaken.\n\nThe instrument below specifies the period in which labour market testing must be undertaken.\n\nSee:IMMI 13/136: Specified period in which labour market testing must be undertaken.\n\nSee:\nIMMI 13/136: Specified period in which labour market testing must be undertaken\n.\n\nThe instrument below specifies the occupations which are exempt from labour market testing.\n\nThe instrument below specifies the occupations which are exempt from labour market testing.\n\nSee:IMMI 13/137: Specification of occupations exempt from labour market testing.\n\nSee:\nIMMI 13/137: Specification of occupations exempt from labour market testing\n.\n\nThe instrument below lists the international trade obligations which are inconsistent with the labour market testing requirement (i.e. where labour market testing is not required).\n\nThe instrument below lists the international trade obligations which are inconsistent with the labour market testing requirement (i.e. where labour market testing is not required).\n\nSee:IMMI 17/109: Determination of International Trade Obligations relating to Labour Market Testing.\n\nSee:\nIMMI 17/109: Determination of International Trade Obligations relating to Labour Market Testing\n.\n\n## Visa applicants\n\nVisa applicants\n\nThis visa is now closed to new applications\n\nThis visa is now closed to new applications\nDetails\n\n### Inclu​ding family in your application\n\nInclu​ding family in your application\nDetails\n\nThey must also be able to show they have the same levels of financial support as you.\n\nThey must also be able to show they have the same levels of financial support as you.\n\nYour sponsor must agree in writing to include them as secondary sponsored persons. They can do this by including the details of your family members in the nomination application, or by providing this information in a letter to be attached to your visa application.\n\nYour sponsor must agree in writing to include them as secondary sponsored persons. They can do this by including the details of your family members in the nomination application, or by providing this information in a letter to be attached to your visa application.\n\n### After you have applied\n\nAfter you have applied\n\nYou can track and manage your application usingImmiAccount.\n\nYou can track and manage your application using\nImmiAccount\n.\n\n### Provide more information\n\nProvide more information\nDetails\n\nYou can provide more information to us at any time until a decision is made on the application. If you want to correct information you provided, use:\n\nYou can provide more information to us at any time until a decision is made on the application. If you want to correct information you provided, use:\n- Form 1023 — Notification of incorrect answer(s) (168KB PDF)\nForm 1023 — Notification of incorrect answer(s) (168KB PDF)\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nWe could also ask you for more information. You will have to respond by a set date. After that date, we can make a decision about your application using the information that we have.\n\nYou can provide additional information, including Form 1023, usingImmiAccount.\n\nYou can provide additional information, including Form 1023, using\nImmiAccount\n.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nIf another person gives us information that could result in you being refused a visa, we will usually give you the opportunity to comment on the information.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nYou might also be interviewed. If you are asked to attend an interview in person, bring your passport or other identification and any requested documents to the interview.\n\nTo help us locate your application quickly, include the following with any information you give us:\n\nTo help us locate your application quickly, include the following with any information you give us:\n- your name and date of birth\nyour name and date of birth\n- the transaction reference number we gave you when you lodged your application.\nthe transaction reference number we gave you when you lodged your application.\n\nReportchanges in your situation​. See more information if you arewithdrawing your application.\n\nReport\nchanges in your situation​\n. See more information if you are\nwithdrawing your application\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis visa can be valid for up to:\n\nThis visa can be valid for up to:\n- four years after it is granted – if your occupation is listed on the MLTSSL.\nfour years after it is granted – if your occupation is listed on the MLTSSL.\n- two years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL.\ntwo years after it is granted – if your occupation is on the list of eligible skilled occupations but is not listed on the MLTSSL.\n\nYou will need to check the letter you received from us when your visa was granted to confirm the date your visa expires. If you no longer have this letter, you can accessVEVOinstead.\n\nYou will need to check the letter you received from us when your visa was granted to confirm the date your visa expires. If you no longer have this letter, you can access\nVEVO\ninstead.\n\nIf your sponsor is a start-up business or has traded in Australia for less than 12 months, then the visa will be granted for 18 months.\n\nIf your sponsor is a start-up business or has traded in Australia for less than 12 months, then the visa will be granted for 18 months.\n\nNote: Subclass 457 visas granted under a Labour Agreement will be granted for 4 years unless the agreement specifies a shorter period.\n\nNote: Subclass 457 visas granted under a Labour Agreement will be granted for 4 years unless the agreement specifies a shorter period.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to:\n\nThis visa allows you to:\n- work in Australia for an approved sponsor for the life of your visa\nwork in Australia for an approved sponsor for the life of your visa\n- bring your family to work or study in Australia\nbring your family to work or study in Australia\n- travel in and out of Australia as often as you want.\ntravel in and out of Australia as often as you want.\n\n### Your obligations\n\nYour obligations\nDetails\n\nIf you are granted a subclass 457 visa, there are certain conditions that apply to you depending on whether you are the primary or a secondary visa holder. You must comply with the visa condition or conditions that apply to you. Failure to do so might result in your visa being cancelled.\n\nIf you are granted a subclass 457 visa, there are certain conditions that apply to you depending on whether you are the primary or a secondary visa holder. You must comply with the visa condition or conditions that apply to you. Failure to do so might result in your visa being cancelled.\n\n#### Mandatory visa conditions\n\nMandatory visa conditions\nDetails\n\nMandatory Condition 8107\n\nMandatory Condition 8107\n\nThese conditions apply to all primary subclass 457 visa holders. You must:\n\nThese conditions apply to all primary subclass 457 visa holders. You must:\n- only work in your nominated occupation\nonly work in your nominated occupation\n- only work for the sponsor who nominated the position you are working in, (if your sponsor is a standard business sponsor and is an Australian business, you can also work for an associated entity of the sponsor).\nonly work for the sponsor who nominated the position you are working in, (if your sponsor is a standard business sponsor and is an Australian business, you can also work for an associated entity of the sponsor).\n\nIf you hold a subclass 457 visa or your last substantive visa was a subclass 457 visa and your employment with your sponsor ends, you can stop working or work outside of the above conditions for a limited time:\n\nIf you hold a subclass 457 visa or your last substantive visa was a subclass 457 visa and your employment with your sponsor ends, you can stop working or work outside of the above conditions for a limited time:\n- up to 180 days in a single period\nup to 180 days in a single period\n- up to 365 days in total across the period your visa is granted for.\nup to 365 days in total across the period your visa is granted for.\n\nThese time periods start from 1 July 2024. They do not include any earlier time periods when you stopped working under the condition in place before that date.\n\nThese time periods start from 1 July 2024. They do not include any earlier time periods when you stopped working under the condition in place before that date.\n\nYou must also:\n\nYou must also:\n- start work within 90 days of:arriving in Australia if you were outside Australia when your visa was grantedbeing granted your visa, if you were in Australia at the time your visa was granted.\nstart work within 90 days of:\n- arriving in Australia if you were outside Australia when your visa was granted\narriving in Australia if you were outside Australia when your visa was granted\n- being granted your visa, if you were in Australia at the time your visa was granted.\nbeing granted your visa, if you were in Australia at the time your visa was granted.\n- obtain any mandatory licence, registration or membership necessary to perform your occupation in Australia and comply with any provisions within 90 days:after initial arrival in Australia on this visafrom date of visa grant if already in Australia.\nobtain any mandatory licence, registration or membership necessary to perform your occupation in Australia and comply with any provisions within 90 days:\n- after initial arrival in Australia on this visa\nafter initial arrival in Australia on this visa\n- from date of visa grant if already in Australia.\nfrom date of visa grant if already in Australia.\n\nIf your visa was grantedon or after 1 December 2015you must also:\n\nIf your visa was granted\non or after 1 December 2015\nyou must also:\n- not engage in work that is inconsistent with your licence, registration or membership\nnot engage in work that is inconsistent with your licence, registration or membership\n- let us know in writing as soon as you can if your application for the licence, registration or membership is:refusedrevokedcancelled or ends.\nlet us know in writing as soon as you can if your application for the licence, registration or membership is:\n- refused\nrefused\n- revoked\nrevoked\n- cancelled or ends.\ncancelled or ends.\n\nEmail:sponsor.notifications@abf.gov.au.\n\nEmail:\nsponsor.notifications@abf.gov.au\n.\n\nYou are considered to have ceased employment when either you or your employer notifies us of the date you stopped work.\n\nYou are considered to have ceased employment when either you or your employer notifies us of the date you stopped work.\n\nIf you stop working for your sponsor, you have up to 180 days to:\n\nIf you stop working for your sponsor, you have up to 180 days to:\n- find another employer to sponsor you and have them lodge a new nomination\nfind another employer to sponsor you and have them lodge a new nomination\n- be granted a different visa\nbe granted a different visa\n- depart Australia.\ndepart Australia.\n\nIf more than 180 consecutive days have passed since the date your sponsor advised us you would be ceasing employment on, you could be in breach of Condition 8107 and your visa could be cancelled.\n\nIf more than 180 consecutive days have passed since the date your sponsor advised us you would be ceasing employment on, you could be in breach of Condition 8107 and your visa could be cancelled.\n\nIf you abandon your employment, or are absent without leave, you could be considered to have ceased employment.\n\nIf you abandon your employment, or are absent without leave, you could be considered to have ceased employment.\n\nIf your visa is about to expire and you want to keep working in Australia, you must apply for another visa.\n\nIf your visa is about to expire and you want to keep working in Australia, you must apply for another visa.\n\nIf you want to change your employer and/or nominated occupation while you still hold a valid 457 visa you do not need to apply for a new subclass 457 visa. Your sponsor, new or existing, must lodge a new nomination and this must be approved before you commence working for the new sponsor or in the new nominated position.\n\nIf you want to change your employer and/or nominated occupation while you still hold a valid 457 visa you do not need to apply for a new subclass 457 visa. Your sponsor, new or existing, must lodge a new nomination and this must be approved before you commence working for the new sponsor or in the new nominated position.\n\nMedical practitioners and general managers\n\nMedical practitioners and general managers\n\nMedical practitioners and general managers must work in their nominated occupation but they can work for employers other than their sponsor or an associated entity of their sponsor.\n\nMedical practitioners and general managers must work in their nominated occupation but they can work for employers other than their sponsor or an associated entity of their sponsor.\n\nThe specific occupations that this applies to are listed inExemption from the requirement to work directly for the sponsor.\n\nThe specific occupations that this applies to are listed in\nExemption from the requirement to work directly for the sponsor\n.\n\n#### Other visa conditions\n\nOther visa conditions\nDetails\n\nCondition 8501 is mandatory on all primary and secondary visas. You may also have additional conditions imposed on your subclass 457 visa, including: 8502, 8516, 8522, 8525 and 8526.\n\nCondition 8501 is mandatory on all primary and secondary visas. You may also have additional conditions imposed on your subclass 457 visa, including: 8502, 8516, 8522, 8525 and 8526.\n\nFor information on any conditions imposed on your visa, please check the letter you received from us when your visa was granted. If you no longer have this letter, you can accessVEVOinstead.\n\nFor information on any conditions imposed on your visa, please check the letter you received from us when your visa was granted. If you no longer have this letter, you can access\nVEVO\ninstead.\n\n#### Report changes\n\nReport changes\nDetails\n\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, a pregnancy, birth or death or any changes in the composition of your family.\n\nYou must tell us if your circumstances change. This includes a new residential address, a new passport, a pregnancy, birth or death or any changes in the composition of your family.\n\nYou can use the following forms:\n\nYou can use the following forms:\n- Form 929 Change of address and/or passport details (193KB PDF)— if you move to a new address or change your passport\nForm 929 Change of address and/or passport details (193KB PDF)\n— if you move to a new address or change your passport\n- Form 1022 Notification of changes in circumstances  (172KB PDF)— if there are other changes in your circumstances.\nForm 1022 Notification of changes in circumstances  (172KB PDF)\n— if there are other changes in your circumstances.\n\nYou might be able to update your address and passport details usingImmiAccount.\n\nYou might be able to update your address and passport details using\nImmiAccount\n.\n\n#### Children born in Australia\n\nChildren born in Australia\nDetails\n\nIf your child is born in Australia while you hold a 457 visa, you must notify us in writing. Your child will then hold a subclass 457 visa.\n\nIf your child is born in Australia while you hold a 457 visa, you must notify us in writing. Your child will then hold a subclass 457 visa.\n\nYou must provide a copy of your child’s Australian birth certificate and the personal details page of their passport. This is particularly important if you are intending to travel outside Australia after the birth of your child.\n\nYou must provide a copy of your child’s Australian birth certificate and the personal details page of their passport. This is particularly important if you are intending to travel outside Australia after the birth of your child.\n\nYou must email this information toESPD@homeaffairs.gov.au. General enquiries submitted to this email address will not be responded to.\n\nYou must email this information to\nESPD@homeaffairs.gov.au\n. General enquiries submitted to this email address will not be responded to.\n\n### After you arrive in Australia\n\nAfter you arrive in Australia\nDetails\n\n#### Changing employer or occupation\n\nChanging employer or occupation\nDetails\n\nIf you have been granted a subclass 457 visa and you want to change your employer or occupation you are not required to apply for a new visa, however before you start working for a new employer or in a new occupation, you must be nominated by your proposed new employer and have that nomination approved first.\n\nIf you have been granted a subclass 457 visa and you want to change your employer or occupation you are not required to apply for a new visa, however before you start working for a new employer or in a new occupation, you must be nominated by your proposed new employer and have that nomination approved first.\n\nThe approval of a new nomination only allows you to change your employer or occupation. It does not extend the length of your subclass 457 visa and does not change the conditions attached to it.\n\nThe approval of a new nomination only allows you to change your employer or occupation. It does not extend the length of your subclass 457 visa and does not change the conditions attached to it.\n\nIt is your responsibility to ensure that you have a valid visa to remain in Australia at all times. To check the visa conditions and expiry date of your visa, refer toVEVO.\n\nIt is your responsibility to ensure that you have a valid visa to remain in Australia at all times. To check the visa conditions and expiry date of your visa, refer to\nVEVO\n.\n\n#### Options if you have lost your job\n\nOptions if you have lost your job\n\nIf you have been laid off and are currently unemployed, you have up to 180 days to find a new employer or make arrangements to leave Australia.\n\nIf you have been laid off and are currently unemployed, you have up to 180 days to find a new employer or make arrangements to leave Australia.\n\n#### Your employment rights in Australia\n\nYour employment rights in Australia\nDetails\n\nAll employees in Australia are covered by the Fair Work Act 2009. This includes you as a subclass 457 visa holders. For more information, seeWorkplace rights for all visa holders working in Australia. ​​​​​\n\nAll employees in Australia are covered by the Fair Work Act 2009. This includes you as a subclass 457 visa holders. For more information, see\nWorkplace rights for all visa holders working in Australia\n. ​​​​​\n\n## Sponsors\n\nSponsors\nDetails\n\n### How long the sponsorship lasts\n\nHow long the sponsorship lasts\nDetails\n\nSponsorships for Australian businesses can be valid for:\n\nSponsorships for Australian businesses can be valid for:\n- 18 months — Sponsorship for start-up businesses\n18 months — Sponsorship for start-up businesses\n- 6 years —  Accredited sponsorships\n6 years —  Accredited sponsorships\n- 5 Years  — Standard business sponsorships\n5 Years  — Standard business sponsorships\n- the length of the labour agreement — Labour agreement\nthe length of the labour agreement — Labour agreement\n\nSponsorships for Overseas businesses can be valid for:\n\nSponsorships for Overseas businesses can be valid for:\n- 18 months — Overseas business seeking to establish a business in Australia\n18 months — Overseas business seeking to establish a business in Australia\n- 5 years — Overseas businesses who have a contractual obligation\n5 years — Overseas businesses who have a contractual obligation\n\nAs of 3 March 2018, all sponsorships approved will be valid for five years.\n\nAs of 3 March 2018, all sponsorships approved will be valid for five years.\n\nIf you have a labour agreement in place, you are an approved sponsor for the term of the agreement.\n\nIf you have a labour agreement in place, you are an approved sponsor for the term of the agreement.\n\n### Report changes in your circumstances\n\nReport changes in your circumstances\nDetails\n\nYou must tell us if your circumstances change. Use the following forms:\n\nYou must tell us if your circumstances change. Use the following forms:\n- Form 929 Change of address and/or passport details (170KB PDF) (193KB PDF)— if you move to a new address or change your passport\nForm 929 Change of address and/or passport details (170KB PDF) (193KB PDF)\n— if you move to a new address or change your passport\n- Form 1022 Notification of changes in circumstances (150KB PDF) (172KB PDF)— if there are other changes in your circumstances.\nForm 1022 Notification of changes in circumstances (150KB PDF) (172KB PDF)\n— if there are other changes in your circumstances.\n\nYou might be able to update your address details usingImmiAccount.\n\nYou might be able to update your address details using\nImmiAccount\n.\n\nThe types of changes that must be notified are:\n\nThe types of changes that must be notified are:\n- a change to your business trading name, your ABN, or other business details\na change to your business trading name, your ABN, or other business details\n- a change to your contact or address details\na change to your contact or address details\n- corrections to information you provided in your application.\ncorrections to information you provided in your application.\n\nChanging your business structure\n\nChanging your business structure\n- Businesses sometimes decide to change their structure and this can have implications if your business sponsors 457 visa holders. If a change in your business structure results in a new legal entity being created (for example, a sole trader commences operating as a company) then the new entity will need to apply to become a standard business sponsor and new nominations will be required for each of your 457 visa holders. If you do not do this you could be breaching your sponsorship obligations and your workers will not be complying with their visa conditions which might result in their visa being cancelled.\nBusinesses sometimes decide to change their structure and this can have implications if your business sponsors 457 visa holders. If a change in your business structure results in a new legal entity being created (for example, a sole trader commences operating as a company) then the new entity will need to apply to become a standard business sponsor and new nominations will be required for each of your 457 visa holders. If you do not do this you could be breaching your sponsorship obligations and your workers will not be complying with their visa conditions which might result in their visa being cancelled.\n- Changing your business structure could also have implications for you and your 457 visa holder if you want to sponsor them for a permanent visa in the future. You should read theEmployer Nomination Schemepages for more information\nChanging your business structure could also have implications for you and your 457 visa holder if you want to sponsor them for a permanent visa in the future. You should read the\nEmployer Nomination Scheme\npages for more information\n\n### Sponsor obligations, monitoring and sanctions\n\nSponsor obligations, monitoring and sanctions\nDetails\n\n#### Sponsor Obligations\n\nSponsor Obligations\nDetails\n\nSponsorship obligations apply to all sponsors of subclass 457 visa holders. They are in place to ensure that overseas skilled workers are protected from exploitation, and that the subclass 457 visa programme is being used to meet genuine skills shortages, and not to undercut local labour wages and conditions.Some obligations apply beyond the term of sponsorship approval.\n\nSponsorship obligations apply to all sponsors of subclass 457 visa holders. They are in place to ensure that overseas skilled workers are protected from exploitation, and that the subclass 457 visa programme is being used to meet genuine skills shortages, and not to undercut local labour wages and conditions.\nSome obligations apply beyond the term of sponsorship approval.\n\nAs a sponsor you must:\n\nAs a sponsor you must:\n- cooperate with inspectors\ncooperate with inspectors\n- ensure equivalent terms and conditions of employment\nensure equivalent terms and conditions of employment\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- tell us when certain events occur\ntell us when certain events occur\n- ensure the visa holder participates in the nominated occupation, program or activity\nensure the visa holder participates in the nominated occupation, program or activity\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- pay travel costs to enable sponsored people to leave Australia\npay travel costs to enable sponsored people to leave Australia\n- pay costs to remove unlawful non-citizens\npay costs to remove unlawful non-citizens\n- provide training to Australians and permanent residents\nprovide training to Australians and permanent residents\n- not engage in discriminatory recruitment practices.\nnot engage in discriminatory recruitment practices.\n\n#### Cooperate with inspectors\n\nCooperate with inspectors\n\nYou must cooperate with inspectors appointed under theMigration Act 1958(the Act) who are investigating whether:\n\nYou must cooperate with inspectors appointed under the\nMigration Act 1958\n(the Act) who are investigating whether:\n- a sponsorship obligation is being, or has been, complied with\na sponsorship obligation is being, or has been, complied with\n- you have hired an illegal worker\nyou have hired an illegal worker\n- there are other circumstances in which we could take administrative action.\nthere are other circumstances in which we could take administrative action.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or work agreement commences\nstarts on the day the sponsorship is approved or work agreement commences\n- ends five years after the day the approved sponsorship ends or work agreement ceases.\nends five years after the day the approved sponsorship ends or work agreement ceases.\n\n#### Cooperating with inspectors can include (but is not limited to):\n\nCooperating with inspectors can include (but is not limited to):\n- providing access to premises\nproviding access to premises\n- producing and providing documents within the requested timeframe\nproducing and providing documents within the requested timeframe\n- not preventing or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\nnot preventing or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\n- providing officers with access to interview any person on their premises.\nproviding officers with access to interview any person on their premises.\n\n#### Ensure equivalent terms and conditions of employment\n\nEnsure equivalent terms and conditions of employment\n\nIf you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than those you provide, or would provide to an Australian performing equivalent work in the same location. Further, if you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than the terms and conditions you advised you would be providing to the sponsored person at the time of the nomination.This obligation does not apply to a sponsor if the annual earnings of their sponsored visa holder are equal to, or greater than AUD250,000.If you sponsor someone under a work agreement, you must ensure that the people you sponsor are paid the amount specified in the work agreement.This obligation starts on the day (whichever is the earliest):\n\nIf you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than those you provide, or would provide to an Australian performing equivalent work in the same location. Further, if you are a standard business sponsor, the terms and conditions of employment for the person you have sponsored must be no less favourable than the terms and conditions you advised you would be providing to the sponsored person at the time of the nomination.\nThis obligation does not apply to a sponsor if the annual earnings of their sponsored visa holder are equal to, or greater than AUD250,000.\nIf you sponsor someone under a work agreement, you must ensure that the people you sponsor are paid the amount specified in the work agreement.\nThis obligation starts on the day (whichever is the earliest):\n- the person you have sponsored is granted a subclass 457 visa\nthe person you have sponsored is granted a subclass 457 visa\n- your nomination is approved (if they already hold a subclass 457 visa when your nomination was approved)\nyour nomination is approved (if they already hold a subclass 457 visa when your nomination was approved)\n\nThis obligation ends either:\n\nThis obligation ends either:\n- on the day the sponsored visa holder stops working for you, or\non the day the sponsored visa holder stops working for you, or\n- on the day they are granted a further visa other than another subclass 457 visa, or a bridging visa, a criminal justice visa, or an enforcement visa.\non the day they are granted a further visa other than another subclass 457 visa, or a bridging visa, a criminal justice visa, or an enforcement visa.\n\nIf the sponsored visa holder is granted another subclass 457 visa to continue to work for you, this obligation continues.\n\nIf the sponsored visa holder is granted another subclass 457 visa to continue to work for you, this obligation continues.\n\n#### Keep records\n\nKeep records\n\nYou must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following:\n\nYou must keep records that show your compliance with your sponsorship obligations. All of the records must be kept in a reproducible format and some must be capable of verification by an independent person. Records that must be kept, in addition to records that must be kept under other Australian Government, and state or territory laws, include the following:\n- written requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received\nwritten requests for payment of outward travel costs for a sponsored visa holder or their family, including when the request was received\n- how the outward travel costs were paid for a sponsored visa holder or their family, how much was paid, for whom they were paid, and when they were paid\nhow the outward travel costs were paid for a sponsored visa holder or their family, how much was paid, for whom they were paid, and when they were paid\n- notifying us of an event required to be reported to us, including the date and method of notification and where the notification was provided\nnotifying us of an event required to be reported to us, including the date and method of notification and where the notification was provided\n- tasks performed by the sponsored visa holder in relation to the nominated occupation and where the tasks were performed\ntasks performed by the sponsored visa holder in relation to the nominated occupation and where the tasks were performed\n- money paid to the sponsored visa holder (unless the sponsored visa holder earns over AUD250,000)\nmoney paid to the sponsored visa holder (unless the sponsored visa holder earns over AUD250,000)\n- money applied or dealt with in any way on behalf of the sponsored visa holder or as the sponsored visa holder directed (unless the sponsored visa holder earns over AUD250,000)\nmoney applied or dealt with in any way on behalf of the sponsored visa holder or as the sponsored visa holder directed (unless the sponsored visa holder earns over AUD250,000)\n- non-monetary benefits provided to the sponsored visa holder , including the agreed value and the time at which, or the period over which, those benefits were provided (unless the sponsored visa holder earns over AUD250,000)\nnon-monetary benefits provided to the sponsored visa holder , including the agreed value and the time at which, or the period over which, those benefits were provided (unless the sponsored visa holder earns over AUD250,000)\n- if there is an equivalent worker in your workplace, a record of the terms and conditions that apply to the equivalent worker, including the period over which the terms and conditions applied (unless the sponsored visa holder earns over AUD250,000)\nif there is an equivalent worker in your workplace, a record of the terms and conditions that apply to the equivalent worker, including the period over which the terms and conditions applied (unless the sponsored visa holder earns over AUD250,000)\n- the written contract of employment each sponsored visa holder is engaged under\nthe written contract of employment each sponsored visa holder is engaged under\n- if you were lawfully operating a business in Australian at the time of your approval as a standard business sponsor or variation of the terms of your approval as a standard business sponsor—how you are complying with the training obligation\nif you were lawfully operating a business in Australian at the time of your approval as a standard business sponsor or variation of the terms of your approval as a standard business sponsor—how you are complying with the training obligation\n- if you are a party to a work agreement, the records required to be kept under the work agreement.\nif you are a party to a work agreement, the records required to be kept under the work agreement.\n\nThe obligation starts the day the sponsorship is approved or work agreement begins.\n\nThe obligation starts the day the sponsorship is approved or work agreement begins.\n\nThis obligation ends two years after both of the following:\n\nThis obligation ends two years after both of the following:\n- your sponsorship or the work agreement ceases\nyour sponsorship or the work agreement ceases\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\n#### Provide records and information to the Minister\n\nProvide records and information to the Minister\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n- a sponsorship obligation is being or has been complied with, and\na sponsorship obligation is being or has been complied with, and\n- determining whether other circumstances, in which the Minister might take administrative action, exist or have existed,in the manner and timeframe requested by us.\ndetermining whether other circumstances, in which the Minister might take administrative action, exist or have existed,\nin the manner and timeframe requested by us.\n\nWe might ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of Subclass 457 visa holders. You must provide the records or information requested if it is a record or information that:\n\nWe might ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of Subclass 457 visa holders. You must provide the records or information requested if it is a record or information that:\n- you are required to keep under Commonwealth, state or territory law\nyou are required to keep under Commonwealth, state or territory law\n- you have an obligation to keep as a sponsor.\nyou have an obligation to keep as a sponsor.\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.This obligation ends two years after:\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.\nThis obligation ends two years after:\n- your sponsorship or work agreement ceases\nyour sponsorship or work agreement ceases\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\n#### Tell us when certain events occur\n\nTell us when certain events occur\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.Examples of events include (but are not limited to):\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\nExamples of events include (but are not limited to):\n- a change to your address or contact details\na change to your address or contact details\n- the end or expected ending of a primary sponsored visa holder’s employment, program or activity\nthe end or expected ending of a primary sponsored visa holder’s employment, program or activity\n- a change to the duties carried out by the primary sponsored visa holder.\na change to the duties carried out by the primary sponsored visa holder.\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.This obligation ends two years after:\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.\nThis obligation ends two years after:\n- your sponsorship or the work agreement ends, and\nyour sponsorship or the work agreement ends, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nChanges or events that all sponsors must notify within 28 calendar days\n\nChanges or events that all sponsors must notify within 28 calendar days\n\nYou must notify us within 28 calendar days if:\n\nYou must notify us within 28 calendar days if:\n- the sponsored visa holder’s employment ends, or is expected to end(the sponsor must tell us if the end date changes)\nthe sponsored visa holder’s employment ends, or is expected to end(the sponsor must tell us if the end date changes)\n- there are changes to the work duties carried out by the sponsored visa holder\nthere are changes to the work duties carried out by the sponsored visa holder\n- you are a standard business sponsor and there is a change to the information in the sponsorship application or the application to vary a term of sponsorship approval relating to the training requirement and the sponsor’s address and contact details\nyou are a standard business sponsor and there is a change to the information in the sponsorship application or the application to vary a term of sponsorship approval relating to the training requirement and the sponsor’s address and contact details\n- if you are a party to a work agreement and there is a change to the address and contact details or the training information provided in the work agreement\nif you are a party to a work agreement and there is a change to the address and contact details or the training information provided in the work agreement\n- you have paid the return travel costs of a sponsored visa holder or any of their family members in accordance with the obligation to pay return travel costs\nyou have paid the return travel costs of a sponsored visa holder or any of their family members in accordance with the obligation to pay return travel costs\n- you have become insolvent within the meaning of subsections 5 (2) and (3) of theBankruptcy Act 1966and section 95A of theCorporations Act 2001\nyou have become insolvent within the meaning of subsections 5 (2) and (3) of the\nBankruptcy Act 1966\nand section 95A of the\nCorporations Act 2001\n- your business ceases to exist as a legal entity.\nyour business ceases to exist as a legal entity.\n\nIf your business is a company\n\nIf your business is a company\n\nA company must also notify us of the following changes or events within 28 calendar days if:\n\nA company must also notify us of the following changes or events within 28 calendar days if:\n- a new director is appointed\na new director is appointed\n- an administrator is appointed for the company under Part 5.3A of theCorporations Act 2001the company resolves by special resolution to be wound up voluntarily under subsection 491(1) of theCorporations Act 2001a court has ordered that the company be wound up in insolvency under Part 5.4, or on other grounds under Part 5.4A, of theCorporations Act 2001a court has appointed an official liquidator to be the provisional liquidator of the company under Part 5.4B of theCorporations Act 2001a court has approved a compromise or arrangement proposed by the company under Part 5.1 of theCorporations Act 2001the property of the company becomes subject to a receiver or other controller under Part 5.2 of theCorporations Act 2001procedures are initiated for the deregistration of the company under Part 5A.1 of theCorporations Act 2001.\nan administrator is appointed for the company under Part 5.3A of the\nCorporations Act 2001\n- the company resolves by special resolution to be wound up voluntarily under subsection 491(1) of theCorporations Act 2001\nthe company resolves by special resolution to be wound up voluntarily under subsection 491(1) of the\nCorporations Act 2001\n- a court has ordered that the company be wound up in insolvency under Part 5.4, or on other grounds under Part 5.4A, of theCorporations Act 2001\na court has ordered that the company be wound up in insolvency under Part 5.4, or on other grounds under Part 5.4A, of the\nCorporations Act 2001\n- a court has appointed an official liquidator to be the provisional liquidator of the company under Part 5.4B of theCorporations Act 2001\na court has appointed an official liquidator to be the provisional liquidator of the company under Part 5.4B of the\nCorporations Act 2001\n- a court has approved a compromise or arrangement proposed by the company under Part 5.1 of theCorporations Act 2001\na court has approved a compromise or arrangement proposed by the company under Part 5.1 of the\nCorporations Act 2001\n- the property of the company becomes subject to a receiver or other controller under Part 5.2 of theCorporations Act 2001\nthe property of the company becomes subject to a receiver or other controller under Part 5.2 of the\nCorporations Act 2001\n- procedures are initiated for the deregistration of the company under Part 5A.1 of theCorporations Act 2001.\nprocedures are initiated for the deregistration of the company under Part 5A.1 of the\nCorporations Act 2001\n.\n\nIf you are an individual\n\nIf you are an individual\n\nIf you operate your business as an individual, you must also notify us of the following changes or events within 28 calendar days:\n\nIf you operate your business as an individual, you must also notify us of the following changes or events within 28 calendar days:\n- you enter into a personal insolvency agreement under Part X of theBankruptcy Act 1966\nyou enter into a personal insolvency agreement under Part X of the\nBankruptcy Act 1966\n- you enter into a debt agreement under Part IX of theBankruptcy Act 1966\nyou enter into a debt agreement under Part IX of the\nBankruptcy Act 1966\n- a sequestration order is made against your estate under Part IV of theBankruptcy Act 1966\na sequestration order is made against your estate under Part IV of the\nBankruptcy Act 1966\n- you become a bankrupt by virtue of the presentation of a debtor’s petition under Part IV of theBankruptcy Act 1966\nyou become a bankrupt by virtue of the presentation of a debtor’s petition under Part IV of the\nBankruptcy Act 1966\n- you present a declaration of intention to present a debtor’s petition under Part IV of theBankruptcy Act 1966\nyou present a declaration of intention to present a debtor’s petition under Part IV of the\nBankruptcy Act 1966\n- a composition or scheme of arrangement is presented in relation to you in accordance with Division 6 of Part IV of theBankruptcy Act 1966.\na composition or scheme of arrangement is presented in relation to you in accordance with Division 6 of Part IV of the\nBankruptcy Act 1966.\n\nIf your business is a partnership\n\nIf your business is a partnership\n\nYou must also notify us of the following changes or events within 28 calendar days:\n\nYou must also notify us of the following changes or events within 28 calendar days:\n- a new partner joins the partnership\na new partner joins the partnership\n- any of the events listed for an individual or a company occurs.\nany of the events listed for an individual or a company occurs.\n\nIf your business is an unincorporated association\n\nIf your business is an unincorporated association\n\nAn unincorporated association must also notify us within 28 calendar days if:\n\nAn unincorporated association must also notify us within 28 calendar days if:\n- a new member is appointed to the managing committee of the association\na new member is appointed to the managing committee of the association\n- any of the events listed for an individual or a company occurs.\nany of the events listed for an individual or a company occurs.\n\nWhere to send a notice of an event or change\n\nWhere to send a notice of an event or change\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nBy email(preferred):sponsor.notifications@abf.gov.auBy registered post:\n\nBy email\n(preferred):\nsponsor.notifications@abf.gov.au\nBy registered post:\n- Australian Capital TerritorySponsor MonitoringGPO Box 717Canberra ACT 2601\nAustralian Capital Territory\nSponsor Monitoring\nGPO Box 717\nCanberra ACT 2601\n- New South WalesSponsor MonitoringGPO Box 9984Sydney NSW 2001\nNew South Wales\nSponsor Monitoring\nGPO Box 9984\nSydney NSW 2001\n- QueenslandSponsor MonitoringGPO Box 9984Brisbane Qld 4001\nQueensland\nSponsor Monitoring\nGPO Box 9984\nBrisbane Qld 4001\n- Northern TerritorySponsor MonitoringGPO Box 864Darwin NT 0801\nNorthern Territory\nSponsor Monitoring\nGPO Box 864\nDarwin NT 0801\n- South AustraliaSponsor MonitoringGPO Box 2399Adelaide SA 5001\nSouth Australia\nSponsor Monitoring\nGPO Box 2399\nAdelaide SA 5001\n- TasmaniaSponsor MonitoringGPO Box 794Hobart Tas. 7001\nTasmania\nSponsor Monitoring\nGPO Box 794\nHobart Tas. 7001\n- VictoriaSponsor MonitoringGPO Box 241Melbourne Vic. 3001\nVictoria\nSponsor Monitoring\nGPO Box 241\nMelbourne Vic. 3001\n- Western AustraliaSponsor MonitoringLocked Bag 7Northbridge WA 6865\nWestern Australia\nSponsor Monitoring\nLocked Bag 7\nNorthbridge WA 6865\n\n#### Ensure that the visa holder participates in the nominated occupation, program or activity\n\nEnsure that the visa holder participates in the nominated occupation, program or activity\n\nYou must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved.This obligation ends on the day (whichever is the earliest):\n\nYou must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved.\nThis obligation ends on the day (whichever is the earliest):\n- the sponsored visa holder has a nomination approved for another approved sponsor\nthe sponsored visa holder has a nomination approved for another approved sponsor\n- the sponsored visa holder is granted another substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa\nthe sponsored visa holder is granted another substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa\n- the sponsored visa holder has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe sponsored visa holder has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\nIf you are a standard business sponsor, you must employ the person you have sponsored under a written contract of employment. They cannot work for another business, and you cannot supply them to another business. If you were lawfully operating a business in Australia at the time you were approved as a standard business sponsor, the person might work for an associated entity.You cannot engage in activities related to the recruitment or hire of the sponsored visa holder to another business unless it is an associated entity and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time the terms of your approval were last varied).\n\nIf you are a standard business sponsor, you must employ the person you have sponsored under a written contract of employment. They cannot work for another business, and you cannot supply them to another business. If you were lawfully operating a business in Australia at the time you were approved as a standard business sponsor, the person might work for an associated entity.\nYou cannot engage in activities related to the recruitment or hire of the sponsored visa holder to another business unless it is an associated entity and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time the terms of your approval were last varied).\n\nThe only exception to this rule is if the sponsored visa holder’s occupation is an exempt occupation for the purposes of this obligation.The obligation ends on the day the sponsored visa holder is granted another substantive visa of a different subclass from the one they last held. The obligation continues if the sponsored visa holder is granted another subclass 457 visa to continue to work for you.\n\nThe only exception to this rule is if the sponsored visa holder’s occupation is an exempt occupation for the purposes of this obligation.\nThe obligation ends on the day the sponsored visa holder is granted another substantive visa of a different subclass from the one they last held. The obligation continues if the sponsored visa holder is granted another subclass 457 visa to continue to work for you.\n\n#### Not recover, transfer or charge certain costs to another person\n\nNot recover, transfer or charge certain costs to another person\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n- the recruitment of the person you sponsored\nthe recruitment of the person you sponsored\n- becoming or being a sponsor or former approved sponsor.\nbecoming or being a sponsor or former approved sponsor.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or the work agreement commences\nstarts on the day the sponsorship is approved or the work agreement commences\n- ends on the following two events:you cease to be an approved sponsor or party to a work agreementyou no longer have a sponsored visa holder.\nends on the following two events:\n- you cease to be an approved sponsor or party to a work agreement\nyou cease to be an approved sponsor or party to a work agreement\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n- cost of sponsorship and nomination charges\ncost of sponsorship and nomination charges\n- migration agent costs associated with the lodgement of sponsorship and nomination applications\nmigration agent costs associated with the lodgement of sponsorship and nomination applications\n- administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:recruitment agent feesmigration agent feesthe cost of job advertisingscreening of candidates, short listing, interviews and reference checkssalaries of recruitment or human resource staffthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the positiontraining of new staffresponding to queries for prospective candidates, and advising unsuccessful applicantstravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\nadministrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:\n- recruitment agent fees\nrecruitment agent fees\n- migration agent fees\nmigration agent fees\n- the cost of job advertising\nthe cost of job advertising\n- screening of candidates, short listing, interviews and reference checks\nscreening of candidates, short listing, interviews and reference checks\n- salaries of recruitment or human resource staff\nsalaries of recruitment or human resource staff\n- the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\nthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\n- training of new staff\ntraining of new staff\n- responding to queries for prospective candidates, and advising unsuccessful applicants\nresponding to queries for prospective candidates, and advising unsuccessful applicants\n- travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\ntravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\n\n#### Pay travel costs to enable sponsored people to leave Australia\n\nPay travel costs to enable sponsored people to leave Australia\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request on their behalf.The costs will be considered reasonable and necessary if they include all of the following:\n\nYou must pay reasonable and necessary travel costs to enable the sponsored person and their sponsored family members to leave Australia. They must ask you in writing for you to pay the costs. We can also make a written request on their behalf.\nThe costs will be considered reasonable and necessary if they include all of the following:\n- travel from the sponsored persons usual place of residence in Australia to their place of departure from Australia\ntravel from the sponsored persons usual place of residence in Australia to their place of departure from Australia\n- travel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to\ntravel from Australia to the country (for which the sponsored visa holder holds a passport) and intends to travel to\n- economy class air travel or, where that is not available, a reasonable equivalent.\neconomy class air travel or, where that is not available, a reasonable equivalent.\n\nTravel costs must be paid within 30 days of receiving the request.You will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again.\n\nTravel costs must be paid within 30 days of receiving the request.\nYou will only be required to pay return travel costs once. If a sponsored person returns to Australia (whilst holding the visa for which you sponsored them) after you have paid their return travel costs, you will not be required to pay their return travel costs again.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- the visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved , or\nthe visa is granted (if the sponsored person did not already hold a visa when your nomination of them was approved , or\n- your nomination is approved (if the person already held a visa in this subclass when your nomination is approved).\nyour nomination is approved (if the person already held a visa in this subclass when your nomination is approved).\n\nThis obligation ends on the day (whichever is the earliest):\n\nThis obligation ends on the day (whichever is the earliest):\n- another sponsor has their nomination application for the sponsored person approved\nanother sponsor has their nomination application for the sponsored person approved\n- the person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa the person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe person you sponsored is granted another visa other than a subclass 457 visa, a bridging visa, a criminal justice visa, or an enforcement visa the person you sponsored has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Pay costs to locate and remove an unlawful non-citizen\n\nPay costs to locate and remove an unlawful non-citizen\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you might be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you might be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nYou might be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10,000) less any amount which might have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nYou might be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10,000) less any amount which might have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that we might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that we might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\n#### Provide training to Australians and permanent residents\n\nProvide training to Australians and permanent residents\n\nIf you are a standard business sponsor and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time you had your terms of approval varied). You must contribute to the training of Australians by either:\n\nIf you are a standard business sponsor and you lawfully operated a business in Australia at the time you were approved as a standard business sponsor (or at the time you had your terms of approval varied). You must contribute to the training of Australians by either:\n- spending an equivalent of at least two per cent of your payroll in payments to an industry training fund that operates in the same or related industry as you\nspending an equivalent of at least two per cent of your payroll in payments to an industry training fund that operates in the same or related industry as you\n- spending an equivalent to at least one per cent of your payroll in the provision of training to employees of your business who are Australian citizens or Australian permanent residents.\nspending an equivalent to at least one per cent of your payroll in the provision of training to employees of your business who are Australian citizens or Australian permanent residents.\n\nThe obligation begins on the day you are approved as a sponsor. You must meet this obligation in each 12 month period within which you employ a sponsored visa holder (including if the sponsored visa holder is not employed by you for the full twelve months). Where your approval as a standard business sponsor is varied, you must meet the training requirement if you employ one or more primary sponsored persons.\n\nThe obligation begins on the day you are approved as a sponsor. You must meet this obligation in each 12 month period within which you employ a sponsored visa holder (including if the sponsored visa holder is not employed by you for the full twelve months). Where your approval as a standard business sponsor is varied, you must meet the training requirement if you employ one or more primary sponsored persons.\n\nThe obligation ends either:\n\nThe obligation ends either:\n- three years after you are approved as a sponsor\nthree years after you are approved as a sponsor\n- if you are an accredited sponsor, six years after you are approved as a sponsor.\nif you are an accredited sponsor, six years after you are approved as a sponsor.\n\n#### Obligation not to engage in discriminatory recruitment practices\n\nObligation not to engage in discriminatory recruitment practices\n\nIf you are a standard business sponsor who lawfully operates a business in Australia, you must not engage in, or have not engaged in, discriminatory recruitment practices that adversely affect Australian citizens, or any other person, based on their visa or citizenship status.You should keep documents on hand that demonstrate that the recruitment process in relation to a subclass 457 holder did not discriminate based on citizenship or visa status.Note:This new obligation was introduced on 19 April 2016. It is not engaged if discrimination in recruitment decisions is evident on other grounds such as sex, gender, race, social group or pregnancy. These issues are outside the remit of us and should be directed to other relevant agencies, such as the Fair Work Ombudsman or the Australian Human Rights Commission.\n\nIf you are a standard business sponsor who lawfully operates a business in Australia, you must not engage in, or have not engaged in, discriminatory recruitment practices that adversely affect Australian citizens, or any other person, based on their visa or citizenship status.\nYou should keep documents on hand that demonstrate that the recruitment process in relation to a subclass 457 holder did not discriminate based on citizenship or visa status.\nNote:\nThis new obligation was introduced on 19 April 2016. It is not engaged if discrimination in recruitment decisions is evident on other grounds such as sex, gender, race, social group or pregnancy. These issues are outside the remit of us and should be directed to other relevant agencies, such as the Fair Work Ombudsman or the Australian Human Rights Commission.\n\n#### Monitoring of sponsors and visa holders\n\nMonitoring of sponsors and visa holders\nDetails\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n- writing to you to ask for information in accordance with the obligation to provide records and information\nwriting to you to ask for information in accordance with the obligation to provide records and information\n- site visits, usually to the sponsored business premises, with or without notice\nsite visits, usually to the sponsored business premises, with or without notice\n- exchanging information with other Commonwealth, state and territory government agencies, including the Fair Work Ombudsman, the Department of Employment and the Australian Taxation Office.\nexchanging information with other Commonwealth, state and territory government agencies, including the Fair Work Ombudsman, the Department of Employment and the Australian Taxation Office.\n\nYour compliance with the sponsorship obligations might be monitored by Immigrations inspectors, Fair Work Inspectors or Fair Work Building Industry Inspectors who have investigative powers under theMigration Act 1958. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\nYour compliance with the sponsorship obligations might be monitored by Immigrations inspectors, Fair Work Inspectors or Fair Work Building Industry Inspectors who have investigative powers under the\nMigration Act 1958\n. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\nSubject to legislation passing, the Department will publish information identifying sponsors who have not complied with their sponsorship obligations and any action taken against them. Further information will be available if this occurs.\n\nSubject to legislation passing, the Department will publish information identifying sponsors who have not complied with their sponsorship obligations and any action taken against them. Further information will be available if this occurs.\n\n#### Sanctions for not meeting your sponsor obligations\n\nSanctions for not meeting your sponsor obligations\nDetails\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nAdministrative\n\nAdministrative\n- you could be barred from sponsoring more people for a specified time\nyou could be barred from sponsoring more people for a specified time\n- you could be barred from applying for approval to be a sponsor, in relation to this visa or another one\nyou could be barred from applying for approval to be a sponsor, in relation to this visa or another one\n- all of your existing approvals as a sponsor could be cancelled.\nall of your existing approvals as a sponsor could be cancelled.\n\nEnforceable undertaking\n\nEnforceable undertaking\n\nYou could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nYou could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nCivil\n\nCivil\n- we can issue an infringement notice of up to AUD12,600 for a body corporate and AUD2,520 for an individual for each failure.\nwe can issue an infringement notice of up to AUD12,600 for a body corporate and AUD2,520 for an individual for each failure.\n- we can apply to a court for a civil penalty order of up to AUD63,000 for a corporation and AUD12,600 for an individual for each failure.\nwe can apply to a court for a civil penalty order of up to AUD63,000 for a corporation and AUD12,600 for an individual for each failure.\n\nOther circumstances in which administrative action might be taken\n\nOther circumstances in which administrative action might be taken\n\nIn addition, you could also have sanctions imposed if:\n\nIn addition, you could also have sanctions imposed if:\n- you provide false or misleading information to us or the Administrative Appeals Tribunal\nyou provide false or misleading information to us or the Administrative Appeals Tribunal\n- you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\nyou no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\n- you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\nyou have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\n- the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.\nthe person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.\n\nThe types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made a work agreement.\n\nThe types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made a work agreement.\n\nIf you have sponsored someone under a work agreement, we could suspend or terminate it in accordance with the clauses of the particular work agreement.\n\nIf you have sponsored someone under a work agreement, we could suspend or terminate it in accordance with the clauses of the particular work agreement.\n\n#### Adverse information for sponsors\n\nAdverse information for sponsors\n\nSee:Adverse information\n\nSee:\nAdverse information\n\n## Nomination\n\nNomination\nDetails\n\n### Nomination process\n\nNomination process\nDetails\n\nNomination is the process of identifying a position to be filled by a skilled worker from outside Australia in an approved business. Nomination is required for both standard business sponsors and parties to a labour agreement.\n\nNomination is the process of identifying a position to be filled by a skilled worker from outside Australia in an approved business. Nomination is required for both standard business sponsors and parties to a labour agreement.\n\nThe nomination process identifies:\n\nThe nomination process identifies:\n- the occupation is relevant to the position to be filled\nthe occupation is relevant to the position to be filled\n- the skills and experience required for the position\nthe skills and experience required for the position\n- the market salary rate for the position and the salary rate to be paid to the prospective overseas employee\nthe market salary rate for the position and the salary rate to be paid to the prospective overseas employee\n- the name of the prospective overseas employee\nthe name of the prospective overseas employee\n- where the employee will be working.\nwhere the employee will be working.\n\n### How long is the nomination valid for?\n\nHow long is the nomination valid for?\nDetails\n\nAn approval of a nomination ceases on the earliest of the following:\n\nAn approval of a nomination ceases on the earliest of the following:\n- the day we receive notification in writing of the withdrawal of the nomination by the sponsor\nthe day we receive notification in writing of the withdrawal of the nomination by the sponsor\n- 12 months after the day the nomination is approved\n12 months after the day the nomination is approved\n- the day the applicant, or the proposed applicant, for the nominated occupation, is granted a subclass 457 visa\nthe day the applicant, or the proposed applicant, for the nominated occupation, is granted a subclass 457 visa\n- if the approval of the nomination is given to a standard business sponsor – three months after the day their approval as a standard business sponsor ceases\nif the approval of the nomination is given to a standard business sponsor – three months after the day their approval as a standard business sponsor ceases\n- if the approval of the nomination is given to a standard business sponsor, and their approval as a standard business sponsor is cancelled – the day the approval as a standard business sponsor is cancelled\nif the approval of the nomination is given to a standard business sponsor, and their approval as a standard business sponsor is cancelled – the day the approval as a standard business sponsor is cancelled\n- if the approval of the nomination is given to a party to a labour agreement – the day the labour agreement ceases.\nif the approval of the nomination is given to a party to a labour agreement – the day the labour agreement ceases.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-skilled-457#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-skilled-457#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:36:24.396483",
  "metadata": {}
}