{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/foreign-affairs-or-defence-sector-visa-subclass-576",
  "title": "Foreign Affairs or Defence Sector visa (subclass 576)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Foreign Affairs or Defence Sector visa (subclass 576) Page Content ​​You can no longer apply for the Foreign Affairs or Defence Sector visa (subclass 576). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for a Student Visa (subclass 500) Visa holders Details This information is for people who have already been granted a Foreign Affairs or Defence Sector visa (subclass 576) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations. You can use the free Visa Entitlement Verification Online (VEVO) to check your visa details and conditions How long your visa lasts Details If you already have a Foreign Affairs or Defence Sector visa (subclass 576), it will be valid until the expiry date you were given when your visa was granted. What this visa lets you do Details With this visa: you can study in Australia eligible dependant family members can accompany you to Australia when you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You can work unlimited hours if you have commenced a masters or doctorate course. You must also comply with State and Territory workplace laws your family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia your family members can work unlimited hours provided you have commenced a masters or doctorate course your family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia. Obligations Details Student Details You must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws. Check which conditions apply to your visa with Visa Entitlement Verification Online (VEVO) or your visa grant letter. Students under 18 years of age Details If you are under 18 years of age you must maintain your accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18. Changing your education provider Details If you do want to transfer to a different education provider, you must have a letter of support from DFAT or Department of Defence stating that your transfer has been approved by them. 'No further stay' condition Details Some visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation Family member Details Your dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia. Your family members must: remain a member of your family for the duration of their stay in Australia have adequate financial support maintain adequate health cover work no more than 40 hours per fortnight and can only start work after you have commenced your course (they can work unlimited hours if you have commenced a masters or doctorate course) attend school if they are of school age. Important: It is your responsibility to ensure that your family members meet the above conditions.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Foreign Affairs or Defence Sector visa (subclass 576)\n\nForeign Affairs or Defence Sector visa (subclass 576)\nPage Content\n\n​​You can no longer apply for the Foreign Affairs or Defence Sector  visa (subclass 576). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  aStudent Visa (subclass 500).\n\n​​You can no longer apply for the Foreign Affairs or Defence Sector  visa (subclass 576). It closed for new applications on 1 July 2016. From 1 July 2016, if you need to extend your stay in Australia, you must apply for  a\nStudent Visa (subclass 500)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Foreign Affairs or Defence Sector visa (subclass 576) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nThis information is for people who have already been granted a Foreign Affairs or Defence Sector visa (subclass 576) or for people who applied for the visa on or before 30 June 2016 and for which a decision has not yet been made. It explains your rights and obligations.\n\nYou can use the freeVisa Entitlement Verification Online (VEVO)to check your visa details and conditions\n\nYou can use the free\nVisa Entitlement Verification Online (VEVO)\nto check your visa details and conditions\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nIf you already have a Foreign Affairs or Defence Sector visa (subclass 576), it will be valid until the expiry date you were given when your visa was granted.\n\nIf you already have a Foreign Affairs or Defence Sector visa (subclass 576), it will be valid until the expiry date you were given when your visa was granted.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nWith this visa:\n\nWith this visa:\n- you can study in Australia\nyou can study in Australia\n- eligible dependant family members can accompany you to Australia\neligible dependant family members can accompany you to Australia\n- when you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You can work unlimited hours if you have commenced a masters or doctorate course. You must also comply with State and Territory workplace laws\nwhen you have commenced your course of study in Australia, you can work up to 40 hours per fortnight while your course is in session and unlimited hours during scheduled course breaks. You can work unlimited hours if you have commenced a masters or doctorate course. You must also comply with State and Territory workplace laws\n- your family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia\nyour family members can work up to 40 hours per fortnight provided you have commenced your course of study in Australia\n- your family members can work unlimited hours provided you have commenced a masters or doctorate course\nyour family members can work unlimited hours provided you have commenced a masters or doctorate course\n- your family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia.\nyour family members who are 18 or older can study in Australia for up to three months. If they want to study for more than three months they must apply for their own student visa. The application can be made in Australia.\n\n## Obligations\n\nObligations\nDetails\n\n### Student\n\nStudent\nDetails\n\nYou must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws.\n\nYou must comply with your visa conditions while studying and living in Australia or your visa could be cancelled. You must also comply with Australian laws.\n\nCheck which conditions apply to your visa withVisa Entitlement Verification Online (VEVO)or your visa grant letter.\n\nCheck which conditions apply to your visa with\nVisa Entitlement Verification Online (VEVO)\nor your visa grant letter.\n\n#### Students under 18 years of age\n\nStudents under 18 years of age\nDetails\n\nIf you are under 18 years of age you must maintain your accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18.\n\nIf you are under 18 years of age you must maintain your accommodation, support and general welfare arrangements for the duration of your visa or until you turn 18.\n\n#### Changing your education provider\n\nChanging your education provider\nDetails\n\nIf you do want to transfer to a different education provider, you must have a letter of support from DFAT or Department of Defence stating that your transfer has been approved by them.\n\nIf you do want to transfer to a different education provider, you must have a letter of support from DFAT or Department of Defence stating that your transfer has been approved by them.\n\n#### 'No further stay' condition\n\n'No further stay' condition\nDetails\n\nSome visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\nSome visas are issued with a 'no further stay' condition. This condition means that you cannot apply to stay in Australia beyond the date specified on your visa, except in certain circumstances.\n\n#### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### Family member\n\nFamily member\nDetails\n\nYour dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia.\n\nYour dependent family members must maintain their visa conditions. A breach of these conditions may result in your visa being cancelled and you may have to leave Australia.\n\nYour family members must:\n\nYour family members must:\n- remain a member of your family for the duration of their stay in Australia\nremain a member of your family for the duration of their stay in Australia\n- have adequate financial support\nhave adequate financial support\n- maintain adequate health cover\nmaintain adequate health cover\n- work no more than 40 hours per fortnight and can only start work after you have commenced your course (they can work unlimited hours if you have commenced a masters or doctorate course)\nwork no more than 40 hours per fortnight and can only start work after you have commenced your course (they can work unlimited hours if you have commenced a masters or doctorate course)\n- attend school if they are of school age.\nattend school if they are of school age.\n\nImportant:It is your responsibility to ensure that your family members meet the above conditions.\n\nImportant:\nIt is your responsibility to ensure that your family members meet the above conditions.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/foreign-affairs-or-defence-sector-visa-subclass-576#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/foreign-affairs-or-defence-sector-visa-subclass-576#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:37:55.911397",
  "metadata": {}
}