{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-entertainment-visa-subclass-420",
  "title": "Temporary Work (Entertainment) visa (subclass 420)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Temporary Work (Entertainment) visa (subclass 420) Page Content ​​The Temporary Work (Entertainment) visa (subclass 420) is closed to new applications. You might be eligible to apply for Temporary Activity visa (subclass 408) Visa holders Details This information is for people who have already been granted a Temporary Work (Entertainment) visa (subclass 420). It explains your rights and obligations. How long your visa lasts Your visa is valid for the duration of the nominated position or two years, whichever is the earliest. Your obligations Details You and your family must comply with all visa conditions and Australian laws. You must: maintain adequate health insurance while you are in Australia leave Australia when your visa ends (unless you are granted another visa) only engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job) only engage in work or an activity consistent with the nominated position in your visa application ask permission from the Entertainment Visa Centre (NSW) to make any changes to your itinerary, including new events, changes in times or new venues If the sponsor ceases your employment or activity, you must either: find another employer who is willing to sponsor you for this visa (your new sponsor must lodge a new nomination to cover you for the time left on your visa). You do not have to apply for a new visa if your visa is still valid and is not about to end leave Australia within 28 days or apply for another visa unless you have a 'no further stay' condition. Family members Your family cannot enter Australia before you. When your visa ends, your family must leave Australia with you. Your family must: intend to remain members of your family unit maintain adequate health insurance while they are in Australia. Your family can work or study in Australia while their visa is valid. There could be other conditions on your entry and stay in Australia that will be explained to you when you are granted the visa. Report changes in circumstances You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. Sponsors Details This information is for a person who sponsored someone for a Temporary Work (Entertainment) visa (subclass 420) to work temporarily in the entertainment industry in Australia. How long your sponsorship lasts Details A sponsorship lasts for up to three years. If you are an approved Entertainment sponsor, you can apply to vary (extend) your sponsorship before it expires to allow you to continue to nominate people. If the sponsorship expires you will need to reapply and be approved as a sponsor to nominate further visa applicants. Report changes in circumstances Details You must contact the Entertainment Visa Centre to report any changes in circumstances that could affect the processing of your application. When you write to us, you must include: the name of your organisation your ABN or other identifier your sponsorship application ID number. This information helps us locate your application quickly. Sponsorship obligations Details You must be able to comply with following sponsorship obligations. cooperate with inspectors keep records provide records and information to the Minister tell us when certain events occur not recover from, transfer or charge certain costs to another person pay costs to locate and remove an unlawful non-citizen ensure visa holder or participates in nominated occupation, program or activity secure an offer of a reasonable standard of accommodation. You are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent. Cooperate with inspectors You must cooperate with inspectors appointed under the Migration Act 1958 (the Act) who are investigating whether: a sponsorship obligation is being, or has been, complied with you have hired an illegal worker there are other circumstances in which we could take administrative action. This obligation: starts on the day the sponsorship is approved or work agreement commences ends five years after the day the approved sponsorship ends or work agreement ceases. Cooperating with inspectors can include (but is not limited to): providing access to premises producing and providing documents within the requested timeframe not preventing or attempting to prevent ,access to a person who has custody of, or access to, a record or documents providing officers with access to interview any person on their premises. Keep records You must keep records that show you have your complied with sponsorship obligations. All records must be kept in a reproducible format and some must be capable of verification by an independent person. You must keep a record of: any notification that you were required to make to us the date on which you notified us, and how and where you made the notification. This obligation starts on the day the sponsorship is approved. This obligation ends two years after both of the following: you are no longer an approved sponsor, and you are no longer sponsoring anyone. You do not need to keep any records for more than five years. Provide records and information to the Minister You must provide records or information, if they are requested by a departmental officer that goes to determining whether: a sponsorship obligation is being or has been complied with, and determining whether other circumstances, in which the Minister may take administrative action, exist or have existed, in the manner and timeframe requested by the department. We may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that: you are required to keep under Commonwealth, state or territory law you have an obligation to keep as a sponsor. This obligation starts to apply on the day the sponsorship is approved or work agreement commences. This obligation ends two years after: your sponsorship or work agreement ends, and you are no longer sponsoring anyone. Tell us when certain events occur You must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring. Events where a sponsor must provide information to us include: the primary sponsored person fails to participate in the nominated activity; the cessation of a primary sponsored person's participation in a film or television production; the primary sponsored person, apart from performers in a film or television production, ceases prior to the cessation date approved at nomination; the sponsor ceases to hold a licence that was required for the nomination to be approved; a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details; and if the sponsor is an Australian organisation, the legal entity ceases to exist. This obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences. This obligation ends two years after: your sponsorship or work agreement ends, and you are no longer sponsoring anyone. Where to send a notice of an event or change You must send details of these events by email or to one of our state or territory offices listed below. By email (preferred): sponsor.notifications@border.gov.au By registered post: Australian Capital Territory Sponsor Monitoring GPO Box 717 Canberra ACT 2601 New South Wales Sponsor Monitoring GPO Box 9984 Sydney NSW 2001 Queensland Sponsor Monitoring GPO Box 9984 Brisbane Qld 4001 Northern Territory Sponsor Monitoring GPO Box 864 Darwin NT 0801 South Australia Sponsor Monitoring GPO Box 2399 Adelaide SA 5001 Tasmania Sponsor Monitoring GPO Box 794 Hobart Tas. 7001 Victoria Sponsor Monitoring GPO Box 241 Melbourne Vic. 3001 Western Australia Sponsor Monitoring Locked Bag 7 Northbridge WA 6865 Ensure that the visa holder participates in the nominated occupation, program or activity You must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved. This obligation ends on the day (whichever is the earliest): the sponsored visa holder has a nomination approved for another approved sponsor the sponsored visa holder is granted another substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa) the sponsored visa holder has left Australia and the relevant visa (and any subsequent bridging visa) is no longer in effect. Not recover, transfer or charge certain costs to another person You must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to: the recruitment of the person you sponsored becoming or being a sponsor or former approved sponsor. This obligation: starts on the day the sponsorship is approved or the work agreement commences ends on the following two events: you cease to be an approved sponsor or party to a work agreement you no longer have a sponsored visa holder. Sponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include: cost of sponsorship and nomination charges migration agent costs associated with the lodgement of sponsorship and nomination applications administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including: recruitment agent fees migration agent fees the cost of job advertising screening of candidates, short listing, interviews and reference checks salaries of recruitment or human resource staff the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position training of new staff responding to queries for prospective candidates, and advising unsuccessful applicants travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia. Pay costs to locate and remove an unlawful non-citizen In the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia. You may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above). This obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia. Secure an offer of a reasonable standard of accommodation If you sponsor someone to work for you as a volunteer without a salary or wages or sponsor someone to participate in a professional development program, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them. If the accommodation becomes unavailable, you must find alternative accommodation for them. A ‘reasonable standard of accommodation’ means that the accommodation must: meet all relevant state or territory and local government regulations regarding fire, health and safety offer 24-hour access provide meals or a self-catering kitchen be clean and well-maintained have a lounge area have adequate laundry facilities or a laundry service provide power for lighting, cooking and refrigeration have an adequate ratio of guests to bathroom facilities have uncrowded sleeping areas provide appropriate gender segregated areas and bathroom facilities allow adequate privacy and secure storage for personal items. This obligation starts on the day: your nomination of the sponsored person is approved, or the day the visa is granted (if the person you have sponsored does not already hold this visa when you nominate them or nomination was not required for that visa type). This obligation ends on the day (whichever is earliest): another sponsor has their nomination application for the same person approved the person you have sponsored is granted a further visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa) the person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect. Monitoring of sponsors and visa holders Details You must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions. We monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways: writing to you to ask for information in accordance with the obligation to provide records and information site visits, usually to the sponsored business premises, with or without notice exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office. Your compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the Migration Act 1958 , including Fair Work Inspectors, and Fair Work Building Industry Inspectors. Failure to cooperate with inspectors is a breach of the sponsorship obligations. Sanctions for not meeting your sponsor obligations Details If you do not meet your obligations, we could take one or more of the following actions: Administrative you could be barred from sponsoring more people for a specified time you could be barred from applying for approval to be a sponsor, in relation to this visa or another one all of your existing approvals as a sponsor could be cancelled. Enforceable undertaking You could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again. Civil we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure. we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure. Other circumstances in which administrative action might be taken In addition, you could also have sanctions imposed if: you provide false or misleading information to us or the Migration Review Tribunal you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Temporary Work (Entertainment) visa (subclass 420)\n\nTemporary Work (Entertainment) visa (subclass 420)\nPage Content\n\n​​The Temporary Work (Entertainment) visa (subclass 420) is closed to new applications. You might be eligible to apply forTemporary Activity visa (subclass 408).\n\n​​The Temporary Work (Entertainment) visa (subclass 420) is closed to new applications. You might be eligible to apply for\nTemporary Activity visa (subclass 408)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Temporary Work (Entertainment) visa (subclass 420). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Temporary Work (Entertainment) visa (subclass 420). It explains your rights and obligations.\n\n### How long your visa lasts\n\nHow long your visa lasts\n\nYour visa is valid for the duration of the nominated position or two years, whichever is the earliest.\n\nYour visa is valid for the duration of the nominated position or two years, whichever is the earliest.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou must:\n\nYou must:\n- maintainadequate health insurancewhile you are in Australia\nmaintain\nadequate health insurance\nwhile you are in Australia\n- leave Australia when your visa ends (unless you are granted another visa)\nleave Australia when your visa ends (unless you are granted another visa)\n- only engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job)\nonly engage in work or an activity for the employer identified in the nomination (you cannot become unemployed, leave your position to do work or an activity for someone else, or work for someone else in a second job)\n- only engage in work or an activity consistent with the nominated position in your visa application\nonly engage in work or an activity consistent with the nominated position in your visa application\n- ask permission from the Entertainment Visa Centre (NSW) to make any changes to your itinerary, including new events, changes in times or new venues\nask permission from the Entertainment Visa Centre (NSW) to make any changes to your itinerary, including new events, changes in times or new venues\n\nIf the sponsor ceases your employment or activity, you must either:\n\nIf the sponsor ceases your employment or activity, you must either:\n- find another employer who is willing to sponsor you for this visa (your new sponsor must lodge a new nomination to cover you for the time left on your visa). You do not have to apply for a new visa if your visa is still valid and is not about to end\nfind another employer who is willing to sponsor you for this visa (your new sponsor must lodge a new nomination to cover you for the time left on your visa). You do not have to apply for a new visa if your visa is still valid and is not about to end\n- leave Australia within 28 days or apply for another visa unless you have a 'no further stay' condition.\nleave Australia within 28 days or apply for another visa unless you have a 'no further stay' condition.\n\n#### Family members\n\nFamily members\n\nYour family cannot enter Australia before you. When your visa ends, your family must leave Australia with you.\n\nYour family cannot enter Australia before you. When your visa ends, your family must leave Australia with you.\n\nYour family must:\n\nYour family must:\n- intend to remain members of your family unit\nintend to remain members of your family unit\n- maintainadequate health insurancewhile they are in Australia.\nmaintain\nadequate health insurance\nwhile they are in Australia.\n\nYour family can work or study in Australia while their visa is valid.\n\nYour family can work or study in Australia while their visa is valid.\n\nThere could be other conditions on your entry and stay in Australia that will be explained to you when you are granted the visa.\n\nThere could be other conditions on your entry and stay in Australia that will be explained to you when you are granted the visa.\n\n### Report changes in circumstances\n\nReport changes in circumstances\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n## Sponsors\n\nSponsors\nDetails\n\nThis information is for a person who sponsored someone for a Temporary Work (Entertainment) visa (subclass 420) to work temporarily in the entertainment industry in Australia.\n\nThis information is for a person who sponsored someone for a Temporary Work (Entertainment) visa (subclass 420) to work temporarily in the entertainment industry in Australia.\n\n### How long your sponsorship lasts\n\nHow long your sponsorship lasts\nDetails\n\nA sponsorship lasts for up to three years.\n\nA sponsorship lasts for up to three years.\n\nIf you are an approved Entertainment sponsor, you can apply to vary (extend) your sponsorship before it expires to allow you to continue to nominate people. If the sponsorship expires you will need to reapply and be approved as a sponsor to nominate further visa applicants.\n\nIf you are an approved Entertainment sponsor, you can apply to vary (extend) your sponsorship before it expires to allow you to continue to nominate people. If the sponsorship expires you will need to reapply and be approved as a sponsor to nominate further visa applicants.\n\n### Report changes in circumstances\n\nReport changes in circumstances\nDetails\n\nYou must contact the Entertainment Visa Centre to report any changes in circumstances that could affect the processing of your application.\n\nYou must contact the Entertainment Visa Centre to report any changes in circumstances that could affect the processing of your application.\n\nWhen you write to us, you must include:\n\nWhen you write to us, you must include:\n- the name of your organisation\nthe name of your organisation\n- your ABN or other identifier\nyour ABN or other identifier\n- your sponsorship application ID number.\nyour sponsorship application ID number.\n\nThis information helps us locate your application quickly.\n\nThis information helps us locate your application quickly.\n\n### Sponsorship obligations\n\nSponsorship obligations\nDetails\n\nYou must be able to comply with following sponsorship obligations.\n\nYou must be able to comply with following sponsorship obligations.\n- cooperate with inspectors\ncooperate with inspectors\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- tell us when certain events occur\ntell us when certain events occur\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- pay costs to locate and remove an unlawful non-citizen\npay costs to locate and remove an unlawful non-citizen\n- ensure  visa holder or participates in nominated occupation, program or activity\nensure  visa holder or participates in nominated occupation, program or activity\n- secure an offer of a reasonable standard of accommodation.\nsecure an offer of a reasonable standard of accommodation.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\nYou are responsible for meeting all your obligations, even if you have authorised someone else to act on your behalf, including a migration agent.\n\n#### Cooperate with inspectors\n\nCooperate with inspectors\n\nYou must cooperate with inspectors appointed under theMigration Act 1958(the Act) who are investigating whether:\n\nYou must cooperate with inspectors appointed under the\nMigration Act 1958\n(the Act) who are investigating whether:\n- a sponsorship obligation is being, or has been, complied with\na sponsorship obligation is being, or has been, complied with\n- you have hired an illegal worker\nyou have hired an illegal worker\n- there are other circumstances in which we could take administrative action.\nthere are other circumstances in which we could take administrative action.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or work agreement commences\nstarts on the day the sponsorship is approved or work agreement commences\n- ends five years after the day the approved sponsorship ends  or work agreement ceases.\nends five years after the day the approved sponsorship ends  or work agreement ceases.\n\nCooperating with inspectors can include (but is not limited to):\n\nCooperating with inspectors can include (but is not limited to):\n- providing access to premises\nproviding access to premises\n- producing and providing documents within the requested timeframe\nproducing and providing documents within the requested timeframe\n- not preventing  or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\nnot preventing  or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\n- providing officers with access to interview any person on their premises.\nproviding officers with access to interview any person on their premises.\n\n#### Keep records\n\nKeep records\n\nYou must keep records that show you have your complied with sponsorship obligations. All records must be kept in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep records that show you have your complied with sponsorship obligations. All records must be kept in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep a record of:\n\nYou must keep a record of:\n- any notification that you were required to make to us\nany notification that you were required to make to us\n- the date on which you notified us, and how and where you made the notification.\nthe date on which you notified us, and how and where you made the notification.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation ends two years after both of the following:\n\nThis obligation ends two years after both of the following:\n- you are no longer an approved sponsor, and\nyou are no longer an approved sponsor, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nYou do not need to keep any records for more than five years.\n\nYou do not need to keep any records for more than five years.\n\n#### Provide records and information to the Minister\n\nProvide records and information to the Minister\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n- a sponsorship obligation is being or has been complied with, and\na sponsorship obligation is being or has been complied with, and\n- determining whether other circumstances, in which the Minister may take administrative action, exist or have existed,in the manner and timeframe requested by the department.\ndetermining whether other circumstances, in which the Minister may take administrative action, exist or have existed,\nin the manner and timeframe requested by the department.\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n- you are required to keep under Commonwealth, state or territory law\nyou are required to keep under Commonwealth, state or territory law\n- you have an obligation to keep as a sponsor.\nyou have an obligation to keep as a sponsor.\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship or work agreement ends, and\nyour sponsorship or work agreement ends, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\n#### Tell us when certain events occur\n\nTell us when certain events occur\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nEvents where a sponsor must provide information to us include:\n\nEvents where a sponsor must provide information to us include:\n- the primary sponsored person fails to participate in the nominated activity;\nthe primary sponsored person fails to participate in the nominated activity;\n- the cessation of a primary sponsored person's participation in a film or television production;\nthe cessation of a primary sponsored person's participation in a film or television production;\n- the primary sponsored person, apart from performers in a film or television production, ceases prior to the cessation date approved at nomination;\nthe primary sponsored person, apart from performers in a film or television production, ceases prior to the cessation date approved at nomination;\n- the sponsor ceases to hold a licence that was required for the nomination to be approved;\nthe sponsor ceases to hold a licence that was required for the nomination to be approved;\n- a change to the information in the sponsor's application for approval as a sponsor, relating to the person's  address and contact details; and\na change to the information in the sponsor's application for approval as a sponsor, relating to the person's  address and contact details; and\n- if the sponsor is an Australian organisation, the legal entity ceases to exist.\nif the sponsor is an Australian organisation, the legal entity ceases to exist.\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship or work agreement ends, and\nyour sponsorship or work agreement ends, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nWhere to send a notice of an event or change\n\nWhere to send a notice of an event or change\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nBy email(preferred):sponsor.notifications@border.gov.au\n\nBy email\n(preferred):\nsponsor.notifications@border.gov.au\n\nBy registered post:\n\nBy registered post:\n- Australian Capital TerritorySponsor MonitoringGPO Box 717Canberra ACT 2601\nAustralian Capital Territory\nSponsor Monitoring\nGPO Box 717\nCanberra ACT 2601\n- New South WalesSponsor MonitoringGPO Box 9984Sydney NSW 2001\nNew South Wales\nSponsor Monitoring\nGPO Box 9984\nSydney NSW 2001\n- QueenslandSponsor MonitoringGPO Box 9984Brisbane Qld 4001\nQueensland\nSponsor Monitoring\nGPO Box 9984\nBrisbane Qld 4001\n- Northern TerritorySponsor MonitoringGPO Box 864Darwin NT 0801\nNorthern Territory\nSponsor Monitoring\nGPO Box 864\nDarwin NT 0801\n- South AustraliaSponsor MonitoringGPO Box 2399Adelaide SA 5001\nSouth Australia\nSponsor Monitoring\nGPO Box 2399\nAdelaide SA 5001\n- TasmaniaSponsor MonitoringGPO Box 794Hobart Tas. 7001\nTasmania\nSponsor Monitoring\nGPO Box 794\nHobart Tas. 7001\n- VictoriaSponsor MonitoringGPO Box 241Melbourne Vic. 3001\nVictoria\nSponsor Monitoring\nGPO Box 241\nMelbourne Vic. 3001\n- Western AustraliaSponsor MonitoringLocked Bag 7Northbridge WA 6865\nWestern Australia\nSponsor Monitoring\nLocked Bag 7\nNorthbridge WA 6865\n\n#### Ensure that the visa holder participates in the nominated occupation, program or activity\n\nEnsure that the visa holder participates in the nominated occupation, program or activity\n\nYou must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for  a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved.\n\nYou must ensure that the person you have sponsored participates only in the occupation, program or activity for which you nominated them. If you want to engage a visa holder for  a different occupation, program or activity, you must lodge a new nomination application. This obligation starts on the day the person you have sponsored is granted a visa. If they already hold a visa when you nominate them, your obligation starts on the day the nomination is approved.\n\nThis obligation ends on the day (whichever is the earliest):\n\nThis obligation ends on the day (whichever is the earliest):\n- the sponsored visa holder has a nomination approved for another approved sponsor\nthe sponsored visa holder has a nomination approved for another approved sponsor\n- the sponsored visa holder is granted another  substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\nthe sponsored visa holder is granted another  substantive visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\n- the sponsored visa holder  has left Australia and  the relevant visa (and any subsequent bridging visa) is no longer in effect.\nthe sponsored visa holder  has left Australia and  the relevant visa (and any subsequent bridging visa) is no longer in effect.\n\n#### Not recover, transfer or charge certain costs to another person\n\nNot recover, transfer or charge certain costs to another person\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n- the recruitment of  the person you sponsored\nthe recruitment of  the person you sponsored\n- becoming or being a sponsor or former approved sponsor.\nbecoming or being a sponsor or former approved sponsor.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or the work agreement commences\nstarts on the day the sponsorship is approved or the work agreement commences\n- ends on the following two events:you cease to be an  approved sponsor or party to a work agreementyou no longer have a sponsored visa holder.\nends on the following two events:\n- you cease to be an  approved sponsor or party to a work agreement\nyou cease to be an  approved sponsor or party to a work agreement\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n- cost of sponsorship and nomination charges\ncost of sponsorship and nomination charges\n- migration agent costs associated with the lodgement of sponsorship and nomination applications\nmigration agent costs associated with the lodgement of sponsorship and nomination applications\n- administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:recruitment agent feesmigration agent feesthe cost of job advertisingscreening of candidates, short listing, interviews and reference checkssalaries of recruitment or human resource staffthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the positiontraining of new staffresponding to queries for prospective candidates, and advising unsuccessful applicantstravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\nadministrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:\n- recruitment agent fees\nrecruitment agent fees\n- migration agent fees\nmigration agent fees\n- the cost of job advertising\nthe cost of job advertising\n- screening of candidates, short listing, interviews and reference checks\nscreening of candidates, short listing, interviews and reference checks\n- salaries of recruitment or human resource staff\nsalaries of recruitment or human resource staff\n- the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\nthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\n- training of new staff\ntraining of new staff\n- responding to queries for prospective candidates, and advising unsuccessful applicants\nresponding to queries for prospective candidates, and advising unsuccessful applicants\n- travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\ntravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\n\n#### Pay costs to locate and remove an unlawful non-citizen\n\nPay costs to locate and remove an unlawful non-citizen\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\n#### Secure an offer of a reasonable standard of accommodation\n\nSecure an offer of a reasonable standard of accommodation\n\nIf you sponsor someone to work for you as a volunteer without a salary or wages or sponsor someone to participate in a professional development program, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf you sponsor someone to work for you as a volunteer without a salary or wages or sponsor someone to participate in a professional development program, you must secure an offer of a reasonable standard of accommodation in Australia for them and any family they bring with them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nIf the accommodation becomes unavailable, you must find alternative accommodation for them.\n\nA ‘reasonable standard of accommodation’ means that the accommodation must:\n\nA ‘reasonable standard of accommodation’ means that the accommodation must:\n- meet all relevant state or territory and local government regulations regarding fire, health and safety\nmeet all relevant state or territory and local government regulations regarding fire, health and safety\n- offer 24-hour access\noffer 24-hour access\n- provide meals or a self-catering kitchen\nprovide meals or a self-catering kitchen\n- be clean and well-maintained\nbe clean and well-maintained\n- have a lounge area\nhave a lounge area\n- have adequate laundry facilities or a laundry service\nhave adequate laundry facilities or a laundry service\n- provide power for lighting, cooking and refrigeration\nprovide power for lighting, cooking and refrigeration\n- have an adequate ratio of guests to bathroom facilities\nhave an adequate ratio of guests to bathroom facilities\n- have uncrowded sleeping areas\nhave uncrowded sleeping areas\n- provide appropriate gender segregated areas and bathroom facilities\nprovide appropriate gender segregated areas and bathroom facilities\n- allow adequate privacy and secure storage for personal items.\nallow adequate privacy and secure storage for personal items.\n\nThis obligation starts on the day:\n\nThis obligation starts on the day:\n- your nomination of the sponsored person is approved, or\nyour nomination of the sponsored person is approved, or\n- the day the visa is granted (if the person you have sponsored does not already hold this visa when you nominate them or nomination was not required for that visa type).\nthe day the visa is granted (if the person you have sponsored does not already hold this visa when you nominate them or nomination was not required for that visa type).\n\nThis obligation ends on the day (whichever is earliest):\n\nThis obligation ends on the day (whichever is earliest):\n- another sponsor has their nomination application for the same person approved\nanother sponsor has their nomination application for the same person approved\n- the person you have sponsored is granted a further visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\nthe person you have sponsored is granted a further visa of a different type for which you sponsored them (unless that other visa is a bridging visa, criminal justice visa or enforcement visa)\n- the person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect.\nthe person you have sponsored has left Australia and the visa (and any bridging visa) is no longer in effect.\n\n### Monitoring of sponsors and visa holders\n\nMonitoring of sponsors and visa holders\nDetails\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n- writing to you to ask for information in accordance with the obligation to provide records and information\nwriting to you to ask for information in accordance with the obligation to provide records and information\n- site visits, usually to the sponsored business premises, with or without notice\nsite visits, usually to the sponsored business premises, with or without notice\n- exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\nexchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under theMigration Act 1958, including Fair Work Inspectors, and Fair Work Building Industry Inspectors. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the\nMigration Act 1958\n, including Fair Work Inspectors, and Fair Work Building Industry Inspectors. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\n### Sanctions for not meeting your sponsor obligations\n\nSanctions for not meeting your sponsor obligations\nDetails\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nAdministrative\n\nAdministrative\n- you could be barred from sponsoring more people for a specified time\nyou could be barred from sponsoring more people for a specified time\n- you could be barred from applying for approval to be a sponsor, in relation to this visa or another one\nyou could be barred from applying for approval to be a sponsor, in relation to this visa or another one\n- all of your existing approvals as a sponsor could be cancelled.\nall of your existing approvals as a sponsor could be cancelled.\n\nEnforceable undertaking\n\nEnforceable undertaking\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nCivil\n\nCivil\n- we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\nwe can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\n- we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\nwe can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\n\nOther circumstances in which administrative action might be taken\n\nOther circumstances in which administrative action might be taken\n\nIn addition, you could also have sanctions imposed if:\n\nIn addition, you could also have sanctions imposed if:\n- you provide false or misleading information to us or the Migration Review Tribunal\nyou provide false or misleading information to us or the Migration Review Tribunal\n- you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\nyou no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\n- you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\nyou have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\n- the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.\nthe person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-entertainment-visa-subclass-420#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/temporary-work-entertainment-visa-subclass-420#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:36:06.554238",
  "metadata": {}
}