{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444",
  "title": "Special Category visa (SCV)",
  "raw_text": "===== main placeholder ========================================== Subclass 444 Special Category visa (SCV) This temporary visa allows you to visit, study, stay, and work in Australia, if you are a New Zealand citizen and meet the eligibility criteria. It is usually applied for each time you enter Australia. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay From the time you are granted the visa until you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again. Cost Free Processing times If you apply on arrival in Australia, your application will be processed at the airport or seaport. If you apply inside Australia, your application may take longer to process depending upon your individual circumstances. With this visa, you can enter and stay in Australia for as long as you are a New Zealand citizen visit, work and study in Australia apply for a permanent visa if eligible See all conditions Check your eligibility You must remain a New Zealand citizen continue to meet the character requirements. About this visa With this visa you can How long you can stay Include family Cost Apply Your obligations Health insurance Travel Travelling as a permanent visa holder Eligible New Zealand citizen (or Protected SCV holder) Visa label With this visa you can enter and stay in Australia for as long as you are and continue to remain a New Zealand citizen visit, work and study in Australia apply for a permanent visa if eligible How long you can stay The visa starts on the date we grant you the visa. The visa ceases on the date you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again. Include family Each family member needs to make their own SCV application. They can do this by showing a valid New Zealand passport and completed incoming passenger card to an officer. They can also answer the health and character questions on SmartGate If family members are not New Zealand citizens, they need to apply for another visa Cost There is no application charge for this visa. Apply You usually apply for this visa when you enter Australia. In some cases, you may be able to apply for this visa after you have entered Australia. This might be the case if you: became a New Zealand citizen and passport holder after you entered Australia entered on a passport that is not a New Zealand passport entered on another temporary visa, or had a New Zealand citizen baby born in Australia. In these cases you can apply by completing our online form . If we grant you the SCV after you have entered Australia the grant date will be the date of the decision. We can't backdate it to your original entry date. If you had a child born in Australia to an SCV holding parent on or before 30 June 2022, ensure that the child has been registered as a New Zealand Citizen and has received a New Zealand citizenship certificate and/or a New Zealand passport. For further information see New Zealand citizenship Once you receive the New Zealand citizenship certificate and/or passport you can submit an onshore SCV application via the Onshore visa application form If you had a child born to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship For further information see You had a baby Check if you already hold a visa Before submitting an application check if you already hold a visa or get a copy of it by using VEVO . To access VEVO you will need a reference number Your obligations You must remain a New Zealand citizen while you hold this visa. If your citizenship status changes, and you are no longer a New Zealand citizen, your SCV will cease. To remain lawful you must apply for and we must grant you a different visa. You must obey Australian laws while you remain in Australia. All visa holders must continue to meet the character requirements . If you don't, we may cancel your visa Health insurance We recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You may be liable for your own healthcare costs while you are in Australia. Insurance can help limit your financial liability. See what we consider adequate health insurance Learn more about health insurance for overseas visitors Learn more about Medicare for New Zealand citizens. Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Travel You can't travel outside Australia and return on this visa. If you leave Australia the visa will cease. If you return to Australia you must apply for a new SCV when you return. Travelling as a permanent visa holder We may manually process your entry into Australia. If you hold a permanent visa (with a valid travel facility), you need to tell us that you do not want an SCV. If you do not tell us, we may grant you the SCV. This may later affect your eligibility for a Resident Return visa. More information is in overseas travel as a permanent resident Eligible New Zealand citizen (or Protected SCV holder) See Eligible New Zealand citizen (or Protected SCV holder) under Entitlements More information is in overseas travel as a permanent resident Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Have a valid New Zealand passport Not be a behaviour concern non-citizen Details If we assess you are a behaviour concern non-citizen (BCNC), we may refuse to grant you an SCV. We may refuse your entry into Australia. You could be assessed as a BCNC if you have been: convicted of a crime that has resulted in a sentence of death or imprisonment for at least one year convicted of two or more crimes resulting in sentences of imprisonment for periods that total at least one year charged with, and found guilty of a crime while of unsound mind. This also includes if you were found not guilty because the crime was committed while of unsound mind removed or deported from Australia in the past removed, deported or excluded from another country in the past. Note: Sentenced to imprisonment includes ordered to be confined in a corrective institution. If you have concerns about your eligibility for the SCV, you can check by using our online webform before you travel: Enquiry Form – New Zealand passport holders travelling with a criminal conviction Not be a health concern non-citizen Details We may assess you as a health concern non-citizen if you declare when you enter Australia that you have tuberculosis (TB). If you declare that you have TB we will ask you to give us more information. Not have a 'no further stay' visa condition You can't apply for this visa if you currently hold a visa that has a 'no further stay' condition. Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply If you had a child born in Australia to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship . They do not need to apply for an SCV first. Ensure you have a valid New Zealand passport before you travel to Australia. You can't apply for this visa on your entry to Australia if you already hold another temporary visa. If you already hold a temporary visa you can apply for an SCV after you have entered Australia. You can't apply for this visa if you currently hold a pemanent visa or a visa that has a 'no further stay' condition. Show steps Check your visa details and status Before submitting an onshore SCV visa application check if you already hold a visa by using VEVO. To access VEVO, you will need a reference number Please see the Stay lawful section below for Bridging visa information. See how Check your passport You must have a valid New Zealand passport to be granted this visa. Your visa will be linked to the passport number in your application. If you plan to get a new passport, do so before you apply. See how Step 2 Gather your documents Show steps Valid New Zealand passport If you are applying for the SCV on or after your entry into Australia you will need your valid New Zealand passport with you. See how Australian Birth Certificate If you were born in Australia on or before 30 June 2022 and have not departed you will need to provide a copy of your Australian Birth Certificate with your onshore SCV application. You will also need to provide evidence of your New Zealand citizenship. You may need to be registered as a New Zealand citizen first. For further information see New Zealand citizenship See how Provide accurate documents Provide accurate information Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You don't need to have any documents certified unless we ask you to. See how Step 3 Apply for the visa When you enter Australia show your completed incoming passenger card with your valid New Zealand passport to an officer. You can also answer the health and character questions on SmartGate If applying after you have entered Australia, you will need to apply online Show steps Provide accurate information Provide accurate information Lodging an application after you have entered Australia Apply online to request an SCV appointment. Once your information has been received by the Department, you will be contacted with a date and time for your appointment. The Department may also contact you about any additional documentation that you may need to submit. Step 4 After you apply We will usually process your visa application at the airport or seaport that you use to enter Australia. If you apply after you have entered Australia, a decision may take longer. Show steps Wait for us to contact you For applications made after you have entered Australia, we will contact you with a date and time for your appointment. See how Status updates We can't give updates on applications. Wait for us to contact you. Stay lawful If you apply for this visa after you have entered Australia, make sure you stay lawful. You can do this by holding a valid visa while we process your application. If your current visa will expire before we decide your application, consider applying for a Bridging visa. If you hold a substantive visa at the time you lodge your application, you may be eligible for a Bridging visa A . You can stay in Australia on the Bridging visa A while we process your new visa application. If you do not hold a substantive visa at the time you lodge your application, you may be eligible for a Bridging visa C . You can stay in Australia on the Bridging visa C while we process your new visa application. If we cancel your current visa or it ceases, and you do not hold a Bridging visa, you: will be staying in Australia unlawfully may not be eligible for a Bridging visa may not be eligible for a Bridging visa B. This allows you to leave and re-enter Australia while we finalise your visa application Learn more about visa expiry See how Tell us if things change Things you may need to let us know about after you have applied include: changes to your phone number, email, address changes to your citizenship (other than becoming an Australian citizen) the birth of a child if you want to withdraw your onshore application. See how to tell us if your situation changes See how Step 5 Visa outcome We will tell you if we have granted your visa. How we tell you will depend on how and where you applied. Show steps If you applied on entry to Australia If you meet all visa and immigration requirements, you will be: granted the visa immigration cleared. We will add your visa electronically to your passport. You can check your visa status, conditions and expiry or get a copy of it in VEVO . To access VEVO, you will need a reference number See how If you applied after you entered Australia We will let you know our decision about your visa application in writing. We will link your visa to the New Zealand passport number in your application and tell you: your visa grant number the date your visa starts your visa conditions. Keep a copy of the decision for your records. If we refuse your visa we will let you know in writing. We will tell you: why we refused your visa whether you have a right to a review of the decision. See how When you have this visa In Australia Leaving Australia In Australia Tell us about a change in your situation Things you may need to let us know about include: changes to your phone number, email, address changes to your citizenship (other than becoming an Australian citizen) the birth of a child If you had a child born in Australia to an SCV holding parent on or after 1 July 2022 your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their proof of citizenship See how to let us know if there is a change in your situation What you can do on your visa Check your visa status, conditions and expiry in VEVO Proving you have a visa To prove you have a visa, show your visa conditions to someone, or get a copy of it, use VEVO . To access VEVO, you will need a reference number Working As an SCV holder you have the right to work in Australia. To confirm your permission to work, use VEVO As you have permission to work on the SCV, you have the protection of Australia's workplace law. You must follow these laws. See your workplace rights and entitlements. Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Get your super If you worked in Australia you may have some money in a superannuation fund. See how to access your super International Movement Record To prove you have been to Australia, ask for your international movement records",
  "main_content": "===== main placeholder ==========================================\nSubclass 444\n\n# Special Category visa (SCV)\n\nSpecial Category visa (SCV)\n\nThis temporary visa allows you to visit, study, stay, and work in Australia, if you are a New Zealand citizen and meet the eligibility criteria. It is usually applied for each time you enter Australia.\n\nThis temporary visa allows you to visit, study, stay, and work in Australia, if you are a New Zealand citizen and meet the eligibility criteria. It is usually applied for each time you enter Australia.\n\nThis temporary visa allows you to visit, study, stay, and work in Australia, if you are a New Zealand citizen and meet the eligibility criteria. It is usually applied for each time you enter Australia.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nFrom the time you are granted the visa until you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\n\nFrom the time you are granted the visa until you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\n\n#### Cost\n\nCost\n\nFree\n\nFree\n\n#### Processing times\n\nProcessing times\n\nIf you apply on arrival in Australia, your application will be processed at the airport or seaport.\n\nIf you apply on arrival in Australia, your application will be processed at the airport or seaport.\n\nIf you apply inside Australia, your application may take longer to process depending upon your individual circumstances.\n\nIf you apply inside Australia, your application may take longer to process depending upon your individual circumstances.\n\n#### With this visa, you can\n\nWith this visa, you can\n- enter and stay in Australia for as long as you are aNew Zealand citizen\nenter and stay in Australia for as long as you are a\nNew Zealand citizen\n- visit, work and study in Australia\nvisit, work and study in Australia\n- apply for a permanent visa if eligible\napply for a permanent visa if eligible\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- remain aNew Zealand citizen\nremain a\nNew Zealand citizen\n- continue to meet thecharacterrequirements.\ncontinue to meet the\ncharacter\nrequirements.\nAbout this visa\nWith this visa you can\nHow long you can stay\nInclude family\nCost\nApply\nYour obligations\nHealth insurance\nTravel\nTravelling as a permanent visa holder\nEligible New Zealand citizen (or Protected SCV holder)\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- enter and stay in Australia for as long as you are and continue to remain aNew Zealand citizen\nenter and stay in Australia for as long as you are and continue to remain a\nNew Zealand citizen\n- visit, work and study in Australia\nvisit, work and study in Australia\n- apply for a permanent visa if eligible\napply for a permanent visa if eligible\n\n## How long you can stay\n\nHow long you can stay\n\nThe visa starts on the date we grant you the visa.\n\nThe visa starts on the date we grant you the visa.\n\nThe visa ceases on the date you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\n\nThe visa ceases on the date you leave Australia, unless it ceases because of other reasons. These may include if we grant you a permanent visa, you become an Australian citizen, or we cancel the visa. When you leave Australia your visa will cease. You must apply for a new SCV if you want to enter Australia again.\n\n## Include family\n\nInclude family\n\nEach family member needs to make their own SCV application. They can do this by showing a valid New Zealand passport and completed incoming passenger card to an officer. They can also answer the health and character questions onSmartGate.\n\nEach family member needs to make their own SCV application. They can do this by showing a valid New Zealand passport and completed incoming passenger card to an officer. They can also answer the health and character questions on\nSmartGate\n.\n\nIf family members are not New Zealand citizens, they need to apply foranother visa.\n\nIf family members are not New Zealand citizens, they need to apply for\nanother visa\n.\n\n## Cost\n\nCost\n\nThere is no application charge for this visa.\n\nThere is no application charge for this visa.\n\n## Apply\n\nApply\n\nYou usually apply for this visa when you enter Australia.\n\nYou usually apply for this visa when you enter Australia.\n\nIn some cases, you may be able to apply for this visa after you have entered Australia. This might be the case if you:\n\nIn some cases, you may be able to apply for this visa after you have entered Australia. This might be the case if you:\n- became a New Zealand citizen and passport holder after you entered Australia\nbecame a New Zealand citizen and passport holder after you entered Australia\n- entered on a passport that is not a New Zealand passport\nentered on a passport that is not a New Zealand passport\n- entered on another temporary visa, or\nentered on another temporary visa, or\n- had a New Zealand citizen baby born in Australia.\nhad a New Zealand citizen baby born in Australia.\n\nIn these cases you can apply by completing ouronline form. If we grant you the SCV after you have entered Australia the grant date will be the date of the decision. We can't backdate it to your original entry date.\n\nIn these cases you can apply by completing our\nonline form\n. If we grant you the SCV after you have entered Australia the grant date will be the date of the decision. We can't backdate it to your original entry date.\n\nIf you had a child born in Australia to an SCV holding parenton or before 30 June 2022,ensure that the child has been registered as a New Zealand Citizen and has received a New Zealand citizenship certificate and/or a New Zealand passport. For further information seeNew Zealand citizenship.\n\nIf you had a child born in Australia to an SCV holding parent\non or before 30 June 2022,\nensure that the child has been registered as a New Zealand Citizen and has received a New Zealand citizenship certificate and/or a New Zealand passport. For further information see\nNew Zealand citizenship\n.\n\nOnce you receive the New Zealand citizenship certificate and/or passport you can submit an onshore SCV application via theOnshore visa application form.\n\nOnce you receive the New Zealand citizenship certificate and/or passport you can submit an onshore SCV application via the\nOnshore visa application form\n.\n\nIf you had a child born to an SCV holding parenton or after 1 July 2022your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for theirproof of citizenship.\n\nIf you had a child born to an SCV holding parent\non or after 1 July 2022\nyour child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their\nproof of citizenship\n.\n\nFor further information seeYou had a baby.\n\nFor further information see\nYou had a baby\n.\n\n### Check if you already hold a visa\n\nCheck if you already hold a visa\n\nBefore submitting an application check if you already hold a visa or get a copy of it by usingVEVO. To access VEVO you will need areference number.\n\nBefore submitting an application check if you already hold a visa or get a copy of it by using\nVEVO\n. To access VEVO you will need a\nreference number\n.\n\n## Your obligations\n\nYour obligations\n\nYou must remain a New Zealand citizen while you hold this visa. If your citizenship status changes, and you are no longer a New Zealand citizen, your SCV will cease. To remain lawful you must apply for and we must grant you a different visa.\n\nYou must remain a New Zealand citizen while you hold this visa. If your citizenship status changes, and you are no longer a New Zealand citizen, your SCV will cease. To remain lawful you must apply for and we must grant you a different visa.\n\nYou must obey Australian laws while you remain in Australia.\n\nYou must obey Australian laws while you remain in Australia.\n\nAll visa holders must continue to meet thecharacter requirements. If you don't, we maycancel your visa.\n\nAll visa holders must continue to meet the\ncharacter requirements\n. If you don't, we may\ncancel your visa\n.\n\n## Health insurance\n\nHealth insurance\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You may be liable for your own healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nWe recommend you take out health insurance to cover any unforeseen medical treatment you might need in Australia. You may be liable for your own healthcare costs while you are in Australia. Insurance can help limit your financial liability.\n\nSee what we consideradequate health insurance.\n\nSee what we consider\nadequate health insurance\n.\n\nLearn more abouthealth insurance for overseas visitors.\n\nLearn more about\nhealth insurance for overseas visitors\n.\n\nLearn more aboutMedicarefor New Zealand citizens.\n\nLearn more about\nMedicare\nfor New Zealand citizens.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Travel\n\nTravel\n\nYou can't travel outside Australia and return on this visa. If you leave Australia the visa will cease. If you return to Australia you must apply for a new SCV when you return.\n\nYou can't travel outside Australia and return on this visa. If you leave Australia the visa will cease. If you return to Australia you must apply for a new SCV when you return.\n\n## Travelling as a permanent visa holder\n\nTravelling as a permanent visa holder\n\nWe may manually process your entry into Australia. If you hold a permanent visa (with a valid travel facility), you need to tell us that you do not want an SCV. If you do not tell us, we may grant you the SCV. This may later affect your eligibility for a Resident Return visa.\n\nWe may manually process your entry into Australia. If you hold a permanent visa (with a valid travel facility), you need to tell us that you do not want an SCV. If you do not tell us, we may grant you the SCV. This may later affect your eligibility for a Resident Return visa.\n\nMore information is inoverseas travel as a permanent resident.\n\nMore information is in\noverseas travel as a permanent resident\n.\n\n## Eligible New Zealand citizen (or Protected SCV holder)\n\nEligible New Zealand citizen (or Protected SCV holder)\n\nSee Eligible New Zealand citizen (or Protected SCV holder) underEntitlements\n\nSee Eligible New Zealand citizen (or Protected SCV holder) under\nEntitlements\n\nMore information is inoverseas travel as a permanent resident.\n\nMore information is in\noverseas travel as a permanent resident\n.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Have a valid New Zealand passport\n\nHave a valid New Zealand passport\n\n## Not be a behaviour concern non-citizen\n\nNot be a behaviour concern non-citizen\nDetails\n\nIf we assess you are a behaviour concern non-citizen (BCNC), we may refuse to grant you an SCV. We may refuse your entry into Australia.\n\nIf we assess you are a behaviour concern non-citizen (BCNC), we may refuse to grant you an SCV. We may refuse your entry into Australia.\n\nYou could be assessed as a BCNC if you have been:\n\nYou could be assessed as a BCNC if you have been:\n- convicted of a crime that has resulted in a sentence of death or imprisonment for at least one year\nconvicted of a crime that has resulted in a sentence of death or imprisonment for at least one year\n- convicted of two or more crimes resulting in sentences of imprisonment for periods that total at least one year\nconvicted of two or more crimes resulting in sentences of imprisonment for periods that total at least one year\n- charged with, and found guilty of a crime while of unsound mind. This also includes if you were found not guilty because the crime was committed while of unsound mind\ncharged with, and found guilty of a crime while of unsound mind. This also includes if you were found not guilty because the crime was committed while of unsound mind\n- removed or deported from Australia in the past\nremoved or deported from Australia in the past\n- removed, deported or excluded from another country in the past.\nremoved, deported or excluded from another country in the past.\n\nNote:Sentenced to imprisonment includes ordered to be confined in a corrective institution.\n\nNote:\nSentenced to imprisonment includes ordered to be confined in a corrective institution.\n\nIf you have concerns about your eligibility for the SCV, you can check by using our online webform before you travel:Enquiry Form – New Zealand passport holders travelling with a criminal conviction.\n\nIf you have concerns about your eligibility for the SCV, you can check by using our online webform before you travel:\nEnquiry Form – New Zealand passport holders travelling with a criminal conviction\n.\n\n## Not be a health concern non-citizen\n\nNot be a health concern non-citizen\nDetails\n\nWe may assess you as a health concern non-citizen if you declare when you enter Australia that you have tuberculosis (TB).\n\nWe may assess you as a health concern non-citizen if you declare when you enter Australia that you have tuberculosis (TB).\n\nIf you declare that you have TB we will ask you to give us more information.\n\nIf you declare that you have TB we will ask you to give us more information.\n\n## Not have a 'no further stay' visa condition\n\nNot have a 'no further stay' visa condition\n\nYou can't apply for this visa if you currently hold a visa that has a 'no further stay' condition.\n\nYou can't apply for this visa if you currently hold a visa that has a 'no further stay' condition.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nIf you had a child born in Australia to an SCV holding parenton or after 1 July 2022your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for theirproof of citizenship. They do not need to apply for an SCV first.\n\nIf you had a child born in Australia to an SCV holding parent\non or after 1 July 2022\nyour child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their\nproof of citizenship\n. They do not need to apply for an SCV first.\n\nEnsure you have a valid New Zealand passport before you travel to Australia.\n\nEnsure you have a valid New Zealand passport before you travel to Australia.\n\nYou can't apply for this visa on your entry to Australia if you already hold another temporary visa. If you already hold a temporary visa you can apply for an SCV after you have entered Australia.\n\nYou can't apply for this visa on your entry to Australia if you already hold another temporary visa. If you already hold a temporary visa you can apply for an SCV after you have entered Australia.\n\nYou can't apply for this visa if you currently hold a pemanent visa or a visa that has a 'no further stay' condition.\n\nYou can't apply for this visa if you currently hold a pemanent visa or a visa that has a 'no further stay' condition.\nShow\n                    steps\n\n#### Check your visa details and status\n\nCheck your visa details and status\n\nBefore submitting an onshore SCV visa application check if you already hold a visa by using VEVO. To access VEVO, you will need areference number.\n\nBefore submitting an onshore SCV visa application check if you already hold a visa by using VEVO. To access VEVO, you will need a\nreference number\n.\n\nPlease see theStay lawfulsection below for Bridging visa information.\n\nPlease see the\nStay lawful\nsection below for Bridging visa information.\nSee how\n\n#### Check your passport\n\nCheck your passport\n\nYou must have a valid New Zealand passport to be granted this visa.\n\nYou must have a valid New Zealand passport to be granted this visa.\n\nYour visa will be linked to the passport number in your application. If you plan to get a new passport, do so before you apply.\n\nYour visa will be linked to the passport number in your application. If you plan to get a new passport, do so before you apply.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\nShow\n                    steps\n\n#### Valid New Zealand passport\n\nValid New Zealand passport\n\nIf you are applying for the SCV on or after your entry into Australia you will need your valid New Zealand passport with you.\n\nIf you are applying for the SCV on or after your entry into Australia you will need your valid New Zealand passport with you.\nSee how\n\n#### Australian Birth Certificate\n\nAustralian Birth Certificate\n\nIf you were born in Australiaon or before 30 June 2022and have not departed you will need to provide a copy of your Australian Birth Certificate with your onshore SCV application.\n\nIf you were born in Australia\non or before 30 June 2022\nand have not departed you will need to provide a copy of your Australian Birth Certificate with your onshore SCV application.\n\nYou will also need to provide evidence of your New Zealand citizenship. You may need to be registered as a New Zealand citizen first. For further information seeNew Zealand citizenship.\n\nYou will also need to provide evidence of your New Zealand citizenship. You may need to be registered as a New Zealand citizen first. For further information see\nNew Zealand citizenship\n.\nSee how\n\n#### Provide accurate documents\n\nProvide accurate documents\n\nProvideaccurate information.\n\nProvide\naccurate information\n.\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You don't need to have any documents certified unless we ask you to.\n\nNote: You don't need to have any documents certified unless we ask you to.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nWhen you enter Australia show your completed incoming passenger card with your valid New Zealand passport to an officer. You can also answer the health and character questions onSmartGate.\n\nWhen you enter Australia show your completed incoming passenger card with your valid New Zealand passport to an officer. You can also answer the health and character questions on\nSmartGate\n.\n\nIf applying after you have entered Australia, you will need toapply online.\n\nIf applying after you have entered Australia, you will need to\napply online\n.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvideaccurate information.\n\nProvide\naccurate information\n.\n\n#### Lodging an application after you have entered Australia\n\nLodging an application after you have entered Australia\n\nApply onlineto request an SCV appointment. Once your information has been received by the Department, you will be contacted with a date and time for your appointment. The Department may also contact you about any additional documentation that you may need to submit.\n\nApply online\nto request an SCV appointment. Once your information has been received by the Department, you will be contacted with a date and time for your appointment. The Department may also contact you about any additional documentation that you may need to submit.\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will usually process your visa application at the airport or seaport that you use to enter Australia.\n\nWe will usually process your visa application at the airport or seaport that you use to enter Australia.\n\nIf you apply after you have entered Australia, a decision may take longer.\n\nIf you apply after you have entered Australia, a decision may take longer.\nShow\n                    steps\n\n#### Wait for us to contact you\n\nWait for us to contact you\n\nFor applications made after you have entered Australia, we will contact you with a date and time for your appointment.\n\nFor applications made after you have entered Australia, we will contact you with a date and time for your appointment.\nSee how\n\n#### Status updates\n\nStatus updates\n\nWe can't give updates on applications. Wait for us to contact you.\n\nWe can't give updates on applications. Wait for us to contact you.\n\n#### Stay lawful\n\nStay lawful\n\nIf you apply for this visa after you have entered Australia, make sure you stay lawful. You can do this by holding a valid visa while we process your application.\n\nIf you apply for this visa after you have entered Australia, make sure you stay lawful. You can do this by holding a valid visa while we process your application.\n\nIf your current visa will expire before we decide your application, consider applying for a Bridging visa.\n\nIf your current visa will expire before we decide your application, consider applying for a Bridging visa.\n- If you hold a substantive visa at the time you lodge your application, you may be eligible for aBridging visa A. You can stay in Australia on the Bridging visa A while we process your new visa application.\nIf you hold a substantive visa at the time you lodge your application, you may be eligible for a\nBridging visa A\n. You can stay in Australia on the Bridging visa A while we process your new visa application.\n- If you do not hold a substantive visa at the time you lodge your application, you may be eligible for aBridging visa C. You can stay in Australia on the Bridging visa C while we process your new visa application.\nIf you do not hold a substantive visa at the time you lodge your application, you may be eligible for a\nBridging visa C\n. You can stay in Australia on the Bridging visa C while we process your new visa application.\n\nIf we cancel your current visa or it ceases, and you do not hold a Bridging visa, you:\n\nIf we cancel your current visa or it ceases, and you do not hold a Bridging visa, you:\n- will be staying in Australia unlawfully\nwill be staying in Australia unlawfully\n- may not be eligible for a Bridging visa\nmay not be eligible for a Bridging visa\n- may not be eligible for a Bridging visa B. This allows you to leave and re-enter Australia while we finalise your visa application\nmay not be eligible for a Bridging visa B. This allows you to leave and re-enter Australia while we finalise your visa application\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you may need to let us know about after you have applied include:\n\nThings you may need to let us know about after you have applied include:\n- changes to your phone number, email, address\nchanges to your phone number, email, address\n- changes to your citizenship (other than becoming an Australian citizen)\nchanges to your citizenship (other than becoming an Australian citizen)\n- the birth of a child\nthe birth of a child\n- if you want to withdraw your onshore application.\nif you want to withdraw your onshore application.\n\nSeehow to tell us if your situation changes.\n\nSee\nhow to tell us if your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will tell you if we have granted your visa. How we tell you will depend on how and where you applied.\n\nWe will tell you if we have granted your visa. How we tell you will depend on how and where you applied.\nShow\n                    steps\n\n#### If you applied on entry to Australia\n\nIf you applied on entry to Australia\n\nIf you meet all visa and immigration requirements, you will be:\n\nIf you meet all visa and immigration requirements, you will be:\n- granted the visa\ngranted the visa\n- immigration cleared.\nimmigration cleared.\n\nWe will add your visa electronically to your passport.\n\nWe will add your visa electronically to your passport.\n\nYou can check your visa status, conditions and expiry or get a copy of it inVEVO. To access VEVO, you will need areference number.\n\nYou can check your visa status, conditions and expiry or get a copy of it in\nVEVO\n. To access VEVO, you will need a\nreference number\n.\nSee how\n\n#### If you applied after you entered Australia\n\nIf you applied after you entered Australia\n\nWe will let you know our decision about your visa application in writing. We will link your visa to the New Zealand passport number in your application and tell you:\n\nWe will let you know our decision about your visa application in writing. We will link your visa to the New Zealand passport number in your application and tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions.\nyour visa conditions.\n\nKeep a copy of the decision for your records.\n\nKeep a copy of the decision for your records.\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n\nIf we refuse your visa we will let you know in writing. We will tell you:\n- why we refused your visa\nwhy we refused your visa\n- whether you have a right to a review of the decision.\nwhether you have a right to a review of the decision.\nSee how\nWhen you have this visa\nIn Australia\nLeaving Australia\n\n## In Australia\n\nIn Australia\n\n### Tell us about a change in your situation\n\nTell us about a change in your situation\n\nThings you may need to let us know about include:\n\nThings you may need to let us know about include:\n- changes to your phone number, email, address\nchanges to your phone number, email, address\n- changes to your citizenship (other than becoming an Australian citizen)\nchanges to your citizenship (other than becoming an Australian citizen)\n- the birth of a child\nthe birth of a child\n\nIf you had a child born in Australia to an SCV holding parenton or after 1 July 2022your child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for theirproof of citizenship.\n\nIf you had a child born in Australia to an SCV holding parent\non or after 1 July 2022\nyour child may have acquired Australian citizenship automatically by operation of law at the time of their birth. Children who meet these circumstances can apply for their\nproof of citizenship\n.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### What you can do on your visa\n\nWhat you can do on your visa\n\nCheck your visa status, conditions and expiry inVEVO.\n\nCheck your visa status, conditions and expiry in\nVEVO\n.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa, show your visa conditions to someone, or get a copy of it, useVEVO. To access VEVO, you will need areference number.\n\nTo prove you have a visa, show your visa conditions to someone, or get a copy of it, use\nVEVO\n. To access VEVO, you will need a\nreference number\n.\n\n### Working\n\nWorking\n\nAs an SCV holder you have the right to work in Australia. To confirm your permission to work, useVEVO.\n\nAs an SCV holder you have the right to work in Australia. To confirm your permission to work, use\nVEVO\n.\n\nAs you have permission to work on the SCV, you have the protection of Australia's workplace law. You must follow these laws.See your workplace rights and entitlements.\n\nAs you have permission to work on the SCV, you have the protection of Australia's workplace law. You must follow these laws.\nSee your workplace rights and entitlements.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Get your super\n\nGet your super\n\nIf you worked in Australia you may have some money in a superannuation fund.\n\nIf you worked in Australia you may have some money in a superannuation fund.\n\nSee how to access your super.\n\nSee how to access your super\n.\n\n#### International Movement Record\n\nInternational Movement Record\n\nTo prove you have been to Australia, ask for yourinternational movement records.\n\nTo prove you have been to Australia, ask for your\ninternational movement records\n.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-c-030",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/special-category-visa-subclass-444#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:21:27.355032",
  "metadata": {}
}