{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-practitioner-visa-subclass-422",
  "title": "Medical Practitioner visa (subclass 422)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Medical Practitioner visa (subclass 422) Page Content ​​​​You cannot apply for this visa. Check the visa finder tool to see which visa you can apply for. Visa holders Details How long your visa lasts Details This visa allows you and any family members who have also been granted the visa to: work in Australia for up to four years bring your family with you to Australia – they can work and study travel in and out of Australia any number of times as long as the visa is valid. Your obligations Details You and your family must comply with all visa conditions and Australian laws. Work in Australia Details You must: not stop being employed by the employer who sponsored you for the visa not work in a position or occupation that is inconsistent with the one for which your visa was granted. If your employment ends, you must do one of the following: find another employer who is willing to sponsor you for another appropriate visa (except for a Medical Practitioner (subclass 422) visa) apply for another type of visa leave Australia before your visa ends. Private health insurance Details You are responsible for all your health costs while you are in Australia. You and your family must have adequate private medical and hospital health insurance for the time you are in Australia unless your country has a reciprocal health care agreement with Australia and you are enrolled with Medicare. . You can use an insurance company from in or outside Australia. Taxation requirements Details You must comply with Australia’s taxation law if you work in Australia. The Australian Taxation Office's website has more information. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane. Adding a dependent Details If you need to add a dependent to your visa, you will need to contact the responsible processing centre The processing centre in Melbourne CBD is responsible for the following states: Northern Territory South Australia Tasmania and Victoria The processing center for Perth is responsible for the following states: Western Australia The Processing center for Sydney CBD is responsible for the following states: New South Wales South Australia Australian Capital Territory Sponsors Details How long the sponsorship lasts Details Your sponsorship of the medical practitioner lasts for the duration of their visa. Contact information Details If sponsorship information needs to be updated contact the responsible processing centre The processing centre in Melbourne CBD is responsible for the following states: Northern Territory South Australia Tasmania and Victoria The processing center for Perth is responsible for the following states: Western Australia The Processing center for Sydney CBD is responsible for the following states: New South Wales South Australia Australian Capital Territory",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Medical Practitioner visa (subclass 422)\n\nMedical Practitioner visa (subclass 422)\nPage Content\n\n​​​​You cannot apply for this visa.\n\n​​​​You cannot apply for this visa.\n\nCheck thevisa finder toolto see which visa you can apply for.\n\nCheck the\nvisa finder tool\nto see which visa you can apply for.\n\n## Visa holders\n\nVisa holders\nDetails\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThis visa allows you and any family members who have also been granted the visa to:\n\nThis visa allows you and any family members who have also been granted the visa to:\n- work in Australia for up to four years\nwork in Australia for up to four years\n- bring your family with you to Australia – they can work and study\nbring your family with you to Australia – they can work and study\n- travel in and out of Australia any number of times as long as the visa is valid.\ntravel in and out of Australia any number of times as long as the visa is valid.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou and your family must comply with all visa conditions and Australian laws.\n\nYou and your family must comply with all visa conditions and Australian laws.\n\n#### Work in Australia\n\nWork in Australia\nDetails\n\nYou must:\n\nYou must:\n- not stop being employed by the employer who sponsored you for the visa\nnot stop being employed by the employer who sponsored you for the visa\n- not work in a position or occupation that is inconsistent with the one for which your visa was granted.\nnot work in a position or occupation that is inconsistent with the one for which your visa was granted.\n\nIf your employment ends, you must do one of the following:\n\nIf your employment ends, you must do one of the following:\n- find another employer who is willing to sponsor you for another appropriate visa (except for a Medical Practitioner (subclass 422) visa)\nfind another employer who is willing to sponsor you for another appropriate visa (except for a Medical Practitioner (subclass 422) visa)\n- apply for another type of visa\napply for another type of visa\n- leave Australia before your visa ends.\nleave Australia before your visa ends.\n\n#### Private health insurance\n\nPrivate health insurance\nDetails\n\nYou are responsible for all your health costs while you are in Australia. You and your family must have adequate private medical and hospital health insurance for the time you are in Australia unless your country has areciprocal health care agreementwith Australia and you are enrolled withMedicare.. You can use an insurance company from in or outside Australia.\n\nYou are responsible for all your health costs while you are in Australia. You and your family must have adequate private medical and hospital health insurance for the time you are in Australia unless your country has a\nreciprocal health care agreement\nwith Australia and you are enrolled with\nMedicare.\n. You can use an insurance company from in or outside Australia.\n\n#### Taxation requirements\n\nTaxation requirements\nDetails\n\nYou must comply with Australia’s taxation law if you work in Australia. TheAustralian Taxation Office's websitehas more information.\n\nYou must comply with Australia’s taxation law if you work in Australia. The\nAustralian Taxation Office's website\nhas more information.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\n### Adding a dependent\n\nAdding a dependent\nDetails\n\nIf you need to add a dependent to your visa, you will need to contact theresponsible processing centre.\n\nIf you need to add a dependent to your visa, you will need to contact the\nresponsible processing centre\n.\n\nThe processing centre in Melbourne CBD is responsible for the following states:\n\nThe processing centre in Melbourne CBD is responsible for the following states:\n- Northern Territory\nNorthern Territory\n- South Australia\nSouth Australia\n- Tasmania and Victoria\nTasmania and Victoria\n\nThe processing center for Perth is responsible for the following states:\n\nThe processing center for Perth is responsible for the following states:\n- Western Australia\nWestern Australia\n\nThe Processing center for Sydney CBD is responsible for the following states:\n\nThe Processing center for Sydney CBD is responsible for the following states:\n- New South Wales\nNew South Wales\n- South Australia\nSouth Australia\n- Australian Capital Territory\nAustralian Capital Territory\n\n## Sponsors\n\nSponsors\nDetails\n\n### How long the sponsorship lasts\n\nHow long the sponsorship lasts\nDetails\n\nYour sponsorship of the medical practitioner lasts for the duration of their visa.\n\nYour sponsorship of the medical practitioner lasts for the duration of their visa.\n\n### Contact information\n\nContact information\nDetails\n\nIf sponsorship information needs to be updatedcontact the responsible processing centre\n\nIf sponsorship information needs to be updated\ncontact the responsible processing centre\n\nThe processing centre in Melbourne CBD is responsible for the following states:\n\nThe processing centre in Melbourne CBD is responsible for the following states:\n- Northern Territory\nNorthern Territory\n- South Australia\nSouth Australia\n- Tasmania and Victoria\nTasmania and Victoria\n\nThe processing center for Perth is responsible for the following states:\n\nThe processing center for Perth is responsible for the following states:\n- Western Australia\nWestern Australia\n\nThe Processing center for Sydney CBD is responsible for the following states:\n\nThe Processing center for Sydney CBD is responsible for the following states:\n- New South Wales\nNew South Wales\n- South Australia\nSouth Australia\n- Australian Capital Territory\nAustralian Capital Territory",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-practitioner-visa-subclass-422#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/medical-practitioner-visa-subclass-422#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:30:34.051133",
  "metadata": {}
}