{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/domestic-worker-temporary-diplomatic-consular-426",
  "title": "Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) Page Content ​​​​ The Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) closed on 24 November 2012. You cannot apply for this visa. You might be able to apply for the Temporary Work (International Relations) visa (subclass 403) Visa holders Details This information is for people who have already been granted a Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details The length of your Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) will depend on your individual circumstances and those of your employer. Your visa cannot last any longer than the length of the posting of your current employer. What this visa lets you do Details This visa allows you to: enter Australia temporarily work in the domestic duties in the household of someone who holds a Diplomatic (Temporary) visa (subclass 995) enter and leave Australia while your visa is valid. Your obligations Details You must comply with all visa conditions and Australian laws. During your stay in Australia you must: maintain adequate health insurance continue to meet the requirements of the visa stream you were granted meet Australian taxation obligations if you work in Australia. Visa holder obligations Details You must: work only in the household of your employer only work doing domestic duties not work for another person or for yourself not stay in Australia if your employer leaves permanently unless the Department of Foreign Affairs and Trade has agreed to you staying in Australia seek the agreement of the Department of Foreign Affairs and Trade if you want to transfer your employment and enter into a new employment agreement in the household of another diplomatic visa holder. Your sponsor’s obligations Details Your sponsor is your employer. They must: provide at least the minimum standards for wages and working conditions under Australian law make sure you leave Australia when your visa ends or when your job finishes, and pay the cost of our travel back to your home country. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to let us know if there is a change in your situation If you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\n\nDomestic Worker (Temporary) Diplomatic and Consular visa (subclass 426)\nPage Content\n\n​​​​\n\n​​​​\n\nThe Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) closed on 24 November 2012. You cannot apply for this visa.\n\nThe Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) closed on 24 November 2012. You cannot apply for this visa.\n\nYou might be able to apply for theTemporary Work (International Relations) visa (subclass 403).\n\nYou might be able to apply for the\nTemporary Work (International Relations) visa (subclass 403)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThe length of your Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) will depend on your individual circumstances and those of your employer.\n\nThe length of your Domestic Worker (Temporary) Diplomatic and Consular visa (subclass 426) will depend on your individual circumstances and those of your employer.\n\nYour visa cannot last any longer than the length of the posting of your current employer.\n\nYour visa cannot last any longer than the length of the posting of your current employer.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nThis visa allows you to:\n\nThis visa allows you to:\n- enter Australia temporarily\nenter Australia temporarily\n- work in the domestic duties in the household of someone who holds a Diplomatic (Temporary) visa (subclass 995)\nwork in the domestic duties in the household of someone who holds a Diplomatic (Temporary) visa (subclass 995)\n- enter and leave Australia while your visa is valid.\nenter and leave Australia while your visa is valid.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou must comply with all visa conditions and Australian laws.\n\nYou must comply with all visa conditions and Australian laws.\n\nDuring your stay in Australia you must:\n\nDuring your stay in Australia you must:\n- maintainadequate health insurance\nmaintain\nadequate health insurance\n- continue to meet the requirements of the visa stream you were granted\ncontinue to meet the requirements of the visa stream you were granted\n- meet Australian taxation obligations if you work in Australia.\nmeet Australian taxation obligations if you work in Australia.\n\n#### Visa holder obligations\n\nVisa holder obligations\nDetails\n\nYou must:\n\nYou must:\n- work only in the household of your employer\nwork only in the household of your employer\n- only work doing domestic duties\nonly work doing domestic duties\n- not work for another person or for yourself\nnot work for another person or for yourself\n- not stay in Australia if your employer leaves permanently unless the Department of Foreign Affairs and Trade has agreed to you staying in Australia\nnot stay in Australia if your employer leaves permanently unless the Department of Foreign Affairs and Trade has agreed to you staying in Australia\n- seek the agreement of the Department of Foreign Affairs and Trade if you want to transfer your employment and enter into a new employment agreement in the household of another diplomatic visa holder.\nseek the agreement of the Department of Foreign Affairs and Trade if you want to transfer your employment and enter into a new employment agreement in the household of another diplomatic visa holder.\n\n### Your sponsor’s obligations\n\nYour sponsor’s obligations\nDetails\n\nYour sponsor is your employer. They must:\n\nYour sponsor is your employer. They must:\n- provide at least the minimum standards for wages and working conditions under Australian law\nprovide at least the minimum standards for wages and working conditions under Australian law\n- make sure you leave Australia when your visa ends or when your job finishes, and pay the cost of our travel back to your home country.\nmake sure you leave Australia when your visa ends or when your job finishes, and pay the cost of our travel back to your home country.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.\n\nIf you do not provide us with the details of any new passport issued to you, you could experience significant delays at the airport and may be denied permission to board your plane.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/domestic-worker-temporary-diplomatic-consular-426#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/domestic-worker-temporary-diplomatic-consular-426#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:27:04.106654",
  "metadata": {}
}