{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190",
  "title": "Skilled Nominated visa",
  "raw_text": "===== main placeholder ========================================== Subclass 190 Skilled Nominated visa This visa lets nominated skilled workers live and work in Australia as permanent residents. Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay Permanently Cost From AUD4,910.00 Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa, you can work and study anywhere in Australia sponsor eligible relatives for permanent residence if eligible, become an Australian citizen See all conditions Check your eligibility You must have an occupation on the relevant skilled list have a suitable skills assessment for the occupation be invited to apply for this visa satisfy the points test Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application Process About this visa With this visa you can How long you can stay Include family Cost Apply from Processing times Travel Visa label With this visa you can stay in Australia permanently work and study in Australia attend free English language classes through the Adult Migrant English Program , if eligible enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, become an Australian citizen Newly arrived residents may need to wait before they can access certain Australian Government payments and benefits How long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. The visa has a travel component that expires 5 years after the date of visa grant. You become a permanent resident on the day we grant the visa. For citizenship purposes, your permanent residency starts on the day: we grant the visa, if you are in Australia you enter Australia on this visa, if you are outside Australia Include family You can include members of the family unit in your application. You can: include them when you lodge your visa application add them after you lodge your application but before we decide on your visa. Family members who apply for the visa must meet our health and character requirements. Family members not accompanying you to Australia might also need to meet our health and character requirements. If your partner or dependent children are not included in this application, to assist us in processing your visa please tell us the reason why. Cost The visa costs AUD4,910.00 for the main applicant. There is also a charge for each family member who applies for the visa with you. To work out what your visa will cost use the Visa Pricing Estimator You might have to pay an extra charge for any applicant 18 years old or older who has less than functional English . This charge is called the second instalment. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa. The second instalment charge for family members is AUD4,885. The Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks, police certificates and biometrics Apply from You can be in or outside Australia when you apply for the visa and when we decide your application but not in immigration clearance. If you apply in Australia, you must hold a substantive visa or a Subclass 010 Bridging A visa, a Subclass 020 Bridging B visa or a Subclass 030 Bridging C visa, otherwise your application will not be valid. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. We assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including: whether you have lodged a complete application, including all necessary supporting documents how quickly you respond to any requests for additional information how long it takes to perform required checks on the supporting information provided how long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements for permanent migration visa applications, how many places are available in the migration program Travel You can travel in and out of Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclass 155 or 157) to re-enter Australia as a permanent resident. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Eligibility Have this visa Details If you are in Australia at the time you apply, you must hold one of the following: a substantive visa Bridging visa A - BVA - (subclass 010) Bridging visa B - BVA - (subclass 020) Bridging visa C - BVC - (subclass 030) If you currently hold or your last substantive visa held was either: Skilled Work Regional (Provisional) (subclass 491); or Skilled Employer Sponsored Regional (Provisional) (subclass 494) You must have held that visa for at least 3 years at the time you apply. Be invited to apply Details You can only apply for this visa if we invite you to. See before you apply Submit an expression of interest (EOI) to let us know you would like to apply for the visa. After you have submitted an EOI, you might be nominated for the visa by a state or territory government. We will only invite you to apply for this visa if you are nominated. Be nominated Details You must have been nominated for this visa by an Australian state or territory government agency. Submit a completed expression of interest (EOI) in SkillSelect . State and territory government agencies can see your completed EOI and might nominate you for the visa. If you are nominated for the visa, we will invite you to apply. All state and territory government agencies have their own criteria for deciding who they will nominate. Contact the state or territory agency directly to find out more about their nomination process and what they want from you. Australian Capital Territory New South Wales Northern Territory Queensland South Australia Tasmania Victoria Western Australia If the state or territory agency that nominates you withdraws your nomination after you have applied, your application becomes invalid. Have a suitable skills assessment Details For your application to be valid, you must declare that you have a suitable skills assessment at the time of invitation. Delegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period. This change of approach is made as a result of the decision of Thapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs [2021] FCCA 686 ( Thapa ). The Minister will administer the Migration Regulations 1994 in accordance with the decision in Thapa , but the Minister reserves the right to make submissions in a Court that Thapa was wrongly decided. You will need to provide a copy of this skills assessment with your application. For medical and legal practitioners, we also accept the following as proof of a skills assessment: full or unconditional or general medical registration with the Australian Health Practitioner Regulation Agency conditional specialist registration with the Australian Health Practitioner Regulation Agency. This only allows you to practise in your speciality. You need no further training or supervision admission to practice law in the relevant state or territory Your skills assessment must have been obtained in the 3 years before the date of your invitation. If the assessment was for a shorter period, that period must not have passed. If your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS. Be this age Details You must be aged under 45 when we invite you to apply for the visa. You can still apply for the visa if you turn 45 after we invite you to apply. If you turn 45 after you submit your EOI but before we invite you to apply, you will not be invited to apply. Be able to score 65 points or more Details The subclass 190 is a points-tested visa. When you submit your EOI in SkillSelect you will be given an indicative points score based on the claims you have made. If you do not obtain a score of 65 points you will not be invited to apply for this visa. If we do invite you to apply for the visa, your invitation will state the number of points that you must score when we assess your application for grant of the visa (this score may be higher than 65 points, depending on your claims in the EOI). When you lodge your application you must provide evidence supporting your claims. To check how points can be awarded refer to the points calculator Have this level of English language Details At the time of invitation, you must have at least competent English Meet the skills requirement Details Your occupation must be on the relevant list of eligible skilled occupations for the 190 Skilled Nominated visa Meet our health requirement Details You and any family who apply for the visa with you must meet our health requirement If requested, family members not accompanying you to Australia might also need to meet our health requirement. Meet our character requirement Details You and family members aged 16 years and over who apply for the visa with you must meet our character requirement Family members not accompanying you to Australia must also meet the character requirement. Have paid back your debt to the Australian government Details If you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back. Sign the Australian values statement Details If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia and confirm you will respect the Australian way of life and obey Australian laws when you sign an Australian Values Statement Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply You must submit an expression of interest (EOI) through SkillSelect to let us know you want to apply for this visa. Show steps Organise health exams We prefer that you have any health checks before you apply for the visa. Find out the examinations you need and how to arrange them. Help with your EOI If you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you see Who can help you with your application See how Step 1.1 – Before you submit your EOI You must submit an expression of interest (EOI) to let us know you want to apply for this visa. See how Check your occupation Your occupation must be on the relevant list of eligible skilled occupations for the Skilled Nominated (subclass 190) visa. Get your skills assessed You must have a suitable skills assessment at the time we invite you to apply. The assessment must be undertaken by an assessing authority listed against your occupation in the list of eligible skilled occupations . You might have to pay for the assessment. To be eligible for a visa your skills assessment must have been obtained within the 3 years before the date of invitation. If the assessment was for a shorter period, that period must not have passed. We can't accept a skills assessment issued more than 3 years before the invitation date. If your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS. Medical practitioners For medical practitioners we accept evidence of registration issued by the Australian Health Practitioner Regulation Agency. You must hold either: unconditional or general medical registration conditional specialist registration – which allows you to practice only in your particular specialty with no further training or supervision requirements You must show that you hold this registration at the time we invite you to apply. Barristers and solicitors A suitable skills assessment for barristers and solicitors is evidence of admission to practice as a lawyer in an Australian state or territory. The relevant legal admissions authority must have admitted you to practice at the time we invite you to apply. See how Check your points You must be able to obtain at least 65 points on our points test to be eligible for this visa. If you cannot obtain 65 points we will not invite you to apply. If we invite you to apply for the visa, you must prove the claims you make in your EOI when we assess your application. Use the points calculator to check how many points you might score See how Check you meet the other eligibility criteria Check that you meet all other eligibility criteria for the visa. If we invite you to apply for the visa, you will have to support the claims you make in your EOI as well as other criteria if you submit an application. See what documents you will need to prove your claims before you submit your EOI in the Gather documents section below. See how Step 1.2 – Submit your EOI Submit your EOI via Skillselect . You can submit it from within or outside Australia. Your EOI is not a visa application. There is no fee for submitting an EOI. Select the Skill Nominated (subclass 190) visa. You will receive an email confirming your EOI has been submitted. See how Step 1.3 – After you submit your EOI SkillSelect will estimate your points score based on the claims made in your EOI. You must have an estimated score of at least 65 points to be invited to apply for this visa. Once your EOI is submitted it will be visible to state and territory governments. If you have the skills they need, a state or territory government agency might nominate you for the visa. If you are nominated, you will get an invitation to apply for this visa. See how Stay lawful An EOI is not a visa application. If you submit an EOI in Australia and your current visa is about to expire, you must apply for another visa to stay in Australia lawfully. You are not eligible for a bridging visa because the EOI is not a visa application. You are only eligible for a bridging visa after you are invited and apply for this visa. See how Make changes to your EOI Let us know through SkillSelect if: you want to apply for a different skilled visa your circumstances change - for example, if you change your occupation or your family structure changes you could score more points - for example, you have completed a higher qualification or gained new work experience your employment circumstances change and you are no longer working at least 20 hours per week in your nominated occupation You must be able to meet the points score on your invitation letter if we invite you to apply or you will not be granted a visa. SkillSelect will update your indicative points score if you make changes to your EOI. You can change your EOI at any time before we invite you to apply for a visa. See how Step 1.4 - Receive an invitation to apply for visa We allocate places for the skilled migration program to meet the Australian Government’s migration planning levels. Once invited, you have 60 calendar days to apply for the visa. We cannot extend this time. You could receive an invitation up to 2 years after submitting an EOI. If we invite you to apply you will receive an email from SkillSelect. Getting an invitation does not mean you will be granted the visa. The invitation will include the number of points you must score based on your EOI claims. After you apply for the visa, you must show that you: can meet the points score on your invitation (which will include proving any claims you made in your EOI) and can meet all other eligibility criteria If you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect. We will not process your visa application if you are 45 at the time of your invitation. See how If you can't show you meet the points score or other eligibility criteria If you can't show you meet the points score on your invitation or the other visa criteria, then do not apply for the visa. Your EOI will be suspended if an invitation is issued, but you can update information once the 60-day invitation period has passed. If this is your second invitation, you will have to submit another EOI if you still want the visa. See how Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents You will need to provide documents to support the claims you make in your EOI and show you meet the other visa criteria. Show steps Provide accurate information Provide accurate information. See what may happen if you can't prove your identity or do not provide true information Identity documents Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Relationship documents If you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations. If your partner or dependent child ren are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident) See how Character documents Provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. For immigration purposes, Australian police certificates are valid for 12 months from the date of issue. Also provide: an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16 military service records or discharge papers if you served in the armed forces of any country Complete and provide the following forms: Form 80 Personal particulars for assessment including character assessment (596KB PDF) Form 1221 Additional personal particulars information (331KB PDF) See how Competent English documents Provide proof you have at least competent English at time of invitation for this visa. Partner documents We need to see evidence of your partner 's identity and relationship with you. Provide: identity documents and photos character documents marriage certificate, if applicable documents about other relationships, if applicable For de facto relationship provide either: evidence that your relationship is registered by an Australian State or Territory enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply For both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Proof your partner has functional English You don't have to provide any documents to prove functional English if your partner is a citizen of and holds a valid passport from: the United Kingdom the Republic of Ireland the United States Canada New Zealand Otherwise, provide proof your partner has functional English If you can't show us your partner has functional English, you will need to pay the second instalment of the visa application charge when we ask you to. See how Dependants under 18 documents For every dependant 18 years old or younger who is applying with you, provide: copies of birth certificates or the family book showing the names of both parents of all your dependent children copies of the adoption paper, if applicable. Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) statutory declaration giving their consent for the child to migrate to Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable You don't have to prove that your dependant under 18 years of age has functional English. Note: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa. See how Dependants over 18 documents To include your child who is over 18 in your visa application, they must be: over 18 years of age but not yet turned 23, and dependent on you or your partner, or over 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner If your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability. Provide: identity documents documents about their other relationships, if applicable You must also provide proof the child is dependent on you. proof of your relationship with the dependant such as a birth certificate or adoption papers a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of financial dependency such as bank statements, money transfers and rent receipts if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions Note: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa. See how Proof your dependant has functional English You don't have to provide any documents to prove functional English if your dependant is a citizen of and holds a valid passport from: the United Kingdom the Republic of Ireland the United States Canada New Zealand Otherwise, provide proof your dependant has functional English If you can't show us your dependant has functional English, you will need to pay the second instalment of the visa application charge when we ask you to. See how Skills assessment documents You must provide documents that support the claims you made in your EOI. To check the documents you need use the points table . Depending on your claims this could include evidence of your: Skills assessment English language skills Australian and/or overseas skilled employment Educational qualifications Satisfying the Australian study requirement Specialist education Accredited community language Study in regional Australia Partner skills Professional Year in Australia Delegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period. This change of approach is made as a result of the decision of Thapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs [2021] FCCA 686 ( Thapa ). The Minister will administer the Migration Regulations 1994 in accordance with the decision in Thapa , but the Minister reserves the right to make submissions in a Court that Thapa was wrongly decided. Medical practitioners One of these certificates issued by the Australian Health Practitioner Regulation Agency: unconditional or general medical registration conditional specialist registration – which allows you to practice only in your speciality with no further training or supervision requirements You must be registered at the time we invite you to apply. Barristers and Solicitors Proof of admission to practice as a lawyer in the relevant state or territory. You must be admitted to practice at the time we invite you to apply. See how Expression of Interest (EOI) documents You must provide documents to prove all of the claims you made in your EOI. Use the points table to check the documents you need. See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Prepare your documents See how Translate Have all non-English documents translated into English. Provide original and translated documents in your application. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Step 3 Apply for the visa When you have your invitation you can apply online. You can be in or outside Australia. You have 60 days from the date of your invitation to apply for the visa. Show steps Provide accurate information Provide accurate information. See what may happen when you cannot prove your identity or do not provide true information Apply for this visa online in ImmiAccount Log into your SkillSelect account. In SkillSelect, click on the 'Apply for visa' button. This will take you to our online system, ImmiAccount. Log in or create an ImmiAccount. Your ImmiAccount login and password will not be the same as your SkillSelect login and password. Attach your documents Pay the application charge . We will not process your application until you pay the first instalment of the visa application charge. Note your transaction reference number (TRN). See how Step 4 After you apply We will let you know when we have received your application. If you are granted a bridging visa you will receive notification of your visa grant. Show steps Status updates We do not give updates on applications within the standard processing time. You can check if we need more information from you in ImmiAccount Travel after you apply If you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision. But if you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check VEVO Learn about visa expiry If you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa See how Health exams If you didn't have health examinations before you applied, we will let you know if you need them. Check ImmiAccount Biometrics We might ask for biometrics . We will let you know if you need to provide them. Attach more information If you did not attach all documents when you applied, attach them as soon as you can in ImmiAccount We might also ask you to provide more information; however; we are not obliged to do so and may make a decision on your application without requesting more documents. Stay lawful Make sure you stay lawful in Australia by holding a valid visa while we process your application. When you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application. Do not ask to have the visa you currently hold cancelled. If your visa is cancelled: you will be staying in Australia unlawfully your BVA will cease Learn more about visa expiry See how Pay the second instalment If you need to pay a second instalment, pay it when we send you the invoice. Add family You can add members of the family unit to your application after you apply but before we decide on your visa. Use Form 1436 Adding an additional applicant after lodgement (481KB PDF) , pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount. Family members who apply for the visa must meet our health and character requirements. Family members who are not coming to Australia do have to meet our character requirement and might have to meet our health requirement. See how Newborn children If your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible. Find out what to do your child is born after you apply Mistakes on your application You must tell us as soon as possible if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) and attach it to your application in ImmiAccount. Help with your application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about after you have applied include: changes to your phone number, email, address or passport changes to your marital or de facto status the birth of a child you want to withdraw your application See how to tell us if your situation changes See how Step 5 Visa outcome You can be in or outside Australia when we decide your visa application but not in immigration clearance . We will let you know our decision in writing. If we grant your visa, we will tell you: your visa grant number the date your visa starts your visa conditions, if applicable Keep a copy of the decision. If we refuse your visa, we will tell you: why we refused the visa whether you have a right to a review of the decision We will not refund the application charge if we refuse your application. When you have this visa Coming to Australia In Australia Leaving Australia Coming to Australia If you are outside Australia when the visa is granted, you must enter Australia before a date that we specify on your visa grant letter. Before you leave Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the border Completing an Incoming Passenger Card All people arriving in Australia must complete the Incoming Passenger Card . You will be given this card onboard. Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia stay in Australia permanently work and study enrol in Australia's public health care scheme, Medicare sponsor your relatives to come to Australia travel to and from Australia for 5 years if eligible, become an Australian citizen What you must do on this visa You and your family members must obey Australian laws. See how long you can stay This is a permanent visa. It lets you stay in Australia indefinitely. Travelling on your visa You can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a Resident Return (RRV) visa (subclasses 155 or 157) to re-enter Australia as a permanent resident. To see when the 5 years ends, use VEVO New Zealand passport holders If an immigration officer processes your clearance at our border, we recommend you tell them: you have a Skilled Nominated visa (subclass190) you do not want a Special Category visa (subclass 444) If you don't tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship. Proving you have a visa If you wish to provide evidence you have a visa and conditions to someone, use VEVO Working You are protected by Australian workplace law. See your workplace rights and entitlements. Bringing family As an Australian permanent resident, you might be able to sponsor eligible family to come to Australia. To find a visa for your family member, explore visa options Becoming an Australian citizen After a certain time, you might be eligible for Australian citizenship. Find out more about becoming a citizen For citizenship purposes, your permanent residence starts on the day: we grant the visa, if you were in Australia you entered Australia on this visa, if you were outside Australia when we granted it Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia and return. Ensure your visa is still valid and allows you to re-enter Australia. Check the travel component of your visa in VEVO See what to do if your visa has expired or is about to expire At the Border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use SmartGate After you leave Proving you have been to Australia To prove you have been to Australia, request your international movement records by completing the Request for international movement records form.",
  "main_content": "===== main placeholder ==========================================\nSubclass 190\n\n# Skilled Nominated visa\n\nSkilled Nominated visa\n\nThis visa lets nominated skilled workers live and work in Australia as permanent residents.\n\nThis visa lets nominated skilled workers live and work in Australia as permanent residents.\n\nThis visa lets nominated skilled workers live and work in Australia as permanent residents.\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nPermanently\n\nPermanently\n\n#### Cost\n\nCost\n\nFromAUD4,910.00\n\nFromAUD4,910.00\n\nFrom\nAUD4,910.00\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa, you can\n\nWith this visa, you can\n- work and study anywhere in Australia\nwork and study anywhere in Australia\n- sponsor eligible relatives for permanent residence\nsponsor eligible relatives for permanent residence\n- if eligible,become an Australian citizen\nif eligible,\nbecome an Australian citizen\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- have an occupation on the relevantskilled list\nhave an occupation on the relevant\nskilled list\n- have a suitableskills assessmentfor the occupation\nhave a suitable\nskills assessment\nfor the occupation\n- be invited to apply for this visa\nbe invited to apply for this visa\n- satisfy the points test\nsatisfy the points test\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\n\n### Process\n\nProcess\nAbout this visa\nWith this visa you can\nHow long you can stay\nInclude family\nCost\nApply from\nProcessing times\nTravel\nVisa label\n\n## With this visa you can\n\nWith this visa you can\n- stay in Australia permanently\nstay in Australia permanently\n- work and study in Australia\nwork and study in Australia\n- attend free English language classes through theAdult Migrant English Program, if eligible\nattend free English language classes through the\nAdult Migrant English Program\n, if eligible\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible,become an Australian citizen\nif eligible,\nbecome an Australian citizen\n\nNewly arrived residents may need towait before they can access certain Australian Government payments and benefits.\n\nNewly arrived residents may need to\nwait before they can access certain Australian Government payments and benefits\n.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely. The visa has a travel component that expires 5 years after the date of visa grant.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely. The visa has a travel component that expires 5 years after the date of visa grant.\n\nYou become a permanent resident on the day we grant the visa.\n\nYou become a permanent resident on the day we grant the visa.\n\nFor citizenship purposes, your permanent residency starts on the day:\n\nFor citizenship purposes, your permanent residency starts on the day:\n- we grant the visa, if you are in Australia\nwe grant the visa, if you are in Australia\n- you enter Australia on this visa, if you are outside Australia\nyou enter Australia on this visa, if you are outside Australia\n\n## Include family\n\nInclude family\n\nYou can includemembers of the family unitin your application. You can:\n\nYou can include\nmembers of the family unit\nin your application. You can:\n- include them when you lodge your visa application\ninclude them when you lodge your visa application\n- add them after you lodge your application but before we decide on your visa.\nadd them after you lodge your application but before we decide on your visa.\n\nFamily members who apply for the visa must meet ourhealthandcharacterrequirements. Family members not accompanying you to Australia might also need to meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa must meet our\nhealth\nand\ncharacter\nrequirements. Family members not accompanying you to Australia might also need to meet our\nhealth\nand\ncharacter\nrequirements.\n\nIf your partner or dependent children are not included in this application, to assist us in processing your visa please tell us the reason why.\n\nIf your partner or dependent children are not included in this application, to assist us in processing your visa please tell us the reason why.\n\n## Cost\n\nCost\n\nThe visa costsAUD4,910.00for the main applicant.\n\nThe visa costs\nAUD4,910.00\nfor the main applicant.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nTo work out what your visa will cost use theVisa Pricing Estimator.\n\nTo work out what your visa will cost use the\nVisa Pricing Estimator\n.\n\nYou might have to pay an extra charge for any applicant 18 years old or older who has less thanfunctional English. This charge is called the second instalment. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa.\n\nYou might have to pay an extra charge for any applicant 18 years old or older who has less than\nfunctional English\n. This charge is called the second instalment. Pay it only when we ask you to. We ask for the charge only if we are going to grant the visa.\n\nThe second instalment charge for family members is AUD4,885.\n\nThe second instalment charge for family members is AUD4,885.\n\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks,police certificatesandbiometrics.\n\nThe Visa Pricing Estimator does not include the second instalment or other costs. You might also have to pay other costs for health checks,\npolice certificates\nand\nbiometrics\n.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa and when we decide your application but not in immigration clearance.\n\nYou can be in or outside Australia when you apply for the visa and when we decide your application but not in immigration clearance.\n\nIf you apply in Australia, you must hold asubstantive visaor a Subclass 010 Bridging A visa, a Subclass 020 Bridging B visa or a Subclass 030 Bridging C visa, otherwise your application will not be valid.\n\nIf you apply in Australia, you must hold a\nsubstantive visa\nor a Subclass 010 Bridging A visa, a Subclass 020 Bridging B visa or a Subclass 030 Bridging C visa, otherwise your application will not be valid.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n\nWe assess applications on a case-by-case basis, and actual processing times can vary due to individual circumstances including:\n- whether you have lodged a complete application, including all necessary supporting documents\nwhether you have lodged a complete application, including all necessary supporting documents\n- how quickly you respond to any requests for additional information\nhow quickly you respond to any requests for additional information\n- how long it takes to perform required checks on the supporting information provided\nhow long it takes to perform required checks on the supporting information provided\n- how long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\nhow long it takes to receive additional information from external agencies, particularly in relation to health, character, and national security requirements\n- for permanent migration visa applications, how many places are available in the migration program\nfor permanent migration visa applications, how many places are available in the migration program\n\n## Travel\n\nTravel\n\nYou can travel in and out of Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need aResident Return (RRV) visa (subclass 155 or 157)to re-enter Australia as a permanent resident.\n\nYou can travel in and out of Australia as many times as you want for 5 years from the date we grant the visa. After 5 years you will need a\nResident Return (RRV) visa (subclass 155 or 157)\nto re-enter Australia as a permanent resident.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\nEligibility\n\n## Have this visa\n\nHave this visa\nDetails\n\nIf you are in Australia at the time you apply, you must hold one of the following:\n\nIf you are in Australia at the time you apply, you must hold one of the following:\n- a substantive visa\na substantive visa\n- Bridging visa A - BVA - (subclass 010)\nBridging visa A - BVA - (subclass 010)\n- Bridging visa B - BVA - (subclass 020)\nBridging visa B - BVA - (subclass 020)\n- Bridging visa C - BVC - (subclass 030)\nBridging visa C - BVC - (subclass 030)\n\nIf you currently hold or your last substantive visa held was either:\n\nIf you currently hold or your last substantive visa held was either:\n- Skilled Work Regional (Provisional) (subclass 491);or\nSkilled Work Regional (Provisional) (subclass 491);\nor\n- Skilled Employer Sponsored Regional (Provisional) (subclass 494)\nSkilled Employer Sponsored Regional (Provisional) (subclass 494)\n\nYou must have held that visa for at least 3 years at the time you apply.\n\nYou must have held that visa for at least 3 years at the time you apply.\n\n## Be invited to apply\n\nBe invited to apply\nDetails\n\nYou can only apply for this visa if we invite you to. Seebefore you apply.\n\nYou can only apply for this visa if we invite you to. See\nbefore you apply\n.\n\nSubmit anexpression of interest (EOI)to let us know you would like to apply for the visa.\n\nSubmit an\nexpression of interest (EOI)\nto let us know you would like to apply for the visa.\n\nAfter you have submitted an EOI, you might be nominated for the visa by a state or territory government. We will only invite you to apply for this visa if you are nominated.\n\nAfter you have submitted an EOI, you might be nominated for the visa by a state or territory government. We will only invite you to apply for this visa if you are nominated.\n\n## Be nominated\n\nBe nominated\nDetails\n\nYou must have been nominated for this visa by an Australian state or territory government agency.\n\nYou must have been nominated for this visa by an Australian state or territory government agency.\n\nSubmit a completedexpression of interest (EOI)inSkillSelect. State and territory government agencies can see your completed EOI and might nominate you for the visa.\n\nSubmit a completed\nexpression of interest (EOI)\nin\nSkillSelect\n. State and territory government agencies can see your completed EOI and might nominate you for the visa.\n\nIf you are nominated for the visa, we will invite you to apply.\n\nIf you are nominated for the visa, we will invite you to apply.\n\nAll state and territory government agencies have their own criteria for deciding who they will nominate. Contact the state or territory agency directly to find out more about their nomination process and what they want from you.\n\nAll state and territory government agencies have their own criteria for deciding who they will nominate. Contact the state or territory agency directly to find out more about their nomination process and what they want from you.\n- Australian Capital Territory\nAustralian Capital Territory\n- New South Wales\nNew South Wales\n- Northern Territory\nNorthern Territory\n- Queensland\nQueensland\n- South Australia\nSouth Australia\n- Tasmania\nTasmania\n- Victoria\nVictoria\n- Western Australia\nWestern Australia\n\nIf the state or territory agency that nominates you withdraws your nomination after you have applied, your application becomes invalid.\n\nIf the state or territory agency that nominates you withdraws your nomination after you have applied, your application becomes invalid.\n\n## Have a suitable skills assessment\n\nHave a suitable skills assessment\nDetails\n\nFor your application to be valid, you must declare that you have a suitableskills assessmentat the time of invitation.\n\nFor your application to be valid, you must declare that you have a suitable\nskills assessment\nat the time of invitation.\n\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\n\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\n\nThis change of approach is made as a result of the decision ofThapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs[2021] FCCA 686 (Thapa). The Minister will administer the Migration Regulations 1994 in accordance with the decision inThapa, but the Minister reserves the right to make submissions in a Court thatThapawas wrongly decided.\n\nThis change of approach is made as a result of the decision of\nThapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs\n[2021] FCCA 686 (\nThapa\n). The Minister will administer the Migration Regulations 1994 in accordance with the decision in\nThapa\n, but the Minister reserves the right to make submissions in a Court that\nThapa\nwas wrongly decided.\n\nYou will need to provide a copy of this skills assessment with your application.\n\nYou will need to provide a copy of this skills assessment with your application.\n\nFor medical and legal practitioners, we also accept the following as proof of a skills assessment:\n\nFor medical and legal practitioners, we also accept the following as proof of a skills assessment:\n- full or unconditional or general medical registration with the Australian Health Practitioner Regulation Agency\nfull or unconditional or general medical registration with the Australian Health Practitioner Regulation Agency\n- conditional specialist registration with the Australian Health Practitioner Regulation Agency. This only allows you to practise in your speciality. You need no further training or supervision\nconditional specialist registration with the Australian Health Practitioner Regulation Agency. This only allows you to practise in your speciality. You need no further training or supervision\n- admission to practice law in the relevant state or territory\nadmission to practice law in the relevant state or territory\n\nYour skills assessment must have been obtained in the 3 years before the date of your invitation. If the assessment was for a shorter period, that period must not have passed.\n\nYour skills assessment must have been obtained in the 3 years before the date of your invitation. If the assessment was for a shorter period, that period must not have passed.\n\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\n\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\n\n## Be this age\n\nBe this age\nDetails\n\nYou must be aged under 45 when we invite you to apply for the visa.\n\nYou must be aged under 45 when we invite you to apply for the visa.\n\nYou can still apply for the visa if you turn 45afterwe invite you to apply.\n\nYou can still apply for the visa if you turn 45\nafter\nwe invite you to apply.\n\nIf you turn 45 after you submit your EOI butbeforewe invite you to apply, you will not be invited to apply.\n\nIf you turn 45 after you submit your EOI but\nbefore\nwe invite you to apply, you will not be invited to apply.\n\n## Be able to score 65 points or more\n\nBe able to score 65 points or more\nDetails\n\nThe subclass 190 is a points-tested visa.\n\nThe subclass 190 is a points-tested visa.\n\nWhen you submit your EOI in SkillSelect you will be given an indicative points score based on the claims you have made. If you do not obtain a score of 65 points you will not be invited to apply for this visa.\n\nWhen you submit your EOI in SkillSelect you will be given an indicative points score based on the claims you have made. If you do not obtain a score of 65 points you will not be invited to apply for this visa.\n\nIf we do invite you to apply for the visa, your invitation will state the number of points that you must score when we assess your application for grant of the visa (this score may be higher than 65 points, depending on your claims in the EOI).\n\nIf we do invite you to apply for the visa, your invitation will state the number of points that you must score when we assess your application for grant of the visa (this score may be higher than 65 points, depending on your claims in the EOI).\n\nWhen you lodge your application you must provide evidence supporting your claims.\n\nWhen you lodge your application you must provide evidence supporting your claims.\n\nTo check how points can be awarded refer to thepoints calculator.\n\nTo check how points can be awarded refer to the\npoints calculator\n.\n\n## Have this level of English language\n\nHave this level of English language\nDetails\n\nAt the time of invitation, you must have at leastcompetent English.\n\nAt the time of invitation, you must have at least\ncompetent English\n.\n\n## Meet the skills requirement\n\nMeet the skills requirement\nDetails\n\nYour occupation must be on the relevant list of eligibleskilled occupationsfor the 190 Skilled Nominated visa\n\nYour occupation must be on the relevant list of eligible\nskilled occupations\nfor the 190 Skilled Nominated visa\n\n## Meet our health requirement\n\nMeet our health requirement\nDetails\n\nYou and any family who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family who apply for the visa with you must meet our\nhealth requirement\n.\n\nIf requested, family members not accompanying you to Australia might also need to meet our health requirement.\n\nIf requested, family members not accompanying you to Australia might also need to meet our health requirement.\n\n## Meet our character requirement\n\nMeet our character requirement\nDetails\n\nYou and family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirement\n.\n\nFamily members not accompanying you to Australia must also meet the character requirement.\n\nFamily members not accompanying you to Australia must also meet the character requirement.\n\n## Have paid back your debt to the Australian government\n\nHave paid back your debt to the Australian government\nDetails\n\nIf you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\n\nIf you or any family members (including those who do not apply for the visa with you) owe the Australian Government money, you or they must have paid it back or arranged to pay it back.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must:\n\nIf you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australiaand\nhave read, or had explained to you, the\nLife in Australia\nand\n- confirm you will respect the Australian way of life and obey Australian laws when you sign anAustralian Values Statement\nconfirm you will respect the Australian way of life and obey Australian laws when you sign an\nAustralian Values Statement\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nYou must submit an expression of interest (EOI) throughSkillSelectto let us know you want to apply for this visa.\n\nYou must submit an expression of interest (EOI) through\nSkillSelect\nto let us know you want to apply for this visa.\nShow\n                    steps\n\n#### Organise health exams\n\nOrganise health exams\n\nWe prefer that you have any health checks before you apply for the visa.\n\nWe prefer that you have any health checks before you apply for the visa.\n\nFind out theexaminations you needand how to arrange them.\n\nFind out the\nexaminations you need\nand how to arrange them.\n\n#### Help with your EOI\n\nHelp with your EOI\n\nIf you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you seeWho can help you with your application.\n\nIf you need help with your EOI you can use a registered migration agent or legal practitioner. For information on how to find someone to help you see\nWho can help you with your application\n.\nSee how\n\n#### Step 1.1 – Before you submit your EOI\n\nStep 1.1 – Before you submit your EOI\n\nYou must submit an expression of interest (EOI) to let us know you want to apply for this visa.\n\nYou must submit an expression of interest (EOI) to let us know you want to apply for this visa.\nSee how\n\n#### Check your occupation\n\nCheck your occupation\n\nYour occupation must be on the relevantlist of eligible skilled occupationsfor the Skilled Nominated (subclass 190) visa.\n\nYour occupation must be on the relevant\nlist of eligible skilled occupations\nfor the Skilled Nominated (subclass 190) visa.\n\n#### Get your skills assessed\n\nGet your skills assessed\n\nYou must have a suitableskills assessmentat the time we invite you to apply.\n\nYou must have a suitable\nskills assessment\nat the time we invite you to apply.\n\nThe assessment must be undertaken by an assessing authority listed against your occupation in thelist of eligible skilled occupations. You might have to pay for the assessment.\n\nThe assessment must be undertaken by an assessing authority listed against your occupation in the\nlist of eligible skilled occupations\n. You might have to pay for the assessment.\n\nTo be eligible for a visa your skills assessment must have been obtained within the 3 years before the date of invitation. If the assessment was for a shorter period, that period must not have passed.  We can't accept a skills assessment issued more than 3 years before the invitation date.\n\nTo be eligible for a visa your skills assessment must have been obtained within the 3 years before the date of invitation. If the assessment was for a shorter period, that period must not have passed.  We can't accept a skills assessment issued more than 3 years before the invitation date.\n\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\n\nIf your skills were assessed on the basis of a qualification you got in Australia when you held a student visa, the qualification must be from studying a course registered on CRICOS.\n\n#### Medical practitioners\n\nMedical practitioners\n\nFor medical practitioners we accept evidence of registration issued by the Australian Health Practitioner Regulation Agency. You must hold either:\n\nFor medical practitioners we accept evidence of registration issued by the Australian Health Practitioner Regulation Agency. You must hold either:\n- unconditional or general medical registration\nunconditional or general medical registration\n- conditional specialist registration – which allows you to practice only in your particular specialty with no further training or supervision requirements\nconditional specialist registration – which allows you to practice only in your particular specialty with no further training or supervision requirements\n\nYou must show that you hold this registration at the time we invite you to apply.\n\nYou must show that you hold this registration at the time we invite you to apply.\n\n#### Barristers and solicitors\n\nBarristers and solicitors\n\nA suitable skills assessment for barristers and solicitors is evidence of admission to practice as a lawyer in an Australian state or territory.\n\nA suitable skills assessment for barristers and solicitors is evidence of admission to practice as a lawyer in an Australian state or territory.\n\nThe relevant legal admissions authority must have admitted you to practice at the time we invite you to apply.\n\nThe relevant legal admissions authority must have admitted you to practice at the time we invite you to apply.\nSee how\n\n#### Check your points\n\nCheck your points\n\nYou must be able to obtain at least 65 points on our points test to be eligible for this visa. If you cannot obtain 65 points we will not invite you to apply.\n\nYou must be able to obtain at least 65 points on our points test to be eligible for this visa. If you cannot obtain 65 points we will not invite you to apply.\n\nIf we invite you to apply for the visa, you must prove the claims you make in your EOI when we assess your application.\n\nIf we invite you to apply for the visa, you must prove the claims you make in your EOI when we assess your application.\n\nUse thepoints calculatorto check how many points you might score\n\nUse the\npoints calculator\nto check how many points you might score\nSee how\n\n#### Check you meet the other eligibility criteria\n\nCheck you meet the other eligibility criteria\n\nCheck that you meet all other eligibility criteria for the visa.\n\nCheck that you meet all other eligibility criteria for the visa.\n\nIf we invite you to apply for the visa, you will have to support the claims you make in your EOI as well as other criteria if you submit an application.\n\nIf we invite you to apply for the visa, you will have to support the claims you make in your EOI as well as other criteria if you submit an application.\n\nSee what documents you will need to prove your claims before you submit your EOI in the Gather documents section below.\n\nSee what documents you will need to prove your claims before you submit your EOI in the Gather documents section below.\nSee how\n\n#### Step 1.2 – Submit your EOI\n\nStep 1.2 – Submit your EOI\n\nSubmit your EOI viaSkillselect. You can submit it from within or outside Australia.\n\nSubmit your EOI via\nSkillselect\n. You can submit it from within or outside Australia.\n\nYour EOI is not a visa application. There is no fee for submitting an EOI.\n\nYour EOI is not a visa application. There is no fee for submitting an EOI.\n\nSelect the Skill Nominated (subclass 190) visa.\n\nSelect the Skill Nominated (subclass 190) visa.\n\nYou will receive an email confirming your EOI has been submitted.\n\nYou will receive an email confirming your EOI has been submitted.\nSee how\n\n#### Step 1.3 – After you submit your EOI\n\nStep 1.3 – After you submit your EOI\n\nSkillSelect will estimate your points score based on the claims made in your EOI.\n\nSkillSelect will estimate your points score based on the claims made in your EOI.\n\nYou must have an estimated score of at least 65 points to be invited to apply for this visa.\n\nYou must have an estimated score of at least 65 points to be invited to apply for this visa.\n\nOnce your EOI is submitted it will be visible to state and territory governments. If you have the skills they need, a state or territory government agency might nominate you for the visa.\n\nOnce your EOI is submitted it will be visible to state and territory governments. If you have the skills they need, a state or territory government agency might nominate you for the visa.\n\nIf you are nominated, you will get an invitation to apply for this visa.\n\nIf you are nominated, you will get an invitation to apply for this visa.\nSee how\n\n#### Stay lawful\n\nStay lawful\n\nAn EOI is not a visa application.\n\nAn EOI is not a visa application.\n\nIf you submit an EOI in Australia and your current visa is about to expire, you must apply for another visa to stay in Australia lawfully.\n\nIf you submit an EOI in Australia and your current visa is about to expire, you must apply for another visa to stay in Australia lawfully.\n\nYou are not eligible for a bridging visa because the EOI is not a visa application. You are only eligible for a bridging visa after you are invited and apply for this visa.\n\nYou are not eligible for a bridging visa because the EOI is not a visa application. You are only eligible for a bridging visa after you are invited and apply for this visa.\nSee how\n\n#### Make changes to your EOI\n\nMake changes to your EOI\n\nLet us know throughSkillSelectif:\n\nLet us know through\nSkillSelect\nif:\n- you want to apply for a different skilled visa\nyou want to apply for a different skilled visa\n- your circumstances change - for example, if you change your occupation or your family structure changes\nyour circumstances change - for example, if you change your occupation or your family structure changes\n- you could score more points - for example, you have completed a higher qualification or gained new work experience\nyou could score more points - for example, you have completed a higher qualification or gained new work experience\n- your employment circumstances change and you are no longer working at least 20 hours per week in your nominated occupation\nyour employment circumstances change and you are no longer working at least 20 hours per week in your nominated occupation\n\nYou must be able to meet the points score on your invitation letter if we invite you to apply or you will not be granted a visa.\n\nYou must be able to meet the points score on your invitation letter if we invite you to apply or you will not be granted a visa.\n\nSkillSelect will update your indicative points score if you make changes to your EOI. You can change your EOI at any time before we invite you to apply for a visa.\n\nSkillSelect will update your indicative points score if you make changes to your EOI. You can change your EOI at any time before we invite you to apply for a visa.\nSee how\n\n#### Step 1.4 - Receive an invitation to apply for visa\n\nStep 1.4 - Receive an invitation to apply for visa\n\nWe allocate places for the skilled migration program to meet the Australian Government’s migration planning levels.\n\nWe allocate places for the skilled migration program to meet the Australian Government’s migration planning levels.\n\nOnce invited, you have 60 calendar days to apply for the visa. We cannot extend this time.\n\nOnce invited, you have 60 calendar days to apply for the visa. We cannot extend this time.\n\nYou could receive an invitation up to 2 years after submitting an EOI. If we invite you to apply you will receive an email from SkillSelect. Getting an invitation does not mean you will be granted the visa.\n\nYou could receive an invitation up to 2 years after submitting an EOI. If we invite you to apply you will receive an email from SkillSelect. Getting an invitation does not mean you will be granted the visa.\n\nThe invitation will include the number of points you must score based on your EOI claims.\n\nThe invitation will include the number of points you must score based on your EOI claims.\n\nAfter you apply for the visa, you must show that you:\n\nAfter you apply for the visa, you must show that you:\n- can meet the points score on your invitation (which will include proving any claims you made in your EOI) and\ncan meet the points score on your invitation (which will include proving any claims you made in your EOI) and\n- can meet all other eligibility criteria\ncan meet all other eligibility criteria\n\nIf you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect.\n\nIf you do not apply for the visa after two invitations, your EOI will be removed from SkillSelect.\n\nWe will not process your visa application if you are 45 at the time of your invitation.\n\nWe will not process your visa application if you are 45 at the time of your invitation.\nSee how\n\n#### If you can't show you meet the points score or other eligibility criteria\n\nIf you can't show you meet the points score or other eligibility criteria\n\nIf you can't show you meet the points score on your invitation or the other visa criteria, then do not apply for the visa.\n\nIf you can't show you meet the points score on your invitation or the other visa criteria, then do not apply for the visa.\n\nYour EOI will be suspended if an invitation is issued, but you can update information once the 60-day invitation period has passed. If this is your second invitation, you will have to submit another EOI if you still want the visa.\n\nYour EOI will be suspended if an invitation is issued, but you can update information once the 60-day invitation period has passed. If this is your second invitation, you will have to submit another EOI if you still want the visa.\nSee how\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nYou will need to provide documents to support the claims you make in your EOI and show you meet the other visa criteria.\n\nYou will need to provide documents to support the claims you make in your EOI and show you meet the other visa criteria.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what may happen if you can'tprove your identity or do not provide true information.\n\nProvide accurate information. See what may happen if you can't\nprove your identity or do not provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name\nproof of change of name\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Relationship documents\n\nRelationship documents\n\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\n\nIf you are or have been married, widowed, divorced or permanently separated, provide proof such as divorce documents, death certificates, separation documents or statutory declarations.\n\nIf yourpartnerordependent children are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident)\n\nIf your\npartner\nor\ndependent child\nren are not included in this application, tell us the reason why (for example, they already hold Australian citizenship or are a permanent resident)\nSee how\n\n#### Character documents\n\nCharacter documents\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16.\n\nWe only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nWe only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\n\nFor immigration purposes, Australian police certificates are valid for 12 months from the date of issue.\n\nAlso provide:\n\nAlso provide:\n- an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\nan overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16\n- military service records or discharge papers if you served in the armed forces of any country\nmilitary service records or discharge papers if you served in the armed forces of any country\n\nComplete and provide the following forms:\n\nComplete and provide the following forms:\n- Form 80 Personal particulars for assessment including character assessment (596KB PDF)\nForm 80 Personal particulars for assessment including character assessment (596KB PDF)\n- Form 1221 Additional personal particulars information (331KB PDF)\nForm 1221 Additional personal particulars information (331KB PDF)\nSee how\n\n#### Competent English documents\n\nCompetent English documents\n\nProvide proof you have at leastcompetent Englishat time of invitation for this visa.\n\nProvide proof you have at least\ncompetent English\nat time of invitation for this visa.\n\n#### Partner documents\n\nPartner documents\n\nWe need to see evidence of yourpartner's identity and relationship with you.\n\nWe need to see evidence of your\npartner\n's identity and relationship with you.\n\nProvide:\n\nProvide:\n- identity documents and photos\nidentity documents and photos\n- character documents\ncharacter documents\n- marriage certificate, if applicable\nmarriage certificate, if applicable\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nForde factorelationship provide either:\n\nFor\nde facto\nrelationship provide either:\n- evidence that your relationship is registered by an Australian State or Territory\nevidence that your relationship is registered by an Australian State or Territory\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Proof your partner has functional English\n\nProof your partner has functional English\n\nYou don't have to provide any documents to prove functional English if your partner is a citizen of and holds a valid passport from:\n\nYou don't have to provide any documents to prove functional English if your partner is a citizen of and holds a valid passport from:\n- the United Kingdom\nthe United Kingdom\n- the Republic of Ireland\nthe Republic of Ireland\n- the United States\nthe United States\n- Canada\nCanada\n- New Zealand\nNew Zealand\n\nOtherwise, provide proof your partner hasfunctional English.\n\nOtherwise, provide proof your partner has\nfunctional English\n.\n\nIf you can't show us your partner has functional English, you will need to pay the second instalment of the visa application charge when we ask you to.\n\nIf you can't show us your partner has functional English, you will need to pay the second instalment of the visa application charge when we ask you to.\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n- copies of birth certificates or the family book showing the names of both parents of all your dependent children\ncopies of birth certificates or the family book showing the names of both parents of all your dependent children\n- copies of the adoption paper, if applicable.\ncopies of the adoption paper, if applicable.\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- statutory declarationgiving their consent for the child to migrate to Australia on this visa\nstatutory declaration\ngiving their consent for the child to migrate to Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\n\nYou don't have to prove that your dependant under 18 years of age has functional English.\n\nYou don't have to prove that your dependant under 18 years of age has functional English.\n\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\n\nNote: If your child is likely to turn 18 while your application is being processed, you will need to provide evidence they are dependent on you. See the section 'Dependants over 18 documents' below for further information. A child who turns 18 while your application is being processed and who is not dependent on you cannot satisfy the criteria for this visa.\nSee how\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nTo include your child who is over 18 in your visa application, they must be:\n\nTo include your child who is over 18 in your visa application, they must be:\n- over 18 years of age but not yet turned 23, and dependent on you or your partner, or\nover 18 years of age but not yet turned 23, and dependent on you or your partner, or\n- over 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\nover 23 years of age and unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\n\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\n\nIf your child is likely to turn 23 while your application is being processed, you will need to provide evidence they are dependent on you due to disability.\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n\nYou must also provide proof the child is dependent on you.\n\nYou must also provide proof the child is dependent on you.\n- proof of your relationship with the dependant such as a birth certificate or adoption papers\nproof of your relationship with the dependant such as a birth certificate or adoption papers\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of financial dependency such as bank statements, money transfers and rent receipts\nproof of financial dependency such as bank statements, money transfers and rent receipts\n- if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nif the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\n\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\n\nNote: A child who turns 23 while your application is being processed and who does not meet these requirements cannot satisfy the criteria for this visa.\nSee how\n\n#### Proof your dependant has functional English\n\nProof your dependant has functional English\n\nYou don't have to provide any documents to prove functional English if your dependant is a citizen of and holds a valid passport from:\n\nYou don't have to provide any documents to prove functional English if your dependant is a citizen of and holds a valid passport from:\n- the United Kingdom\nthe United Kingdom\n- the Republic of Ireland\nthe Republic of Ireland\n- the United States\nthe United States\n- Canada\nCanada\n- New Zealand\nNew Zealand\n\nOtherwise, provide proof your dependant hasfunctional English.\n\nOtherwise, provide proof your dependant has\nfunctional English\n.\n\nIf you can't show us your dependant has functional English, you will need to pay the second instalment of the visa application charge when we ask you to.\n\nIf you can't show us your dependant has functional English, you will need to pay the second instalment of the visa application charge when we ask you to.\nSee how\n\n#### Skills assessment documents\n\nSkills assessment documents\n\nYou must provide documents that support the claims you made in your EOI. To check the documents you need use thepoints table. Depending on your claims this could include evidence of your:\n\nYou must provide documents that support the claims you made in your EOI. To check the documents you need use the\npoints table\n. Depending on your claims this could include evidence of your:\n- Skills assessment\nSkills assessment\n- English language skills\nEnglish language skills\n- Australian and/or overseas skilled employment\nAustralian and/or overseas skilled employment\n- Educational qualifications\nEducational qualifications\n- Satisfying the Australian study requirement\nSatisfying the Australian study requirement\n- Specialist education\nSpecialist education\n- Accredited community language\nAccredited community language\n- Study in regional Australia\nStudy in regional Australia\n- Partner skills\nPartner skills\n- Professional Year in Australia\nProfessional Year in Australia\n\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\n\nDelegates of the Minister will now accept a suitable skills assessment for an applicant’s nominated skilled occupation which has been obtained within the 60 day invitation period.\n\nThis change of approach is made as a result of the decision ofThapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs[2021] FCCA 686 (Thapa). The Minister will administer theMigration Regulations 1994in accordance with the decision inThapa, but the Minister reserves the right to make submissions in a Court thatThapawas wrongly decided.\n\nThis change of approach is made as a result of the decision of\nThapa v Minister for Immigration, Citizenship, Migrant Services and Multicultural Affairs\n[2021] FCCA 686 (\nThapa\n). The Minister will administer the\nMigration Regulations 1994\nin accordance with the decision in\nThapa\n, but the Minister reserves the right to make submissions in a Court that\nThapa\nwas wrongly decided.\n\n### Medical practitioners\n\nMedical practitioners\n\nOne of these certificates issued by the Australian Health Practitioner Regulation Agency:\n\nOne of these certificates issued by the Australian Health Practitioner Regulation Agency:\n- unconditional or general medical registration\nunconditional or general medical registration\n- conditional specialist registration – which allows you to practice only in your speciality with no further training or supervision requirements\nconditional specialist registration – which allows you to practice only in your speciality with no further training or supervision requirements\n\nYou must be registered at the time we invite you to apply.\n\nYou must be registered at the time we invite you to apply.\n\n### Barristers and Solicitors\n\nBarristers and Solicitors\n\nProof of admission to practice as a lawyer in the relevant state or territory. You must be admitted to practice at the time we invite you to apply.\n\nProof of admission to practice as a lawyer in the relevant state or territory. You must be admitted to practice at the time we invite you to apply.\nSee how\n\n#### Expression of Interest (EOI) documents\n\nExpression of Interest (EOI) documents\n\nYou must provide documents to prove all of the claims you made in your EOI. Use thepoints tableto check the documents you need.\n\nYou must provide documents to prove all of the claims you made in your EOI. Use the\npoints table\nto check the documents you need.\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nProvide original and translated documents in your application.\n\nProvide original and translated documents in your application.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\nStep 3\n\nStep 3\nApply for the visa\n\nWhen you have your invitation you can apply online. You can be in or outside Australia.\n\nWhen you have your invitation you can apply online. You can be in or outside Australia.\n\nYou have 60 days from the date of your invitation to apply for the visa.\n\nYou have 60 days from the date of your invitation to apply for the visa.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what may happen when you cannotprove your identity or do not provide true information.\n\nProvide accurate information. See what may happen when you cannot\nprove your identity or do not provide true information\n.\n\n#### Apply for this visa online in ImmiAccount\n\nApply for this visa online in ImmiAccount\n1. Log into yourSkillSelectaccount. In SkillSelect, click on the 'Apply for visa' button. This will take you to our online system, ImmiAccount.\nLog into your\nSkillSelect\naccount. In SkillSelect, click on the 'Apply for visa' button. This will take you to our online system, ImmiAccount.\n2. Log in or create an ImmiAccount. Your ImmiAccount login and password will not be the same as your SkillSelect login and password.\nLog in or create an ImmiAccount. Your ImmiAccount login and password will not be the same as your SkillSelect login and password.\n3. Attach your documents.\nAttach your documents\n.\n4. Pay the application charge. We will not process your application until you pay the first instalment of the visa application charge.\nPay the application charge\n. We will not process your application until you pay the first instalment of the visa application charge.\n5. Note your transaction reference number (TRN).\nNote your transaction reference number (TRN).\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nWe will let you know when we have received your application.\n\nWe will let you know when we have received your application.\n\nIf you are granted a bridging visa you will receive notification of your visa grant.\n\nIf you are granted a bridging visa you will receive notification of your visa grant.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nWe do not give updates on applications within the standard processing time.\n\nWe do not give updates on applications within the standard processing time.\n\nYou can check if we need more information from you inImmiAccount.\n\nYou can check if we need more information from you in\nImmiAccount\n.\n\n#### Travel after you apply\n\nTravel after you apply\n\nIf you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nIf you are in Australia, you do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nBut if you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, checkVEVO.\n\nBut if you leave Australia, make sure your visa allows you to return. To see if you can return on your current visa, check\nVEVO\n.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\n\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa\n\nIf you applied outside Australia, don't arrange travel to Australia, leave your job or sell your home until we advise you in writing that you have been granted the visa\nSee how\n\n#### Health exams\n\nHealth exams\n\nIf you didn't havehealth examinationsbefore you applied, we will let you know if you need them. CheckImmiAccount.\n\nIf you didn't have\nhealth examinations\nbefore you applied, we will let you know if you need them. Check\nImmiAccount\n.\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n. We will let you know if you need to provide them.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not attach all documents when you applied, attach them as soon as you can inImmiAccount.\n\nIf you did not attach all documents when you applied, attach them as soon as you can in\nImmiAccount\n.\n\nWe might also ask you to provide more information; however; we are not obliged to do so and may make a decision on your application without requesting more documents.\n\nWe might also ask you to provide more information; however; we are not obliged to do so and may make a decision on your application without requesting more documents.\n\n#### Stay lawful\n\nStay lawful\n\nMake sure you stay lawful in Australia by holding a valid visa while we process your application.\n\nMake sure you stay lawful in Australia by holding a valid visa while we process your application.\n\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application.\n\nWhen you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will come into effect. You can stay in Australia on the BVA while we process your new visa application.\n\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\n\nDo not ask to have the visa you currently hold cancelled. If your visa is cancelled:\n- you will be staying in Australia unlawfully\nyou will be staying in Australia unlawfully\n- your BVA will cease\nyour BVA will cease\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Pay the second instalment\n\nPay the second instalment\n\nIf you need to pay a second instalment, pay it when we send you the invoice.\n\nIf you need to pay a second instalment, pay it when we send you the invoice.\n\n#### Add family\n\nAdd family\n\nYou can addmembers of the family unitto your application after you apply but before we decide on your visa.\n\nYou can add\nmembers of the family unit\nto your application after you apply but before we decide on your visa.\n\nUseForm 1436 Adding an additional applicant after lodgement (481KB PDF), pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount.\n\nUse\nForm 1436 Adding an additional applicant after lodgement (481KB PDF)\n, pay using ImmiAccount, attach the form and supporting documents to your ImmiAccount.\n\nFamily members who apply for the visa must meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa must meet our\nhealth\nand\ncharacter\nrequirements.\n\nFamily members who are not coming to Australia do have to meet ourcharacterrequirement and might have to meet ourhealthrequirement.\n\nFamily members who are not coming to Australia do have to meet our\ncharacter\nrequirement and might have to meet our\nhealth\nrequirement.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\n\nIf your child is born after you submit your application but before we decide on your visa, you must tell us as soon as possible.\n\nFind out what to doyour child is born after you apply.\n\nFind out what to do\nyour child is born after you apply\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nYou must tell us as soon as possible if you made a mistake on your application.\n\nYou must tell us as soon as possible if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)and attach it to your application in ImmiAccount.\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\nand attach it to your application in ImmiAccount.\n\n#### Help with your application\n\nHelp with your application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about after you have applied include:\n\nThings you need to let us know about after you have applied include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your marital or de facto status\nchanges to your marital or de facto status\n- the birth of a child\nthe birth of a child\n- you want to withdraw your application\nyou want to withdraw your application\n\nSee how to tell usif your situation changes.\n\nSee how to tell us\nif your situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nYou can be in or outside Australia when we decide your visa application but not inimmigration clearance. We will let you know our decision in writing.\n\nYou can be in or outside Australia when we decide your visa application but not in\nimmigration clearance\n. We will let you know our decision in writing.\n\nIf we grant your visa, we will tell you:\n\nIf we grant your visa, we will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions, if applicable\nyour visa conditions, if applicable\n\nKeep a copy of the decision.\n\nKeep a copy of the decision.\n\nIf we refuse your visa, we will tell you:\n\nIf we refuse your visa, we will tell you:\n- why we refused the visa\nwhy we refused the visa\n- whether you have a right to a review of the decision\nwhether you have a right to a review of the decision\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Coming to Australia\n\nComing to Australia\n\nIf you are outside Australia when the visa is granted, you must enter Australia before a date that we specify on your visa grant letter.\n\nIf you are outside Australia when the visa is granted, you must enter Australia before a date that we specify on your visa grant letter.\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the border\n\nAt the border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving in Australia must complete theIncoming Passenger Card. You will be given this card onboard.\n\nAll people arriving in Australia must complete the\nIncoming Passenger Card\n. You will be given this card onboard.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n- stay in Australia permanently\nstay in Australia permanently\n- work and study\nwork and study\n- enrol in Australia's public health care scheme,Medicare\nenrol in Australia's public health care scheme,\nMedicare\n- sponsor your relatives to come to Australia\nsponsor your relatives to come to Australia\n- travel to and from Australia for 5 years\ntravel to and from Australia for 5 years\n- if eligible,become an Australian citizen\nif eligible,\nbecome an Australian citizen\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must obey Australian laws.\n\nYou and your family members must obey Australian laws.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\nThis is a permanent visa. It lets you stay in Australia indefinitely.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need aResident Return (RRV) visa (subclasses 155 or 157)to re-enter Australia as a permanent resident. To see when the 5 years ends, useVEVO.\n\nYou can travel to and from Australia for 5 years from the date we grant the visa. After 5 years you will need a\nResident Return (RRV) visa (subclasses 155 or 157)\nto re-enter Australia as a permanent resident. To see when the 5 years ends, use\nVEVO\n.\n\n### New Zealand passport holders\n\nNew Zealand passport holders\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n\nIf an immigration officer processes your clearance at our border, we recommend you tell them:\n- you have a Skilled Nominated visa (subclass190)\nyou have a Skilled Nominated visa (subclass190)\n- you do not want a Special Category visa (subclass 444)\nyou do not want a Special Category visa (subclass 444)\n\nIf you don't tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship.\n\nIf you don't tell them, you might be granted the subclass 444 visa. Grant of a subclass 444 visa might affect your eligibility for Australian citizenship.\n\n### Proving you have a visa\n\nProving you have a visa\n\nIf you wish to provide evidence you have a visa and conditions to someone, useVEVO.\n\nIf you wish to provide evidence you have a visa and conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nYou are protected by Australian workplace law. See yourworkplace rights and entitlements.\n\nYou are protected by Australian workplace law. See your\nworkplace rights and entitlements.\n\n### Bringing family\n\nBringing family\n\nAs an Australian permanent resident, you might be able to sponsor eligible family to come to Australia.\n\nAs an Australian permanent resident, you might be able to sponsor eligible family to come to Australia.\n\nTo find a visa for your family member,explore visa options.\n\nTo find a visa for your family member,\nexplore visa options\n.\n\n### Becoming an Australian citizen\n\nBecoming an Australian citizen\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more aboutbecoming a citizen.\n\nAfter a certain time, you might be eligible for Australian citizenship. Find out more about\nbecoming a citizen\n.\n\nFor citizenship purposes, your permanent residence starts on the day:\n\nFor citizenship purposes, your permanent residence starts on the day:\n- we grant the visa, if you were in Australia\nwe grant the visa, if you were in Australia\n- you entered Australia on this visa, if you were outside Australia when we granted it\nyou entered Australia on this visa, if you were outside Australia when we granted it\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia and return.\n\nYou must have a valid passport or other travel document to leave Australia and return.\n\n#### Ensure your visa is still valid and allows you to re-enter Australia.\n\nEnsure your visa is still valid and allows you to re-enter Australia.\n\nCheck the travel component of your visa inVEVO.\n\nCheck the travel component of your visa in\nVEVO\n.\n\nSee what to do if yourvisa has expired or is about to expire.\n\nSee what to do if your\nvisa has expired or is about to expire\n.\n\n### At the Border\n\nAt the Border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You could leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Proving you have been to Australia\n\nProving you have been to Australia\n\nTo prove you have been to Australia, request your international movement records by completing theRequest for international movement recordsform.\n\nTo prove you have been to Australia, request your international movement records by completing the\nRequest for international movement records\nform.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/resident-return-visa-155-157",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-a-010",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-c-030",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-work-regional-provisional-491",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-employer-sponsored-regional-494",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/skilled-nominated-190#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:14:05.103981",
  "metadata": {}
}