{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/superyacht-crew-visa-488",
  "title": "Superyacht Crew visa (subclass 488)",
  "raw_text": "===== main placeholder ========================================== ​This visa is closed to new applications. Superyacht Crew visa (subclass 488) Page Content ​​The Superyacht Crew visa (subclass 488) is closed to new applications from 19 November 2016. You might be eligible for a Temporary Activity visa (subclass 408) Visa holders Details This information is for people who have already been granted a Superyacht Crew visa (subclass 488). It explains your rights and obligations. You can use Visa Entitlement Verification Online (VEVO) for free to check your visa details and entitlements. How long your visa lasts Details The Superyacht Crew visa (subclass 488) usually lasts for 12 months from the date it is granted, although stays of three or six months may also be granted. To apply for a further visa as a superyacht crew member while in Australia you must apply for a Temporary Activity visa (subclass 408) while you continue to hold the visa. What this visa lets you do Details If you are granted this visa, you can: stay in Australia for a period of usually no more than 12 months, although stays of three or six months may also be granted enter Australia as many times as you want while the visa is valid work on your sponsor’s superyacht while you are in Australia. You cannot do any work that is not part of the usual day-to-day routine maintenance or business of the superyacht. Your obligations Details You must comply with all visa conditions and Australian laws. Working in Australia Details You can work only as a superyacht crew member in Australia, and only for your sponsor. You cannot do any work for the sponsor or owner of the superyacht that is not part of the day-to-day routine maintenance or business of the superyacht. You cannot work for any other person or for yourself. If your employment ceases or you change employer Details If your employment ceases, you must do one of the following: find another employer who is willing to sponsor you, and then apply for another Superyacht Crew visa (subclass 488) apply for another type of substantive visa leave Australia within 28 days or before your visa ends. If you want to change your employer, you will need a new sponsorship and a new Superyacht Crew visa (subclass 488). To be granted a further Superyacht Crew visa (subclass 488) while in Australia, you must apply either while your Superyacht Crew visa (subclass 488) is still valid or while you hold another valid Australian visa. Tell us if things change Details Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child. See how to tell us if your situation changes Sponsors Details This information is for approved sponsors of a crew member for a Superyacht Crew visa (subclass 488). You can use Visa Entitlement Verification Online (VEVO for Organisations) to check the visa status and entitlements of people you have sponsored. You cannot apply to sponsor applicants for this visa because it is no longer open to new applications. If you were approved as a superyacht crew sponsor before 19 November 2016 you can use this approval to sponsor a Temporary Activity visa (subclass 408) . applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your approval ceases (whichever is earlier). From 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date. If you applied for approval as a superyacht crew sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Temporary Activity visa (subclass 408) applications until 18 May 2017. Sponsorship obligations Details You must comply with the following sponsorship obligations: cooperate with inspectors tell us when certain events occur not recover from, transfer or charge certain costs to another person keep records provide records and information to the Minister pay costs to locate and remove an unlawful non-citizen. You are responsible for meeting all your obligations, even if you have someone else authorised to act on your behalf, including a migration agent. Cooperate with inspectors Details You must cooperate with inspectors appointed under the Migration Act 1958 (the Act) who are investigating whether: a sponsorship obligation is being, or has been, complied with you have hired an illegal worker there are other circumstances in which we could take administrative action. This obligation: starts on the day the sponsorship is approved or work agreement commences ends five years after the day the approved sponsorship ends or work agreement ceases. Cooperating with inspectors can include (but is not limited to): providing access to premises producing and providing documents within the requested timeframe not preventing or attempting to prevent ,access to a person who has custody of, or access to, a record or documents providing officers with access to interview any person on their premises. Keep records Details You must keep records that show you have your complied with your obligations. All records must be in a reproducible format and some must be capable of verification by an independent person. You must keep a record of: any notification that you were required to make to us the date on which you notified us, and how and where you made the notification. This obligation starts on the day the sponsorship is approved. This obligation ends two years after both of the following: you are no longer an approved sponsor, and you are no longer sponsoring anyone. You do not need to keep any records for more than five years. Provide records and information to the Minister Details You must provide records or information, if they are requested by a departmental officer that goes to determining whether: a sponsorship obligation is being or has been complied with, and determining whether other circumstances, in which the Minister may take administrative action, exist or have existed, in the manner and timeframe requested by the department. We may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that: you are required to keep under Commonwealth, state or territory law you have an obligation to keep as a sponsor. This obligation starts to apply on the day the sponsorship is approved or work agreement commences. This obligation ends two years after: your sponsorship or work agreement ceases, and you no longer have a sponsored visa holder Tell us when certain events occur Details You must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring. Events where a sponsor must provide information to us include: a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details, and the cessation, or expected cessation, of a primary sponsored person's employment. If an expected cessation does not take place or the primary sponsored person will cease employment on a different date than previously notified, you must notify us of the continued employment or new cessation date. This obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences. This obligation ends two years after: your sponsorship or work agreement ends, and you are no longer sponsoring anyone. Where to send a notice of an event or change You must send details of these events by email or to one of our state or territory offices listed below. By email (preferred): sponsor.notifications@homeaffairs.gov.au By registered post: Australian Capital Territory Sponsor Monitoring GPO Box 717 Canberra ACT 2601 New South Wales Sponsor Monitoring GPO Box 9984 Sydney NSW 2001 Queensland Sponsor Monitoring GPO Box 9984 Brisbane Qld 4001 Northern Territory Sponsor Monitoring GPO Box 864 Darwin NT 0801 South Australia Sponsor Monitoring GPO Box 2399 Adelaide SA 5001 Tasmania Sponsor Monitoring GPO Box 794 Hobart Tas. 7001 Victoria Sponsor Monitoring GPO Box 241 Melbourne Vic. 3001 Western Australia Sponsor Monitoring Locked Bag 7 Northbridge WA 6865 Not recover, transfer or charge certain costs to another person Details You must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to: the recruitment of the person you sponsored becoming or being a sponsor or former approved sponsor. This obligation: starts on the day the sponsorship is approved or the work agreement commences ends on the following two events: you cease to be an approved sponsor or party to a work agreement you no longer have a sponsored visa holder. Sponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include: cost of sponsorship and nomination charges migration agent costs associated with the lodgement of sponsorship and nomination applications administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including: recruitment agent fees migration agent fees the cost of job advertising screening of candidates, short listing, interviews and reference checks salaries of recruitment or human resource staff the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position training of new staff responding to queries for prospective candidates, and advising unsuccessful applicants travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia. Pay costs to locate and remove an unlawful non-citizen Details In the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia. You may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above). This obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia. This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia. Monitoring of sponsors and visa holders Details You must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions. We monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways: exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office. writing to you to ask for information in accordance with the obligation to provide records and information site visits, usually to the sponsored business premises, with or without notice Your compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the Migration Act 1958 . Failure to cooperate with inspectors is a breach of the sponsorship obligations. Sanctions for not meeting your sponsorship obligations Details If you do not meet your obligations, we could take one or more of the following actions: Administrative you could be barred from sponsoring more people for a specified time you could be barred from applying for approval to be a sponsor, in relation to this visa or another one all of your existing approvals as a sponsor could be cancelled. Enforceable undertaking You could be invited to enter into an enforceable undertaking. Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again. Civil we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure. we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure. Other circumstances in which administrative action might be taken In addition, you could also have sanctions imposed if: The types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made a work agreement. If you have sponsored someone under a work agreement, we could suspend or terminate it in accordance with the clauses of the particular work agreement. you provide false or misleading information to us or the Migration Review Tribunal you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "main_content": "===== main placeholder ==========================================\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n​This visa is closed to new applications.\n\n# Superyacht Crew visa (subclass 488)\n\nSuperyacht Crew visa (subclass 488)\nPage Content\n\n​​The Superyacht Crew visa (subclass 488) is closed to new  applications from 19 November 2016.\n\n​​The Superyacht Crew visa (subclass 488) is closed to new  applications from 19 November 2016.\n\nYou might be eligible for aTemporary Activity visa  (subclass 408).\n\nYou might be eligible for a\nTemporary Activity visa  (subclass 408)\n.\n\n## Visa holders\n\nVisa holders\nDetails\n\nThis information is for people who have already been granted a Superyacht Crew visa (subclass 488). It explains your rights and obligations.\n\nThis information is for people who have already been granted a Superyacht Crew visa (subclass 488). It explains your rights and obligations.\n\nYou can useVisa Entitlement Verification Online (VEVO)for free to check your visa details and entitlements.\n\nYou can use\nVisa Entitlement Verification Online (VEVO)\nfor free to check your visa details and entitlements.\n\n### How long your visa lasts\n\nHow long your visa lasts\nDetails\n\nThe Superyacht Crew visa (subclass 488) usually lasts for 12 months from the date it is granted, although stays of three or six months may also be granted.\n\nThe Superyacht Crew visa (subclass 488) usually lasts for 12 months from the date it is granted, although stays of three or six months may also be granted.\n\nTo apply for a further visa as a superyacht crew member while in Australia you must apply for a Temporary Activity visa (subclass 408) while you continue to hold the visa.\n\nTo apply for a further visa as a superyacht crew member while in Australia you must apply for a Temporary Activity visa (subclass 408) while you continue to hold the visa.\n\n### What this visa lets you do\n\nWhat this visa lets you do\nDetails\n\nIf you are granted this visa, you can:\n\nIf you are granted this visa, you can:\n- stay in Australia for a period of usually no more than 12 months, although stays of three or six months may also be granted\nstay in Australia for a period of usually no more than 12 months, although stays of three or six months may also be granted\n- enter Australia as many times as you want while the visa is valid\nenter Australia as many times as you want while the visa is valid\n- work on your sponsor’s superyacht while you are in Australia.\nwork on your sponsor’s superyacht while you are in Australia.\n\nYou cannot do any work that is not part of the usual day-to-day routine maintenance or business of the superyacht.\n\nYou cannot do any work that is not part of the usual day-to-day routine maintenance or business of the superyacht.\n\n### Your obligations\n\nYour obligations\nDetails\n\nYou must comply with all visa conditions and Australian laws.\n\nYou must comply with all visa conditions and Australian laws.\n\n#### Working in Australia\n\nWorking in Australia\nDetails\n\nYou can work only as a superyacht crew member in Australia, and only for your sponsor. You cannot do any work for the sponsor or owner of the superyacht that is not part of the day-to-day routine maintenance or business of the superyacht.\n\nYou can work only as a superyacht crew member in Australia, and only for your sponsor. You cannot do any work for the sponsor or owner of the superyacht that is not part of the day-to-day routine maintenance or business of the superyacht.\n\nYou cannot work for any other person or for yourself.\n\nYou cannot work for any other person or for yourself.\n\n#### If your employment ceases or you change employer\n\nIf your employment ceases or you change employer\nDetails\n\nIf your employment ceases, you must do one of the following:\n\nIf your employment ceases, you must do one of the following:\n- find another employer who is willing to sponsor you, and then apply for another Superyacht Crew visa (subclass 488)\nfind another employer who is willing to sponsor you, and then apply for another Superyacht Crew visa (subclass 488)\n- apply for another type of substantive visa\napply for another type of substantive visa\n- leave Australia within 28 days or before your visa ends.\nleave Australia within 28 days or before your visa ends.\n\nIf you want to change your employer, you will need a new sponsorship and a new Superyacht Crew visa (subclass 488).\n\nIf you want to change your employer, you will need a new sponsorship and a new Superyacht Crew visa (subclass 488).\n\nTo be granted a further Superyacht Crew visa (subclass 488) while in Australia, you must apply either while your Superyacht Crew visa (subclass 488) is still valid or while you hold another valid Australian visa.\n\nTo be granted a further Superyacht Crew visa (subclass 488) while in Australia, you must apply either while your Superyacht Crew visa (subclass 488) is still valid or while you hold another valid Australian visa.\n\n### Tell us if things change\n\nTell us if things change\nDetails\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child.\nthe birth of a child.\n\nSee how totell us if your situation changes.\n\nSee how to\ntell us if your situation changes\n.\n\n## Sponsors\n\nSponsors\nDetails\n\nThis information is for approved sponsors of a crew member for a Superyacht Crew visa (subclass 488).\n\nThis information is for approved sponsors of a crew member for a Superyacht Crew visa (subclass 488).\n\nYou can useVisa Entitlement Verification Online (VEVO for Organisations)to check the visa status and entitlements of people you have sponsored.\n\nYou can use\nVisa Entitlement Verification Online (VEVO for Organisations)\nto check the visa status and entitlements of people you have sponsored.\n\nYou cannot apply to sponsor applicants for this visa because it is no longer open to new applications.If you were approved as a superyacht crew sponsor before 19 November 2016 you can use this approval to sponsor aTemporary Activity visa (subclass 408). applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your approval ceases (whichever is earlier).From 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date.If you applied for approval as a superyacht crew sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Temporary Activity visa (subclass 408) applications until 18 May 2017.\n\nYou cannot apply to sponsor applicants for this visa because it is no longer open to new applications.\nIf you were approved as a superyacht crew sponsor before 19 November 2016 you can use this approval to sponsor a\nTemporary Activity visa (subclass 408)\n. applicant (who is engaging in the relevant activity) during the transitional period, that is until 18 May 2017, or until your approval ceases (whichever is earlier).\nFrom 19 May 2017 you must apply online for approval as a temporary activities sponsor if you want to sponsor a Temporary Activity visa (subclass 408) applicant after this date.\nIf you applied for approval as a superyacht crew sponsor before 19 November 2016 your application will continue to be assessed under the pre-19 November 2016 legislation. If approved, the sponsorship would only be valid to sponsor new Temporary Activity visa (subclass 408) applications until 18 May 2017.\n\n### Sponsorship obligations\n\nSponsorship obligations\nDetails\n\nYou must comply with the following sponsorship obligations:\n\nYou must comply with the following sponsorship obligations:\n- cooperate with inspectors\ncooperate with inspectors\n- tell us when certain events occur\ntell us when certain events occur\n- not recover from, transfer or charge certain costs to another person\nnot recover from, transfer or charge certain costs to another person\n- keep records\nkeep records\n- provide records and information to the Minister\nprovide records and information to the Minister\n- pay costs to locate and remove an unlawful non-citizen.\npay costs to locate and remove an unlawful non-citizen.\n\nYou are responsible for meeting all your obligations, even if you have someone else authorised to act on your behalf, including a migration agent.\n\nYou are responsible for meeting all your obligations, even if you have someone else authorised to act on your behalf, including a migration agent.\n\n#### Cooperate with inspectors\n\nCooperate with inspectors\nDetails\n\nYou must cooperate with inspectors appointed under theMigration Act 1958(the Act) who are investigating whether:\n\nYou must cooperate with inspectors appointed under the\nMigration Act 1958\n(the Act) who are investigating whether:\n- a sponsorship obligation is being, or has been, complied with\na sponsorship obligation is being, or has been, complied with\n- you have hired an illegal worker\nyou have hired an illegal worker\n- there are other circumstances in which we could take administrative action.\nthere are other circumstances in which we could take administrative action.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or work agreement commences\nstarts on the day the sponsorship is approved or work agreement commences\n- ends five years after the day the approved sponsorship ends  or work agreement ceases.\nends five years after the day the approved sponsorship ends  or work agreement ceases.\n\nCooperating with inspectors can include (but is not limited to):\n\nCooperating with inspectors can include (but is not limited to):\n- providing access to premises\nproviding access to premises\n- producing and providing documents within the requested timeframe\nproducing and providing documents within the requested timeframe\n- not preventing  or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\nnot preventing  or attempting to prevent ,access to a person who has custody of, or access to, a record or documents\n- providing officers with access to interview any person on their premises.\nproviding officers with access to interview any person on their premises.\n\n#### Keep records\n\nKeep records\nDetails\n\nYou must keep records that show you have your complied with your obligations. All records must be in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep records that show you have your complied with your obligations. All records must be in a reproducible format and some must be capable of verification by an independent person.\n\nYou must keep a record of:\n\nYou must keep a record of:\n- any notification that you were required to make to us\nany notification that you were required to make to us\n- the date on which you notified us, and how and where you made the notification.\nthe date on which you notified us, and how and where you made the notification.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation starts on the day the sponsorship is approved.\n\nThis obligation ends two years after both of the following:\n\nThis obligation ends two years after both of the following:\n- you are no longer an approved sponsor, and\nyou are no longer an approved sponsor, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nYou do not need to keep any records for more than five years.\n\nYou do not need to keep any records for more than five years.\n\n#### Provide records and information to the Minister\n\nProvide records and information to the Minister\nDetails\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n\nYou must provide records or information, if they are requested by a departmental officer that goes to determining whether:\n- a sponsorship obligation is being or has been complied with, and\na sponsorship obligation is being or has been complied with, and\n- determining whether other circumstances, in which the Minister may take administrative action, exist or have existed,in the manner and timeframe requested by the department.\ndetermining whether other circumstances, in which the Minister may take administrative action, exist or have existed,\nin the manner and timeframe requested by the department.\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n\nWe may ask you in writing to provide records or information which relate to your sponsorship obligations, and any other matters that relate to your sponsorship of visa holders. You must provide the records or information requested if it is a record or information that:\n- you are required to keep under Commonwealth, state or territory law\nyou are required to keep under Commonwealth, state or territory law\n- you have an obligation to keep as a sponsor.\nyou have an obligation to keep as a sponsor.\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.\n\nThis obligation starts to apply on the day the sponsorship is approved or work agreement commences.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship or work agreement ceases, and\nyour sponsorship or work agreement ceases, and\n- you no longer have a sponsored visa holder\nyou no longer have a sponsored visa holder\n\n#### Tell us when certain events occur\n\nTell us when certain events occur\nDetails\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nYou must tell us in writing when certain events occur. Send the information by registered post or electronic mail to a specified address and within certain timeframes of the event occurring.\n\nEvents where a sponsor must provide information to us include:\n\nEvents where a sponsor must provide information to us include:\n- a change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details, and\na change to the information in the sponsor's application for approval as a sponsor, relating to the person's address and contact details, and\n- the cessation, or expected cessation, of a primary sponsored person's employment. If an expected cessation does not take place or the primary sponsored person will cease employment on a different date than previously notified, you must notify us of the continued employment or new cessation date.\nthe cessation, or expected cessation, of a primary sponsored person's employment. If an expected cessation does not take place or the primary sponsored person will cease employment on a different date than previously notified, you must notify us of the continued employment or new cessation date.\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.\n\nThis obligation starts to apply on the day the standard business sponsorship is approved or the work agreement commences.\n\nThis obligation ends two years after:\n\nThis obligation ends two years after:\n- your sponsorship or work agreement ends, and\nyour sponsorship or work agreement ends, and\n- you are no longer sponsoring anyone.\nyou are no longer sponsoring anyone.\n\nWhere to send a notice of an event or change\n\nWhere to send a notice of an event or change\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nYou must send details of these events by email or to one of our state or territory offices listed below.\n\nBy email(preferred):sponsor.notifications@homeaffairs.gov.au\n\nBy email\n(preferred):\nsponsor.notifications@homeaffairs.gov.au\n\nBy registered post:\n\nBy registered post:\n- Australian Capital TerritorySponsor MonitoringGPO Box 717Canberra ACT 2601\nAustralian Capital Territory\nSponsor Monitoring\nGPO Box 717\nCanberra ACT 2601\n- New South WalesSponsor MonitoringGPO Box 9984Sydney NSW 2001\nNew South Wales\nSponsor Monitoring\nGPO Box 9984\nSydney NSW 2001\n- QueenslandSponsor MonitoringGPO Box 9984Brisbane Qld 4001\nQueensland\nSponsor Monitoring\nGPO Box 9984\nBrisbane Qld 4001\n- Northern TerritorySponsor MonitoringGPO Box 864Darwin NT 0801\nNorthern Territory\nSponsor Monitoring\nGPO Box 864\nDarwin NT 0801\n- South AustraliaSponsor MonitoringGPO Box 2399Adelaide SA 5001\nSouth Australia\nSponsor Monitoring\nGPO Box 2399\nAdelaide SA 5001\n- TasmaniaSponsor MonitoringGPO Box 794Hobart Tas. 7001\nTasmania\nSponsor Monitoring\nGPO Box 794\nHobart Tas. 7001\n- VictoriaSponsor MonitoringGPO Box 241Melbourne Vic. 3001\nVictoria\nSponsor Monitoring\nGPO Box 241\nMelbourne Vic. 3001\n- Western AustraliaSponsor MonitoringLocked Bag 7Northbridge WA 6865\nWestern Australia\nSponsor Monitoring\nLocked Bag 7\nNorthbridge WA 6865\n\n#### Not recover, transfer or charge certain costs to another person\n\nNot recover, transfer or charge certain costs to another person\nDetails\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n\nYou must not take any action or seek to take any action that would result in the transfer or charging of costs (including migration agent costs) to another person, such as a sponsored visa holder or their sponsored family members this includes costs that relate to:\n- the recruitment of  the person you sponsored\nthe recruitment of  the person you sponsored\n- becoming or being a sponsor or former approved sponsor.\nbecoming or being a sponsor or former approved sponsor.\n\nThis obligation:\n\nThis obligation:\n- starts on the day the sponsorship is approved or the work agreement commences\nstarts on the day the sponsorship is approved or the work agreement commences\n- ends on the following two events:you cease to be an  approved sponsor or party to a work agreementyou no longer have a sponsored visa holder.\nends on the following two events:\n- you cease to be an  approved sponsor or party to a work agreement\nyou cease to be an  approved sponsor or party to a work agreement\n- you no longer have a sponsored visa holder.\nyou no longer have a sponsored visa holder.\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n\nSponsors are also required to pay certain costs associated with becoming a sponsor and not pass these costs, in any form, onto another person. These include:\n- cost of sponsorship and nomination charges\ncost of sponsorship and nomination charges\n- migration agent costs associated with the lodgement of sponsorship and nomination applications\nmigration agent costs associated with the lodgement of sponsorship and nomination applications\n- administrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:recruitment agent feesmigration agent feesthe cost of job advertisingscreening of candidates, short listing, interviews and reference checkssalaries of recruitment or human resource staffthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the positiontraining of new staffresponding to queries for prospective candidates, and advising unsuccessful applicantstravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\nadministrative costs and any sundry costs an employer incurs when they conduct recruitment exercises, including:\n- recruitment agent fees\nrecruitment agent fees\n- migration agent fees\nmigration agent fees\n- the cost of job advertising\nthe cost of job advertising\n- screening of candidates, short listing, interviews and reference checks\nscreening of candidates, short listing, interviews and reference checks\n- salaries of recruitment or human resource staff\nsalaries of recruitment or human resource staff\n- the cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\nthe cost of outsourcing background checks, police checks and psychological testing where they relate to an employer determining an applicant’s suitability for the position\n- training of new staff\ntraining of new staff\n- responding to queries for prospective candidates, and advising unsuccessful applicants\nresponding to queries for prospective candidates, and advising unsuccessful applicants\n- travel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\ntravel costs for the sponsor to interview and/or meet the applicant either overseas or in Australia.\n\n#### Pay costs to locate and remove an unlawful non-citizen\n\nPay costs to locate and remove an unlawful non-citizen\nDetails\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nIn the event a primary sponsored person (or any of their sponsored family members) becomes an unlawful non-citizen, you may be required to pay the costs incurred by the Commonwealth in locating and/or removing the primary or secondary sponsored persons from Australia.\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nYou may be liable to pay the Commonwealth the difference between the actual costs incurred by the Commonwealth (up to a maximum of AUD10 000) less any amount which may have already been paid under the obligation to pay travel costs to enable sponsored persons to leave Australia (see ‘Obligation to pay travel costs’ above).\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\nThis obligation starts on the day the person you sponsored becomes an unlawful non-citizen. It ends five years after they leave Australia.  This means that the department might, up to five years after the person you have sponsored has left Australia, give you a letter requiring payment of the costs that the Commonwealth paid to locate and remove the person you sponsored prior to their departure from Australia.\n\n### Monitoring of sponsors and visa holders\n\nMonitoring of sponsors and visa holders\nDetails\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nYou must comply with your obligations as a sponsor. We monitor your compliance with the sponsorship obligations and whether your visa holders are upholding their visa conditions.\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n\nWe monitor you while you are a sponsor and for up to five years after you cease being a sponsor. We do this routinely and in response to information provided to us, and in three main ways:\n- exchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\nexchanging information with other Commonwealth, state and territory government agencies, including the Department of Employment, the Fair Work Ombudsman, and the Australian Taxation Office.\n- writing to you to ask for information in accordance with the obligation to provide records and information\nwriting to you to ask for information in accordance with the obligation to provide records and information\n- site visits, usually to the sponsored business premises, with or without notice\nsite visits, usually to the sponsored business premises, with or without notice\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under theMigration Act 1958. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\nYour compliance with the sponsorship obligations might be investigated by Immigration inspectors who have investigative powers under the\nMigration Act 1958\n. Failure to cooperate with inspectors is a breach of the sponsorship obligations.\n\n### Sanctions for not meeting your sponsorship obligations\n\nSanctions for not meeting your sponsorship obligations\nDetails\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nIf you do not meet your obligations, we could take one or more of the following actions:\n\nAdministrative\n\nAdministrative\n- you could be barred from sponsoring more people for a specified time\nyou could be barred from sponsoring more people for a specified time\n- you could be barred from applying for approval to be a sponsor, in relation to this visa or another one\nyou could be barred from applying for approval to be a sponsor, in relation to this visa or another one\n- all of your existing approvals as a sponsor could be cancelled.\nall of your existing approvals as a sponsor could be cancelled.\n\nEnforceable undertaking\n\nEnforceable undertaking\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nYou could be invited to enter into an enforceable undertaking.  Enforceable undertakings require you to promise, in writing, to undertake to complete certain actions to demonstrate that the failures have been rectified and won’t happen again.\n\nCivil\n\nCivil\n- we can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\nwe can issue an infringement notice of up to AUD10200 for a body corporate and AUD2040 for an individual for each failure.\n- we can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\nwe can apply to a court for a civil penalty order of up to AUD51 000 for a corporation and AUD10200 for an individual for each failure.\n\nOther circumstances in which administrative action might be taken\n\nOther circumstances in which administrative action might be taken\n\nIn addition, you could also have sanctions imposed if:\n\nIn addition, you could also have sanctions imposed if:\n\nThe types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made  a work agreement.\n\nThe types of actions that could be taken depend on whether the sponsor is a standard business sponsor or has made  a work agreement.\n\nIf you have sponsored someone under a work  agreement, we could suspend or terminate it in accordance with the clauses of the particular work  agreement.\n\nIf you have sponsored someone under a work  agreement, we could suspend or terminate it in accordance with the clauses of the particular work  agreement.\n- you provide false or misleading information to us or the Migration Review Tribunal\nyou provide false or misleading information to us or the Migration Review Tribunal\n- you no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\nyou no longer satisfy the criteria for approval as a sponsor or for variation of a term of that approval\n- you have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\nyou have been found by a court or competent authority to have contravened a Commonwealth, state or territory law\n- the person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.\nthe person you have sponsored breaks a law relating to the licensing, registration or membership needed to work in the nominated position.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/superyacht-crew-visa-488#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/repealed-visas/superyacht-crew-visa-488#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:35:28.831393",
  "metadata": {}
}