{
  "url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407",
  "title": "Training visa",
  "raw_text": "===== main placeholder ========================================== Subclass 407 Training visa This visa allows you to take part in workplace-based occupational training activities to improve your skills for your job, area of tertiary study, field of expertise or in a professional development training program in Australia. Personalise this page... For Applicants For Sponsors Overview About this visa Eligibility Step by step When you have this visa Overview About this visa Eligibility Step by step When you have this visa Overview Stay This is a temporary visa. We might grant you a visa allowing you to stay in Australia for up to 2 years. Cost From AUD430.00 for the main applicant. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. With this visa you can visit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program See all conditions Check your eligibility You must be sponsored be nominated (unless your sponsor is a Commonwealth Government agency) be invited (if your sponsor is a Commonwealth Government agency) Help with your visa If you are getting help with your visa, before you pay someone, read information on Who can help with your visa application Apply Process About this visa With this visa, you can Nomination types How long you can stay Stay longer Include family Cost Apply from Processing times Your obligations Travel Visa label Financial support Changing sponsors Apply for a new visa With this visa, you can visit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program Nomination types This visa allows people to take part in workplace-based training to improve their skills for their job, area of tertiary study, field of expertise or in a professional development training program in Australia. Nomination requirements are different depending on the purpose or type of training. There are 3 types of occupational training covered by this visa: Occupational training required for registration Occupational training to improve skills in an eligible occupation Occupational training for capacity building overseas . This includes overseas qualification, government support or professional. Nomination is the stage where the sponsor provides details about the nominee (intended trainee), the purpose or type of training and how and where the training will be provided. How long you can stay This is a temporary visa. We might grant you a visa stay in Australia for up to 2 years. You can leave and re-enter Australia on the visa while it is valid. Stay longer You can't stay in Australia longer by extending this visa. You can apply for another visa. Explore visa options Include family You can include members of the family unit in your application when you apply Family members who apply for the visa with you must also meet our health and character requirements. If you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirements. Newborn children Find out what to do if your child is born after you apply or when you hold your visa Subsequent entrants If we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant They can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount Family members applying subsequently should : be listed on the nomination form if their sponsor is not a Commonwealth Government Agency, and provide a letter from the sponsor of the primary applicant confirming the sponsor has agreed to sponsor them Cost The visa costs from AUD430.00 for the main applicant. There is also a charge for each family member who applies for the visa with you. You might also have to pay other costs for health checks, police certificates and biometrics To work out what your visa will cost, use the Visa Pricing Estimator . The estimator does not take into account the other costs. Apply from You can be in or outside Australia when you apply for the visa and when we decide on your application. Processing times For an indication of processing times for this visa, use the visa processing time guide tool . This will show the processing times for recently decided applications. It is a guide only and not specific to your application. Your application might take longer to process if: you do not fill it in correctly you do not include all the documents we need or we need more information from you we have to verify your information We can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application. Your obligations You and your family members must obey all Australian laws. Learn more about conditions for this visa Travel You can travel outside Australia and return as many times as you want while the visa is valid. The time you spend outside Australia does not extend the visa. Visa label We will digitally link your visa to your passport. You will not get a label in your passport. Financial support You will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members. Changing sponsors If you decide to train with another organisation while you are in Australia, you will need to be sponsored by that organisation. They must submit a new nomination for you. When the new nomination is approved you can do your occupational training with that organisation for the time remaining on your visa. You do not have to apply for a new visa, as long as you continue to do the training program your visa was approved for. If your occupational training program changes, you need to submit a new visa application. If your sponsor ends your training you must tell us. You may try to find another organisation to sponsor you. Apply for a new visa If you want to apply for a new Training visa (subclass 407) you will need continuing sponsorship. You may have to provide an explanation of why you were unable to complete the training within the initial training period. Eligibility Have an approved sponsor Details Your sponsor must be approved as a temporary activities sponsor Be nominated Details Your sponsor must have nominated you to participate in a program of occupational training unless your sponsor is a Australian Commonwealth Government agency. Nomination requirements are different depending on the purpose or type of training. There are 3 types of occupational training covered by this visa: Occupational training required for registration Occupational training to improve skills in an eligible occupation Occupational training for capacity building overseas . This includes overseas qualification, government support or professional. Be this age Usually, you must be 18 years old or older at the time we decide your visa application. Have this visa Details If you are applying in Australia, you must currently hold a valid temporary substantive visa that is not a: a Subclass 403 (Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular stream) or a Subclass 771 (Transit) visa or a Special Purpose visa If you are in Australia and do not hold a substantive visa, your last substantive visa must not have been one of the above visas and your application must be made within 28 days: after the last substantive visa you held ceased to be in effect or after the day you were notified of the Administrative Appeal Tribnual's decision to set aside and substitute the decision to cancel your substantive visa, or the Minister's decision not to revoke the cancellation of your substantive visa. Meet our health requirement You and any family members who apply for the visa with you must meet our health requirement Meet our character requirement You and family members aged 16 years and over who apply for the visa with you must meet our character requirement We might also ask that other family members meet the requirement. Have adequate health insurance Details You are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. You must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport. See a guide to what we consider adequate health insurance See more about health insurance for overseas visitors Reciprocal healthcare agreements Some countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about reciprocal healthcare agreements Be a genuine temporary entrant Details You must only intend to: stay temporarily in Australia do the things you are allowed to do on this visa You must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held. Have this level of English language You must have functional English Sign the Australian values statement Details If you are 18 years of age or older, you must: have read, or had explained to you, the Life in Australia booklet and sign an Australian Values Statement that confirms you will respect the Australian way of life and obey Australian laws Have paid back your debt to the Australian Government If you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back. Not had a visa cancelled or an application refused We will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused. In some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see Limitations on applications in Australia If applying for a visa from outside Australia see Can I go to Australia If you want immigration assistance, see Who can help with your visa application Best interests of the child We might not grant this visa if it is not in the best interests of an applicant under 18. Meet all these criteria? Check how to apply in our step by step guide. Step by step Step 1 Before you apply Before you apply, you have to make sure your sponsoring organisation has applied to be or has been approved as a sponsor. Your sponsoring organisation must also have submitted a nomination application. Australian Commonwealth Government agencies don't have to nominate. Don't arrange travel until we tell you in writing you have the visa. If you plan to get a new passport, you should do so before applying for this visa. If you get a new passport after you have submitted your application, you must tell us of this change in writing. You can do this using ImmiAccount Show steps Get help with your application Only some people can help you with your application. If you appoint someone to give you immigration assistance they must be: registered migration agent legal practitioner , or an exempt person You can appoint anyone to receive documents on your behalf relating to your visa matter. See how Step 2 Gather your documents Gather documents to prove your identity and show you have a sponsor, nomination or government invitation, financial support and health insurance. You will need to prepare them to submit online. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Identity documents We need proof of your identity. If you can't prove your identity: we will refuse your visa application we might not grant you another visa for 10 years we might not grant any family members you listed on your application a visa for 10 years Provide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates. Also provide: a national identity card, if you have one proof of change of name, if applicable Documents that prove a change of name include: a marriage or divorce certificate change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority documents that show other names you have been known by See how Sponsor documents You need to provide: a sponsor approval letter or receipt for submission of the sponsorship application your sponsor’s nomination approval letter or receipt for submission of the nomination application – if your sponsor is not an Australian Commonwealth Government agency a written statement from the sponsor that they will meet the sponsorship obligations for you and all dependent family members included in your application See how Volunteer documents If this is a volunteer position, you and your sponsor need to complete the Acknowledgement of unpaid placement forms. Form 1283 Acknowledgement of unpaid placement—visa applicant (131KB PDF) Form 1284 Acknowledgement of unpaid placement—sponsor (136KB PDF) Your sponsor should submit these forms with the nomination. See how Financial support documents You will need to show evidence of your financial capacity to support yourself and your family while you are in Australia, such as: bank statements a letter from your financial institution stating your financial position employment contracts documents showing allowances, accommodation and stipends from your sponsor while you are in Australia if you are currently or were previously an AusAID or Foreign Affairs supported student provide a copy of the letter of support from the Department of Foreign Affairs and Trade See how Health insurance You will need to provide evidence of adequate health insurance for you and your family members for the duration of your stay in Australia. See how Evidence of English language Provide evidence that you have functional English language skills to undertake the training programme. You do not need to provide these results if you hold a valid passport from: the United Kingdom Canada New Zealand the United States the Republic of Ireland Workplace-based activity documents If you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training. If you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application. Also provide a copy of your qualifications and curriculum vitae (CV). If registrations or licences are required for you to do the training, provide copies of registrations or licences. See how Professional Development documents If you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training. If you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application. Provide a statement from your sponsor confirming they are satisfied: that you are doing the professional development training specified in the application that you have relevant managerial or other professional skills and work experience to participate in the program Provide a signed letter on company letterhead from your current manager detailing your current position and duties. Also provide a copy of your qualifications and curriculum vitae (CV). See how Occupational training required for registration You must provide a letter from the relevant regulatory body for the occupation in Australia or your home country. This letter must : name you state the nominated training is necessary for the you to get registration, membership or licensing to work in the occupation If you are a health practitioner treating patients as part of your occupational training you must: have a letter from the relevant registration authority, or regulatory body stating you have conditional registration for the training See how Character documents Provide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the Australian Federal Police . We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police. Also provide military service records or discharge papers if you served in the armed forces of any country. Depending on your circumstances, we may ask you to also provide an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16. Complete and provide the following forms: Form 80 Personal particulars for character assessment (596KB PDF) Form 1221 Additional personal particulars information (331KB PDF) See how Tell us you are getting help To nominate someone to: receive your correspondence, use Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration assistance, use Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount See how Partner documents Provide your partner 's: identity documents character documents marriage certificate documents about other relationships, if applicable For de facto relationships provide either: evidence that your relationship is registered by an Australian State or Territory enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply For both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to: joint bank account statements billing accounts in joint names joint leases or mortgages documents that show your partner has lived at the same address as you See how Dependants under 18 documents For every dependant 18 years old or younger who is applying with you, provide: copies of birth certificates or the family book showing the names of both parents of all your dependent children copies of the adoption paper, if applicable. Parental responsibility documents You must get consent for any applicant under 18 years of age to migrate to Australia from anyone who: has a legal right to decide where the child lives and is not coming to Australia with the child They must complete either: Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF) a statutory declaration giving their consent for the child to visit Australia on this visa Alternatively, you can show us: an Australian court order that allows your child to migrate to Australia, or that the laws of your home country allow them to migrate Include: an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence adoption papers or other court documents if applicable See how Dependants over 18 documents To include your child who is over 18 in your visa application, they must be: over 18 years of age but not yet turned 23, and dependent on you or your partner, or over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner Provide: identity documents documents about their other relationships, if applicable character documents You must also provide proof the child is dependent on you: proof of your relationship with the dependent such as a birth certificate or adoption papers a completed Form 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF) proof of financial dependency such as bank statements, money transfers and rent receipts if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions See how Prepare your documents See how Translate Have all non-English documents translated into English. Translators in Australia must be accredited by the National Accreditation Authority for Translators and Interpreters Translators outside Australia do not have to be accredited. But on each translation, they must include their: full name address and telephone number qualifications and experience in the language they are translating These details must be in English. Note: You do not need to have any documents certified. See how Scan or photograph Scan or photograph all documents (English and non-English) in colour. The scans and photos must be clear. If a document is more than one page, save it all as one file. See how Keep Keep a copy of your completed application. Step 3 Apply for the visa You must apply for this visa online. Show steps Provide accurate information Provide accurate information. See what happens if you can't prove your identity or don't provide true information Apply online Create an account or log in to ImmiAccount Attach documents , including your sponsor's documents Have family applications processed together. Each family member must still have their application charge paid and documents attached to their application Pay the application charge . We will not process your application until you pay the charge. See how Step 4 After you apply See what you can and must do after you apply. Show steps Status updates If it is within standard processing times do not call. We can't provide any further updates on the application's progress. You can see if we have asked for more information in your ImmiAccount Stay lawful Make sure you stay lawful by holding a valid visa while we process your application. If you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure. Do not cancel your current visa. If you do, you will: be staying in Australia unlawfully not be eligible for a Bridging visa A Learn more about visa expiry See how Travel after you apply You do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision. But if you leave Australia, make sure you have a valid visa to return Learn about visa expiry See how Health exams We will let you know if you need health examinations Biometrics We might ask for biometrics . We will let you know if you need to provide them. Attach more information If you did not attach all your documents when you applied, attach them as soon as possible in ImmiAccount. We might also ask you to provide more information. Add family members You cannot add members of the family unit to your application after you apply but before we decide on your visa, unless it is a child born after you apply but before we make a decision on your visa. Newborn Children If your child is born after you apply but before we make a decision on your visa, then your child is considered to have made the same visa application as you. You must tell us as soon as possible and give us: a copy of the child’s birth certificate completed Form 1022 Notification of changes in circumstances (172KB PDF) Attach supporting documents including the child's passport if available to your ImmiAccount. Subsequent entrants If we grant you the visa, your family members might be able to apply to join you in Australia later as a subsequent entrant . They can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount. See how Newborn children Find out what to do if your child is born after you apply or when you hold your visa Mistakes on your application Let us know as soon as you can if you made a mistake on your application. Complete Form 1023 Notification of incorrect answers (168KB PDF) Help with you application Let us know if you no longer want someone to: receive your correspondence - complete Form 956A Appointment or withdrawal of an authorised recipient (301KB PDF) provide immigration advice - complete Form 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF) Upload your written notification or your forms to ImmiAccount For more information see Who can help you with your application See how Tell us if things change Things you need to let us know about include: you want to withdraw your application changes to your phone number, address or passport changes to your relationship status the birth of a child See how to tell us if your situation changes See how Step 5 Visa outcome We will let you know in writing our decision about your visa application. We will tell you: your visa grant number the date your visa starts your visa conditions Keep a copy of the decision with you when in Australia. If we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision. We will not refund the application charge if we refuse your application. When you have this visa Now you have your visa Coming to Australia In Australia Leaving Australia Now you have your visa If we have granted you a Training (subclass 407) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us. We will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare. To withdraw any other visa application, you must tell us in writing. More information is available on our website at You want to withdraw an application Coming to Australia Before you travel Check your travel documents You must have: a valid visa to enter Australia a valid passport or other travel document At the border Completing an Incoming Passenger Card All people arriving Australia must complete the Incoming Passenger Card . You will get the card on board. Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate In Australia What you can do when you have this visa visit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program travel to and from Australia as many times as you want To see your specific conditions, work and study entitlements, use VEVO What you must do on this visa You and your family members must meet all visa conditions that apply and obey all Australian laws. Check your conditions in VEVO or your visa grant letter. Tell us if things change Things you need to let us know about when you have this visa include: changes to your phone number, email, address or passport changes to your relationship status the birth of a child See how to let us know if there is a change in your situation See how long you can stay This is a temporary visa. You can stay until your visa expires. To see when your visa expires use VEVO. Staying longer You can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer. Travelling on your visa You can travel outside Australia and return as many times as you want while the visa is valid. The time you spend outside Australia does not extend the visa. Proving you have a visa To prove you have a visa and show your conditions to someone, use VEVO Working You and your family are protected by Australian workplace law. See their workplace rights and entitlements Family members Family members who are granted the same visa with you can only work up to 40 hours every two weeks in Australia. To see your and your family's conditions for work, use VEVO Bringing a family member Your family members who did not apply for the visa with you might be eligible to apply as a subsequent entrant after the visa is granted. Apply for a subsequent entrant visa using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount Newborn children Find out what to do if your child is born after you apply or when you hold your visa Leaving Australia Before you leave Check your travel documents You must have a valid passport or other travel document to leave Australia. Ensure your visa is still valid if you intend to return to Australia Check your conditions and the expiry of your current visa in VEVO. See what you can and must do if your visa has expired or is about to expire At the border Leaving the airport faster We have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use SmartGate After you leave Get your superannuation if you intend not to return to Australia You are likely to have some money in a superannuation fund if you worked in Australia and you are: 18 years old or older paid AUD450 or more before tax in a month See how to access your super To prove you have been to Australia Request your international movement records to get proof of your travel in and out of Australia.",
  "main_content": "===== main placeholder ==========================================\nSubclass 407\n\n# Training visa\n\nTraining visa\n\nThis visa allows you to take part in workplace-based occupational training activities to improve your skills for your job, area of tertiary study, field of expertise or in a professional development training program in Australia.\n\nThis visa allows you to take part in workplace-based occupational training activities to improve your skills for your job, area of tertiary study, field of expertise or in a professional development training program in Australia.\n\nThis visa allows you to take part in workplace-based occupational training activities to improve your skills for your job, area of tertiary study, field of expertise or in a professional development training program in Australia.\nPersonalise this page...\nFor Applicants\nFor Sponsors\n- Overview\nOverview\n- About this visa\nAbout this visa\n- Eligibility\nEligibility\n- Step by step\nStep by step\n- When you have this visa\nWhen you have this visa\nOverview\nAbout this visa\nEligibility\nStep by step\nWhen you have this visa\nOverview\n\n#### Stay\n\nStay\n\nThis is a temporary visa. We might grant you a visa allowing you to stay in Australia for up to 2 years.\n\nThis is a temporary visa. We might grant you a visa allowing you to stay in Australia for up to 2 years.\n\n#### Cost\n\nCost\n\nFromAUD430.00for the main applicant.\n\nFromAUD430.00for the main applicant.\n\nFrom\nAUD430.00\nfor the main applicant.\n\n#### Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\n#### With this visa you can\n\nWith this visa you can\n- visit Australia to complete a workplace-based  training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\nvisit Australia to complete a workplace-based  training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\n\nSee all conditions\n\nSee all conditions\n\nCheck your eligibility\n\nCheck your eligibility\n\n#### You must\n\nYou must\n- be sponsored\nbe sponsored\n- be nominated (unless your sponsor is a Commonwealth Government agency)\nbe nominated (unless your sponsor is a Commonwealth Government agency)\n- be invited (if your sponsor is a Commonwealth Government agency)\nbe invited (if your sponsor is a Commonwealth Government agency)\n\n#### Help with your visa\n\nHelp with your visa\n\nIf you are getting help with your visa, before you pay someone, read information onWho can help with your visa application.\n\nIf you are getting help with your visa, before you pay someone, read information on\nWho can help with your visa application\n.\n\nApply\n\nApply\n\n### Process\n\nProcess\nAbout this visa\nWith this visa, you can\nNomination types\nHow long you can stay\nStay longer\nInclude family\nCost\nApply from\nProcessing times\nYour obligations\nTravel\nVisa label\nFinancial support\nChanging sponsors\nApply for a new visa\n\n## With this visa, you can\n\nWith this visa, you can\n- visit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\nvisit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\n\n## Nomination types\n\nNomination types\n\nThis visa allows people to take part in workplace-based training to improve their skills for their job, area of tertiary study, field of expertise or in a professional development training program in Australia.\n\nThis visa allows people to take part in workplace-based training to improve their skills for their job, area of tertiary study, field of expertise or in a professional development training program in Australia.\n\nNomination requirements are different depending on the purpose or type of training.\n\nNomination requirements are different depending on the purpose or type of training.\n\nThere are 3 types of occupational training covered by this visa:\n\nThere are 3 types of occupational training covered by this visa:\n- Occupational training required for registration\nOccupational training required for registration\n- Occupational training to improve skills in an eligible occupation\nOccupational training to improve skills in an eligible occupation\n- Occupational training for capacity building overseas. This includes overseas qualification, government support or professional.\nOccupational training for capacity building overseas\n. This includes overseas qualification, government support or professional.\n\nNomination is the stage where the sponsor provides details about the nominee (intended trainee), the purpose or type of training and how and where the training will be provided.\n\nNomination is the stage where the sponsor provides details about the nominee (intended trainee), the purpose or type of training and how and where the training will be provided.\n\n## How long you can stay\n\nHow long you can stay\n\nThis is a temporary visa.  We might grant you a visa stay in Australia for up to 2 years.\n\nThis is a temporary visa.  We might grant you a visa stay in Australia for up to 2 years.\n\nYou can leave and re-enter Australia on the visa while it is valid.\n\nYou can leave and re-enter Australia on the visa while it is valid.\n\n## Stay longer\n\nStay longer\n\nYou can't stay in Australia longer by extending this visa.\n\nYou can't stay in Australia longer by extending this visa.\n\nYou can apply for another visa.Explore visa options.\n\nYou can apply for another visa.\nExplore visa options\n.\n\n## Include family\n\nInclude family\n\nYou can includemembers of the family unitin your application when you apply\n\nYou can include\nmembers of the family unit\nin your application when you apply\n\nFamily members who apply for the visa with you must also meet ourhealthandcharacterrequirements.\n\nFamily members who apply for the visa with you must also meet our\nhealth\nand\ncharacter\nrequirements.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirements.\n\nIf you apply for this visa from outside Australia, family members who are not coming to Australia might also have to meet our health requirements.\n\n### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply or when you hold your visa.\n\nFind out what to do if\nyour child is born after you apply or when you hold your visa\n.\n\n### Subsequent entrants\n\nSubsequent entrants\n\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as asubsequent entrant.\n\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a\nsubsequent entrant\n.\n\nThey can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form inImmiAccount.\n\nThey can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in\nImmiAccount\n.\n\nFamily members applying subsequently should :\n\nFamily members applying subsequently should :\n- be listed on the nomination form if their sponsor is not a Commonwealth Government Agency, and\nbe listed on the nomination form if their sponsor is not a Commonwealth Government Agency, and\n- provide a letter from the sponsor of the primary applicant confirming the sponsor has agreed to sponsor them\nprovide a letter from the sponsor of the primary applicant confirming the sponsor has agreed to sponsor them\n\n## Cost\n\nCost\n\nThe visa costs fromAUD430.00for the main applicant.\n\nThe visa costs from\nAUD430.00\nfor the main applicant.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nThere is also a charge for each family member who applies for the visa with you.\n\nYou might also have to pay other costs for health checks, police certificates andbiometrics.\n\nYou might also have to pay other costs for health checks, police certificates and\nbiometrics\n.\n\nTo work out what your visa will cost, use theVisa Pricing Estimator. The estimator does not take into account the other costs.\n\nTo work out what your visa will cost, use the\nVisa Pricing Estimator\n. The estimator does not take into account the other costs.\n\n## Apply from\n\nApply from\n\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n\nYou can be in or outside Australia when you apply for the visa and when we decide on your application.\n\n## Processing times\n\nProcessing times\n\nFor an indication of processing times for this visa, use thevisa processing time guide tool. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nFor an indication of processing times for this visa, use the\nvisa processing time guide tool\n. This will show the processing times for recently decided applications. It is a guide only and not specific to your application.\n\nYour application might take longer to process if:\n\nYour application might take longer to process if:\n- you do not fill it in correctly\nyou do not fill it in correctly\n- you do not include all the documents we need or we need more information from you\nyou do not include all the documents we need or we need more information from you\n- we have to verify your information\nwe have to verify your information\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\nWe can't process your application if you do not pay the correct visa application charge. We will notify you if this is the case and if necessary return your application.\n\n## Your obligations\n\nYour obligations\n\nYou and your family members must obey all Australian laws.\n\nYou and your family members must obey all Australian laws.\n\nLearn more aboutconditions for this visa.\n\nLearn more about\nconditions for this visa\n.\n\n## Travel\n\nTravel\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n## Visa label\n\nVisa label\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\nWe will digitally link your visa to your passport. You will not get a label in your passport.\n\n## Financial support\n\nFinancial support\n\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members.\n\nYou will need to be able to financially support yourself while in Australia. You will need to be able to financially support accompanying family members.\n\n## Changing sponsors\n\nChanging sponsors\n\nIf you decide to train with another organisation while you are in Australia, you will need to be sponsored by that organisation. They must submit a new nomination for you.\n\nIf you decide to train with another organisation while you are in Australia, you will need to be sponsored by that organisation. They must submit a new nomination for you.\n\nWhen the new nomination is approved you can do your occupational training with that organisation for the time remaining on your visa.\n\nWhen the new nomination is approved you can do your occupational training with that organisation for the time remaining on your visa.\n\nYou do not have to apply for a new visa, as long as you continue to do the training program your visa was approved for.\n\nYou do not have to apply for a new visa, as long as you continue to do the training program your visa was approved for.\n\nIf your occupational training program changes, you need to submit a new visa application.\n\nIf your occupational training program changes, you need to submit a new visa application.\n\nIf your sponsor ends your training you must tell us. You may try to find another organisation to sponsor you.\n\nIf your sponsor ends your training you must tell us. You may try to find another organisation to sponsor you.\n\n## Apply for a new visa\n\nApply for a new visa\n\nIf you want to apply for a new Training visa (subclass 407) you will need continuing sponsorship. You may have to provide an explanation of why you were unable to complete the training within the initial training period.\n\nIf you want to apply for a new Training visa (subclass 407) you will need continuing sponsorship. You may have to provide an explanation of why you were unable to complete the training within the initial training period.\nEligibility\n\n## Have an approved sponsor\n\nHave an approved sponsor\nDetails\n\nYour sponsor must be approved as atemporary activities sponsor.\n\nYour sponsor must be approved as a\ntemporary activities sponsor\n.\n\n## Be nominated\n\nBe nominated\nDetails\n\nYour sponsor must have nominated you to participate in a program of occupational training unless your sponsor is a Australian Commonwealth Government agency.\n\nYour sponsor must have nominated you to participate in a program of occupational training unless your sponsor is a Australian Commonwealth Government agency.\n\nNomination requirements are different depending on the purpose or type of training.\n\nNomination requirements are different depending on the purpose or type of training.\n\nThere are 3 types of occupational training covered by this visa:\n\nThere are 3 types of occupational training covered by this visa:\n- Occupational training required for registration\nOccupational training required for registration\n- Occupational training to improve skills in an eligible occupation\nOccupational training to improve skills in an eligible occupation\n- Occupational training for capacity building overseas. This includes overseas qualification, government support or professional.\nOccupational training for capacity building overseas\n. This includes overseas qualification, government support or professional.\n\n## Be this age\n\nBe this age\n\nUsually, you must be 18 years old or older at the time we decide your visa application.\n\nUsually, you must be 18 years old or older at the time we decide your visa application.\n\n## Have this visa\n\nHave this visa\nDetails\n\nIf you are applying in Australia, you must currently hold a valid temporarysubstantive visathat is not a:\n\nIf you are applying in Australia, you must currently hold a valid temporary\nsubstantive visa\nthat is not a:\n- a Subclass 403 (Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular stream) or\na Subclass 403 (Temporary Work (International Relations) visa in the Domestic Worker (Diplomatic or Consular stream) or\n- a Subclass 771 (Transit) visa or\na Subclass 771 (Transit) visa or\n- a Special Purpose visa\na Special Purpose visa\n\nIf you are in Australia and do not hold a substantive visa, your last substantive visa must not have been one of the above visas and your application must be made within 28 days:\n\nIf you are in Australia and do not hold a substantive visa, your last substantive visa must not have been one of the above visas and your application must be made within 28 days:\n- after the last substantive visa you held ceased to be in effect or\nafter the last substantive visa you held ceased to be in effect or\n- after the day you were notified of the Administrative Appeal Tribnual's decision to set aside and substitute the decision to cancel your substantive visa, or the Minister's decision not to revoke the cancellation of your substantive visa.\nafter the day you were notified of the Administrative Appeal Tribnual's decision to set aside and substitute the decision to cancel your substantive visa, or the Minister's decision not to revoke the cancellation of your substantive visa.\n\n## Meet our health requirement\n\nMeet our health requirement\n\nYou and any family members who apply for the visa with you must meet ourhealth requirement.\n\nYou and any family members who apply for the visa with you must meet our\nhealth requirement\n.\n\n## Meet our character requirement\n\nMeet our character requirement\n\nYou and family members aged 16 years and over who apply for the visa with you must meet ourcharacter requirement.\n\nYou and family members aged 16 years and over who apply for the visa with you must meet our\ncharacter requirement\n.\n\nWe might also ask that other family members meet the requirement.\n\nWe might also ask that other family members meet the requirement.\n\n## Have adequate health insurance\n\nHave adequate health insurance\nDetails\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. You must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\n\nYou are personally liable for all your healthcare costs while you are in Australia. Medical insurance helps limit your financial liability. You must maintain adequate health cover for the whole of your stay if you are granted this visa. Your insurance should cover you for medically necessary treatment, including transport.\n\nSee a guide to what we consideradequate health insurance.\n\nSee a guide to what we consider\nadequate health insurance\n.\n\nSee more abouthealth insurance for overseas visitors.\n\nSee more about\nhealth insurance for overseas visitors\n.\n\n### Reciprocal healthcare agreements\n\nReciprocal healthcare agreements\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia aboutreciprocal healthcare agreements.\n\nSome countries have a reciprocal healthcare agreement with Australia. Find out more from Services Australia about\nreciprocal healthcare agreements\n.\n\n## Be a genuine temporary entrant\n\nBe a genuine temporary entrant\nDetails\n\nYou must only intend to:\n\nYou must only intend to:\n- stay temporarily in Australia\nstay temporarily in Australia\n- do the things you are allowed to do on this visa\ndo the things you are allowed to do on this visa\n\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\n\nYou must have substantially complied with the conditions of the last substantive or subsequent bridging visa that you held.\n\n## Have this level of English language\n\nHave this level of English language\n\nYou must havefunctional English.\n\nYou must have\nfunctional English\n.\n\n## Sign the Australian values statement\n\nSign the Australian values statement\nDetails\n\nIf you are 18 years of age or older, you must:\n\nIf you are 18 years of age or older, you must:\n- have read, or had explained to you, theLife in Australia bookletand\nhave read, or had explained to you, the\nLife in Australia booklet\nand\n- sign anAustralian Values Statementthat confirms you will respect the Australian way of life and obey Australian laws\nsign an\nAustralian Values Statement\nthat confirms you will respect the Australian way of life and obey Australian laws\n\n## Have paid back your debt to the Australian Government\n\nHave paid back your debt to the Australian Government\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\nIf you or any family members (including those who don't apply for the visa with you) owe the Australian government money, you or they must have paid it back or arranged to pay it back.\n\n## Not had a visa cancelled or an application refused\n\nNot had a visa cancelled or an application refused\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nWe will consider your immigration history when we make a decision on your application, which means you might not be eligible for this visa if you have had a visa cancelled or refused.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused seeLimitations on applications in Australia.\n\nIn some circumstances you may still apply for a permanent visa if you have had a visa cancelled or an application refused see\nLimitations on applications in Australia\n.\n\nIf applying for a visa from outside Australia seeCan I go to Australia.\n\nIf applying for a visa from outside Australia see\nCan I go to Australia\n.\n\nIf you want immigration assistance, seeWho can help with your visa application.\n\nIf you want immigration assistance, see\nWho can help with your visa application\n.\n\n## Best interests of the child\n\nBest interests of the child\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nWe might not grant this visa if it is not in the best interests of an applicant under 18.\n\nMeet all these criteria? Check how to apply in ourstep by stepguide.\n\nMeet all these criteria? Check how to apply in our\nstep by step\nguide.\nStep by step\n\nStep 1\n\nStep 1\nBefore you apply\n\nBefore you apply, you have to make sure your sponsoring organisation has applied to be or has been approved as a sponsor. Your sponsoring organisation must also have submitted a nomination application. Australian Commonwealth Government agencies don't have to nominate.\n\nBefore you apply, you have to make sure your sponsoring organisation has applied to be or has been approved as a sponsor. Your sponsoring organisation must also have submitted a nomination application. Australian Commonwealth Government agencies don't have to nominate.\n\nDon't arrange travel until we tell you in writing you have the visa.\n\nDon't arrange travel until we tell you in writing you have the visa.\n\nIf you plan to get a new passport, you should do so before applying for this visa. If you get a new passport after you have submitted your application, you must tell us of this change in writing. You can do this usingImmiAccount.\n\nIf you plan to get a new passport, you should do so before applying for this visa. If you get a new passport after you have submitted your application, you must tell us of this change in writing. You can do this using\nImmiAccount\n.\nShow\n                    steps\n\n#### Get help with your application\n\nGet help with your application\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n\nOnly some people can help you with your application. If you appoint someone to give you immigration assistance they must be:\n- aregistered migration agent\na\nregistered migration agent\n- alegal practitioner, or\na\nlegal practitioner\n, or\n- anexempt person.\nan\nexempt person\n.\n\nYou can appoint anyone toreceive documentson your behalf relating to your visa matter.\n\nYou can appoint anyone to\nreceive documents\non your behalf relating to your visa matter.\nSee how\n\nStep 2\n\nStep 2\nGather your documents\n\nGather documents to prove your identity and show you have a sponsor, nomination or government invitation, financial support and health insurance. You will need to prepare them to submit online.\n\nGather documents to prove your identity and show you have a sponsor, nomination or government invitation, financial support and health insurance. You will need to prepare them to submit online.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happens if you can'tprove your identity or don't provide true information.\n\nProvide accurate information. See what happens if you can't\nprove your identity or don't provide true information\n.\n\n#### Identity documents\n\nIdentity documents\n\nWe need proof of your identity. If you can't prove your identity:\n\nWe need proof of your identity. If you can't prove your identity:\n- we will refuse your visa application\nwe will refuse your visa application\n- we might not grant you another visa for 10 years\nwe might not grant you another visa for 10 years\n- we might not grant any family members you listed on your application a visa for 10 years\nwe might not grant any family members you listed on your application a visa for 10 years\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nProvide the pages of your current passport showing your photo, personal details, and passport issue and expiry dates.\n\nAlso provide:\n\nAlso provide:\n- a national identity card, if you have one\na national identity card, if you have one\n- proof of change of name, if applicable\nproof of change of name, if applicable\n\nDocuments that prove a change of name include:\n\nDocuments that prove a change of name include:\n- a marriage or divorce certificate\na marriage or divorce certificate\n- change of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\nchange of name documents from an Australian Registry of Births, Deaths and Marriages, or the relevant overseas authority\n- documents that show other names you have been known by\ndocuments that show other names you have been known by\nSee how\n\n#### Sponsor documents\n\nSponsor documents\n\nYou need to provide:\n\nYou need to provide:\n- a sponsor approval letter or receipt for submission of the sponsorship application\na sponsor approval letter or receipt for submission of the sponsorship application\n- your sponsor’s nomination approval letter or receipt for submission of the nomination application – if your sponsor is not an Australian Commonwealth Government agency\nyour sponsor’s nomination approval letter or receipt for submission of the nomination application – if your sponsor is not an Australian Commonwealth Government agency\n- a written statement from the sponsor that they will meet the sponsorship obligations for you and all dependent family members included in your application\na written statement from the sponsor that they will meet the sponsorship obligations for you and all dependent family members included in your application\nSee how\n\n#### Volunteer documents\n\nVolunteer documents\n\nIf this is a volunteer position, you and your sponsor need to complete the Acknowledgement of unpaid placement forms.\n\nIf this is a volunteer position, you and your sponsor need to complete the Acknowledgement of unpaid placement forms.\n- Form 1283 Acknowledgement of unpaid placement—visa applicant (131KB PDF)\nForm 1283 Acknowledgement of unpaid placement—visa applicant (131KB PDF)\n- Form 1284 Acknowledgement of unpaid placement—sponsor (136KB PDF)\nForm 1284 Acknowledgement of unpaid placement—sponsor (136KB PDF)\n\nYour sponsor should submit these forms with the nomination.\n\nYour sponsor should submit these forms with the nomination.\nSee how\n\n#### Financial support documents\n\nFinancial support documents\n\nYou will need to show evidence of your financial capacity to support yourself and your family while you are in Australia, such as:\n\nYou will need to show evidence of your financial capacity to support yourself and your family while you are in Australia, such as:\n- bank statements\nbank statements\n- a letter from your financial institution stating your financial position\na letter from your financial institution stating your financial position\n- employment contracts\nemployment contracts\n- documents showing allowances, accommodation and stipends from your sponsor while you are in Australia\ndocuments showing allowances, accommodation and stipends from your sponsor while you are in Australia\n- if you are currently or were previously an AusAID or Foreign Affairs supported student provide a copy of the letter of support from the Department of Foreign Affairs and Trade\nif you are currently or were previously an AusAID or Foreign Affairs supported student provide a copy of the letter of support from the Department of Foreign Affairs and Trade\nSee how\n\n#### Health insurance\n\nHealth insurance\n\nYou will need to provide evidence ofadequate health insurancefor you and your family members for the duration of your stay in Australia.\n\nYou will need to provide evidence of\nadequate health insurance\nfor you and your family members for the duration of your stay in Australia.\nSee how\n\n#### Evidence of English language\n\nEvidence of English language\n\nProvide evidence that you havefunctional Englishlanguage skills to undertake the training programme.\n\nProvide evidence that you have\nfunctional English\nlanguage skills to undertake the training programme.\n\nYou do not need to provide these results if you hold a valid passport from:\n\nYou do not need to provide these results if you hold a valid passport from:\n- the United Kingdom\nthe United Kingdom\n- Canada\nCanada\n- New Zealand\nNew Zealand\n- the United States\nthe United States\n- the Republic of Ireland\nthe Republic of Ireland\n\n#### Workplace-based activity documents\n\nWorkplace-based activity documents\n\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\n\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\n\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\n\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\n\nAlso provide a copy of your qualifications and curriculum vitae (CV).\n\nAlso provide a copy of your qualifications and curriculum vitae (CV).\n\nIf registrations or licences are required for you to do the training, provide copies of registrations or licences.\n\nIf registrations or licences are required for you to do the training, provide copies of registrations or licences.\nSee how\n\n#### Professional Development documents\n\nProfessional Development documents\n\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\n\nIf you are sponsored by a Australian Commonwealth Government agency, provide a copy of the invitation to participate in the training.\n\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\n\nIf you are not sponsored by a Australian Commonwealth Government agency, provide a copy of the nomination approval letter or receipt for submitting the nomination application.\n\nProvide a statement from your sponsor confirming they are satisfied:\n\nProvide a statement from your sponsor confirming they are satisfied:\n- that you are doing the professional development training specified in the application\nthat you are doing the professional development training specified in the application\n- that you have relevant managerial or other professional skills and work experience to participate in the program\nthat you have relevant managerial or other professional skills and work experience to participate in the program\n\nProvide a signed letter on company letterhead from your current manager detailing your current position and duties.\n\nProvide a signed letter on company letterhead from your current manager detailing your current position and duties.\n\nAlso provide a copy of your qualifications and curriculum vitae (CV).\n\nAlso provide a copy of your qualifications and curriculum vitae (CV).\nSee how\n\n#### Occupational training required for registration\n\nOccupational training required for registration\n\nYou must provide a letter from the relevant regulatory body for the occupation in Australia or your home country. This letter must :\n\nYou must provide a letter from the relevant regulatory body for the occupation in Australia or your home country. This letter must :\n- name you\nname you\n- state the nominated training is necessary for the you to get registration, membership or licensing to work in the occupation\nstate the nominated training is necessary for the you to get registration, membership or licensing to work in the occupation\n\nIf you are a health practitioner treating patients as part of your occupational training you must:\n\nIf you are a health practitioner treating patients as part of your occupational training you must:\n- have a letter from the relevant registration authority, or\nhave a letter from the relevant registration authority, or\n- regulatory body stating you have conditional registration for the training\nregulatory body stating you have conditional registration for the training\nSee how\n\n#### Character documents\n\nCharacter documents\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by theAustralian Federal Police. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nProvide an Australian police certificate if you have spent a total of 12 months or more in Australia in the last 10 years since you turned 16. We only accept complete disclosure National Police Certificates issued by the\nAustralian Federal Police\n. We do not accept standard disclosure certificates or national police certificates issued by Australian state or territory police.\n\nAlso provide military service records or discharge papers if you served in the armed forces of any country.\n\nAlso provide military service records or discharge papers if you served in the armed forces of any country.\n\nDepending on your circumstances, we may ask you to also provide an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16.\n\nDepending on your circumstances, we may ask you to also provide an overseas police certificate from every country, including your home country, where you spent a total of 12 months or more in the last 10 years since you turned 16.\n\nComplete and provide the following forms:\n\nComplete and provide the following forms:\n- Form 80 Personal particulars for character assessment (596KB PDF)\nForm 80 Personal particulars for character assessment (596KB PDF)\n- Form 1221 Additional personal particulars information (331KB PDF)\nForm 1221 Additional personal particulars information (331KB PDF)\nSee how\n\n#### Tell us you are getting help\n\nTell us you are getting help\n\nTo nominate someone to:\n\nTo nominate someone to:\n- receive your correspondence, useForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence, use\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration assistance, useForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration assistance, use\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\nSee how\n\n#### Partner documents\n\nPartner documents\n\nProvide yourpartner's:\n\nProvide your\npartner\n's:\n- identity documents\nidentity documents\n- character documents\ncharacter documents\n- marriage certificate\nmarriage certificate\n- documents about other relationships, if applicable\ndocuments about other relationships, if applicable\n\nForde factorelationships provide either:\n\nFor\nde facto\nrelationships provide either:\n- evidence that your relationship is registered by an Australian State or Territory\nevidence that your relationship is registered by an Australian State or Territory\n- enough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\nenough documents to prove you have been in a de facto relationship with your partner for at least 12 months before you apply\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n\nFor both married and de facto applicants you must provide evidence that you are in a genuine and continuing relationship. Evidence can include but is not limited to:\n- joint bank account statements\njoint bank account statements\n- billing accounts in joint names\nbilling accounts in joint names\n- joint leases or mortgages\njoint leases or mortgages\n- documents that show your partner has lived at the same address as you\ndocuments that show your partner has lived at the same address as you\nSee how\n\n#### Dependants under 18 documents\n\nDependants under 18 documents\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n\nFor every dependant 18 years old or younger who is applying with you, provide:\n- copies of birth certificates or the family book showing the names of both parents of all your dependent children\ncopies of birth certificates or the family book showing the names of both parents of all your dependent children\n- copies of the adoption paper, if applicable.\ncopies of the adoption paper, if applicable.\n\n#### Parental responsibility documents\n\nParental responsibility documents\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n\nYou must get consent for any applicant under 18 years of age to migrate to Australia from anyone who:\n- has a legal right to decide where the child lives and\nhas a legal right to decide where the child lives and\n- is not coming to Australia with the child\nis not coming to Australia with the child\n\nThey must complete either:\n\nThey must complete either:\n- Form 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\nForm 1229 Consent form to grant an Australian visa to a child under the age of 18 years (276KB PDF)\n- a statutory declaration giving their consent for the child to visit Australia on this visa\na statutory declaration giving their consent for the child to visit Australia on this visa\n\nAlternatively, you can show us:\n\nAlternatively, you can show us:\n- an Australian court order that allows your child to migrate to Australia, or\nan Australian court order that allows your child to migrate to Australia, or\n- that the laws of your home country allow them to migrate\nthat the laws of your home country allow them to migrate\n\nInclude:\n\nInclude:\n- an identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\nan identity document that shows the signature and photo of the person who completed the form or declaration, such as a passport or driver’s licence\n- adoption papers or other court documents if applicable\nadoption papers or other court documents if applicable\nSee how\n\n#### Dependants over 18 documents\n\nDependants over 18 documents\n\nTo include your child who is over 18 in your visa application, they must be:\n\nTo include your child who is over 18 in your visa application, they must be:\n- over 18 years of age but not yet turned 23, and dependent on you or your partner, or\nover 18 years of age but not yet turned 23, and dependent on you or your partner, or\n- over 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\nover 23 years of age, unable to earn a living to support themselves due to physical or cognitive limitations and dependent on you or your partner\n\nProvide:\n\nProvide:\n- identity documents\nidentity documents\n- documents about their other relationships, if applicable\ndocuments about their other relationships, if applicable\n- character documents\ncharacter documents\n\nYou must also provide proof the child is dependent on you:\n\nYou must also provide proof the child is dependent on you:\n- proof of your relationship with the dependent such as a birth certificate or adoption papers\nproof of your relationship with the dependent such as a birth certificate or adoption papers\n- a completedForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\na completed\nForm 47a Details of a child or other dependent family member aged 18 years or over (307KB PDF)\n- proof of financial dependency such as bank statements, money transfers and rent receipts\nproof of financial dependency such as bank statements, money transfers and rent receipts\n- if the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nif the child is aged 23 or is likely to turn 23 while your application is being processed, you must also provide a report from a qualified medical practitioner that states they are dependent on you or your partner due to the total or partial loss of their bodily or mental functions\nSee how\n\n#### Prepare your documents\n\nPrepare your documents\nSee how\n\n#### Translate\n\nTranslate\n\nHave all non-English documents translated into English.\n\nHave all non-English documents translated into English.\n\nTranslators in Australia must be accredited by theNational Accreditation Authority for Translators and Interpreters.\n\nTranslators in Australia must be accredited by the\nNational Accreditation Authority for Translators and Interpreters\n.\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n\nTranslators outside Australia do not have to be accredited. But on each translation, they must include their:\n- full name\nfull name\n- address and telephone number\naddress and telephone number\n- qualifications and experience in the language they are translating\nqualifications and experience in the language they are translating\n\nThese details must be in English.\n\nThese details must be in English.\n\nNote: You do not need to have any documents certified.\n\nNote: You do not need to have any documents certified.\nSee how\n\n#### Scan or photograph\n\nScan or photograph\n\nScan or photograph all documents (English and non-English) in colour.\n\nScan or photograph all documents (English and non-English) in colour.\n\nThe scans and photos must be clear.\n\nThe scans and photos must be clear.\n\nIf a document is more than one page, save it all as one file.\n\nIf a document is more than one page, save it all as one file.\nSee how\n\n#### Keep\n\nKeep\n\nKeep a copy of your completed application.\n\nKeep a copy of your completed application.\n\nStep 3\n\nStep 3\nApply for the visa\n\nYou must apply for this visa online.\n\nYou must apply for this visa online.\nShow\n                    steps\n\n#### Provide accurate information\n\nProvide accurate information\n\nProvide accurate information. See what happensif you can't prove your identity or don't provide true information.\n\nProvide accurate information. See what happens\nif you can't prove your identity or don't provide true information\n.\n\n#### Apply online\n\nApply online\n1. Create an account or log in toImmiAccount\nCreate an account or log in to\nImmiAccount\n2. Attach documents, including your sponsor's documents\nAttach documents\n, including your sponsor's documents\n3. Have family applications processed together. Each family member must still have their application charge paid and documents attached to their application\nHave family applications processed together. Each family member must still have their application charge paid and documents attached to their application\n4. Pay the application charge. We will not process your application until you pay the charge.\nPay the application charge\n. We will not process your application until you pay the charge.\nSee how\n\nStep 4\n\nStep 4\nAfter you apply\n\nSee what you can and must do after you apply.\n\nSee what you can and must do after you apply.\nShow\n                    steps\n\n#### Status updates\n\nStatus updates\n\nIf it is within standard processing times do not call. We can't provide any further updates on the application's progress.\n\nIf it is within standard processing times do not call. We can't provide any further updates on the application's progress.\n\nYou can see if we have asked for more information in yourImmiAccount.\n\nYou can see if we have asked for more information in your\nImmiAccount\n.\n\n#### Stay lawful\n\nStay lawful\n\nMake sure you stay lawful by holding a valid visa while we process your application.\n\nMake sure you stay lawful by holding a valid visa while we process your application.\n\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\n\nIf you were in Australia when you applied for this visa, you were granted a Bridging visa A (BVA). If your current visa expires before we decide on your application, the BVA will start. You can stay in Australia on the BVA while we process your new visa application. You cannot travel on the BVA - there is no right of return on this visa; it cancels on departure.\n\nDo not cancel your current visa. If you do, you will:\n\nDo not cancel your current visa. If you do, you will:\n- be staying in Australia unlawfully\nbe staying in Australia unlawfully\n- not be eligible for a Bridging visa A\nnot be eligible for a Bridging visa A\n\nLearn more aboutvisa expiry.\n\nLearn more about\nvisa expiry\n.\nSee how\n\n#### Travel after you apply\n\nTravel after you apply\n\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nYou do not have to tell us if you want to travel outside Australia while we process your application. This is because you can be outside Australia when we make a decision.\n\nBut if you leave Australia, make sure you have avalid visa to return.\n\nBut if you leave Australia, make sure you have a\nvalid visa to return\n.\n\nLearn aboutvisa expiry.\n\nLearn about\nvisa expiry\n.\nSee how\n\n#### Health exams\n\nHealth exams\n\nWe will let you know if you needhealth examinations.\n\nWe will let you know if you need\nhealth examinations\n.\n\n#### Biometrics\n\nBiometrics\n\nWe might ask forbiometrics. We will let you know if you need to provide them.\n\nWe might ask for\nbiometrics\n. We will let you know if you need to provide them.\n\n#### Attach more information\n\nAttach more information\n\nIf you did not attach all your documents when you applied, attach them as soon as possible in ImmiAccount.\n\nIf you did not attach all your documents when you applied, attach them as soon as possible in ImmiAccount.\n\nWe might also ask you to provide more information.\n\nWe might also ask you to provide more information.\n\n#### Add family members\n\nAdd family members\n\nYou cannot addmembers of the family unitto your application after you apply but before we decide on your visa, unless it is a child born after you apply but before we make a decision on your visa.\n\nYou cannot add\nmembers of the family unit\nto your application after you apply but before we decide on your visa, unless it is a child born after you apply but before we make a decision on your visa.\n\n#### Newborn Children\n\nNewborn Children\n\nIf your child is born after you apply but before we make a decision on your visa, then your child is considered to have made the same visa application as you.\n\nIf your child is born after you apply but before we make a decision on your visa, then your child is considered to have made the same visa application as you.\n\nYou must tell us as soon as possible and give us:\n\nYou must tell us as soon as possible and give us:\n- a copy of the child’s birth certificate\na copy of the child’s birth certificate\n- completedForm 1022 Notification of changes in circumstances (172KB PDF)\ncompleted\nForm 1022 Notification of changes in circumstances (172KB PDF)\n\nAttach supporting documents including the child's passport if available to your ImmiAccount.\n\nAttach supporting documents including the child's passport if available to your ImmiAccount.\n\n#### Subsequent entrants\n\nSubsequent entrants\n\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as asubsequent entrant. They can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount.\n\nIf we grant you the visa, your family members might be able to apply to join you in Australia later as a\nsubsequent entrant\n. They can do this using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in ImmiAccount.\nSee how\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply or when you hold your visa.\n\nFind out what to do if\nyour child is born after you apply or when you hold your visa\n.\n\n#### Mistakes on your application\n\nMistakes on your application\n\nLet us know as soon as you can if you made a mistake on your application.\n\nLet us know as soon as you can if you made a mistake on your application.\n\nCompleteForm 1023 Notification of incorrect answers (168KB PDF)\n\nComplete\nForm 1023 Notification of incorrect answers (168KB PDF)\n\n#### Help with you application\n\nHelp with you application\n\nLet us know if you no longer want someone to:\n\nLet us know if you no longer want someone to:\n- receive your correspondence - completeForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\nreceive your correspondence - complete\nForm 956A Appointment or withdrawal of an authorised recipient (301KB PDF)\n- provide immigration advice - completeForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF).\nprovide immigration advice - complete\nForm 956 Appointment of a registered migration agent, legal practitioner or exempt person (308KB PDF)\n.\n\nUpload your written notification or your forms toImmiAccount.\n\nUpload your written notification or your forms to\nImmiAccount\n.\n\nFor more information seeWho can help you with your application.\n\nFor more information see\nWho can help you with your application\n.\nSee how\n\n#### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about include:\n\nThings you need to let us know about include:\n- you want to withdraw your application\nyou want to withdraw your application\n- changes to your phone number, address or passport\nchanges to your phone number, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child\nthe birth of a child\n\nSee how to tell us ifyour situation changes.\n\nSee how to tell us if\nyour situation changes\n.\nSee how\n\nStep 5\n\nStep 5\nVisa outcome\n\nWe will let you know in writing our decision about your visa application. We will tell you:\n\nWe will let you know in writing our decision about your visa application. We will tell you:\n- your visa grant number\nyour visa grant number\n- the date your visa starts\nthe date your visa starts\n- your visa conditions\nyour visa conditions\n\nKeep a copy of the decision with you when in Australia.\n\nKeep a copy of the decision with you when in Australia.\n\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\n\nIf we refuse your visa we will let you know in writing. We will tell you why we refused and whether you have a right to a review of the decision.\n\nWe will not refund the application charge if we refuse your application.\n\nWe will not refund the application charge if we refuse your application.\nWhen you have this visa\nNow you have your visa\nComing to Australia\nIn Australia\nLeaving Australia\n\n## Now you have your visa\n\nNow you have your visa\n\nIf we have granted you a Training (subclass 407) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\n\nIf we have granted you a Training (subclass 407) visa, you may want to consider withdrawing any other undecided visa applications you have lodged with us.\n\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\n\nWe will continue to progress any undecided visa applications. If they meet the requirements it may result in your current visa ceasing. It may also affect your eligibility for government benefits such as Centrelink or Medicare.\n\nTo withdraw any other visa application, you must tell us in writing.  More information is available on our website atYou want to withdraw an application.\n\nTo withdraw any other visa application, you must tell us in writing.  More information is available on our website at\nYou want to withdraw an application\n.\n\n## Coming to Australia\n\nComing to Australia\n\n### Before you travel\n\nBefore you travel\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have:\n\nYou must have:\n- a valid visa to enter Australia\na valid visa to enter Australia\n- a valid passport or other travel document\na valid passport or other travel document\n\n### At the border\n\nAt the border\n\n#### Completing an Incoming Passenger Card\n\nCompleting an Incoming Passenger Card\n\nAll people arriving Australia must complete theIncoming Passenger Card. You will get the card on board.\n\nAll people arriving Australia must complete the\nIncoming Passenger Card\n. You will get the card on board.\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n## In Australia\n\nIn Australia\n\n### What you can do when you have this visa\n\nWhat you can do when you have this visa\n- visit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\nvisit Australia to complete a workplace-based training (to improve your skills for your current occupation, area of tertiary study or field of expertise), or a professional development training program\n- travel to and from Australia as many times as you want\ntravel to and from Australia as many times as you want\n\nTo see your specific conditions, work and study entitlements, useVEVO.\n\nTo see your specific conditions, work and study entitlements, use\nVEVO\n.\n\n### What you must do on this visa\n\nWhat you must do on this visa\n\nYou and your family members must meet all visa conditions that apply and obey all Australian laws.\n\nYou and your family members must meet all visa conditions that apply and obey all Australian laws.\n\nCheck your conditions inVEVOor your visa grant letter.\n\nCheck your conditions in\nVEVO\nor your visa grant letter.\n\n### Tell us if things change\n\nTell us if things change\n\nThings you need to let us know about when you have this visa include:\n\nThings you need to let us know about when you have this visa include:\n- changes to your phone number, email, address or passport\nchanges to your phone number, email, address or passport\n- changes to your relationship status\nchanges to your relationship status\n- the birth of a child\nthe birth of a child\n\nSee how to let us know if there is achange in your situation.\n\nSee how to let us know if there is a\nchange in your situation\n.\n\n### See how long you can stay\n\nSee how long you can stay\n\nThis is a temporary visa. You can stay until your visa expires. To see when your visa expires use VEVO.\n\nThis is a temporary visa. You can stay until your visa expires. To see when your visa expires use VEVO.\n\n### Staying longer\n\nStaying longer\n\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\n\nYou can't stay in Australia longer by extending this visa. You must apply for a new visa if you want to stay longer.\n\n### Travelling on your visa\n\nTravelling on your visa\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nYou can travel outside Australia and return as many times as you want while the visa is valid.\n\nThe time you spend outside Australia does not extend the visa.\n\nThe time you spend outside Australia does not extend the visa.\n\n### Proving you have a visa\n\nProving you have a visa\n\nTo prove you have a visa and show your conditions to someone, useVEVO.\n\nTo prove you have a visa and show your conditions to someone, use\nVEVO\n.\n\n### Working\n\nWorking\n\nYou and your family are protected by Australian workplace law.See their workplace rights and entitlements.\n\nYou and your family are protected by Australian workplace law.\nSee their workplace rights and entitlements\n.\n\n#### Family members\n\nFamily members\n\nFamily members who are granted the same visa with you can only work up to 40 hours every two weeks in Australia.\n\nFamily members who are granted the same visa with you can only work up to 40 hours every two weeks in Australia.\n\nTo see your and your family's conditions for work, useVEVO.\n\nTo see your and your family's conditions for work, use\nVEVO\n.\n\n### Bringing a family member\n\nBringing a family member\n\nYour family members who did not apply for the visa with you might be eligible to apply as asubsequent entrantafter the visa is granted.\n\nYour family members who did not apply for the visa with you might be eligible to apply as a\nsubsequent entrant\nafter the visa is granted.\n\nApply for a subsequent entrant visa using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form inImmiAccount.\n\nApply for a subsequent entrant visa using the Temporary Work and Activity Visa (Subsequent Entrant) (403,407,408) form in\nImmiAccount\n.\n\n#### Newborn children\n\nNewborn children\n\nFind out what to do ifyour child is born after you apply or when you hold your visa.\n\nFind out what to do if\nyour child is born after you apply or when you hold your visa\n.\n\n## Leaving Australia\n\nLeaving Australia\n\n### Before you leave\n\nBefore you leave\n\n#### Check your travel documents\n\nCheck your travel documents\n\nYou must have a valid passport or other travel document to leave Australia.\n\nYou must have a valid passport or other travel document to leave Australia.\n\n#### Ensure your visa is still valid if you intend to return to Australia\n\nEnsure your visa is still valid if you intend to return to Australia\n\nCheck your conditions and the expiry of your current visa in VEVO.\n\nCheck your conditions and the expiry of your current visa in VEVO.\n\nSee what you can and must doif your visa has expired or is about to expire.\n\nSee what you can and must do\nif your visa has expired or is about to expire\n.\n\n### At the border\n\nAt the border\n\n#### Leaving the airport faster\n\nLeaving the airport faster\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you useSmartGate.\n\nWe have an automated process that uses facial recognition technology and your ePassport. You might be able to leave the airport faster if you use\nSmartGate\n.\n\n### After you leave\n\nAfter you leave\n\n#### Get your superannuation if you intend not to return to Australia\n\nGet your superannuation if you intend not to return to Australia\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n\nYou are likely to have some money in a superannuation fund if you worked in Australia and you are:\n- 18 years old or older\n18 years old or older\n- paid AUD450 or more before tax in a month\npaid AUD450 or more before tax in a month\n\nSee how toaccess your super.\n\nSee how to\naccess your super\n.\n\n#### To prove you have been to Australia\n\nTo prove you have been to Australia\n\nRequest your international movement recordsto get proof of your travel in and out of Australia.\n\nRequest your international movement records\nto get proof of your travel in and out of Australia.",
  "interactive_sections": [],
  "referenced_links": [],
  "discovered_links": [
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#contentBox",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#Eligibility",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-4",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-5",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-6",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-7",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-8",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-9",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-10",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-11",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-12",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#aboutVisa-index-13",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407/occupational-training-types#content-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407/occupational-training-types#content-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407/occupational-training-types#content-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#HowTo",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/bridging-visa-b-020",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#haveThisVisa-index-0",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#haveThisVisa-index-1",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#haveThisVisa-index-2",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#haveThisVisa-index-3",
    "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing/training-407#top"
  ],
  "parent_url": "https://immi.homeaffairs.gov.au/visas/getting-a-visa/visa-listing",
  "depth": 1,
  "scraped_at": "2026-01-05T15:04:17.124422",
  "metadata": {}
}