{
  "url": "https://immi.homeaffairs.gov.au/visas/employing-and-sponsoring-someone/sponsoring-workers/learn-about-sponsoring/how-to-sponsor-a-worker",
  "title": "How to sponsor a worker",
  "content_type": "visa_information",
  "summary": "This page provides an overview of the steps employers must follow to sponsor a skilled worker in Australia. It outlines requirements such as labour market testing, selecting an eligible occupation, checking sponsor eligibility, nominating a position, and the worker completing a visa application. It also references additional resources and conditions depending on the visa type chosen.",
  "structured_data": {
    "sponsorship_process_steps": [
      {
        "step_number": 1,
        "title": "Labour market testing",
        "requirements": [
          "Employer must show they cannot find a suitable person in Australia to fill the vacancy",
          "Must provide evidence of labour market testing meeting formal requirements",
          "Some occupations are exempt from labour market testing"
        ]
      },
      {
        "step_number": 2,
        "title": "Occupation eligibility",
        "requirements": [
          "Occupation must be on the list of eligible skilled occupations",
          "If not listed, employer may be able to negotiate a labour agreement",
          "Some visa options exist for highly paid or specialist skilled applicants",
          "Worker may need to provide qualifications, skills, and/or experience evidence",
          "Employer must pay at least the applicable market salary rate",
          "Nominated occupation determines applicable visa options"
        ]
      },
      {
        "step_number": 3,
        "title": "Select a suitable visa",
        "notes": [
          "Employer should find a visa that suits both the employee and business needs",
          "VEVO can be used to check the worker’s eligibility"
        ]
      },
      {
        "step_number": 4,
        "title": "Check sponsor eligibility",
        "notes": [
          "Employer must ensure they and their business meet sponsorship eligibility requirements"
        ]
      },
      {
        "step_number": 5,
        "title": "Apply to become a sponsor",
        "requirements": [
          "Employer must become an approved sponsor and/or nominator",
          "May apply to be an accredited sponsor depending on visa type",
          "Accredited sponsors receive priority processing",
          "Additional information available under Becoming a sponsor or nominator"
        ]
      },
      {
        "step_number": 6,
        "title": "Nominate the occupation",
        "requirements": [
          "Employer must nominate the occupation or position as required for the visa type",
          "Must include details of the person to fill the role",
          "Position must generally be on a relevant skilled occupation list"
        ]
      },
      {
        "step_number": 7,
        "title": "Visa application",
        "requirements": [
          "The skilled worker is responsible for completing the visa application",
          "Employer should ensure nominee meets eligibility criteria",
          "Some workers may require a skills assessment from the correct assessing authority"
        ]
      }
    ],
    "key_links_referenced": [
      "Labour market testing",
      "Eligible skilled occupations list",
      "Labour agreement",
      "VEVO eligibility check",
      "Visa options for sponsored skilled workers",
      "Approved sponsor",
      "Accredited sponsor",
      "Becoming a sponsor or nominator"
    ]
  },
  "parent_url": "https://immi.homeaffairs.gov.au/visas/employing-and-sponsoring-someone/employing-overseas-workers",
  "depth": 1
}