{
  "url": "https://immi.homeaffairs.gov.au/entering-and-leaving-australia/leaving-australia",
  "title": "Before and after you leave Australia",
  "content_type": "general_information",
  "summary": "The page provides guidance for people leaving Australia, covering tax implications of selling property, steps to take before departure, and how to access superannuation after leaving. It also outlines eligibility rules and procedures for claiming the Departing Australia Superannuation Payment (DASP).",
  "structured_data": {
    "selling_property_tax_rules": {
      "foreign_residents_cgt_exemption": "Foreign residents cannot claim the CGT main residence exemption when selling Australian residential property, except in limited circumstances.",
      "pre_9_may_2017_rule": "Before 9 May 2017, foreign residents who had been Australian residents could claim the CGT main residence exemption."
    },
    "before_you_leave": {
      "border_guidance": "See what to do when you cross the border.",
      "assistance_programs": {
        "return_and_reintegration_assistance": "Available for people needing help to leave Australia.",
        "status_resolution_service": "Available for people with complex visa issues or difficult personal circumstances."
      },
      "conflict_zone_warning": {
        "advice": "Avoid travelling to conflict zones.",
        "legal_note": "It is an offence to intentionally enter or remain in a declared zone.",
        "reference": "Australian National Security declared zones."
      }
    },
    "after_you_leave": {
      "super_eligibility_work_conditions": {
        "age_requirement": "18 years or older",
        "earnings_requirement": "Paid AUD 450 or more before tax in a month"
      },
      "dasp_eligibility": {
        "departed_australia": true,
        "not_citizen_or_pr": "Must not be an Australian or New Zealand citizen or permanent resident",
        "temporary_visa": "Must have entered on a temporary visa (except Subclass 405 or 410)",
        "no_active_visa": "Must no longer have any Australian visas in effect (including tourist visas)"
      },
      "dasp_steps": {
        "step_1": "Check temporary visa status via VEVO.",
        "step_2": "Request cancellation of temporary visa (if applicable).",
        "step_3": {
          "free_online_method": "Apply via ATO DASP online system once visa has expired.",
          "paper_method": {
            "when_to_use": "Only when ATO online cannot be used",
            "required": "Submit correct ATO paper form (fees may apply)",
            "prepayment": "Pre-pay AUD 55 via ImmiAccount"
          }
        }
      }
    }
  },
  "parent_url": null,
  "depth": 0
}