{
  "url": "https://immi.homeaffairs.gov.au/entering-and-leaving-australia/leaving-australia#top",
  "title": "Before and after you leave Australia",
  "content_type": "general_information",
  "summary": "The page provides guidance for people leaving Australia, including tax implications when selling property, what to do before departure, and how to access superannuation after leaving. It explains eligibility for the Departing Australia Superannuation Payment (DASP) and outlines the steps required to claim it. Additional information is provided on assistance programs and avoiding travel to conflict zones.",
  "structured_data": {
    "selling_property_tax_rules": {
      "foreign_residents_cgt_main_residence_exemption": "Foreign residents cannot claim the CGT main residence exemption when selling Australian residential property, except in limited circumstances.",
      "rule_change_date": "9 May 2017",
      "previous_rule": "Before 9 May 2017, foreign residents who had been Australian residents could claim the CGT main residence exemption on residential property sales."
    },
    "before_you_leave": {
      "border_crossing_info": "See what to do when you cross the border.",
      "assistance_programs": {
        "return_and_reintegration_assistance_program": "Provides help to eligible people needing assistance to leave Australia.",
        "status_resolution_service": "Supports people with complex visa situations or difficult personal circumstances."
      },
      "conflict_zones_warning": {
        "advice": "Avoid travelling to conflict zones.",
        "legal_note": "It is an offence to intentionally enter or remain in a declared zone.",
        "reference": "Australian National Security"
      }
    },
    "after_you_leave": {
      "superannuation_eligibility": {
        "likely_super_conditions": [
          "18 years old or older",
          "Paid AUD450 or more before tax in a month"
        ],
        "dasp_eligibility": [
          "Departed Australia",
          "Not an Australian or New Zealand citizen, or a permanent resident",
          "Entered Australia on a temporary visa (except Subclass 405 or 410)",
          "No Australian visas currently in effect, including tourist visas"
        ],
        "payment_name": "Departing Australia Superannuation Payment (DASP)"
      },
      "dasp_claim_process": {
        "steps": [
          {
            "step": 1,
            "description": "Check temporary visa status through VEVO."
          },
          {
            "step": 2,
            "description": "Request cancellation of temporary visa (if eligible)."
          },
          {
            "step": 3,
            "description": "Apply for DASP."
          }
        ],
        "application_methods": {
          "online_free": "Apply through ATO’s DASP online system (verifies departure and visa expiry).",
          "paper_form_option": {
            "description": "Send correct ATO paper form to super fund or ATO.",
            "notes": "Fees may apply.",
            "additional_fee": "AUD55 pre-payment via ImmiAccount when unable to use ATO Online Service."
          }
        }
      }
    }
  },
  "parent_url": "https://immi.homeaffairs.gov.au/entering-and-leaving-australia/leaving-australia",
  "depth": 1
}